pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
#include "bl602_demo_wifi.h"



// WARNING: Removing unreachable block (ram,0x230000d8)

void bl602_start(void)

{
  uint32_t *puVar1;
  undefined4 *puVar2;
  int *piVar3;
  ipc_shared_env_tag *piVar4;
  anon_struct_conflict371 *paVar5;
  anon_struct_conflict372 *paVar6;
  code *pcVar7;
  
  puVar2 = (undefined4 *)(ram_heap + 0x1c40);
  paVar5 = &boot2_partition_table;
  do {
    *(undefined4 *)paVar5 = *puVar2;
    puVar2 = puVar2 + 1;
    paVar5 = (anon_struct_conflict371 *)&paVar5->table;
  } while (paVar5 < &boot2_flashCfg);
  puVar1 = (uint32_t *)hal_boot2_get_flash_addr();
  paVar6 = &boot2_flashCfg;
  do {
    paVar6->magic = *puVar1;
    puVar1 = puVar1 + 1;
    paVar6 = (anon_struct_conflict372 *)&paVar6->flashCfg;
  } while (paVar6 < &count);
  puVar2 = (undefined4 *)&_bl_static_blogfile_code_end;
  pcVar7 = AON_Power_On_BG;
  do {
    *(undefined4 *)pcVar7 = *puVar2;
    puVar2 = puVar2 + 1;
    pcVar7 = (code *)&((anon_struct_conflict371 *)pcVar7)->table;
  } while (pcVar7 < &boot2_partition_table);
  piVar3 = &count;
  do {
    *piVar3 = 0;
    piVar3 = piVar3 + 1;
  } while (piVar3 < &__bss_end);
  piVar4 = &ipc_shared_env;
  do {
    (piVar4->msg_a2e_buf).dummy_word = 0;
    piVar4 = (ipc_shared_env_tag *)(piVar4->msg_a2e_buf).msg;
  } while (piVar4 < (ipc_shared_env_tag *)&_heap_wifi_start);
  DAT_42041ff8 = 0x230000e8;
  bfl_main(0,0);
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



err_t cb_httpc_headers_done_fn
                (httpc_state_t *connection,void *arg,pbuf *hdr,u16_t hdr_len,u32_t content_len)

{
  undefined2 in_register_00002036;
  
  printf("[HTTPC] hdr_len is %u, content_len is %lu\r\n",CONCAT22(in_register_00002036,hdr_len),
         content_len);
  return '\0';
}



void cb_httpc_result(void *arg,httpc_result_t httpc_result,u32_t rx_content_len,u32_t srv_res,
                    err_t err)

{
  printf("[HTTPC] Transfer finished. rx_content_len is %lu\r\n",rx_content_len);
  *(undefined4 *)arg = 0;
  return;
}



err_t cb_altcp_recv_fn(void *arg,altcp_pcb *conn,pbuf *p,err_t err)

{
  int count;
  int iVar1;
  uint uVar2;
  
  puts(".");
  iVar1 = count + 1;
  uVar2 = count & 0x3f;
  count = iVar1;
  if (uVar2 == 0) {
    puts("\r\n");
  }
  altcp_recved(conn,p->tot_len);
  pbuf_free(p);
  return '\0';
}



void cmd_stack_wifi(char *buf,int len,int argc,char **argv)

{
  uint8_t stack_wifi_init;
  uint32_t uVar1;
  
  if (stack_wifi_init == '\x01') {
    puts("Wi-Fi Stack Started already!!!\r\n");
    return;
  }
  stack_wifi_init = '\x01';
  uVar1 = bl_timer_now_us();
  printf("Start Wi-Fi fw @%lums\r\n",uVar1 / 1000);
  hal_wifi_start_firmware_task();
  uVar1 = bl_timer_now_us();
  printf("Start Wi-Fi fw is Done @%lums\r\n",uVar1 / 1000);
  aos_post_event(2,1,0);
  return;
}



void cmd_exception_illegal_ins(char *buf,int len,int argc,char **argv)

{
  bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_ILLEGAL_INSTRUCTION,(void *)0x22008001);
  return;
}



void cmd_exception_store(char *buf,int len,int argc,char **argv)

{
  bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_STORE_MISALIGN,(void *)0x22008001);
  return;
}



void cmd_exception_l_illegal(char *buf,int len,int argc,char **argv)

{
  bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_ACCESS_ILLEGAL,(void *)0x200000);
  return;
}



void cmd_exception_load(char *buf,int len,int argc,char **argv)

{
  bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_LOAD_MISALIGN,(void *)0x22008001);
  return;
}



void cmd_dma(void)

{
  bl_dma_item *first;
  void *__s;
  void *__s_00;
  TickType_t TVar1;
  
  first = (bl_dma_item *)pvPortMalloc(0x1c);
  __s = pvPortMalloc(0x44);
  __s_00 = pvPortMalloc(0x44);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [TEST] [DMA] first %p, src %p, dst %p\r\n",TVar1,&DAT_2307f16c,
              "bl_dma.c",0x1af,first,__s,__s_00);
  }
  memset(first,0,0x1c);
  memset(__s,1,0x44);
  memset(__s_00,0xff,0x44);
  first->ctrl = 0x8c49b011;
  *(void **)&first->src = __s;
  *(void **)&first->dst = __s_00;
  first->next = 0;
  first->cb = _cb_cmd;
  *(bl_dma_item **)&first->arg = first;
  bl_dma_copy(first);
  while (first->arg != (void *)0x0) {
    vTaskDelay(2);
  }
  vPortFree((void *)first->src);
  vPortFree((void *)first->dst);
  vPortFree(first);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

undefined4 cmd_cks(void)

{
  ushort uVar1;
  TickType_t TVar2;
  char *format;
  undefined *puVar3;
  undefined4 uVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  undefined2 uStack128;
  ushort uStack126;
  undefined4 uStack124;
  undefined4 uStack120;
  bl_dma_item bStack116;
  undefined auStack88 [4];
  undefined4 uStack84;
  undefined4 uStack80;
  undefined2 *puStack76;
  undefined *puStack72;
  undefined **ppuStack68;
  undefined4 uStack64;
  undefined auStack60 [4];
  undefined4 uStack56;
  undefined4 uStack52;
  undefined *puStack48;
  ushort *puStack44;
  undefined4 uStack40;
  undefined4 uStack36;
  
  puStack76 = &uStack128;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] --->>> case1 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x137);
  }
  DAT_4000a700 = 1;
  iVar5 = 0;
  do {
    DAT_4000a704 = data_src1_2802[iVar5];
    iVar5 = iVar5 + 1;
  } while (iVar5 != 0x14);
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS result with LE is %04x, should be %02x%02x\r\n",TVar2,
              &DAT_2307f16c,"bl_cks.c",0x40,uVar6,0x61,0xb8);
  }
  DAT_4000a700 = 2;
  iVar5 = 0;
  do {
    DAT_4000a704 = data_src1_2802[iVar5];
    iVar5 = iVar5 + 1;
  } while (iVar5 != 0x14);
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS result with BE is %04x, should be %02x%02x\r\n",TVar2,
              &DAT_2307f16c,"bl_cks.c",0x48,uVar6,0x61,0xb8);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] --->>> case2 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x139);
    }
  }
  DAT_4000a700 = 1;
  DAT_4000a704 = 0x3f;
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0x61,uVar6,0xc0e0);
  }
  uVar1 = _DAT_4000a708;
  DAT_4000a700 = 2;
  DAT_4000a704 = 0x3f;
  uVar6 = (uint)_DAT_4000a708;
  if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
    if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
                0x73,uVar6,0xc0e0);
      if (uVar1 != 0xc0e0) goto LAB_2303332e;
      if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) || (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks)
         ) goto LAB_23032c88;
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar6 = 0xc0e0;
      uVar4 = 0x75;
      format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_23032c7a:
      bl_printk(format,TVar2,&DAT_2307f16c,"bl_cks.c",uVar4,uVar6);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)
         ) {
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] --->>> case3 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13b);
      }
    }
    else {
      if (_DAT_4000a708 != 0xc0e0) goto LAB_23033338;
    }
  }
  else {
    if (_DAT_4000a708 != 0xc0e0) {
LAB_2303332e:
      if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
LAB_23033338:
        if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN) {
          if (TrapNetCounter == 0) {
            TVar2 = xTaskGetTickCount();
          }
          else {
            TVar2 = xTaskGetTickCountFromISR();
          }
          uVar4 = 0x77;
          format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
          goto LAB_23032c7a;
        }
      }
    }
  }
LAB_23032c88:
  DAT_4000a700 = 1;
  iVar5 = 1000;
  do {
    DAT_4000a704 = 0x3f;
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  uVar6 = 0xf69118;
  while (uVar6 >> 0x10 != 0) {
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  }
  uVar7 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0x91,uVar7,~uVar6 & 0xffff);
  }
  DAT_4000a700 = 2;
  iVar5 = 1000;
  do {
    DAT_4000a704 = 0x3f;
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  uVar6 = 0xf69118;
  while (uVar6 >> 0x10 != 0) {
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  }
  uVar7 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xa3,uVar7,~uVar6 & 0xffff);
  }
  if (uVar7 == (~uVar6 & 0xffff)) {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar4 = 0xa5;
      puVar3 = &DAT_2307f16c;
      format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_230330f0:
      bl_printk(format,TVar2,puVar3,"bl_cks.c",uVar4,uVar7);
      goto LAB_230330f4;
    }
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar4 = 0xa7;
      puVar3 = &DAT_23072bcc;
      format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
      goto LAB_230330f0;
    }
LAB_230330f4:
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] --->>> case4 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13d);
    }
  }
  DAT_4000a700 = 1;
  DAT_4000a704 = 0xa1;
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xc4,uVar6,0xc03f);
  }
  uVar1 = _DAT_4000a708;
  DAT_4000a700 = 2;
  DAT_4000a704 = 0xa1;
  uVar6 = (uint)_DAT_4000a708;
  if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks) {
      if (_DAT_4000a708 == 0xc03f) goto LAB_23032ef6;
      goto LAB_230332e4;
    }
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xd8,uVar6,0xc03f);
    if (uVar1 != 0xc03f) goto LAB_230332da;
    if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) || (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks))
    goto LAB_23032ef6;
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    uVar6 = 0xc03f;
    uVar4 = 0xda;
    puVar3 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_230331c2:
    bl_printk(format,TVar2,puVar3,"bl_cks.c",uVar4,uVar6);
  }
  else {
    if (_DAT_4000a708 == 0xc03f) goto LAB_23032ef6;
LAB_230332da:
    if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
LAB_230332e4:
      if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_ASSERT) {
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        uVar4 = 0xdc;
        puVar3 = &DAT_23072bcc;
        format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
        goto LAB_230331c2;
      }
    }
  }
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] --->>> case5 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13f);
  }
LAB_23032ef6:
  bStack116.arg = &bStack116;
  uStack128 = 0x3f1f;
  uStack124 = 1;
  uStack120 = 2;
  uStack126 = 0;
  memset(bStack116.arg,0,0x1c);
  memset(auStack88,0,0x1c);
  memset(auStack60,0,0x1c);
  bStack116.src = &uStack124;
  bStack116.dst = &DAT_4000a700;
  bStack116.next = &puStack76;
  bStack116.ctrl = 0x4480002;
  bStack116.cb = _cb_cmd;
  puStack72 = &DAT_4000a704;
  puStack48 = &DAT_4000a708;
  ppuStack68 = &puStack48;
  puStack44 = &uStack126;
  uStack64 = 0x403e8;
  uStack84 = 0;
  uStack80 = 0;
  uStack40 = 0;
  uStack36 = 0x80240001;
  uStack56 = 0;
  uStack52 = 0;
  bl_dma_copy(bStack116.arg);
  while (bStack116.arg != (bl_dma_item *)0x0) {
    vTaskDelay(2);
  }
  if (uStack126 == 0x6df1) {
    if (BLOG_LEVEL_INFO < _fsymc_level_hal_drv) {
      return 0;
    }
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks) {
      return 0;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar4 = 0x12f;
    puVar3 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
  }
  else {
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return 0;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_cks) {
      return 0;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar4 = 0x131;
    puVar3 = &DAT_23072bcc;
    format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
  }
  bl_printk(format,puVar3,"bl_cks.c",uVar4,(uint)uStack126);
  return 0;
}



int cmd_aes(void)

{
  bl_irq_register(0x1d,bl_sec_aes_IRQHandler);
  bl_irq_enable(0x1d);
  bl_printk(
           "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n"
           );
  Sec_Eng_AES_Link_Case_CBC_128(SEC_ENG_AES_ID0);
  bl_printk(
           "####################################################################################\r\n"
           );
  Sec_Eng_AES_Link_Case_CTR_128(SEC_ENG_AES_ID0);
  bl_printk(
           "####################################################################################\r\n"
           );
  Sec_Eng_AES_Link_Case_ECB_128(SEC_ENG_AES_ID0);
  bl_printk(
           "------------------------------------------------------------------------------------\r\n"
           );
  return 0;
}



int cmd_trng(void)

{
  int iVar1;
  
