pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  bl_printk("------------------TRNG TEST---------------------------------\r\n");
  iVar1 = bl_rand();
  bl_printk("**********TRNG TEST rand[%08x]**************\r\n",iVar1);
  iVar1 = bl_rand();
  bl_printk("**********TRNG TEST rand[%08x]**************\r\n",iVar1);
  bl_printk("------------------------------------------------------------\r\n");
  return 0;
}



int cmd_sha(void)

{
  puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n");
  puts("^^^^^^^^^^^^^^^^^^^^^^^SHA256 TEST CASE^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n");
  sha256_test_case0();
  puts("------------------------------------------------------------------------------------\r\n");
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void cmd_wifi(void)

{
  uint uVar1;
  undefined *puVar2;
  int iVar3;
  
  uVar1 = _DAT_44b000d8;
  puts("==========================  Keyram Config ========================\r\n");
  printf("  start %02u -->> end %02u; nVAP %02u; max %02u\r\n",uVar1 & 0xff,uVar1 >> 8 & 0xff,
         uVar1 >> 0x10 & 0xff,uVar1 >> 0x18);
  puts("==========================  Keyram Dump =========================\r\n");
  uVar1 = _DAT_44b000d8 >> 8;
  puts("[id]   MAC Address     Key Len  VLan ID  Default      \tKey Hexdump(16Bytes MAX)\r\n");
  iVar3 = 0;
  while (iVar3 < (int)(uVar1 & 0xff)) {
    blmac_encr_cntrl_pack('\x01','\0',(uint16_t)iVar3,'\0','\0','\0','\0','\0');
    do {
    } while ((int)_DAT_44b000c4 < 0);
    printf("[%02d] %02X:%02X:%02X:%02X:%02X:%02X",iVar3,_DAT_44b000bc & 0xff,
           _DAT_44b000bc >> 8 & 0xff,_DAT_44b000bc >> 0x10 & 0xff,_DAT_44b000bc >> 0x18,
           _DAT_44b000c0 & 0xff,_DAT_44b000c0 >> 8 & 0xff);
    puVar2 = &UNK_230743ec;
    if ((_DAT_44b000c4 & 1) == 0) {
      puVar2 = &UNK_230743f4;
    }
    printf(" %s",puVar2);
    iVar3 = iVar3 + 1;
    printf("    %02u",_DAT_44b000c4 >> 4 & 0xf);
    printf("        %u",_DAT_44b000c4 >> 1 & 1);
    printf("     %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X",
           _DAT_44b000ac & 0xff,_DAT_44b000ac >> 8 & 0xff,_DAT_44b000ac >> 0x10 & 0xff,
           _DAT_44b000ac >> 0x18,_DAT_44b000b0 & 0xff,_DAT_44b000b0 >> 8 & 0xff,
           _DAT_44b000b0 >> 0x10 & 0xff);
    puts("\r\n");
  }
  puts("==========================  MAC Address =========================\r\n");
  printf("    MAC %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00010 & 0xff,_DAT_44b00010 >> 8 & 0xff,
         _DAT_44b00010 >> 0x10 & 0xff,_DAT_44b00010 >> 0x18,_DAT_44b00014 & 0xff,
         _DAT_44b00014 >> 8 & 0xff);
  printf(" Mask %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00018 & 0xff,_DAT_44b00018 >> 8 & 0xff,
         _DAT_44b00018 >> 0x10 & 0xff,_DAT_44b00018 >> 0x18,_DAT_44b0001c & 0xff,
         _DAT_44b0001c >> 8 & 0xff);
  puts("\r\n");
  printf("  BSSID %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00020 & 0xff,_DAT_44b00020 >> 8 & 0xff,
         _DAT_44b00020 >> 0x10 & 0xff,_DAT_44b00020 >> 0x18,_DAT_44b00024 & 0xff,
         _DAT_44b00024 >> 8 & 0xff);
  printf(" Mask %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00028 >> 8 & 0xff,
         _DAT_44b00028 >> 0x10 & 0xff,_DAT_44b00028 >> 0x18,_DAT_44b0002c & 0xff,
         _DAT_44b0002c >> 8 & 0xff);
  puts("\r\n");
  return;
}



int cmd_pka(void)

{
  bl_irq_register(0x1b,bl_sec_pka_IRQHandler);
  bl_irq_enable(0x1b);
  _pka_test_case2();
  _pka_test_case_xgcd();
  _pka_test_case2();
  return 0;
}



void cmd_aws(char *buf,int len,int argc,char **argv)

{
  xTaskCreate(aws_main_entry,"aws_iot",0x1000,(void *)0x0,10,(TaskHandle_t *)0x0);
  return;
}



void proc_hellow_entry(void *pvParameters)

{
  char "proc_hellow_entry" [18];
  
  vTaskDelay(500);
  do {
    printf("%s: RISC-V rv32imafc\r\n","proc_hellow_entry");
    vTaskDelay(10000);
  } while( true );
}



uchar char_to_hex(char asccode)

{
  char cVar1;
  byte bVar2;
  
  bVar2 = asccode - 0x30;
  if (9 < bVar2) {
    if ((byte)(asccode + 0x9fU) < 6) {
      cVar1 = -0x57;
    }
    else {
      if (5 < (byte)(asccode + 0xbfU)) {
        return '\0';
      }
      cVar1 = -0x37;
    }
    bVar2 = asccode + cVar1;
  }
  return (uchar)bVar2;
}



void cmd_httpc_test(char *buf,int len,int argc,char **argv)

{
  if (req_12703 != 0) {
    printf("[CLI] req is on-going...\r\n");
    return;
  }
  memset(settings_12702,0,0x1c);
  settings_12702._20_4_ = cb_httpc_result;
  settings_12702._24_4_ = cb_httpc_headers_done_fn;
  settings_12702[6] = 0;
  httpc_get_file_dns("nf.cr.dandanman.com",0x50,"/ddm/ContentResource/music/204.mp3",
                     (httpc_connection_t_conflict *)settings_12702,cb_altcp_recv_fn,&req_12703,
                     (httpc_state_t **)&req_12703);
  return;
}



int get_dts_addr(char *name)

{
  TickType_t TVar1;
  
  if (TrapNetCounter == 0) {
    TVar1 = xTaskGetTickCount();
  }
  else {
    TVar1 = xTaskGetTickCountFromISR();
  }
  bl_printk("[%10u][%s: %s:%4d] %s NULL.\r\n",TVar1,&DAT_23072bcc,&UNK_23072bc4,0x322,name);
  return -1;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

int client_demo(void)

{
  uint uVar1;
  hostent *phVar2;
  char *__format;
  int s;
  int iVar3;
  TickType_t TVar4;
  void *mem;
  uint uVar5;
  TickType_t TVar6;
  char cVar7;
  ip4_addr_t iStack308;
  uint32_t address;
  sockaddr_in dest;
  char wbuf [111];
  char buffer [128];
  
  phVar2 = lwip_gethostbyname("nf.cr.dandanman.com");
  if (phVar2 == (hostent *)0x0) {
    __format = "gethostbyname Failed\r\n";
  }
  else {
    s = lwip_socket(2,1,0);
    if (s < 0) {
      __format = "Error in socket\r\n";
    }
    else {
      memset(&address,0,0x10);
      address._1_1_ = '\x02';
      address._2_2_ = lwip_htons(0x50);
      iStack308 = (ip4_addr_t)((ip4_addr_t *)((ip4_addr_t *)phVar2->h_addr_list)->addr)->addr;
      dest._0_4_ = iStack308;
      __format = ip4addr_ntoa(&iStack308);
      printf("Server ip Address : %s\r\n",__format);
      iVar3 = lwip_connect(s,(sockaddr *)&address,0x10);
      if (iVar3 == 0) {
        memset(wbuf + 0x6c,0,0x80);
        memcpy(dest.sin_zero + 4,
                              
