pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
               "GET /ddm/ContentResource/music/204.mp3 HTTP/1.1\r\nHost: nf.cr.dandanman.com\r\nUser-Agent: wmsdk\r\nAccept: */*\r\n\r\n"
               ,0x6f);
        lwip_write(s,dest.sin_zero + 4,0x6e);
        TVar4 = xTaskGetTickCount();
        mem = pvPortMalloc(0x3000);
        if (mem != (void *)0x0) {
          uVar1 = 0;
          cVar7 = '\0';
          do {
            uVar5 = lwip_read(s,mem,0x3000);
            if (uVar5 == 0) {
              printf("eof\n\r",0);
              goto LAB_230006f2;
            }
            if ((int)uVar5 < 0) {
              __format = "ret = %d, err = %d\n\r";
              uVar1 = errno;
              goto LAB_23000718;
            }
            uVar1 = uVar1 + uVar5;
            if (cVar7 == '\0') {
              printf("total = %d, ret = %d\n\r",uVar1,uVar5);
            }
            cVar7 = cVar7 + '\x01';
          } while ((int)uVar1 < 0x4e3fbd1);
          TVar6 = xTaskGetTickCount();
          uVar5 = (TVar6 - TVar4) / 1000;
          __format = "Download comlete, total time %u s, speed %u Kbps\r\n";
          uVar1 = (uVar1 / uVar5 << 3) / 1000;
LAB_23000718:
          printf(__format,uVar5,uVar1);
LAB_230006f2:
          vPortFree(mem);
        }
        lwip_close(s);
        return 0;
      }
      __format = "Error in connect\r\n";
    }
  }
  printf(__format);
  return -1;
}



// WARNING: Type propagation algorithm not settling

int http_test_cmd(void)

{
  uint uVar1;
  hostent *phVar2;
  char *__format;
  int s;
  int iVar3;
  TickType_t TVar4;
  void *mem;
  uint uVar5;
  TickType_t TVar6;
  char cVar7;
  ip4_addr_t iStack308;
  undefined uStack304;
  sa_family_t sStack303;
  u16_t uStack302;
  ip4_addr_t iStack300;
  undefined auStack288 [112];
  undefined auStack176 [136];
  
  phVar2 = lwip_gethostbyname("nf.cr.dandanman.com");
  if (phVar2 == (hostent *)0x0) {
    __format = "gethostbyname Failed\r\n";
  }
  else {
    s = lwip_socket(2,1,0);
    if (s < 0) {
      __format = "Error in socket\r\n";
    }
    else {
      memset(&uStack304,0,0x10);
      sStack303 = '\x02';
      uStack302 = lwip_htons(0x50);
      iStack308 = (ip4_addr_t)((ip4_addr_t *)((ip4_addr_t *)phVar2->h_addr_list)->addr)->addr;
      iStack300 = iStack308;
      __format = ip4addr_ntoa(&iStack308);
      printf("Server ip Address : %s\r\n",__format);
      iVar3 = lwip_connect(s,(sockaddr *)&uStack304,0x10);
      if (iVar3 == 0) {
        memset(auStack176,0,0x80);
        memcpy(auStack288,
                              
               "GET /ddm/ContentResource/music/204.mp3 HTTP/1.1\r\nHost: nf.cr.dandanman.com\r\nUser-Agent: wmsdk\r\nAccept: */*\r\n\r\n"
               ,0x6f);
        lwip_write(s,auStack288,0x6e);
        TVar4 = xTaskGetTickCount();
        mem = pvPortMalloc(0x3000);
        if (mem != (void *)0x0) {
          uVar1 = 0;
          cVar7 = '\0';
          do {
            uVar5 = lwip_read(s,mem,0x3000);
            if (uVar5 == 0) {
              printf("eof\n\r",0);
              goto LAB_230006f2;
            }
            if ((int)uVar5 < 0) {
              __format = "ret = %d, err = %d\n\r";
              uVar1 = errno;
              goto LAB_23000718;
            }
            uVar1 = uVar1 + uVar5;
            if (cVar7 == '\0') {
              printf("total = %d, ret = %d\n\r",uVar1,uVar5);
            }
            cVar7 = cVar7 + '\x01';
          } while ((int)uVar1 < 0x4e3fbd1);
          TVar6 = xTaskGetTickCount();
          uVar5 = (TVar6 - TVar4) / 1000;
          __format = "Download comlete, total time %u s, speed %u Kbps\r\n";
          uVar1 = (uVar1 / uVar5 << 3) / 1000;
LAB_23000718:
          printf(__format,uVar5,uVar1);
LAB_230006f2:
          vPortFree(mem);
        }
        lwip_close(s);
        return 0;
      }
      __format = "Error in connect\r\n";
    }
  }
  printf(__format);
  return -1;
}



void aos_loop_proc(void *pvParameters)

{
  StackType_t proc_stack_looprt [512];
  StaticTask_t proc_task_looprt;
  void *fdt;
  void *fdt_00;
  int sock;
  aos_poll_call_t *cb;
  void *pvVar1;
  void *pvVar2;
  
  looprt_start((StackType_t *)&ram0x4200f8e0,0x200,(StaticTask_t *)&ram0x420100e0);
  loopset_led_hook_on_looprt();
  easyflash_init();
  vfs_init();
  vfs_device_init();
  fdt = (void *)hal_board_get_factory_addr();
  fdt_00 = (void *)fdt_subnode_offset(fdt,0,"uart");
  if (fdt_00 == (void *)0x0) {
    sock = get_dts_addr("uart");
    fdt = fdt_00;
    pvVar2 = (void *)0x0;
    if (sock != 0) goto LAB_230007c6;
    fdt = (void *)0x0;
  }
  vfs_uart_init(fdt,fdt_00);
  pvVar2 = fdt_00;
LAB_230007c6:
  fdt_00 = (void *)hal_board_get_factory_addr();
  pvVar1 = (void *)fdt_subnode_offset(fdt_00,0,"gpio");
  if ((pvVar1 != (void *)0x0) ||
     (sock = get_dts_addr("gpio"), fdt_00 = fdt, pvVar1 = pvVar2, sock == 0)) {
    hal_gpio_init_from_dts(fdt_00,pvVar1);
  }
  romfs_register();
  aos_loop_init();
  sock = aos_open("/dev/ttyS0",0);
  if (-1 < sock) {
    printf("Init CLI with event Driven\r\n");
    aos_cli_init(0);
    cb = (aos_poll_call_t *)aos_cli_event_cb_read_get();
    aos_poll_read_fd(sock,cb,(void *)0x12345678);
    codex_debug_cli_init();
    easyflash_cli_init();
    network_netutils_iperf_cli_register();
    network_netutils_tcpserver_cli_register();
    network_netutils_tcpclinet_cli_register();
    network_netutils_netstat_cli_register();
    network_netutils_ping_cli_register();
    sntp_cli_init();
    bl_sys_time_cli_init();
    bl_sys_ota_cli_init();
    blfdt_cli_init();
    wifi_mgmr_cli_init();
    bl_wdt_cli_init();
    bl_gpio_cli_init();
    looprt_test_cli_init();
  }
  aos_register_event_filter(2,event_cb_wifi_event,(void *)0x0);
  cmd_stack_wifi((char *)0x0,0,0,(char **)0x0);
  aos_loop_run();
  puts("------------------------------------------\r\n");
  puts("+++++++++Critical Exit From Loop++++++++++\r\n");
  puts("******************************************\r\n");
  vTaskDelete((TaskHandle_t)0x0);
  return;
}



void vApplicationStackOverflowHook(TaskHandle_t xTask,char *pcTaskName)

{
  puts("Stack Overflow checked\r\n");
  printf("Task Name %s\r\n",pcTaskName);
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void vApplicationMallocFailedHook(void)

{
  size_t sVar1;
  
