pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  sVar1 = xPortGetFreeHeapSize();
  printf("Memory Allocate Failed. Current left size is %d bytes\r\n",sVar1);
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void vApplicationIdleHook(void)

{
  return;
}



// WARNING: Variable defined which should be unmapped: sta_info

int check_dts_config(char *ssid,char *password)

{
  int iVar1;
  int iVar2;
  undefined auStack116 [4];
  bl_wifi_ap_info_t sta_info;
  
  iVar2 = bl_wifi_sta_info_get((bl_wifi_ap_info_t *)auStack116);
  iVar1 = -1;
  if (iVar2 == 0) {
    strncpy(ssid,auStack116,0x20);
    ssid[0x1f] = '\0';
    strncpy(password,(char *)(sta_info.ssid + 0x1d),0x40);
    password[0x3f] = '\0';
    iVar1 = iVar2;
  }
  return iVar1;
}



void _connect_wifi(undefined4 param_1)

{
  bool bVar1;
  int iVar2;
  uint8_t *puVar3;
  char *__dest;
  uchar uVar4;
  uchar uVar5;
  wifi_interface_t pvVar6;
  char *password_00;
  size_t ssid_len;
  size_t sVar7;
  size_t sVar8;
  undefined3 extraout_var;
  char *__src;
  uint16_t freq;
  int iVar9;
  uint uVar10;
  int iVar11;
  char *__dest_00;
  longlong lVar12;
  byte abStack340 [4];
  uint8_t mac [6];
  char chan [10];
  char bssid [32];
  char ssid [33];
  char pmk [66];
  char password [66];
  char val_buf [66];
  
  pvVar6 = wifi_mgmr_sta_enable();
  wifi_interface = pvVar6;
  lVar12 = aos_now_ms();
  __dest = ssid + 0x20;
  printf(
         "[APP] [WIFI] [T] %lld\r\n[APP]   Get STA %p from Wi-Fi Mgmr, pmk ptr %p, ssid ptr %p, password %p\r\n"
         ,pvVar6,param_1,wifi_interface,__dest,bssid + 0x1c,pmk + 0x40,(int)lVar12);
  memset(__dest,0,0x42);
  memset(bssid + 0x1c,0,0x21);
  memset(pmk + 0x40,0,0x42);
  __dest_00 = chan + 8;
  memset(__dest_00,0,0x20);
  memset(abStack340,0,6);
  memset(mac + 4,0,10);
  memset(password + 0x40,0,0x42);
  ef_get_env_blob("conf_ap_ssid",password + 0x40,0x41,(size_t *)0x0);
  if (password[64] == '\0') {
    password_00 = pmk + 0x40;
    sVar7 = check_dts_config(bssid + 0x1c,password_00);
    freq = 0;
    if (sVar7 != 0) {
      puts("[APP]    Empty Config\r\n");
      puts("[APP]    Try to set the following ENV with psm_set command, then reboot\r\n");
      puts("[APP]    NOTE: conf_ap_pmk MUST be psm_unset when conf is changed\r\n");
      puts("[APP]    env: conf_ap_ssid\r\n");
      puts("[APP]    env: conf_ap_psk\r\n");
      puts("[APP]    env(optinal): conf_ap_pmk\r\n");
      return;
    }
    goto LAB_23000b88;
  }
  strncpy(bssid + 0x1c,password + 0x40,0x20);
  memset(password + 0x40,0,0x42);
  ef_get_env_blob("conf_ap_psk",password + 0x40,0x41,(size_t *)0x0);
  if (password[64] != '\0') {
    strncpy(pmk + 0x40,password + 0x40,0x41);
  }
  memset(password + 0x40,0,0x42);
  __src = password + 0x40;
  password_00 = (char *)ef_get_env_blob("conf_ap_pmk",__src,0x41,(size_t *)0x0);
  if (password[64] != '\0') {
    __src = password + 0x40;
    password_00 = strncpy(__dest,__src,0x41);
  }
  if (ssid[32] == '\0') {
    lVar12 = aos_now_ms();
    printf("[APP] [WIFI] [T] %lld\r\n",password_00,__src,(int)lVar12);
    puts("[APP]    Re-cal pmk\r\n");
    ssid_len = strlen(bssid + 0x1c);
    wifi_mgmr_psk_cal(pmk + 0x40,bssid + 0x1c,ssid_len,__dest);
    ef_set_env("conf_ap_pmk",__dest);
    ef_save_env();
  }
  memset(password + 0x40,0,0x42);
  ef_get_env_blob("conf_ap_channel",password + 0x40,0x41,(size_t *)0x0);
  if (password[64] == '\0') {
LAB_23000b00:
    freq = 0;
    uVar4 = '\0';
  }
  else {
    strncpy((char *)(mac + 4),password + 0x40,9);
    printf("connect wifi channel = %s\r\n",mac + 4);
    password_00 = strchr((char *)(mac + 4),0x7c);
    if (password_00 + 1 == (char *)0x0) goto LAB_23000b00;
    iVar11 = 1;
    iVar9 = 0;
    uVar4 = char_to_hex(password_00[1]);
    ssid_len = strlen((char *)(mac + 4));
    sVar8 = strlen(password_00 + 1);
    iVar2 = ssid_len - sVar8;
    mac[iVar2 + 3] = '\0';
    uVar10 = 0;
    puVar3 = mac + iVar2 + 4;
    while( true ) {
      freq = (uint16_t)uVar10;
      if (iVar2 + -1 <= iVar9) break;
      iVar9 = iVar9 + 1;
      uVar5 = char_to_hex(puVar3[-2]);
      uVar10 = uVar10 + CONCAT31(extraout_var,uVar5) * iVar11 & 0xffff;
      iVar11 = iVar11 * 10;
      puVar3 = puVar3 + -1;
    }
  }
  memset(password + 0x40,0,0x42);
  password_00 = password + 0x40;
  sVar7 = ef_get_env_blob("conf_ap_bssid",password_00,0x41,(size_t *)0x0);
  bVar1 = password[64] != '\0';
  password[64] = uVar4;
  if (bVar1) {
    strncpy(__dest_00,password + 0x40,0x1f);
    printf("connect wifi bssid = %s\r\n",__dest_00);
    ssid_len = strlen(__dest_00);
    if ((ssid_len & 1) != 0) {
      ssid_len = ssid_len - (int)ssid_len % 2;
    }
    if (ssid_len != 0) {
      uVar10 = 0;
      while ((int)uVar10 < (int)ssid_len) {
        uVar4 = char_to_hex(*__dest_00);
        uVar5 = char_to_hex(__dest_00[1]);
        abStack340[uVar10 >> 1] = uVar4 * '\x10' + uVar5;
        uVar10 = uVar10 + 2;
        __dest_00 = __dest_00 + 2;
      }
    }
    password_00 = (char *)(uint)abStack340[0];
    sVar7 = printf("mac = %02X:%02X:%02X:%02X:%02X:%02X\r\n",(uint)abStack340[1],(uint)abStack340[2]
                   ,(uint)abStack340[3],(uint)mac[0],(uint)mac[1]);
  }
LAB_23000b88:
  aos_now_ms();
  ssid_len = strlen(bssid + 0x1c);
  sVar8 = strlen(pmk + 0x40);
  printf(
         "[APP] [WIFI] [T] %lld\r\n[APP]    SSID %s\r\n[APP]    SSID len %d\r\n[APP]    password %s\r\n[APP]    password len %d\r\n[APP]    pmk %s\r\n[APP]    bssid %s\r\n[APP]    channel band %d\r\n[APP]    channel freq %d\r\n"
         ,sVar7,password_00,bssid + 0x1c,ssid_len,pmk + 0x40,sVar8);
  wifi_mgmr_sta_connect
            ((wifi_interface_t *)wifi_interface,bssid + 0x1c,pmk + 0x40,__dest,abStack340,
             password[64],freq);
  return;
}



void event_cb_wifi_event(input_event_t *event,void *private_data)

{
  ushort uVar1;
  char *password;
  char *ssid;
  ulong *puVar2;
  uint32_t uVar3;
  char *__format;
  size_t sVar4;
  wifi_interface_t *wifi_interface;
  input_event_t *piVar5;
  char *__format_00;
  undefined4 uVar6;
  longlong lVar7;
  
  uVar1 = event->code;
  piVar5 = event;
  switch((uint)uVar1 - 1 & 0xffff) {
  case 0:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] INIT DONE %lld\r\n",event,private_data,(int)lVar7);
    wifi_mgmr_start_background(&conf);
    return;
  case 1:
    aos_now_ms();
    uVar3 = bl_timer_now_us();
    printf("[APP] [EVT] MGMR DONE %lld, now %lums\r\n",event,private_data,uVar3 / 1000);
    _connect_wifi();
    return;
  case 2:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] Reconnect %lld\r\n";
    break;
  case 3:
  case 5:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] connected %lld\r\n";
    break;
  case 4:
    aos_now_ms();
    __format = wifi_mgmr_status_code_str(*(uint16_t *)&event->value);
    __format_00 = "[APP] [EVT] disconnect %lld, Reason: %s\r\n";
    goto LAB_23000dee;
  case 6:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] GOT IP %lld\r\n",event,private_data,(int)lVar7);
    sVar4 = xPortGetFreeHeapSize();
    printf("[SYS] Memory left is %d Bytes\r\n",sVar4);
    return;
  case 7:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] Connecting %lld\r\n";
    break;
  case 8:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] SCAN Done %lld\r\n",event,private_data,(int)lVar7);
    wifi_mgmr_cli_scanlist();
    return;
  case 9:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] SCAN On Join %lld\r\n";
    break;
  default:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] Unknown code %u, %lld\r\n",(uint)uVar1,event,private_data,(int)lVar7);
    return;
  case 0xc:
    lVar7 = aos_now_ms();
    __format = (char *)event->value;
    if (__format == (char *)0x0) {
      __format = "UNKNOWN";
    }
    printf("[APP] [EVT] [PROV] [SSID] %lld: %s\r\n",piVar5,private_data,__format,(int)lVar7);
    puVar2 = (ulong *)0x4200dc84;
    password = ssid;
    goto LAB_23000eaa;
  case 0xd:
    lVar7 = aos_now_ms();
    __format = (char *)event->value;
    if (__format == (char *)0x0) {
      __format = "UNKNOWN";
    }
    printf("[APP] [EVT] [PROV] [BSSID] %lld: %s\r\n",piVar5,private_data,__format,(int)lVar7);
    if ((void *)event->value == (void *)0x0) {
      return;
    }
    vPortFree((void *)event->value);
    return;
  case 0xe:
    lVar7 = aos_now_ms();
    __format = (char *)event->value;
    if (__format == (char *)0x0) {
      __format = "UNKNOWN";
    }
    printf("[APP] [EVT] [PROV] [PASSWD] %lld: %s\r\n",piVar5,private_data,__format,(int)lVar7);
    puVar2 = (ulong *)0x4200dc7c;
LAB_23000eaa:
    if (password != (char *)0x0) {
      vPortFree(password);
    }
    *puVar2 = event->value;
    return;
  case 0xf:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] [PROV] [CONNECT] %lld\r\n",event,private_data,(int)lVar7);
    printf("connecting to %s:%s...\r\n",ssid,password);
    wifi_interface = (wifi_interface_t *)wifi_mgmr_sta_enable();
    wifi_mgmr_sta_connect(wifi_interface,ssid,password,(char *)0x0,(uint8_t *)0x0,'\0',0);
    return;
  case 0x10:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] [PROV] [DISCONNECT] %lld\r\n";
    break;
  case 0x13:
    lVar7 = aos_now_ms();
    uVar6 = (undefined4)lVar7;
    __format = "[APP] [EVT] Microwave Denoise is ON %lld\r\n";
    break;
  case 0x14:
    aos_now_ms();
    __format = (char *)event->value;
    __format_00 = "[APP] [EVT] [AP] [ADD] %lld, sta idx is %lu\r\n";
    goto LAB_23000dee;
  case 0x15:
    aos_now_ms();
    __format = (char *)event->value;
    __format_00 = "[APP] [EVT] [AP] [DEL] %lld, sta idx is %lu\r\n";
LAB_23000dee:
    printf(__format_00,piVar5,private_data,__format);
    return;
  case 0x16:
    lVar7 = aos_now_ms();
    printf("[APP] [EVT] EMERGENCY MAC %lld\r\n",event,private_data,(int)lVar7);
    hal_reboot();
    return;
  }
  printf(__format,event,private_data,uVar6);
  return;
}



void vApplicationGetIdleTaskMemory
               (StaticTask_t **ppxIdleTaskTCBBuffer,StackType_t **ppxIdleTaskStackBuffer,
               uint32_t *pulIdleTaskStackSize)

{
  StackType_t uxIdleTaskStack [96];
  StaticTask_t xIdleTaskTCB;
  
