pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  *ppxIdleTaskTCBBuffer = (StaticTask_t *)&ram0x4201091c;
  *ppxIdleTaskStackBuffer = (StackType_t *)&ram0x4201015c;
  *pulIdleTaskStackSize = 0x60;
  return;
}



void vApplicationGetTimerTaskMemory
               (StaticTask_t **ppxTimerTaskTCBBuffer,StackType_t **ppxTimerTaskStackBuffer,
               uint32_t *pulTimerTaskStackSize)

{
  StackType_t uxTimerTaskStack [400];
  StaticTask_t xTimerTaskTCB;
  
  *ppxTimerTaskTCBBuffer = (StaticTask_t *)&ram0x4201097c;
  *ppxTimerTaskStackBuffer = (StackType_t *)&ram0x420102dc;
  *pulTimerTaskStackSize = 400;
  return;
}



// WARNING: Removing unreachable block (ram,0x23001014)

void vAssertCalled(void)

{
  uint32_t ulSetTo1ToExitFunction;
  
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



// WARNING: Variable defined which should be unmapped: chip_feature

void bfl_main(void)

{
  StackType_t aos_loop_proc_stack [1024];
  StaticTask_t aos_loop_proc_task;
  StackType_t proc_hellow_stack [512];
  StaticTask_t proc_hellow_task;
  int iVar1;
  char *pcStack60;
  char *banner;
  char chip_feature [40];
  
  time_main = bl_timer_now_us();
  bl_uart_init('\0','\x10','\a',-1,-1,(uint32_t)&DAT_001e8480);
  puts("Starting bl602 now....\r\n");
  puts("Booting BL602 Chip...\r\n");
  iVar1 = bl_chip_banner(&pcStack60);
  if (iVar1 == 0) {
    puts(pcStack60);
  }
  puts("\r\n");
  puts("\r\n");
  puts("------------------------------------------------------------\r\n");
  puts("RISC-V Core Feature:");
  bl_chip_info((char *)&banner);
  puts((char *)&banner);
  puts("\r\n");
  puts("Build Version: ");
  puts("release_bl_iot_sdk_1.6.11-1-g66bb28da-dirty");
  puts("\r\n");
  puts("PHY   Version: ");
  puts("a0_final-44-geb7fadd");
  puts("\r\n");
  puts("RF    Version: ");
  puts("f76e39a");
  puts("\r\n");
  puts("Build Date: ");
  puts("Oct 30 2020");
  puts("\r\n");
  puts("Build Time: ");
  puts("00:08:24");
  puts("\r\n");
  puts("------------------------------------------------------------\r\n");
  vPortDefineHeapRegions(xHeapRegions);
  printf("Heap %u@%p, %u@%p\r\n",&_heap_size,&__bss_end,0x860,&_heap_wifi_start);
  printf("Boot2 consumed %lums\r\n",time_main / 1000);
  blog_init();
  bl_irq_init();
  bl_sec_init();
  bl_sec_test();
  bl_dma_init();
  hal_boot2_init();
  hal_board_cfg(0);
  puts("[OS] Starting proc_hellow_entry task...\r\n");
  xTaskCreateStatic(proc_hellow_entry,"hellow",0x200,(void *)0x0,0xf,(StackType_t *)&ram0x4200f080,
                    (StaticTask_t *)&ram0x4200f880);
  puts("[OS] Starting aos_loop_proc task...\r\n");
  xTaskCreateStatic(aos_loop_proc,"event_loop",0x400,(void *)0x0,0xf,(StackType_t *)&ram0x4200e020,
                    (StaticTask_t *)&ram0x4200f020);
  puts("[OS] Starting TCP/IP Stack...\r\n");
  tcpip_init((tcpip_init_done_fn)0x0,(void *)0x0);
  puts("[OS] Starting OS Scheduler...\r\n");
  vTaskStartScheduler();
  return;
}



void ShadowUpdateStatusCallback
               (char *pThingName,ShadowActions_t action,Shadow_Ack_Status_t status,
               char *pReceivedJsonDocument,void *pContextData)

{
  char *__format;
  undefined3 in_register_00002031;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002031,status);
  shadowUpdateInProgress = false;
  if (iVar1 == 0) {
    __format = "Update timed out\r\n";
  }
  else {
    if (iVar1 == 1) {
      __format = "Update rejected\r\n";
    }
    else {
      if (iVar1 != 2) {
        shadowUpdateInProgress = false;
        return;
      }
      __format = "Update accepted\r\n";
    }
  }
  printf(__format);
  return;
}



void windowActuate_Callback(char *pJsonString,uint32_t JsonStringDataLen,jsonStruct_t *pContext)

{
  if (pContext != (jsonStruct_t *)0x0) {
    printf("Delta - Window state changed to %d\r\n",(uint)*(byte *)pContext->pData);
    return;
  }
  return;
}


/*
Unable to decompile 'aws_main_entry'
Cause: Pcode: XML comms: Invalid storage: Unsupported varnode size: -1
*/


void cmd_coex_dump(char *buf,int len,int argc,char **argv)

{
  coex_dump_pta();
  coex_dump_wifi();
  return;
}



int codex_debug_cli_init(void)

{
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_rx_filter_set(void)

{
  _DAT_44b00060 = mm_env.rx_filter_lmac_enable | mm_env.rx_filter_umac;
  return;
}



int element_notify_status_enabled
              (cfg_element_entry *entry,void *arg1,void *arg2,CFG_ELEMENT_TYPE_OPS ops)

{
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_ap_setf(uint8_t ap)

{
  undefined3 in_register_00002029;
  
  _DAT_44b0004c = CONCAT31(in_register_00002029,ap) << 1 | _DAT_44b0004c & 0xfffffffd;
  return;
}



uchar ascii_to_hex(char asccode)

{
  char cVar1;
  byte bVar2;
  
  bVar2 = asccode - 0x30;
  if (9 < bVar2) {
    if ((byte)(asccode + 0x9fU) < 6) {
      cVar1 = -0x57;
    }
    else {
      if (5 < (byte)(asccode + 0xbfU)) {
        return '\0';
      }
      cVar1 = -0x37;
    }
    bVar2 = asccode + cVar1;
  }
  return (uchar)bVar2;
}



undefined4 element_notify_time_last_received_set(void)

{
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_encr_cntrl_pack
               (uint8_t newread,uint8_t newwrite,uint16_t keyindexram,uint8_t ctyperam,
               uint8_t vlanidram,uint8_t sppram,uint8_t usedefkeyram,uint8_t clenram)

{
  uint uVar1;
  undefined3 in_register_00002035;
  undefined3 in_register_00002039;
  undefined3 in_register_0000203d;
  undefined3 in_register_00002041;
  undefined3 in_register_00002045;
  uint uVar2;
  
  uVar2 = CONCAT31(in_register_00002039,vlanidram) << 4;
  if ((uVar2 & 0xffffff0f) != 0) {
    assert_err("(((uint32_t)vlanidram << 4) & ~((uint32_t)0x000000F0)) == 0","module",0x1873);
  }
  uVar1 = CONCAT31(in_register_0000203d,sppram) << 2;
  if ((uVar1 & 0xfffffff3) != 0) {
    assert_err("(((uint32_t)sppram << 2) & ~((uint32_t)0x0000000C)) == 0","module",0x1874);
  }
  _DAT_44b000c4 =
       (uint)newread << 0x1f | CONCAT31(in_register_00002045,clenram) |
       CONCAT31(in_register_00002041,usedefkeyram) << 1 | uVar1 | uVar2 |
       CONCAT31(in_register_00002035,ctyperam) << 8 | (uint)keyindexram << 0x10 |
       (uint)newwrite << 0x1e;
  return;
}



undefined4 element_notify_keepalive_received(void)

{
  return 0;
}



// WARNING: Removing unreachable block (ram,0x23001bd8)
// WARNING: Removing unreachable block (ram,0x23001be2)
// WARNING: Removing unreachable block (ram,0x23001c0a)
// WARNING: Removing unreachable block (ram,0x23001bfe)
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t hal_machw_rx_duration(rx_hd *rhd,uint16_t len)

{
  if ((""[rhd->recvec1a >> 0xc & 0xf] & 0x80) != 0) {
    assert_err("(((uint32_t)ppdumcsindex << 0) & ~((uint32_t)0x0000007F)) == 0","module",0x1a99);
  }
  do {
  } while( true );
}



