pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_env_max_ampdu_duration_set(void)

{
  mm_env.ampdu_max_dur[0] = 0x96;
  if (((_DAT_44b00200 >> 0xc & 0xffff) != 0) && ((_DAT_44b00200 >> 0xc & 0xffff) < 0x97)) {
    mm_env.ampdu_max_dur[0] = (uint16_t)(_DAT_44b00200 >> 0xc);
  }
  mm_env.ampdu_max_dur[1] = 0x96;
  if (((_DAT_44b00204 >> 0xc & 0xffff) != 0) && ((_DAT_44b00204 >> 0xc & 0xffff) < 0x97)) {
    mm_env.ampdu_max_dur[1] = (uint16_t)(_DAT_44b00204 >> 0xc);
  }
  mm_env.ampdu_max_dur[2] = 0x96;
  if (((_DAT_44b00208 >> 0xc & 0xffff) != 0) && ((_DAT_44b00208 >> 0xc & 0xffff) < 0x97)) {
    mm_env.ampdu_max_dur[2] = (uint16_t)(_DAT_44b00208 >> 0xc);
  }
  mm_env.ampdu_max_dur[3] = 0x96;
  if (((_DAT_44b0020c >> 0xc & 0xffff) != 0) && ((_DAT_44b0020c >> 0xc & 0xffff) < 0x97)) {
    mm_env.ampdu_max_dur[3] = (uint16_t)(_DAT_44b0020c >> 0xc);
  }
  mm_env.ampdu_max_dur[4] = mm_env.ampdu_max_dur[3];
  return;
}



void mm_env_init(void)

{
  memset(&mm_env,0,0x2c);
  mm_env._34_2_ = 0x101;
  mm_env._18_2_ = 0;
  mm_env.rx_filter_lmac_enable = 0;
  mm_env.rx_filter_umac = 0x7fffffde;
  mm_rx_filter_set();
  mm_env_max_ampdu_duration_set();
  return;
}



void mm_init(void)

{
  hal_machw_init();
  mm_env_init();
  vif_mgmt_init();
  sta_mgmt_init();
  td_init();
  ps_init();
  txl_cntrl_init();
  rxl_init();
  mm_timer_init();
  scan_init();
  chan_init();
  hal_dma_init();
  mm_bcn_init();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_active(void)

{
  _DAT_44b00038 = 0x30;
  ke_state_set(0,1);
  return;
}



void mm_reset(void)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(0);
  if (CONCAT22(extraout_var,kVar1) == 1) {
    mm_active();
    return;
  }
  ke_state_set(0,0);
  return;
}


/*
Unable to decompile 'mm_tbtt_evt'
Cause: Exception while decompiling 23001d94: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t mm_sec_machwaddr_wr(uint8_t sta_idx,uint8_t inst_nbr)

{
  uint uVar1;
  undefined3 in_register_00002029;
  int iVar2;
  
  iVar2 = CONCAT31(in_register_00002029,sta_idx);
  uVar1 = iVar2 + 8U & 0xff;
  _DAT_44b000bc = *(undefined4 *)sta_info_tab[iVar2].mac_addr.array;
  _DAT_44b000c0 = (uint)sta_info_tab[iVar2].mac_addr.array[2];
  _DAT_44b000ac = 0;
  _DAT_44b000b0 = 0;
  _DAT_44b000b4 = 0;
  _DAT_44b000b8 = 0;
  blmac_encr_cntrl_pack('\0','\x01',(uint16_t)uVar1,'\0',inst_nbr,'\0','\x01','\0');
  do {
  } while (_DAT_44b000c4 << 1 < 0);
  return (uint8_t)uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_sec_keydump(void)

{
  uint uVar1;
  undefined *puVar2;
  int iVar3;
  
  uVar1 = _DAT_44b000d8;
  puts("==========================  Keyram Config ========================\r\n");
  printf("  start %02u -->> end %02u; nVAP %02u; max %02u\r\n",uVar1 & 0xff,uVar1 >> 8 & 0xff,
         uVar1 >> 0x10 & 0xff,uVar1 >> 0x18);
  puts("==========================  Keyram Dump =========================\r\n");
  uVar1 = _DAT_44b000d8 >> 8;
  puts("[id]   MAC Address     Key Len  VLan ID  Default      \tKey Hexdump(16Bytes MAX)\r\n");
  iVar3 = 0;
  while (iVar3 < (int)(uVar1 & 0xff)) {
    blmac_encr_cntrl_pack('\x01','\0',(uint16_t)iVar3,'\0','\0','\0','\0','\0');
    do {
    } while ((int)_DAT_44b000c4 < 0);
    printf("[%02d] %02X:%02X:%02X:%02X:%02X:%02X",iVar3,_DAT_44b000bc & 0xff,
           _DAT_44b000bc >> 8 & 0xff,_DAT_44b000bc >> 0x10 & 0xff,_DAT_44b000bc >> 0x18,
           _DAT_44b000c0 & 0xff,_DAT_44b000c0 >> 8 & 0xff);
    puVar2 = &UNK_230743ec;
    if ((_DAT_44b000c4 & 1) == 0) {
      puVar2 = &UNK_230743f4;
    }
    printf(" %s",puVar2);
    iVar3 = iVar3 + 1;
    printf("    %02u",_DAT_44b000c4 >> 4 & 0xf);
    printf("        %u",_DAT_44b000c4 >> 1 & 1);
    printf("     %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X %02X%02X%02X%02X",
           _DAT_44b000ac & 0xff,_DAT_44b000ac >> 8 & 0xff,_DAT_44b000ac >> 0x10 & 0xff,
           _DAT_44b000ac >> 0x18,_DAT_44b000b0 & 0xff,_DAT_44b000b0 >> 8 & 0xff,
           _DAT_44b000b0 >> 0x10 & 0xff);
    puts("\r\n");
  }
  puts("==========================  MAC Address =========================\r\n");
  printf("    MAC %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00010 & 0xff,_DAT_44b00010 >> 8 & 0xff,
         _DAT_44b00010 >> 0x10 & 0xff,_DAT_44b00010 >> 0x18,_DAT_44b00014 & 0xff,
         _DAT_44b00014 >> 8 & 0xff);
  printf(" Mask %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00018 & 0xff,_DAT_44b00018 >> 8 & 0xff,
         _DAT_44b00018 >> 0x10 & 0xff,_DAT_44b00018 >> 0x18,_DAT_44b0001c & 0xff,
         _DAT_44b0001c >> 8 & 0xff);
  puts("\r\n");
  printf("  BSSID %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00020 & 0xff,_DAT_44b00020 >> 8 & 0xff,
         _DAT_44b00020 >> 0x10 & 0xff,_DAT_44b00020 >> 0x18,_DAT_44b00024 & 0xff,
         _DAT_44b00024 >> 8 & 0xff);
  printf(" Mask %02X:%02X:%02X:%02X:%02X:%02X",_DAT_44b00028 >> 8 & 0xff,
         _DAT_44b00028 >> 0x10 & 0xff,_DAT_44b00028 >> 0x18,_DAT_44b0002c & 0xff,
         _DAT_44b0002c >> 8 & 0xff);
  puts("\r\n");
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t mm_sec_machwkey_wr(mm_key_add_req *param)

{
  byte bVar1;
  byte vlanidram;
  uint16_t keyindexram;
  uint uVar2;
  uint8_t ctyperam;
  uint8_t clenram;
  uint uVar3;
  
  bVar1 = param->sta_idx;
  uVar3 = (uint)bVar1;
  vlanidram = param->inst_nbr;
  if (bVar1 == 0xff) {
    uVar3 = (uint)vlanidram * 4 + (uint)param->key_idx & 0xff;
    keyindexram = (uint16_t)uVar3;
    _DAT_44b000bc = 0xffffffff;
    _DAT_44b000c0 = 0xffffffff;
    vif_mgmt_add_key(param,(uint8_t)uVar3);
  }
  else {
    if (0xb < bVar1) {
      assert_err("sta_idx < STA_MAX","module",0x3e4);
    }
    uVar2 = uVar3 + 8 & 0xff;
    keyindexram = (uint16_t)uVar2;
    sta_mgmt_add_key(param,(uint8_t)uVar2);
    _DAT_44b000bc = *(undefined4 *)sta_info_tab[uVar3].mac_addr.array;
    _DAT_44b000c0 = (uint)sta_info_tab[uVar3].mac_addr.array[2];
  }
  bVar1 = param->cipher_suite;
  if (bVar1 < 4) {
    clenram = *(uint8_t *)((int)&CSWTCH_22 + (uint)bVar1);
    ctyperam = *(uint8_t *)((int)&CSWTCH_23 + (uint)bVar1);
  }
  else {
    assert_err("0","module",0x429);
    ctyperam = '\0';
    clenram = '\x01';
  }
  _DAT_44b000ac = (param->key).array[0];
  _DAT_44b000b0 = (param->key).array[1];
  _DAT_44b000b4 = (param->key).array[2];
  _DAT_44b000b8 = (param->key).array[3];
  blmac_encr_cntrl_pack('\0','\x01',keyindexram,ctyperam,vlanidram,param->spp,'\0',clenram);
  do {
  } while (_DAT_44b000c4 << 1 < 0);
  return (uint8_t)keyindexram;
}



