pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_sec_machwkey_del(uint8_t hw_key_idx)

{
  undefined3 in_register_00002029;
  uint uVar1;
  uint uVar2;
  
  uVar1 = CONCAT31(in_register_00002029,hw_key_idx);
  if (uVar1 < 8) {
    _DAT_44b000bc = 0xffffffff;
    _DAT_44b000c0 = 0xffffffff;
    vif_mgmt_del_key(vif_info_tab + ((int)uVar1 >> 2),hw_key_idx & 3);
  }
  else {
    uVar2 = uVar1 - 8 & 0xff;
    _DAT_44b000bc = *(undefined4 *)sta_info_tab[uVar2].mac_addr.array;
    _DAT_44b000c0 = (uint)sta_info_tab[uVar2].mac_addr.array[2];
    sta_mgmt_del_key(sta_info_tab + uVar2);
  }
  _DAT_44b000ac = 0;
  _DAT_44b000b0 = 0;
  _DAT_44b000b4 = 0;
  _DAT_44b000b8 = 0;
  blmac_encr_cntrl_pack('\0','\x01',(uint16_t)uVar1,'\0','\0','\0','\0','\0');
  do {
  } while (_DAT_44b000c4 << 1 < 0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_sec_machwaddr_del(uint8_t sta_idx)

{
  _DAT_44b000bc = 0xffffffff;
  _DAT_44b000c0 = 0xffffffff;
  _DAT_44b000ac = 0;
  _DAT_44b000b0 = 0;
  _DAT_44b000b4 = 0;
  _DAT_44b000b8 = 0;
  blmac_encr_cntrl_pack('\0','\x01',(ushort)sta_idx + 8 & 0xff,'\0','\0','\0','\0','\0');
  do {
  } while (_DAT_44b000c4 << 1 < 0);
  return;
}



void mm_hw_idle_evt(int dummy)

{
  ke_evt_clear(0x800000);
  ke_state_set(0,0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_hw_info_set(mac_addr *mac_addr)

{
  blmac_ap_setf('\0');
  _DAT_44b0001c = 0x100;
  _DAT_44b080a4 = 0;
  _DAT_44b080a8 = 0;
  _DAT_44b00010 = *(undefined4 *)mac_addr->array;
  _DAT_44b00014 = (uint)mac_addr->array[2];
  _DAT_44b0004c = _DAT_44b0004c & 0xfffff8ff | 1;
  mm_env.rx_filter_umac = 0x3503858c;
  mm_rx_filter_set();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_hw_ap_info_set(void)

{
  blmac_ap_setf('\x01');
  mm_env.rx_filter_umac = 0x3507a58c;
  mm_rx_filter_set();
  _DAT_44b08070 = 0x40001;
  _DAT_44b08074 = _DAT_44b08074 | 0x40001;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_hw_ap_info_reset(void)

{
  blmac_ap_setf('\0');
  mm_env.rx_filter_umac = 0x3503858c;
  mm_rx_filter_set();
  _DAT_44b08070 = 0x40001;
  _DAT_44b08074 = _DAT_44b08074 & 0xfffbfffe;
  return;
}



void mm_back_to_host_idle(void)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(0);
  if (CONCAT22(extraout_var,kVar1) != 3) {
    assert_err("ke_state_get(TASK_MM) == MM_HOST_BYPASSED","module",0x52a);
  }
  if (mm_env.host_idle == '\0') {
    mm_active();
    return;
  }
  ke_state_set(0,0);
  return;
}


/*
Unable to decompile 'mm_force_idle_req'
Cause: Exception while decompiling 2300251e: Decompiler process died

*/


// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

uint8_t mm_sta_add(mm_sta_add_req *param,uint8_t *sta_idx,uint8_t *hw_sta_idx)

{
  uint uVar1;
  uint8_t uVar2;
  uint8_t uVar3;
  uchar uVar4;
  uchar uVar5;
  undefined3 extraout_var;
  size_t sVar6;
  int security_mode;
  uint8_t *phrase;
  int iVar7;
  int iVar8;
  _Bool is_pmf_required;
  uint uVar9;
  undefined2 uStack92;
  mm_key_add_req key_add_req;
  
  uVar2 = sta_mgmt_register(param,sta_idx);
  if (CONCAT31(extraout_var,uVar2) != 0) {
    return uVar2;
  }
  uVar1 = (uint)param->inst_nbr;
  uVar3 = mm_sec_machwaddr_wr(*sta_idx,param->inst_nbr);
  *hw_sta_idx = uVar3;
  if (vif_info_tab[uVar1].type != '\0') {
    return uVar2;
  }
  if (vif_info_tab[uVar1].bss_info.is_supplicant_enabled == false) goto LAB_230025a4;
  sta_conn_info.staId = *sta_idx;
  if ((*(uint *)&vif_info_tab[uVar1].bss_info.is_supplicant_enabled & 0x12800) == 0) {
    if ((*(byte *)&vif_info_tab[uVar1].bss_info.wpa_wpa2_wep & 2) != 0) {
      sVar6 = strlen((char *)(sm_env.connect_param)->phrase);
      printf("wep:len:%d,password:%s\n",sVar6,(sm_env.connect_param)->phrase);
      memset(&uStack92,0,0x2c);
      key_add_req.key.array[7]._1_1_ = param->inst_nbr;
      uStack92 = 0xff00;
      sVar6 = strlen((char *)(sm_env.connect_param)->phrase);
      uVar9 = sVar6 & 0xff;
      key_add_req.key_idx = (uint8_t)uVar9;
      if (uVar9 == 5) {
        key_add_req.key.array[7]._0_1_ = '\0';
LAB_230026d8:
        memcpy(&key_add_req.key,(sm_env.connect_param)->phrase,sVar6 & 0xff);
      }
      else {
        if (uVar9 == 0xd) {
          key_add_req.key.array[7]._0_1_ = '\x03';
          goto LAB_230026d8;
        }
        if (uVar9 == 10) {
          key_add_req.key.array[7]._0_1_ = '\0';
        }
        else {
          if (uVar9 != 0x1a) {
            printf("password length is not correct for wep\n");
            sta_mgmt_unregister(*sta_idx);
            return '\x01';
          }
          key_add_req.key.array[7]._0_1_ = '\x03';
        }
        uVar9 = sVar6 & 0xff;
        if ((sVar6 & 1) != 0) {
          uVar9 = sVar6 & 0xfe;
        }
        if (uVar9 != 0) {
          iVar7 = 0;
          phrase = (sm_env.connect_param)->phrase;
          do {
            uVar4 = ascii_to_hex(*phrase);
            uVar5 = ascii_to_hex(phrase[1]);
            (&key_add_req.key.length)[iVar7 >> 1] = uVar4 * '\x10' + uVar5;
            iVar7 = iVar7 + 2;
            phrase = phrase + 2;
          } while (iVar7 < (int)uVar9);
        }
        key_add_req.key_idx = key_add_req.key_idx >> 1;
      }
      wep_hw_keyid = mm_sec_machwkey_wr((mm_key_add_req *)&uStack92);
    }
  }
  else {
    if ((sm_env.connect_param)->phrase_pmk[0] == '\0') {
      phrase = (sm_env.connect_param)->phrase;
    }
    else {
      phrase = (sm_env.connect_param)->phrase_pmk;
    }
    set_psk((char *)vif_info_tab[uVar1].bss_info.ssid.array,vif_info_tab[uVar1].bss_info.ssid.length
            ,(char *)phrase);
  }
  iVar7 = uVar1 * 0x5d8;
  if ((*(uint *)&vif_info_tab[uVar1].bss_info.is_supplicant_enabled & 0x12000) == 0) {
    if ((*(byte *)&vif_info_tab[uVar1].bss_info.wpa_wpa2_wep & 8) != 0) {
      iVar8 = iVar7 + 0x3ec;
      iVar7 = iVar7 + 0x3eb;
      is_pmf_required = vif_info_tab[uVar1].bss_info.is_pmf_required;
      security_mode = 3;
      goto LAB_2300263a;
    }
  }
  else {
    is_pmf_required = vif_info_tab[uVar1].bss_info.is_pmf_required;
    iVar8 = iVar7 + 0x3ee;
    iVar7 = iVar7 + 0x3ed;
    security_mode = 4;
LAB_2300263a:
    supplicantEnable(&sta_conn_info,security_mode,
                     (void *)((int)&vif_info_tab[0].list_hdr.next + iVar7),
                     (void *)((int)&vif_info_tab[0].list_hdr.next + iVar8),is_pmf_required);
  }
  if (vif_info_tab[uVar1].type != '\0') {
    return uVar2;
  }
LAB_230025a4:
  vif_info_tab[uVar1].u[4] = *sta_idx;
  return '\0';
}



