pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mm_sta_del(uint8_t sta_idx)

{
  uint uVar1;
  undefined3 in_register_00002029;
  undefined *puVar2;
  byte bVar3;
  uint uVar4;
  
  uVar4 = (uint)sta_info_tab[CONCAT31(in_register_00002029,sta_idx)].inst_nbr;
  if (vif_info_tab[uVar4].type == '\0') {
    vif_info_tab[uVar4].u[4] = 0xff;
    if (vif_info_tab[uVar4].bss_info.is_supplicant_enabled != false) {
      if ((*(uint *)&vif_info_tab[uVar4].bss_info.is_supplicant_enabled & 0x12800) == 0) {
        if (((*(byte *)&vif_info_tab[uVar4].bss_info.wpa_wpa2_wep & 2) != 0) && (wep_hw_keyid != -1)
           ) {
          mm_sec_machwkey_del(wep_hw_keyid);
        }
      }
      else {
        mm_sec_machwkey_del(sta_conn_info.ptkHwKeyId);
        mm_sec_machwkey_del(sta_conn_info.gtkHwKeyId);
        mm_sec_machwkey_del(sta_conn_info.mfpHwKeyId);
        supplicantDisable(&sta_conn_info);
        memset(&(sta_conn_info.suppData)->hashSsId,0,0x22);
        remove_psk((char *)vif_info_tab[uVar4].bss_info.ssid.array,
                   vif_info_tab[uVar4].bss_info.ssid.length);
      }
      vif_info_tab[uVar4].bss_info.is_supplicant_enabled = false;
    }
  }
  else {
    if ((sta_info_tab[CONCAT31(in_register_00002029,sta_idx)].ps_state == '\x01') &&
       (bVar3 = vif_info_tab[uVar4].u[0x2ee] - 1, vif_info_tab[uVar4].u[0x2ee] = bVar3, bVar3 == 0))
    {
      uVar1 = (uint)vif_info_tab[uVar4].index + 10 & 0xff;
      puVar2 = (undefined *)ke_msg_alloc(0x49,0xd,0,2);
      sta_info_tab[uVar1].ps_state = '\0';
      *puVar2 = (char)uVar1;
      puVar2[1] = 0;
      ke_msg_send();
      apm_tx_int_ps_clear(vif_info_tab + uVar4,vif_info_tab[uVar4].index + '\n');
    }
  }
  mm_sec_machwaddr_del(sta_idx);
  sta_mgmt_unregister(sta_idx);
  return;
}



void mm_cfg_element_keepalive_timestamp_update(void)

{
  mm_env.keep_alive_time_last_received = xTaskGetTickCount();
  mm_env.keep_alive_packet_counter = mm_env.keep_alive_packet_counter + 1;
  return;
}



void mm_send_connection_loss_ind(vif_info_tag *p_vif_entry)

{
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0x43,6,0,1);
  *puVar1 = p_vif_entry->index;
  ke_msg_send();
  return;
}



void mm_ap_probe_cfm(void *env,uint32_t status)

{
  if ((int)(status << 8) < 0) {
    *(undefined *)((int)env + 0x74) = 0;
    return;
  }
  mm_send_connection_loss_ind((vif_info_tag *)env);
  return;
}



// WARNING: Variable defined which should be unmapped: cur_us
// WARNING: Could not reconcile some variable overlaps

void mm_check_rssi(vif_info_tag *vif_entry,int8_t rssi)

{
  byte bVar1;
  uint8_t uVar2;
  int iVar3;
  uint8_t *puVar4;
  undefined3 in_register_0000202d;
  int iVar5;
  uint uVar6;
  bool bVar7;
  int iVar8;
  uint uStack40;
  longlong cur_us;
  
  iVar5 = CONCAT31(in_register_0000202d,rssi);
  iVar8 = (int)(char)vif_entry->u[0x19];
  iVar3 = (int)(char)vif_entry->u[0x1a];
  bVar1 = vif_entry->u[0x1b];
  bVar7 = (bool)vif_entry->u[0x1c];
  vif_entry->u[0x19] = rssi;
  uStack40 = 0;
  cur_us._0_4_ = 0;
  bl60x_current_time_us((longlong *)&uStack40);
  if (iVar8 != 0) {
    uVar6 = (uint)(uStack40 < uStack40 - (uint)last_us);
    if (((int)(((int)cur_us - last_us._4_4_) - uVar6) < 1) &&
       (((int)cur_us - last_us._4_4_ != uVar6 || (uStack40 - (uint)last_us < 0x1e8481))))
    goto LAB_230029d6;
  }
  puVar4 = (uint8_t *)ke_msg_alloc(0x57,0xd,0,3);
  uVar2 = vif_entry->index;
  *(bool *)(puVar4 + 1) = bVar7;
  puVar4[2] = rssi;
  *puVar4 = uVar2;
  last_us._0_4_ = uStack40;
  last_us._4_4_ = (int)cur_us;
  ke_msg_send();
LAB_230029d6:
  if (iVar3 != 0) {
    if (bVar7 == false) {
      if (iVar5 < iVar8) {
        bVar7 = iVar5 < iVar3 - (char)bVar1;
      }
    }
    else {
      if (iVar8 < iVar5) {
        bVar7 = iVar5 <= iVar3 + (char)bVar1;
      }
    }
    if ((bool)vif_entry->u[0x1c] != bVar7) {
      puVar4 = (uint8_t *)ke_msg_alloc(0x57,0xd,0,3);
      uVar2 = vif_entry->index;
      *(bool *)(puVar4 + 1) = bVar7;
      puVar4[2] = rssi;
      *puVar4 = uVar2;
      ke_msg_send();
    }
    *(bool *)(vif_entry->u + 0x1c) = bVar7;
  }
  return;
}



void mm_send_csa_traffic_ind(uint8_t vif_index,_Bool enable)

{
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0x59,0xd,0,2);
  *puVar1 = vif_index;
  *(_Bool *)(puVar1 + 1) = enable;
  ke_msg_send();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint mm_check_beacon(rx_hd *param_1,vif_info_tag *param_2,int param_3,char **param_4)

{
  ushort len;
  ushort uVar1;
  ushort uVar2;
  uint uVar3;
  int iVar4;
  uint8_t uVar5;
  undefined3 extraout_var;
  uint32_t crc;
  uint32_t uVar6;
  uint32_t uVar7;
  uint uVar8;
  uint uVar9;
  char *pcVar10;
  uint uVar11;
  int iVar12;
  int iVar13;
  uint len_00;
  int iVar14;
  uint uVar15;
  
  len = param_1->frmlen;
  iVar13 = *(int *)(param_1->first_pbd_ptr + 8);
  param_2->u[0x18] = 0;
  beacon_rx_count = beacon_rx_count + 1;
  iVar14 = *(int *)(param_2->u + 0x14);
  if (param_2->u[0x1e] != 0) {
    mm_send_csa_traffic_ind(param_2->index,true);
    param_2->u[0x1e] = 0;
  }
  if ((((30000000 - _DAT_44b00120) + *(int *)(param_2->u + 0x10) < 0) &&
      (mm_env.keep_alive_status_enabled != false)) &&
     (uVar5 = txl_frame_send_null_frame(param_2->u[4],(cfm_func_ptr *)0x0,(void *)0x0),
     CONCAT31(extraout_var,uVar5) == 0)) {
    *(int *)(param_2->u + 0x10) = _DAT_44b00120;
  }
  uVar3 = (uint)len - 0x24;
  mm_check_rssi(param_2,*(int8_t *)((int)&param_1->recvec1c + 3));
  crc = co_crc32(iVar13 + 0x20,4,0);
  pcVar10 = (char *)(iVar13 + 0x24);
  *param_4 = (char *)0x0;
  while (uVar3 = uVar3 & 0xffff, 1 < uVar3) {
    len_00 = (uint)(byte)pcVar10[1];
    if (uVar3 <= len_00 + 1) break;
    if (*pcVar10 == '\x05') {
      *param_4 = pcVar10;
    }
    else {
      crc = co_crc32((uint32_t)(pcVar10 + 2),len_00,crc);
    }
    uVar3 = uVar3 + (-2 - len_00);
    pcVar10 = pcVar10 + 2 + len_00;
  }
  *(uint32_t *)(param_2->u + 0x14) = crc;
  uVar1 = *(ushort *)(param_3 + 0x16);
  uVar2 = *(ushort *)(iVar13 + 0x20);
  uVar3 = *(uint *)(iVar13 + 0x18);
  crc = param_1->tsflo;
  iVar4 = (uint)uVar2 * 0x400;
  iVar13 = *(int *)(iVar13 + 0x1c);
  len_00 = (uint)*(ushort *)param_2->u;
  if (*(ushort *)param_2->u == 0) {
    pcVar10 = *param_4;
    len_00 = 1;
    if ((pcVar10 != (char *)0x0) && (len_00 = (uint)(byte)pcVar10[2], pcVar10[2] == 0)) {
      len_00 = (uint)(byte)pcVar10[3];
    }
  }
  uVar6 = hal_machw_rx_duration(param_1,len);
  uVar7 = hal_machw_rx_duration(param_1,0x18);
  uVar8 = uVar3;
  iVar12 = iVar13;
  __udivdi3();
  uVar11 = uVar3 - uVar7;
  uVar15 = iVar13 - (uint)(uVar3 < uVar11);
  uVar9 = iVar12 * iVar4 + (int)((ulonglong)uVar8 * (ulonglong)uVar2 * 0x400 >> 0x20);
  if ((uVar9 < uVar15) || ((uVar15 == uVar9 && (uVar8 * iVar4 < uVar11)))) {
    uVar11 = uVar8 * iVar4;
  }
  iVar12 = ((uVar11 + len_00 * iVar4) - ((uVar3 - crc) + (uVar6 - uVar7))) - uVar1 * len_00;
  iVar13 = iVar12 + -400;
  if (iVar12 + (-0xc80 - _DAT_44b00120) < 0) {
    iVar13 = iVar13 + iVar4;
  }
  crc = (_DAT_44b00120 - _DAT_44b080a4) + iVar13;
  if (crc != (param_2->tbtt_timer).time) {
    mm_timer_set(&param_2->tbtt_timer,crc);
  }
  return (uint)(*(int *)(param_2->u + 0x14) != iVar14);
}



