pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mm_sta_tbtt(void *env)

{
  uint32_t value;
  _Bool _Var1;
  undefined3 extraout_var;
  byte bVar2;
  
  if (*(char *)((int)env + 0x58) == '\0') {
    return;
  }
  if (*(char *)((int)env + 0x79) != '\0') {
    bVar2 = *(char *)((int)env + 0x79) - 1;
    *(byte *)((int)env + 0x79) = bVar2;
    if (bVar2 < 2) {
      vif_mgmt_switch_channel((vif_info_tag *)env);
      return;
    }
    if (bVar2 == 2) {
      mm_send_csa_traffic_ind(*(uint8_t *)((int)env + 0x57),false);
    }
  }
  value = sta_info_tab[*(byte *)((int)env + 0x60)].bcn_int + *(int *)((int)env + 0x24);
  mm_timer_set((mm_timer_tag *)((int)env + 0x18),value);
  vif_mgmt_bcn_to_prog((vif_info_tag *)env);
  chan_tbtt_switch_update((vif_info_tag *)env,value);
  _Var1 = chan_is_on_channel((vif_info_tag *)env);
  if (CONCAT31(extraout_var,_Var1) != 0) {
    *(uint *)((int)env + 4) = *(uint *)((int)env + 4) | 1;
    bVar2 = *(char *)((int)env + 0x74) + 1;
    *(byte *)((int)env + 0x74) = bVar2;
    if (100 < bVar2) {
      txl_frame_send_null_frame(*(uint8_t *)((int)env + 0x60),mm_ap_probe_cfm,env);
      return;
    }
    if (bVar2 == 100) {
      chan_bcn_detect_start((vif_info_tag *)env);
      return;
    }
  }
  return;
}



uint16_t mm_get_rsn_wpa_ie(uint8_t sta_id,uint8_t *wpa_ie)

{
  undefined3 in_register_00002029;
  uint uVar1;
  
  uVar1 = (uint)sta_info_tab[CONCAT31(in_register_00002029,sta_id)].inst_nbr;
  memcpy(wpa_ie,vif_info_tab[uVar1].bss_info.rsn_wpa_ie,
         (uint)vif_info_tab[uVar1].bss_info.rsn_wpa_ie_len);
  return (uint16_t)(ushort)vif_info_tab[uVar1].bss_info.rsn_wpa_ie_len;
}



void mm_tim_update_proceed(ushort *param_1)

{
  byte bVar1;
  ushort uVar2;
  uint uVar3;
  uint8_t *puVar4;
  uint uVar5;
  int iVar6;
  uint uVar7;
  int iVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  byte *pbVar12;
  
  uVar2 = *param_1;
  uVar9 = (uint)*(byte *)((int)param_1 + 3);
  if (uVar2 == 0) {
    if (*(char *)(param_1 + 1) == '\0') {
      vif_info_tab[uVar9].u[0x2ea] = 0;
    }
    else {
      vif_info_tab[uVar9].u[0x2ea] = 1;
    }
  }
  else {
    iVar8 = uVar9 * 8;
    uVar10 = (uint)(uVar2 >> 3);
    uVar11 = uVar10 & 0xff;
    puVar4 = txl_tim_bitmap_pool + uVar9 * 0xfc;
    pbVar12 = puVar4 + uVar11;
    bVar1 = *pbVar12;
    uVar7 = 1 << ((uint)uVar2 & 7);
    uVar5 = uVar7 & 0xff;
    uVar3 = uVar5 & bVar1;
    if (*(char *)(param_1 + 1) == '\0') {
      if (uVar3 != 0) {
        *pbVar12 = ~(byte)uVar7 & bVar1;
        uVar3 = (uint)*(ushort *)(vif_info_tab[uVar9].u + 0x2e0) - 1;
        *(short *)(vif_info_tab[uVar9].u + 0x2e0) = (short)(uVar3 * 0x10000 >> 0x10);
        if ((uVar3 & 0xffff) == 0) {
          *(undefined2 *)(vif_info_tab[uVar9].u + 0x2de) = 6;
          *(undefined2 *)(vif_info_tab[uVar9].u + 0x2e8) = 0xff;
          bVar1 = vif_info_tab[uVar9].u[0x2de];
          txl_tim_ie_pool[iVar8 + 4] = '\0';
          txl_tim_ie_pool[iVar8 + 1] = bVar1 - 2;
          txl_tim_desc[uVar9 * 2].dataendptr = iVar8 + 0x42047365;
          *(tx_pbd **)&txl_tim_desc[uVar9 * 2].next = txl_bcn_end_desc + *(byte *)((int)param_1 + 3)
          ;
          *(uint8_t **)&txl_tim_desc[uVar9 * 2 + 1].dataendptr =
               puVar4 + vif_info_tab[uVar9].u[0x2e9];
        }
        else {
          if ((uint)vif_info_tab[uVar9].u[0x2e8] == (uVar10 & 0xfe)) {
            while( true ) {
              bVar1 = vif_info_tab[uVar9].u[0x2e8];
              if ((bVar1 == 0xfb) || (puVar4[(uint)bVar1] != '\0')) break;
              vif_info_tab[uVar9].u[0x2e8] = bVar1 + 1;
            }
            uVar3 = (uint)bVar1 & 0xfe;
            vif_info_tab[uVar9].u[0x2e8] = (byte)uVar3;
            *(uint8_t **)&txl_tim_desc[uVar9 * 2 + 1].datastartptr = puVar4 + uVar3;
          }
          if ((uint)vif_info_tab[uVar9].u[0x2e9] == uVar11) {
            while( true ) {
              bVar1 = vif_info_tab[uVar9].u[0x2e9];
              if ((bVar1 == 0) || (puVar4[bVar1] != '\0')) break;
              vif_info_tab[uVar9].u[0x2e9] = bVar1 - 1;
            }
            *(uint8_t **)&txl_tim_desc[uVar9 * 2 + 1].dataendptr = puVar4 + bVar1;
          }
          iVar6 = (((uint)vif_info_tab[uVar9].u[0x2e9] + 6) - (uint)vif_info_tab[uVar9].u[0x2e8]) *
                  0x10000;
          *(short *)(vif_info_tab[uVar9].u + 0x2de) = (short)((uint)iVar6 >> 0x10);
          txl_tim_ie_pool[iVar8 + 1] = (char)((uint)iVar6 >> 0x10) + -2;
          txl_tim_ie_pool[iVar8 + 4] = vif_info_tab[uVar9].u[0x2e8];
        }
      }
    }
    else {
      if (uVar3 == 0) {
        *pbVar12 = (byte)uVar5 | bVar1;
        bVar1 = vif_info_tab[uVar9].u[0x2e8];
        *(short *)(vif_info_tab[uVar9].u + 0x2e0) = *(short *)(vif_info_tab[uVar9].u + 0x2e0) + 1;
        if (uVar11 < bVar1) {
          vif_info_tab[uVar9].u[0x2e8] = (byte)(uVar10 & 0xfe);
          *(uint8_t **)&txl_tim_desc[uVar9 * 2 + 1].datastartptr = puVar4 + (uVar10 & 0xfe);
        }
        if (vif_info_tab[uVar9].u[0x2e9] < uVar11) {
          vif_info_tab[uVar9].u[0x2e9] = (byte)uVar11;
          *(byte **)&txl_tim_desc[uVar9 * 2 + 1].dataendptr = pbVar12;
        }
        iVar6 = (((uint)vif_info_tab[uVar9].u[0x2e9] + 6) - (uint)vif_info_tab[uVar9].u[0x2e8]) *
                0x10000;
        *(short *)(vif_info_tab[uVar9].u + 0x2de) = (short)((uint)iVar6 >> 0x10);
        txl_tim_ie_pool[iVar8 + 1] = (char)((uint)iVar6 >> 0x10) + -2;
        txl_tim_ie_pool[iVar8 + 4] = vif_info_tab[uVar9].u[0x2e8];
        txl_tim_desc[uVar9 * 2].dataendptr = iVar8 + 0x42047364;
        txl_tim_desc[uVar9 * 2].next = uVar9 * 0x28 + 0x42047aa4;
      }
    }
  }
  ke_msg_send_basic(0x42,param_1[-2],0);
  ke_msg_free(param_1 + -6);
  return;
}



void mm_bcn_init(void)

{
  memset(&mm_bcn_env,0,0x24);
  mm_bcn_env.dma.dma_desc = &bcn_dwnld_desc;
  mm_bcn_env.dma.cb = mm_bcn_updated;
  co_list_init(&mm_bcn_env.tim_list);
  return;
}



void mm_bcn_init_vif(vif_info_tag *vif_entry)

{
  byte bVar1;
  tx_pbd *ptVar2;
  uint uVar3;
  int iVar4;
  
  uVar3 = (uint)vif_entry->index;
  txl_frame_init_desc((txl_frame_desc_tag *)(vif_entry->u + 4),
                      (txl_buffer_tag *)(txl_bcn_pool + uVar3 * 0xd3),txl_bcn_hwdesc_pool + uVar3,
                      txl_bcn_buf_ctrl + uVar3);
  txl_bcn_hwdesc_pool[uVar3].cfm_ptr = txl_bcn_hwdesc_cfms + vif_entry->index;
  uVar3 = (uint)vif_entry->index;
  iVar4 = uVar3 * 8;
  vif_entry->u[0x2e7] = 0;
  *(undefined2 *)(vif_entry->u + 0x2e0) = 0;
  vif_entry->u[0x2ea] = 0;
  *(undefined2 *)(vif_entry->u + 0x2de) = 6;
  *(undefined2 *)(vif_entry->u + 0x2e8) = 0xff;
  txl_tim_desc[uVar3 * 2].dataendptr = iVar4 + 0x42047365;
  txl_tim_desc[uVar3 * 2].upatterntx = 0xcafefade;
  *(uint8_t **)&txl_tim_desc[uVar3 * 2].datastartptr = txl_tim_ie_pool + iVar4;
  txl_tim_desc[uVar3 * 2].bufctrlinfo = 0;
  ptVar2 = txl_bcn_end_desc + uVar3;
  *(tx_pbd **)&txl_tim_desc[uVar3 * 2].next = ptVar2;
  txl_tim_ie_pool[iVar4] = '\x05';
  txl_tim_ie_pool[iVar4 + 1] = '\x04';
  bVar1 = vif_entry->u[0x2e7];
  txl_tim_ie_pool[iVar4 + 4] = '\0';
  txl_tim_ie_pool[iVar4 + 2] = bVar1;
  txl_tim_ie_pool[iVar4 + 3] = '\x01';
  txl_tim_ie_pool[iVar4 + 5] = -1;
  txl_tim_desc[uVar3 * 2 + 1].upatterntx = 0xcafefade;
  bVar1 = vif_entry->u[0x2e9];
  *(tx_pbd **)&txl_tim_desc[uVar3 * 2 + 1].next = ptVar2;
  *(uint8_t **)&txl_tim_desc[uVar3 * 2 + 1].dataendptr = txl_tim_bitmap_pool + uVar3 * 0xfc + bVar1;
  memset(txl_tim_bitmap_pool + uVar3 * 0xfc,0,0xfc);
  ptVar2->upatterntx = 0xcafefade;
  txl_bcn_end_desc[uVar3].next = 0;
  txl_bcn_end_desc[uVar3].bufctrlinfo = 0;
  iVar4 = *(int *)(vif_entry->u + 0x70);
  *(undefined4 *)(iVar4 + 0x24) = 0;
  *(undefined4 *)(iVar4 + 0x3c) = 0;
  *(undefined4 *)(iVar4 + 0x10) = 0;
  *(undefined4 *)(vif_entry->u + 0x2d0) = 0x2300362e;
  *(vif_info_tag **)(vif_entry->u + 0x2d4) = vif_entry;
  return;
}



