pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mm_tim_update(mm_tim_update_req *param)

{
  if (mm_bcn_env.tx_cfm != 0) {
    co_list_push_back(&mm_bcn_env.tim_list,(co_list_hdr *)(param + -3));
    return;
  }
  mm_tim_update_proceed();
  return;
}



// WARNING: Type propagation algorithm not settling

void mm_bcn_transmit(void)

{
  byte bVar1;
  uint8_t uVar2;
  uint8_t uVar3;
  vif_info_tag *vif;
  txl_frame_desc_tag *frame;
  _Bool _Var4;
  undefined3 extraout_var;
  char *pcVar5;
  undefined3 extraout_var_00;
  uint8_t *puVar6;
  int iVar7;
  byte bVar8;
  uint uVar9;
  char cVar10;
  int iVar11;
  
  vif = (vif_info_tag *)vif_mgmt_env.used_list.first;
  if (mm_bcn_env.tx_cfm != 0) {
    assert_err("!mm_bcn_env.tx_cfm","module",0x339);
  }
  if (mm_bcn_env.update_ongoing == false) {
    mm_bcn_env.tx_pending = false;
    while (vif != (vif_info_tag *)0x0) {
      if (((vif->type == '\x02') && (*(char *)((int)vif->u + 0x2e6) != '\0')) &&
         (*(char *)((int)vif->u + 0x2e5) == *(char *)((int)vif->u + 0x2e4))) {
        iVar7 = *(int *)((int)vif->u + 0x70);
        iVar11 = (uint)vif->index * 8;
        bVar1 = txl_tim_ie_pool[iVar11 + 4];
        *(int *)(iVar7 + 0x1c) =
             (uint)*(ushort *)((int)vif->u + 0x2dc) + (uint)*(ushort *)((int)vif->u + 0x2de) + 4;
        uVar9 = (uint)txl_cntrl_env.seqnbr;
        frame = (txl_frame_desc_tag *)((int)vif->u + 4);
        txl_cntrl_env.seqnbr = (uint16_t)((uVar9 + 1) * 0x10000 >> 0x10);
        *(undefined2 *)(*(int *)(iVar7 + 0x14) + 0x16) = (short)((uVar9 + 1 & 0xffff) << 4);
        uVar2 = *(uint8_t *)((int)vif->u + 0x2e7);
        txl_tim_ie_pool[iVar11 + 2] = uVar2;
        if (uVar2 == '\0') {
          if ((*(char *)((int)vif->u + 0x2ea) != '\0') ||
             (bVar8 = bVar1 & 0xfe, ipc_emb_env.txdesc[ipc_emb_env.txdesc_idx & 3].ready != 0)) {
            bVar8 = bVar1 | 1;
          }
          *(uint8_t *)((int)vif->u + 0x2e7) = txl_tim_ie_pool[iVar11 + 3];
        }
        else {
          bVar8 = bVar1 & 0xfe;
          if ((*(byte *)((int)vif->u + 0x2ea) & 2) != 0) {
            bVar8 = bVar1 | 1;
          }
        }
        txl_tim_ie_pool[iVar11 + 4] = bVar8 | 1;
        *(char *)((int)vif->u + 0x2e7) = *(char *)((int)vif->u + 0x2e7) + -1;
        cVar10 = *(char *)((int)vif->u + 0x2eb);
        if (cVar10 != '\0') {
          bVar1 = *(byte *)((int)vif->u + 0x2ec);
          cVar10 = cVar10 + -1;
          *(char *)((int)vif->u + 0x2eb) = cVar10;
          if (bVar1 != 0) {
            *(char *)(*(int *)(iVar7 + 0x14) + (uint)bVar1) = cVar10;
            bVar1 = *(byte *)((int)vif->u + 0x2ed);
            if (bVar1 != 0) {
              *(undefined *)(*(int *)(iVar7 + 0x14) + (uint)bVar1) =
                   *(undefined *)((int)vif->u + 0x2eb);
            }
          }
          uVar2 = *(uint8_t *)((int)vif->u + 0x2eb);
          if (uVar2 != '\0') {
            uVar3 = vif->index;
            puVar6 = (uint8_t *)ke_msg_alloc(0x4e,0xd,0,2);
            *puVar6 = uVar3;
            puVar6[1] = uVar2;
            ke_msg_send();
            if (*(char *)((int)vif->u + 0x2eb) != '\0') goto LAB_230033a6;
          }
          *(undefined *)((int)vif->u + 0x2eb) = 1;
        }
LAB_230033a6:
        tpc_update_frame_tx_power(vif,frame);
        _Var4 = chan_is_on_operational_channel(vif);
        if (CONCAT31(extraout_var,_Var4) != 0) {
          uVar2 = vif->index;
          pcVar5 = (char *)ke_msg_alloc(0x4a,0xd,0,3);
          *pcVar5 = uVar2 + '\n';
          pcVar5[1] = '\0';
          pcVar5[2] = '\0';
          ke_msg_send();
          *(uint8_t *)((int)vif->u + 0x33) = vif->index;
          *(undefined *)((int)vif->u + 0x34) = 0xff;
          _Var4 = txl_frame_push(frame,'\x04');
          if (CONCAT31(extraout_var_00,_Var4) != 0) {
            mm_bcn_env.tx_cfm = mm_bcn_env.tx_cfm + 1;
          }
          iVar7 = (uint)vif->index + 10;
          if ((sta_info_tab[iVar7].traffic_avail & PS_TRAFFIC_INT) != 0) {
            sta_info_tab[iVar7].ps_service_period = 9;
            sta_mgmt_send_postponed_frame(vif,sta_info_tab + iVar7,0);
            sta_info_tab[iVar7].ps_service_period = 0;
          }
        }
      }
      vif = *(vif_info_tag **)&vif->list_hdr;
    }
  }
  else {
    mm_bcn_env.tx_pending = true;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_bcn_updated(void *env,int dma_queue)

{
  ushort uVar1;
  ushort uVar2;
  mm_bcn_change_req *pmVar3;
  int iVar4;
  uint32_t uVar5;
  int iVar6;
  txl_buffer_control *ptVar7;
  mm_bcn_change_req *mem_ptr;
  int iVar8;
  uint uVar9;
  int iVar10;
  
  mem_ptr = mm_bcn_env.param + -1;
  ke_msg_send_basic(0x40,*(ke_task_id_t *)&mm_bcn_env.param[-1].tim_len,0);
  pmVar3 = mm_bcn_env.param;
  uVar9 = (uint)*(byte *)((int)env + 0x57);
  iVar4 = *(int *)((int)env + 0xcc);
  uVar1 = (mm_bcn_env.param)->tim_oft;
  iVar10 = (uint)(mm_bcn_env.param)->bcn_len - (uint)(mm_bcn_env.param)->tim_len;
  iVar8 = *(int *)(iVar4 + 0x14);
  *(undefined2 *)((int)env + 0x338) = (short)iVar10;
  me_beacon_check(*(byte *)((int)env + 0x57),pmVar3->bcn_len,*(uint32_t *)(iVar4 + 0x14));
  iVar6 = *(int *)(iVar4 + 0x14) + ((uint)pmVar3->tim_oft - 1);
  *(int *)(iVar4 + 0x18) = iVar6;
  uVar5 = (uint)pmVar3->tim_len + 1 + iVar6;
  txl_bcn_end_desc[uVar9].datastartptr = uVar5;
  uVar2 = pmVar3->tim_oft;
  txl_bcn_end_desc[uVar9].bufctrlinfo = 0;
  txl_bcn_end_desc[uVar9].dataendptr = ~(uint)uVar2 + iVar10 + uVar5;
  if (*(char *)(*(int *)((int)env + 0x40) + 4) == '\0') {
    ptVar7 = &txl_buffer_control_24G;
  }
  else {
    ptVar7 = &txl_buffer_control_5G;
  }
  *(uint *)(ptVar7->field_0 + 0x24) = _DAT_44b000a0 & 0xff;
  *(txl_buffer_control **)(iVar4 + 0x28) = ptVar7;
  *(undefined4 *)(iVar4 + 0x24) = 0;
  *(undefined4 *)(iVar4 + 0x3c) = 0;
  *(tx_pbd **)(iVar4 + 0x10) = txl_tim_desc + (uint)*(byte *)((int)env + 0x57) * 2;
  *(undefined *)((int)env + 0x342) = 1;
  txl_tim_ie_pool[uVar9 * 8 + 3] = *(uint8_t *)(iVar8 + (uint)uVar1 + 3);
  pmVar3 = mm_bcn_env.param;
  *(undefined *)((int)env + 0x347) = 0;
  *(uint8_t *)((int)env + 0x348) = pmVar3->csa_oft[0];
  *(uint8_t *)((int)env + 0x349) = pmVar3->csa_oft[1];
  if (pmVar3->csa_oft[0] != 0) {
    *(char *)((int)env + 0x347) =
         *(char *)(*(int *)(*(int *)((int)env + 0xcc) + 0x14) + (uint)pmVar3->csa_oft[0]) + '\x01';
  }
  mm_bcn_env.update_ongoing = false;
  if (mm_bcn_env.tx_pending != false) {
    mm_bcn_transmit();
  }
  mm_bcn_env.param = (mm_bcn_change_req *)0x0;
  ke_msg_free(mem_ptr);
  return;
}



