pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mm_bcn_update(mm_bcn_change_req *param)

{
  byte bVar1;
  
  bVar1 = param->inst_nbr;
  memcpy(txl_bcn_pool + (uint)bVar1 * 0xd3 + 0x53,param + 1,(uint)param->bcn_len);
  mm_bcn_env.update_pending = false;
  mm_bcn_env.update_ongoing = true;
  mm_bcn_updated(vif_info_tab + (uint)bVar1,0);
  return;
}



void mm_bcn_transmitted(vif_info_tag *param_1)

{
  co_list_hdr *pcVar1;
  
  if (mm_bcn_env.tx_cfm == 0) {
    assert_err("mm_bcn_env.tx_cfm","module",0x244);
  }
  mm_bcn_env.tx_cfm = mm_bcn_env.tx_cfm + -1;
  if (mm_bcn_env.tx_cfm == 0) {
    if (mm_bcn_env.update_pending != false) {
      mm_bcn_update(mm_bcn_env.param);
    }
    while (mm_bcn_env.tim_list.first != (co_list_hdr *)0x0) {
      pcVar1 = co_list_pop_front(&mm_bcn_env.tim_list);
      mm_tim_update_proceed(pcVar1 + 3);
    }
    if (param_1->u[0x2eb] == 1) {
      vif_mgmt_switch_channel(param_1);
      return;
    }
  }
  return;
}



void mm_bcn_change(mm_bcn_change_req *param)

{
  if (mm_bcn_env.tx_cfm != 0) {
    mm_bcn_env.param = param;
    mm_bcn_env.update_pending = true;
    return;
  }
  mm_bcn_env.param = param;
  mm_bcn_update(param);
  return;
}


/*
Unable to decompile 'mm_timer_hw_set'
Cause: Exception while decompiling 230036ce: Decompiler process died

*/


_Bool cmp_abs_time(co_list_hdr *timerA,co_list_hdr *timerB)

{
  return SUB41((uint)((int)timerA[3].next - (int)timerB[3].next) >> 0x1f,0);
}



void mm_timer_init(void)

{
  co_list_init((co_list *)&mm_timer_env);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_timer_set(mm_timer_tag *timer,uint32_t value)

{
  bool bVar1;
  
  if ((int)(value - _DAT_44b00120) < 0) {
    puts("\r\n-------------------[FW] Timer is past due to flash operation. Try to fix\r\n");
    value = _DAT_44b00120 + 3000;
  }
  bVar1 = timer != (mm_timer_tag *)mm_timer_env.prog.first;
  if (bVar1) {
    co_list_extract((co_list *)&mm_timer_env,(co_list_hdr *)timer);
  }
  else {
    co_list_pop_front((co_list *)&mm_timer_env);
  }
  timer->time = value;
  co_list_insert((co_list *)&mm_timer_env,(co_list_hdr *)timer,cmp_abs_time);
  if ((!bVar1) || (timer == (mm_timer_tag *)mm_timer_env.prog.first)) {
    mm_timer_hw_set(mm_timer_env.prog.first);
  }
  if ((int)(value - _DAT_44b00120) < 0) {
    ke_evt_set(0x8000000);
    return;
  }
  return;
}



void mm_timer_clear(mm_timer_tag *timer)

{
  if (timer == (mm_timer_tag *)mm_timer_env.prog.first) {
    co_list_pop_front((co_list *)&mm_timer_env);
    mm_timer_hw_set(mm_timer_env.prog.first);
    return;
  }
  co_list_extract((co_list *)&mm_timer_env,(co_list_hdr *)timer);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mm_timer_schedule(int dummy)

{
  co_list_hdr *pcVar1;
  
  while( true ) {
    ke_evt_clear(0x8000000);
    pcVar1 = mm_timer_env.prog.first;
    if (mm_timer_env.prog.first == (co_list_hdr *)0x0) {
      mm_timer_hw_set(0);
      return;
    }
    if ((-1 < (int)mm_timer_env.prog.first[3].next + (-0x32 - _DAT_44b00120)) &&
       (mm_timer_hw_set(mm_timer_env.prog.first), -1 < (int)((int)pcVar1[3].next - _DAT_44b00120)))
    break;
    co_list_pop_front((co_list *)&mm_timer_env);
    if (pcVar1[1].next == (co_list_hdr *)0x0) {
      assert_err("timer->cb","module",0xde);
    }
    (*(code *)pcVar1[1].next)(pcVar1[2].next,pcVar1[1].next);
  }
  return;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ps_uapsd_timer_handle(void *env)

{
  vif_info_tag *p_vif_entry;
  _Bool _Var1;
  undefined3 extraout_var;
  int iVar2;
  
  iVar2 = 0;
  p_vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first;
  while (p_vif_entry != (vif_info_tag *)0x0) {
    if (((p_vif_entry->type == '\0') && (p_vif_entry->active != false)) &&
       (*(char *)((int)p_vif_entry->u + 0xc) != '\0')) {
      _Var1 = chan_is_on_channel(p_vif_entry);
      __Var1 = CONCAT31(extraout_var,_Var1);
      if ((__Var1 != 0) &&
         (iVar2 = __Var1,
         (int)(((ps_env.uapsd_timeout >> 1) - _DAT_44b00120) + *(int *)((int)p_vif_entry->u + 8)) <
         0)) {
        p_vif_entry->prevent_sleep = p_vif_entry->prevent_sleep | 8;
        txl_frame_send_qosnull_frame
                  (*(uint8_t *)((int)p_vif_entry->u + 4),7,(cfm_func_ptr *)0x0,(void *)0x0);
        *(int *)((int)p_vif_entry->u + 8) = _DAT_44b00120;
      }
    }
    p_vif_entry = *(vif_info_tag **)&p_vif_entry->list_hdr;
  }
  if (iVar2 != 0) {
    mm_timer_set(&ps_env.uapsd_timer,_DAT_44b00120 + ps_env.uapsd_timeout);
    return;
  }
  ps_env.uapsd_tmr_on = false;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_pwr_mgt_setf(uint8_t pwrmgt)

{
  undefined3 in_register_00002029;
  
  _DAT_44b0004c = CONCAT31(in_register_00002029,pwrmgt) << 2 | _DAT_44b0004c & 0xfffffffb;
  return;
}



// WARNING: Type propagation algorithm not settling

void ps_dpsm_update(_Bool pause)

{
  vif_info_tag *p_vif_entry;
  _Bool _Var1;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  code *UNRECOVERED_JUMPTABLE;
  
  if (CONCAT31(in_register_00002029,pause) == 0) {
    ps_env.dpsm_state = ps_env.dpsm_state | 4;
    ps_env.prevent_sleep = ps_env.prevent_sleep & 0xfffffff7;
    UNRECOVERED_JUMPTABLE = ps_enable_cfm;
  }
  else {
    ps_env.dpsm_state = ps_env.dpsm_state | 2;
    ps_env.prevent_sleep = ps_env.prevent_sleep | 8;
    UNRECOVERED_JUMPTABLE = ps_disable_cfm;
  }
  blmac_pwr_mgt_setf(pause ^ 1);
  ps_env.cfm_cnt = '\0';
  p_vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first;
  while (p_vif_entry != (vif_info_tag *)0x0) {
    if (((p_vif_entry->type == '\0') && (p_vif_entry->active != false)) &&
       (_Var1 = chan_is_on_channel(p_vif_entry), CONCAT31(extraout_var,_Var1) != 0)) {
      *(undefined *)((int)p_vif_entry->u + 3) = 0;
      ps_env.cfm_cnt = ps_env.cfm_cnt + '\x01';
      txl_frame_send_null_frame
                (*(uint8_t *)((int)p_vif_entry->u + 4),UNRECOVERED_JUMPTABLE,p_vif_entry);
    }
    p_vif_entry = *(vif_info_tag **)&p_vif_entry->list_hdr;
  }
  if (ps_env.cfm_cnt == '\0') {
                    // WARNING: Could not recover jumptable at 0x230039d8. Too many branches
                    // WARNING: Treating indirect jump as call
    (*UNRECOVERED_JUMPTABLE)((void *)0x0,0x800000);
    return;
  }
  return;
}



uint8_t ps_send_pspoll(vif_info_tag *vif_entry)

{
  ushort uVar1;
  txl_frame_desc_tag *frame;
  tx_hw_desc *ptVar2;
  txl_buffer_tag *ptVar3;
  uint uVar4;
  char acStack40 [4];
  phy_channel_info phy_info;
  
  uVar4 = (uint)vif_entry->u[4];
  phy_get_channel((phy_channel_info *)acStack40,'\0');
  frame = txl_frame_get((uint)(acStack40[0] != '\0'),0x10);
  if (frame != (txl_frame_desc_tag *)0x0) {
    tpc_update_frame_tx_power(vif_entry,frame);
    ptVar3 = (frame->txdesc).lmac.buffer;
    *(undefined *)&ptVar3[1].length = 0xa4;
    *(undefined *)((int)&ptVar3[1].length + 1) = 0;
    uVar1 = sta_info_tab[uVar4].aid;
    *(undefined *)((int)&ptVar3[1].length + 2) = (char)uVar1;
    *(byte *)((int)&ptVar3[1].length + 3) = (byte)((uint)uVar1 >> 8) | 0xc0;
    memcpy(&ptVar3[1].lenheader,&sta_info_tab[uVar4].mac_addr,6);
    memcpy((void *)((int)&ptVar3[1].lenpad + 2),&vif_entry->mac_addr,6);
    ptVar2 = (frame->txdesc).lmac.hw_desc;
    (ptVar2->thd).macctrlinfo2 = (ptVar2->thd).macctrlinfo2 | 0x10000053;
    (frame->txdesc).host.vif_idx = sta_info_tab[uVar4].inst_nbr;
    (frame->txdesc).host.staid = sta_info_tab[uVar4].staid;
    txl_frame_push(frame,'\x03');
  }
  return (uint8_t)(frame == (txl_frame_desc_tag *)0x0);
}



void ps_init(void)

{
  memset(&ps_env,0,0x28);
  ps_env.uapsd_timer.cb = ps_uapsd_timer_handle;
  return;
}



// WARNING: Type propagation algorithm not settling

void ps_set_mode(uint8_t mode,ke_task_id_t taskid)

{
  vif_info_tag *p_vif_entry;
  _Bool _Var1;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  code *UNRECOVERED_JUMPTABLE;
  
  ps_env.taskid = taskid;
  if (((ps_env.dpsm_state & 1) == 0) || ((ps_env.dpsm_state & 6) == 0)) {
    if (CONCAT31(in_register_00002029,mode) == 0) {
      ps_env.dpsm_state = '\0';
      UNRECOVERED_JUMPTABLE = ps_disable_cfm;
      blmac_pwr_mgt_setf(mode);
    }
    else {
      if (CONCAT31(in_register_00002029,mode) == 2) {
        ps_env.dpsm_state = ps_env.dpsm_state | 1;
      }
      blmac_pwr_mgt_setf('\x01');
      UNRECOVERED_JUMPTABLE = ps_enable_cfm;
    }
    ps_env.cfm_cnt = '\0';
    ps_env.uapsd_on = false;
    p_vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first;
    while (p_vif_entry != (vif_info_tag *)0x0) {
      if (((p_vif_entry->type == '\0') && (p_vif_entry->active != false)) &&
         (_Var1 = chan_is_on_channel(p_vif_entry), CONCAT31(extraout_var,_Var1) != 0)) {
        *(undefined *)((int)p_vif_entry->u + 3) = 0;
        ps_env.cfm_cnt = ps_env.cfm_cnt + '\x01';
        if (*(char *)((int)p_vif_entry->u + 0xc) != '\0') {
          ps_env.uapsd_on = true;
        }
        txl_frame_send_null_frame
                  (*(uint8_t *)((int)p_vif_entry->u + 4),UNRECOVERED_JUMPTABLE,p_vif_entry);
      }
      p_vif_entry = *(vif_info_tag **)&p_vif_entry->list_hdr;
    }
    if (ps_env.cfm_cnt == '\0') {
                    // WARNING: Could not recover jumptable at 0x23003ba6. Too many branches
                    // WARNING: Treating indirect jump as call
      (*UNRECOVERED_JUMPTABLE)((void *)0x0,0x800000);
      return;
    }
  }
  else {
    ps_env.dpsm_state = ps_env.dpsm_state | 0x10;
    ps_env.next_mode = mode;
  }
  return;
}



