pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ps_enable_cfm(void *env,uint32_t status)

{
  co_list_hdr cVar1;
  char cVar2;
  
  if (-1 < (int)(status << 8)) {
    cVar2 = *(char *)((int)env + 0x5f) + '\x01';
    *(char *)((int)env + 0x5f) = cVar2;
    if (cVar2 != '\x03') {
      txl_frame_send_null_frame(*(uint8_t *)((int)env + 0x60),ps_enable_cfm,env);
      return;
    }
    mm_send_connection_loss_ind((vif_info_tag *)env);
  }
  cVar1 = (co_list_hdr)vif_mgmt_env.used_list.first;
  if ((ps_env.cfm_cnt == '\0') || (ps_env.cfm_cnt = ps_env.cfm_cnt + -1, ps_env.cfm_cnt == '\0')) {
    if (ps_env.uapsd_on != false) {
      mm_timer_set(&ps_env.uapsd_timer,_DAT_44b00120 + ps_env.uapsd_timeout);
      ps_env.uapsd_tmr_on = true;
      while (cVar1 != (co_list_hdr)0x0) {
        if (((*(char *)((int)cVar1 + 0x56) == '\0') &&
            (*(char *)&((co_list_hdr *)((int)cVar1 + 0x58))->next != '\0')) &&
           (*(char *)&((co_list_hdr *)((int)cVar1 + 0x68))->next != '\0')) {
          ((co_list_hdr *)((int)cVar1 + 4))->next =
               (co_list_hdr *)((uint)((co_list_hdr *)((int)cVar1 + 4))->next & 0xfffffff7);
        }
        cVar1 = *(co_list_hdr *)cVar1;
      }
    }
    if ((ps_env.dpsm_state & 5) == 5) {
      ps_env.dpsm_state = ps_env.dpsm_state & 0xf3;
    }
    else {
      ps_env.ps_on = true;
      ke_msg_send_basic(0x32,ps_env.taskid,0);
    }
    if ((ps_env.dpsm_state & 0x10) != 0) {
      ps_env.dpsm_state = ps_env.dpsm_state & 0xef;
      ps_set_mode(ps_env.next_mode,ps_env.taskid);
      return;
    }
  }
  return;
}



void ps_disable_cfm(void *env,uint32_t status)

{
  char cVar1;
  
  if (-1 < (int)(status << 8)) {
    cVar1 = *(char *)((int)env + 0x5f) + '\x01';
    *(char *)((int)env + 0x5f) = cVar1;
    if (cVar1 != '\x03') {
      txl_frame_send_null_frame(*(uint8_t *)((int)env + 0x60),ps_disable_cfm,env);
      return;
    }
    mm_send_connection_loss_ind((vif_info_tag *)env);
  }
  if ((ps_env.cfm_cnt == '\0') || (ps_env.cfm_cnt = ps_env.cfm_cnt + -1, ps_env.cfm_cnt == '\0')) {
    mm_timer_clear(&ps_env.uapsd_timer);
    ps_env.uapsd_tmr_on = false;
    if ((ps_env.dpsm_state & 3) == 3) {
      ps_env.dpsm_state = ps_env.dpsm_state & 0xfd | 8;
    }
    else {
      ps_env.ps_on = false;
      ke_msg_send_basic(0x32,ps_env.taskid,0);
    }
    if ((ps_env.dpsm_state & 0x10) != 0) {
      ps_env.dpsm_state = ps_env.dpsm_state & 0xef;
      ps_set_mode(ps_env.next_mode,ps_env.taskid);
      return;
    }
  }
  return;
}



uint8_t ps_polling_frame(vif_info_tag *vif_entry)

{
  ushort uVar1;
  txl_frame_desc_tag *frame;
  tx_hw_desc *ptVar2;
  txl_buffer_tag *ptVar3;
  uint uVar4;
  char acStack40 [16];
  
  uVar4 = (uint)vif_entry->u[4];
  phy_get_channel((phy_channel_info *)acStack40,'\0');
  frame = txl_frame_get((uint)(acStack40[0] != '\0'),0x10);
  if (frame != (txl_frame_desc_tag *)0x0) {
    tpc_update_frame_tx_power(vif_entry,frame);
    ptVar3 = (frame->txdesc).lmac.buffer;
    *(undefined *)&ptVar3[1].length = 0xa4;
    *(undefined *)((int)&ptVar3[1].length + 1) = 0;
    uVar1 = sta_info_tab[uVar4].aid;
    *(undefined *)((int)&ptVar3[1].length + 2) = (char)uVar1;
    *(byte *)((int)&ptVar3[1].length + 3) = (byte)((uint)uVar1 >> 8) | 0xc0;
    memcpy(&ptVar3[1].lenheader,&sta_info_tab[uVar4].mac_addr,6);
    memcpy((void *)((int)&ptVar3[1].lenpad + 2),&vif_entry->mac_addr,6);
    ptVar2 = (frame->txdesc).lmac.hw_desc;
    (ptVar2->thd).macctrlinfo2 = (ptVar2->thd).macctrlinfo2 | 0x10000053;
    (frame->txdesc).host.vif_idx = sta_info_tab[uVar4].inst_nbr;
    (frame->txdesc).host.staid = sta_info_tab[uVar4].staid;
    txl_frame_push(frame,'\x03');
  }
  return (uint8_t)(frame == (txl_frame_desc_tag *)0x0);
}



void ps_check_beacon(int param_1,vif_info_tag *param_2)

{
  ushort uVar1;
  _Bool _Var2;
  uint8_t uVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint uVar4;
  uint uVar5;
  uint32_t uVar6;
  byte bVar7;
  
  _Var2 = ps_env.ps_on;
  uVar1 = sta_info_tab[param_2->u[4]].aid;
  uVar5 = param_2->prevent_sleep;
  uVar4 = uVar5 & 0xfffffffe;
  param_2->prevent_sleep = uVar4;
  if (((_Var2 == false) || ((ps_env.dpsm_state & 8) != 0)) || (param_1 == 0)) {
    return;
  }
  if (param_2->u[2] == 0) {
    if ((*(byte *)(param_1 + 4) & 1) == 0) {
      param_2->prevent_sleep = uVar5 & 0xfffffffc;
    }
    else {
      param_2->prevent_sleep = uVar4 | 2;
    }
  }
  uVar5 = (uint)(uVar1 >> 3);
  uVar4 = (uint)*(byte *)(param_1 + 4) & 0xfe;
  bVar7 = param_2->u[0xc] & 0xf;
  if (((uVar4 <= uVar5) && (uVar5 <= ((uint)*(byte *)(param_1 + 1) - 4) + uVar4)) &&
     (((uint)*(byte *)(((uVar5 + param_1) - uVar4) + 5) & 1 << ((uint)uVar1 & 7)) != 0)) {
    if (bVar7 == 0xf) {
      uVar3 = txl_frame_send_qosnull_frame(param_2->u[4],7,(cfm_func_ptr *)0x0,(void *)0x0);
      if (CONCAT31(extraout_var,uVar3) != 0) {
        return;
      }
      uVar6 = param_2->prevent_sleep | 8;
    }
    else {
      uVar3 = ps_send_pspoll(param_2);
      if (CONCAT31(extraout_var_00,uVar3) != 0) {
        return;
      }
      uVar6 = param_2->prevent_sleep | 4;
    }
    param_2->prevent_sleep = uVar6;
    return;
  }
  if (bVar7 == 0xf) {
    uVar6 = param_2->prevent_sleep & 0xfffffff7;
  }
  else {
    uVar6 = param_2->prevent_sleep & 0xfffffffb;
  }
  param_2->prevent_sleep = uVar6;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ps_check_frame(uint8_t *frame,uint32_t statinfo,vif_info_tag *vif_entry)

{
  byte bVar1;
  uint uVar2;
  uint8_t uVar3;
  undefined3 extraout_var;
  uint32_t uVar4;
  _Bool _Var5;
  
  _Var5 = ps_env.uapsd_on;
  if (ps_env.ps_on == false) {
    return;
  }
  uVar2 = (uint)*(ushort *)frame;
  if ((frame[4] & 1) != 0) {
    if (((int)(uVar2 << 0x12) < 0) && (vif_entry->u[2] == 0)) {
      return;
    }
    uVar4 = vif_entry->prevent_sleep & 0xfffffffd;
LAB_23003ee6:
    vif_entry->prevent_sleep = uVar4;
    return;
  }
  if ((statinfo & 0x200) != 0) {
    return;
  }
  if (ps_env.uapsd_on != false) {
    if ((uVar2 & 0x88) == 0x88) {
      if ((uVar2 & 0x300) == 0x300) {
        bVar1 = frame[0x1e];
      }
      else {
        bVar1 = frame[0x18];
      }
      if ((vif_entry->u[0xc] >> ((uint)"\x01"[(uint)bVar1 & 7] & 0x1f) & 1) != 0) {
        *(undefined4 *)(vif_entry->u + 8) = _DAT_44b00120;
        if ((bVar1 & 0x10) == 0) {
          return;
        }
        uVar4 = vif_entry->prevent_sleep & 0xfffffff7;
        goto LAB_23003ee6;
      }
    }
    else {
      if (((*(ushort *)frame & 0xc) == 0) && ((vif_entry->u[0xc] & 8) != 0)) {
        *(undefined4 *)(vif_entry->u + 8) = _DAT_44b00120;
        goto LAB_23003f80;
      }
    }
    _Var5 = false;
  }
LAB_23003f80:
  td_pck_ps_ind(vif_entry->index,true);
  if ((_Var5 == false) &&
     ((-1 < (int)(uVar2 << 0x12) ||
      (((ps_env.dpsm_state & 8) == 0 &&
       (uVar3 = ps_send_pspoll(vif_entry), CONCAT31(extraout_var,uVar3) != 0)))))) {
    vif_entry->prevent_sleep = vif_entry->prevent_sleep & 0xfffffffb;
  }
  return;
}



