pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ps_check_tx_frame(uint8_t staid,uint8_t tid)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  uint uVar1;
  
  if ((((ps_env.ps_on != false) && (CONCAT31(in_register_00002029,staid) != 0xff)) &&
      (CONCAT31(in_register_0000202d,tid) != 0xff)) &&
     ((uVar1 = (uint)sta_info_tab[CONCAT31(in_register_00002029,staid)].inst_nbr,
      vif_info_tab[uVar1].type == '\0' && (vif_info_tab[uVar1].active != false)))) {
    if ((vif_info_tab[uVar1].u[0xc] >> ((uint)"\x01"[CONCAT31(in_register_0000202d,tid)] & 0x1f) & 1
        ) != 0) {
      vif_info_tab[uVar1].prevent_sleep = vif_info_tab[uVar1].prevent_sleep | 8;
      *(undefined4 *)(vif_info_tab[uVar1].u + 8) = _DAT_44b00120;
      return;
    }
    td_pck_ps_ind(vif_info_tab[uVar1].index,false);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ps_uapsd_set(vif_info_tag *vif_entry,uint8_t hw_queue,_Bool uapsd)

{
  byte bVar1;
  undefined3 in_register_00002031;
  
  bVar1 = (byte)(1 << ((uint)hw_queue & 0x1f));
  if (CONCAT31(in_register_00002031,uapsd) == 0) {
    vif_entry->u[0xc] = vif_entry->u[0xc] & ~bVar1;
  }
  else {
    vif_entry->u[0xc] = vif_entry->u[0xc] | bVar1;
    if ((ps_env.ps_on != false) && (ps_env.uapsd_tmr_on == false)) {
      ps_env.uapsd_on = true;
      mm_timer_set(&ps_env.uapsd_timer,_DAT_44b00120 + ps_env.uapsd_timeout);
      ps_env.uapsd_tmr_on = true;
    }
  }
  return;
}



void ps_traffic_status_update(uint8_t vif_index,uint8_t new_status)

{
  _Bool pause;
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  char cVar1;
  co_list_hdr cVar2;
  
  if (((ps_env.ps_on != false) && ((ps_env.dpsm_state & 1) != 0)) && ((ps_env.dpsm_state & 6) == 0))
  {
    cVar2 = (co_list_hdr)vif_mgmt_env.used_list.first;
    if (CONCAT31(in_register_0000202d,new_status) == 0) {
      while (cVar2 != (co_list_hdr)0x0) {
        if ((((uint)*(byte *)((int)cVar2 + 0x57) != CONCAT31(in_register_00002029,vif_index)) &&
            (cVar1 = *(char *)&((co_list_hdr *)((int)cVar2 + 0x58))->next, cVar1 != '\0')) &&
           ((*(char *)((int)cVar2 + 0x56) == '\0' &&
            ((td_env[(uint)*(byte *)((int)cVar2 + 0x57)].status & 0xc) != 0)))) goto LAB_230040e0;
        cVar2 = *(co_list_hdr *)cVar2;
      }
      cVar1 = '\0';
LAB_230040e0:
      if (cVar1 == '\0') {
        if ((ps_env.dpsm_state & 8) == 0) {
          return;
        }
        pause = false;
        goto LAB_230040e8;
      }
    }
    pause = true;
    if ((ps_env.dpsm_state & 8) == 0) {
LAB_230040e8:
      ps_dpsm_update(pause);
      return;
    }
  }
  return;
}



void mm_ps_change_ind(uint8_t sta_idx,uint8_t ps_state)

{
  undefined3 in_register_00002029;
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0x49,0xd,0,2);
  sta_info_tab[CONCAT31(in_register_00002029,sta_idx)].ps_state = ps_state;
  *puVar1 = sta_idx;
  puVar1[1] = ps_state;
  ke_msg_send();
  return;
}



void rxl_mpdu_transfer(rx_swdesc *swdesc)

{
  rx_pbd *prVar1;
  rx_pbd *prVar2;
  rx_pbd *prVar3;
  rx_dmadesc *prVar4;
  
  prVar4 = swdesc->dma_hdrdesc;
  prVar1 = (rx_pbd *)(prVar4->hd).first_pbd_ptr;
  phy_get_channel(&prVar4->phy_info,'\0');
  prVar4->payl_offset = mac_payload_offset;
  swdesc->pbd_count = '\0';
  prVar3 = (rx_pbd *)0x0;
  do {
    prVar2 = prVar1;
    if ((prVar2->bufstatinfo & 1) != 0) {
      swdesc->spare_pbd = prVar2;
      swdesc->last_pbd = prVar3;
      return;
    }
    prVar1 = (rx_pbd *)prVar2->next;
    swdesc->pbd_count = swdesc->pbd_count + '\x01';
    prVar3 = prVar2;
  } while (prVar1 != (rx_pbd *)0x0);
  assert_rec("pd != NULL","module",0xb4);
  return;
}



void rxl_init(void)

{
  rxl_hwdesc_init(1);
  rx_swdesc_init();
  co_list_init((co_list *)&rxl_cntrl_env);
  rxu_cntrl_init();
  return;
}



void rxl_cntrl_dump(void)

{
  uint32_t uVar1;
  co_list_hdr cVar2;
  
  uVar1 = co_list_cnt((co_list *)&rxl_cntrl_env);
  cVar2 = (co_list_hdr)rxl_cntrl_env.ready.first;
  if (uVar1 != 0) {
    while (cVar2 != (co_list_hdr)0x0) {
      cVar2 = *(co_list_hdr *)cVar2;
    }
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_timer_int_handler(void)

{
  rx_hd *prVar1;
  rx_dmadesc *desc;
  char *condition;
  rx_swdesc *list_hdr;
  int line;
  uint32_t uVar2;
  
  _DAT_44b0807c = 0xa0000;
  do {
    while( true ) {
      if ((rxl_cntrl_env.first == (rx_dmadesc *)0x0) ||
         (-1 < (int)(((rxl_cntrl_env.first)->hd).statinfo << 0x11))) {
        if (rxl_cntrl_env.ready.first != (co_list_hdr *)0x0) {
          ke_evt_set(0x40000);
          return;
        }
        return;
      }
      list_hdr = ((rxl_cntrl_env.first)->hd).swdesc;
      prVar1 = &(rxl_cntrl_env.first)->hd;
      desc = list_hdr->dma_hdrdesc;
      rxl_cntrl_env.first = (rx_dmadesc *)((rxl_cntrl_env.first)->hd).next;
      list_hdr->pd = (rx_payloaddesc *)prVar1->first_pbd_ptr;
      uVar2 = (desc->hd).first_pbd_ptr;
      if ((desc->hd).frmlen == 0) break;
      if (uVar2 == 0) {
        line = 0xd8;
        condition = "pd != NULL";
LAB_23004280:
        assert_rec(condition,"module",line);
      }
      else {
        co_list_push_back((co_list *)&rxl_cntrl_env,(co_list_hdr *)list_hdr);
      }
    }
    if (uVar2 != 0) {
      line = 0xfa;
      condition = "dma_hdrdesc->hd.first_pbd_ptr == 0";
      goto LAB_23004280;
    }
    list_hdr->spare_pbd = (rx_pbd *)0x0;
    list_hdr->last_pbd = (rx_pbd *)0x0;
    rxl_hd_append(desc);
  } while( true );
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_timeout_int_handler(void)

{
  _DAT_44b0808c = _DAT_44b0808c & 0xffffffbf;
  return;
}



void rxl_dma_int_handler(void)

{
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



