pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_dma_evt(int dummy)

{
  ke_evt_clear(0x100000);
  _DAT_44a00020 = 0x20;
  return;
}



void rxl_frame_release(rx_swdesc *swdesc)

{
  rxl_pd_append((rx_pbd *)(swdesc->dma_hdrdesc->hd).first_pbd_ptr,swdesc->last_pbd,swdesc->spare_pbd
               );
  rxl_hd_append(swdesc->dma_hdrdesc);
  return;
}



void rxl_mpdu_free(rx_swdesc *swdesc)

{
  ushort uVar1;
  rx_pbd *prVar2;
  rx_pbd *prVar3;
  rx_pbd *prVar4;
  
  prVar2 = (rx_pbd *)(swdesc->dma_hdrdesc->hd).first_pbd_ptr;
  vTaskEnterCritical();
  swdesc->use_in_tcpip = '\0';
  swdesc->dma_hdrdesc->use_in_tcpip = 0;
  prVar4 = (rx_pbd *)0x0;
  do {
    prVar3 = prVar2;
    uVar1 = prVar3->bufstatinfo;
    prVar3[1].upattern = 0;
    if ((uVar1 & 1) != 0) {
      swdesc->spare_pbd = prVar3;
      swdesc->last_pbd = prVar4;
      rxl_frame_release(swdesc);
      vTaskExitCritical();
      return;
    }
    prVar2 = (rx_pbd *)prVar3->next;
    prVar4 = prVar3;
  } while ((rx_pbd *)prVar3->next != (rx_pbd *)0x0);
  assert_rec("pd != NULL","module",0x397);
  return;
}


/*
Unable to decompile 'rxl_cntrl_evt'
Cause: Exception while decompiling 23004384: Decompiler process died

*/


void bl60x_firmwre_mpdu_free(void *swdesc_ptr)

{
  rx_swdesc *swdesc;
  
  vTaskEnterCritical();
  rxl_cntrl_env.packet_stack_cnt =
       rxl_cntrl_env.packet_stack_cnt - *(byte *)((int)swdesc_ptr + 0x1d);
  vTaskExitCritical();
  rxl_mpdu_free((rx_swdesc *)swdesc_ptr);
  return;
}



void rxl_reset(void)

{
  rxl_hwdesc_init(0);
  co_list_init((co_list *)&rxl_cntrl_env);
  co_list_init((co_list *)&swdesc);
  return;
}



void rxl_hwdesc_dump(void)

{
  rx_dmadesc *prVar1;
  rx_payloaddesc *prVar2;
  int iVar3;
  int iVar4;
  uint32_t uVar5;
  
  puts("---------- rxl_hwdesc_dump -------\r\n");
  printf("rx_dma_hdrdesc: %d\r\n",0xd);
  iVar3 = 0;
  prVar1 = rx_dma_hdrdesc;
  do {
    printf("  [%2d]@%08lx: upatternrx %08lx next %08lx first_pbd_ptr %08lx, swdesc %p\r\n",iVar3,
           prVar1,(prVar1->hd).upatternrx,(prVar1->hd).next,(prVar1->hd).first_pbd_ptr,
           (prVar1->hd).swdesc);
    iVar3 = iVar3 + 1;
    printf(
           "    datastartptr %08lx dataendptr %08lx, headerctrlinfo %08lx frmlen %4u ampdu_stat_info %04x\r\n"
           ,(prVar1->hd).datastartptr,(prVar1->hd).dataendptr,(prVar1->hd).headerctrlinfo,
           (uint)(prVar1->hd).frmlen,(uint)(prVar1->hd).ampdu_stat_info);
    printf(
           "    tsflo %08lx tsfhi %08lx recvec1b %08lx recvec1c %08lx recvec1d %08lx recvec2a %08lx recvec2b %08lx statinfo %08lx\r\n"
           ,(prVar1->hd).tsflo,(prVar1->hd).tsfhi,(prVar1->hd).recvec1b,(prVar1->hd).recvec1c,
           (prVar1->hd).recvec1d,(prVar1->hd).recvec2a,(prVar1->hd).recvec2b);
    prVar1 = prVar1 + 1;
  } while (iVar3 != 0xd);
  printf("rx_payload_desc: %d\r\n",0xd);
  iVar3 = 0;
  prVar2 = rx_payload_desc;
  do {
    uVar5 = (prVar2->pbd).dataendptr;
    iVar4 = 0;
    if (uVar5 != 0) {
      iVar4 = (uVar5 + 1) - (prVar2->pbd).datastartptr;
    }
    iVar3 = iVar3 + 1;
    printf(
           "  [%2d]@%08lx %3lu Bytes: upatternrx %08lx next %08lx datastartptr %08lx dataendptr %08lx bufstatinfo %04x reserved %04X\r\n"
           ,prVar2,iVar4,(prVar2->pbd).upattern,(prVar2->pbd).next);
    prVar2 = prVar2 + 1;
  } while (iVar3 != 0xd);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_hwdesc_init(int init)

{
  rx_dmadesc *prVar1;
  rx_dmadesc *prVar2;
  txl_buffer_control *ptVar3;
  txl_buffer_control *ptVar4;
  txl_buffer_control *ptVar5;
  int iVar6;
  uint32_t *puVar7;
  int iVar8;
  txl_buffer_control *ptVar9;
  rx_dmadesc *prVar10;
  rx_dmadesc *prVar11;
  rx_dmadesc *prVar12;
  rx_dmadesc *prVar13;
  txl_buffer_control *ptVar14;
  txl_buffer_control *ptVar15;
  
  vTaskEnterCritical();
  prVar13 = (rx_dmadesc *)0x0;
  iVar6 = 0;
  iVar8 = 0;
  prVar1 = (rx_dmadesc *)0x0;
  prVar10 = rx_dma_hdrdesc;
  prVar11 = (rx_dmadesc *)0x0;
  do {
    prVar2 = prVar10;
    prVar10 = prVar2 + 1;
    prVar12 = prVar11;
    if ((init == 0) && (prVar2->use_in_tcpip == 1)) {
      prVar2 = prVar1;
      if (prVar1 != (rx_dmadesc *)0x0) {
        (prVar1->hd).next = 0;
      }
    }
    else {
      if (prVar1 != (rx_dmadesc *)0x0) {
        *(rx_dmadesc **)&(prVar1->hd).next = prVar2;
      }
      (prVar2->hd).datastartptr = 0;
      (prVar2->hd).dataendptr = 0;
      (prVar2->hd).upatternrx = 0xbaadf00d;
      (prVar2->hd).statinfo = 0;
      (prVar2->hd).headerctrlinfo = 0;
      *(rx_dmadesc **)&(prVar2->hd).next = prVar10;
      (prVar2->hd).first_pbd_ptr = 0;
      (prVar2->hd).swdesc = rx_swdesc_tab + iVar8;
      (prVar2->hd).frmlen = 0;
      prVar12 = prVar2;
      if ((iVar6 != 0) && (prVar12 = prVar11, iVar6 == 1)) {
        prVar13 = prVar2;
      }
      iVar6 = iVar6 + 1;
    }
    iVar8 = iVar8 + 1;
    prVar1 = prVar2;
    prVar11 = prVar12;
  } while (iVar8 != 0xd);
  if (iVar6 < 4) {
    printf("No enough DESC %d(%d)\r\n",0xd);
  }
  if (prVar2 != (rx_dmadesc *)0x0) {
    (prVar2->hd).next = 0;
  }
  _DAT_44b08180 = 0x4000000;
  puVar7 = rx_payload_desc_buffer;
  ptVar9 = (txl_buffer_control *)0x0;
  iVar6 = 0;
  ptVar3 = (txl_buffer_control *)0x0;
  ptVar5 = (txl_buffer_control *)rx_payload_desc;
  ptVar14 = (txl_buffer_control *)0x0;
  _DAT_44b081b8 = prVar13;
  do {
    ptVar4 = ptVar5;
    ptVar5 = (txl_buffer_control *)&ptVar4->mac_control_info;
    ptVar15 = ptVar14;
    if ((init == 0) && (*(int *)(ptVar4->field_0 + 0x14) == 1)) {
      ptVar4 = ptVar3;
      if (ptVar3 != (txl_buffer_control *)0x0) {
        *(undefined4 *)ptVar3->field_0 = 0;
      }
    }
    else {
      if (ptVar3 != (txl_buffer_control *)0x0) {
        *(txl_buffer_control **)ptVar3->field_0 = ptVar4;
      }
      *(txl_buffer_control **)ptVar4->field_0 = ptVar5;
      *(undefined4 *)ptVar4->field_0 = 0xc0dedbad;
      *(undefined2 *)ptVar4->field_0 = 0;
      *(uint32_t **)ptVar4->field_0 = puVar7;
      *(int *)ptVar4->field_0 = (int)puVar7 + 0x34f;
      *(uint32_t **)(ptVar4->field_0 + 0x18) = puVar7;
      ptVar15 = ptVar4;
      if ((iVar6 != 0) && (ptVar15 = ptVar14, iVar6 == 1)) {
        ptVar9 = ptVar4;
      }
      iVar6 = iVar6 + 1;
    }
    puVar7 = puVar7 + 0xd4;
    ptVar3 = ptVar4;
    ptVar14 = ptVar15;
  } while (ptVar5 != txl_buffer_control_desc_bcmc);
  if (iVar6 < 4) {
    printf("No enough PBD DESC, %d(%d)\r\n",0xd);
  }
  *(undefined4 *)ptVar4->field_0 = 0;
  _DAT_44b08180 = 0x8000000;
  _DAT_44b081bc = ptVar9;
  if ((((prVar12 == (rx_dmadesc *)0x0) || (prVar13 == (rx_dmadesc *)0x0)) ||
      (prVar2 == (rx_dmadesc *)0x0)) ||
     ((ptVar15 == (txl_buffer_control *)0x0 || (ptVar9 == (txl_buffer_control *)0x0)))) {
    printf("%p:%p%p vs %p:%p:%p\r\n",prVar12,prVar13,prVar2,ptVar15,ptVar4);
  }
  rxl_cntrl_env.first = prVar13;
  rxl_cntrl_env.last = prVar2;
  rxl_cntrl_env.free = prVar12;
  rx_hwdesc_env.last = (rx_pbd *)ptVar4;
  rx_hwdesc_env.free = (rx_pbd *)ptVar15;
  vTaskExitCritical();
  return;
}



