pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_hd_append(rx_dmadesc *desc)

{
  rx_dmadesc *prVar1;
  
  if (desc == (rx_dmadesc *)0x0) {
    assert_err("desc != NULL","module",0xf9);
  }
  prVar1 = desc;
  if (rxl_cntrl_env.free != _DAT_44b08548) {
    prVar1 = rxl_cntrl_env.free;
    rxl_cntrl_env.free = desc;
  }
  (prVar1->hd).next = 0;
  (prVar1->hd).first_pbd_ptr = 0;
  (prVar1->hd).statinfo = 0;
  (prVar1->hd).frmlen = 0;
  *(rx_dmadesc **)&((rxl_cntrl_env.last)->hd).next = prVar1;
  if (rxl_cntrl_env.first == (rx_dmadesc *)0x0) {
    rxl_cntrl_env.first = prVar1;
  }
  rxl_cntrl_env.last = prVar1;
  _DAT_44b08180 = 0x1000000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxl_pd_append(rx_pbd *first,rx_pbd *last,rx_pbd *spare)

{
  rx_pbd **pprVar1;
  rx_pbd *prVar2;
  rx_pbd *prVar3;
  rx_pbd *prVar4;
  
  if (spare == (rx_pbd *)0x0) {
    assert_err("spare != NULL","module",0x128);
  }
  prVar4 = rx_hwdesc_env.free;
  if (rx_hwdesc_env.free == _DAT_44b0854c) {
    prVar4 = first;
    if (last == (rx_pbd *)0x0) {
      prVar4 = spare;
    }
    spare->bufstatinfo = 0;
  }
  else {
    prVar2 = rx_hwdesc_env.free;
    prVar3 = spare;
    if (last != (rx_pbd *)0x0) {
      pprVar1 = (rx_pbd **)&(rx_hwdesc_env.free)->next;
      rx_hwdesc_env.free = spare;
      *pprVar1 = first;
      prVar2 = last;
      prVar3 = rx_hwdesc_env.free;
    }
    rx_hwdesc_env.free = prVar3;
    spare = prVar2;
    prVar4->bufstatinfo = 0;
  }
  spare->next = 0;
  *(rx_pbd **)&(rx_hwdesc_env.last)->next = prVar4;
  rx_hwdesc_env.last = spare;
  _DAT_44b08180 = 0x2000000;
  return;
}



void scan_search_ds(void)

{
  scan_start_req *param;
  
  DAT_42018f0c = mac_ie_find(0x42047d04,(uint)param->add_ie_len,3);
  return;
}



void scan_init(void)

{
  memset(&scan_env,0,0x1c);
  ke_state_set(2,0);
  DAT_42018efc = &scan_probe_req_ie;
  DAT_42018f00 = dma_cb;
  DAT_42018f04 = 0;
  scan_probe_req_ie.dma_desc.dest = 0x42047d04;
  scan_probe_req_ie.pbd.upatterntx = 0xcafefade;
  scan_probe_req_ie.pbd.next = 0;
  scan_probe_req_ie.pbd.datastartptr = 0x42047d04;
  scan_probe_req_ie.pbd.bufctrlinfo = 0;
  return;
}



void scan_set_channel_request(void)

{
  scan_chan_tag *psVar1;
  uint uVar2;
  undefined uVar3;
  int iVar4;
  
  psVar1 = param->chan + DAT_42018f12;
  chan_scan_req(*(uint8_t *)(&psVar1->freq + 1),psVar1->freq,*(int8_t *)(&psVar1->freq + 2),110000,
                param->vif_idx);
  if (DAT_42018f0c == 0) goto LAB_23004c56;
  uVar2 = (uint)psVar1->freq;
  if (*(char *)(&psVar1->freq + 1) == '\0') {
    uVar3 = 0;
    if (((uVar2 - 0x96c & 0xffff) < 0x49) && (uVar3 = 0xe, psVar1->freq != 0x9b4)) {
      iVar4 = -0x967;
LAB_23004c4a:
      uVar3 = (undefined)((int)(uVar2 + iVar4) / 5);
    }
  }
  else {
    uVar3 = 0;
    if ((*(char *)(&psVar1->freq + 1) == '\x01') && ((uVar2 - 0x138d & 0xffff) < 0x335)) {
      iVar4 = -5000;
      goto LAB_23004c4a;
    }
  }
  *(undefined *)(DAT_42018f0c + 2) = uVar3;
LAB_23004c56:
  ke_state_set(2,2);
  return;
}



void dma_cb(void *env,int dma_queue)

{
  scan_search_ds();
  scan_set_channel_request();
  return;
}



void scan_ie_download(scan_start_req *param)

{
  scan_search_ds();
  scan_set_channel_request();
  scan_probe_req_ie.pbd.dataendptr =
       (scan_probe_req_ie.pbd.datastartptr - 1) + (uint)param->add_ie_len;
  scan_probe_req_ie.pbd.bufctrlinfo = 0;
  return;
}



void scan_probe_req_tx(void)

{
  byte bVar1;
  byte bVar2;
  scan_start_req *psVar3;
  txl_buffer_tag *ptVar4;
  uint type;
  txl_frame_desc_tag *frame;
  int iVar5;
  int iVar6;
  uint uVar7;
  uint8_t *puVar8;
  tx_hw_desc *ptVar9;
  
  psVar3 = param;
  uVar7 = (uint)DAT_42018f12;
  bVar1 = param->vif_idx;
  puVar8 = param->ssid[0].array;
  iVar6 = 0;
  while( true ) {
    if ((int)(uint)psVar3->ssid_cnt <= iVar6) {
      return;
    }
    type = 1;
    if (psVar3->chan[uVar7].band == '\0') {
      type = (uint)psVar3->no_cck;
    }
    frame = txl_frame_get(type,(uint)psVar3->add_ie_len + (uint)puVar8[-1] + 0x1a);
    if (frame == (txl_frame_desc_tag *)0x0) break;
    ptVar4 = (frame->txdesc).lmac.buffer;
    ptVar9 = (frame->txdesc).lmac.hw_desc;
    *(undefined *)&ptVar4[1].length = 0x40;
    *(undefined *)((int)&ptVar4[1].length + 1) = 0;
    *(undefined *)((int)&ptVar4[1].length + 2) = 0;
    *(undefined *)((int)&ptVar4[1].length + 3) = 0;
    memcpy(&ptVar4[1].lenheader,&mac_addr_bcst,6);
    memcpy((void *)((int)&ptVar4[1].lenpad + 2),&vif_info_tab[bVar1].mac_addr,6);
    memcpy(&ptVar4[1].next,&psVar3->bssid,6);
    type = (uint)txl_cntrl_env.seqnbr;
    *(undefined *)&ptVar4[1].dma_desc[0].src = 0;
    txl_cntrl_env.seqnbr = (uint16_t)((type + 1) * 0x10000 >> 0x10);
    iVar5 = (type + 1) * 0x100000;
    *(undefined *)((int)&ptVar4[1].txdesc + 2) = (char)((uint)iVar5 >> 0x10);
    *(undefined *)((int)&ptVar4[1].txdesc + 3) = (char)((uint)iVar5 >> 0x18);
    bVar2 = puVar8[-1];
    *(byte *)((int)&ptVar4[1].dma_desc[0].src + 1) = bVar2;
    type = 0;
    while ((uint)bVar2 != type) {
      *(uint8_t *)((int)&ptVar4[1].dma_desc[0].src + type + 2) = puVar8[type];
      type = type + 1;
    }
    (ptVar9->thd).field_3 = 0x42047cf0;
    (ptVar9->thd).field_5 = (ptVar9->thd).field_5 - (uint)psVar3->add_ie_len;
    (frame->cfm).cfm_func = (cfm_func_ptr *)0x0;
    (frame->cfm).env = (void *)0x0;
    iVar6 = iVar6 + 1;
    puVar8 = puVar8 + 0x22;
    (frame->txdesc).host.vif_idx = psVar3->vif_idx;
    (frame->txdesc).host.staid = -1;
    txl_frame_push(frame,'\x03');
  }
  return;
}



void scan_send_cancel_cfm(uint8_t status,ke_task_id_t dest_id)

{
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0x804,dest_id,2,1);
  *puVar1 = status;
  ke_msg_send();
  return;
}



void sta_mgmt_entry_init(sta_info_tag *sta_entry)

{
  txdesc *txdesc;
  uint16_t *puVar1;
  
