pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  while ((sta_entry->tx_desc_post).first != (co_list_hdr *)0x0) {
    txdesc = (txdesc *)co_list_pop_front(&sta_entry->tx_desc_post);
    txl_frame_release(txdesc,true);
  }
  memset(sta_entry,0,0x1b0);
  puVar1 = (uint16_t *)&sta_entry->ba_info[0].bam_idx_rx;
  do {
    *(uint8_t *)puVar1 = '\x02';
    *(uint8_t *)((int)puVar1 + 1) = '\x02';
    puVar1 = puVar1 + 6;
  } while (puVar1 != sta_entry->rx_qos_last_seqcntl + 3);
  sta_entry->inst_nbr = -1;
  return;
}



void sta_mgmt_init(void)

{
  sta_info_tag *sta_entry;
  sta_info_tag *psVar1;
  
  co_list_init((co_list *)&sta_info_env);
  sta_entry = sta_info_tab;
  do {
    sta_mgmt_entry_init(sta_entry);
    psVar1 = sta_entry + 1;
    co_list_push_back((co_list *)&sta_info_env,(co_list_hdr *)sta_entry);
    sta_entry = psVar1;
  } while (psVar1 != sta_info_tab + 10);
  sta_mgmt_entry_init(sta_info_tab + 10);
  sta_info_tab[10].pol_tbl.buf_ctrl = txl_buffer_control_desc_bcmc;
  sta_info_tab[10].sta_sec_info.cur_key = &vif_info_tab[0].default_key;
  sta_info_tab[10].inst_nbr = '\0';
  sta_info_tab[10].ctrl_port_state = '\0';
  printf("------ set default key %p, key ptr %p\r\n",0x4201a9d0,vif_info_tab[0].default_key);
  sta_mgmt_entry_init(sta_info_tab + 0xb);
  sta_info_tab[11].inst_nbr = '\x01';
  sta_info_tab[11].pol_tbl.buf_ctrl = txl_buffer_control_desc_bcmc + 1;
  sta_info_tab[11].ctrl_port_state = '\0';
  sta_info_tab[11].sta_sec_info.cur_key = &vif_info_tab[1].default_key;
  printf("------ set default key %p, key ptr %p\r\n",vif_info_tab[1].default_key);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t sta_mgmt_register(mm_sta_add_req *param,uint8_t *sta_idx)

{
  uint8_t uVar1;
  co_list_hdr *list_hdr;
  char *__format;
  undefined4 uVar2;
  key_info_tag *pkVar3;
  co_list_hdr *pcVar4;
  byte bVar5;
  co_list_hdr *pcVar6;
  co_list_hdr *pcVar7;
  uint uVar8;
  
  uVar8 = (uint)param->inst_nbr;
  list_hdr = co_list_pop_front((co_list *)&sta_info_env);
  if (list_hdr == (co_list_hdr *)0x0) {
    uVar1 = '\x01';
  }
  else {
    memcpy((void *)((int)&list_hdr[7].next + 2),&param->mac_addr,6);
    bVar5 = param->ampdu_spacing_min;
    if (bVar5 < 0x10) {
      bVar5 = 0x10;
    }
    *(byte *)&list_hdr[5].next = bVar5;
    *(uint16_t *)&list_hdr[3].next = param->ampdu_size_max_ht;
    list_hdr[2].next = (co_list_hdr *)param->ampdu_size_max_vht;
    list_hdr[4].next = (co_list_hdr *)param->paid_gid;
    *(uint8_t *)((int)&list_hdr[6].next + 2) = param->inst_nbr;
    *(int8_t *)&list_hdr[9].next = param->rssi;
    list_hdr[10].next = (co_list_hdr *)param->tsflo;
    list_hdr[0xb].next = (co_list_hdr *)param->tsfhi;
    *(uint8_t *)&list_hdr[0xc].next = param->data_rate;
    uVar1 = (char)((int)(list_hdr + -0x108063c8) >> 4) * '\x13';
    *sta_idx = uVar1;
    *(uint8_t *)((int)&list_hdr[6].next + 3) = uVar1;
    list_hdr[1].next = (co_list_hdr *)0x19000;
    *(undefined2 *)&list_hdr[0x62].next = 0xffff;
    pcVar6 = (co_list_hdr *)((int)&list_hdr[0x62].next + 2);
    do {
      *(undefined2 *)&pcVar6->next = 0xffff;
      pcVar6 = (co_list_hdr *)((int)&pcVar6->next + 2);
    } while (pcVar6 != list_hdr + 0x67);
    bVar5 = *sta_idx;
    *(undefined *)((int)&list_hdr[0xc].next + 1) = 0;
    *(txl_buffer_control **)&list_hdr[0x43].next = txl_buffer_control_desc + bVar5;
    if ((vif_info_tab[uVar8].flags & 8) == 0) {
      list_hdr[0x2b].next = (co_list_hdr *)(uVar8 * 0x5d8 + 0x4201a9d0);
      pkVar3 = vif_info_tab[uVar8].default_key;
      uVar2 = 0x10d;
      __format = "------ %d set default key %p, ptr %p\r\n";
    }
    else {
      pkVar3 = (key_info_tag *)list_hdr[0x2a].next;
      list_hdr[0x2b].next = list_hdr + 0x2a;
      uVar2 = 0x102;
      __format = "------ %d set default key %p, key ptr %p\r\n";
    }
    printf(__format,uVar2,pkVar3);
    pcVar6 = _DAT_44b00120;
    pcVar7 = list_hdr + 0x47;
    pcVar4 = _DAT_44b00120 + -250000;
    do {
      pcVar7->next = pcVar6;
      pcVar7[1].next = pcVar4;
      pcVar7 = pcVar7 + 3;
    } while (pcVar7 != list_hdr + 0x62);
    co_list_push_back(&vif_info_tab[uVar8].sta_list,list_hdr);
    *(undefined *)((int)&list_hdr[7].next + 1) = 1;
    uVar1 = '\0';
  }
  return uVar1;
}



void sta_mgmt_unregister(uint8_t sta_idx)

{
  sta_info_tag *sta_entry;
  undefined3 in_register_00002029;
  
  sta_entry = sta_info_tab + CONCAT31(in_register_00002029,sta_idx);
  co_list_extract(&vif_info_tab[sta_info_tab[CONCAT31(in_register_00002029,sta_idx)].inst_nbr].
                   sta_list,(co_list_hdr *)sta_entry);
  sta_mgmt_entry_init(sta_entry);
  co_list_push_back((co_list *)&sta_info_env,(co_list_hdr *)sta_entry);
  return;
}



void sta_mgmt_add_key(mm_key_add_req *param,uint8_t hw_key_idx)

{
  uint8_t uVar1;
  uint uVar2;
  
  uVar2 = (uint)param->sta_idx;
  sta_info_tab[uVar2].sta_sec_info.key_info.hw_key_idx = hw_key_idx;
  sta_info_tab[uVar2].sta_sec_info.key_info.cipher = param->cipher_suite;
  sta_info_tab[uVar2].sta_sec_info.key_info.key_idx = param->key_idx;
  memset(&sta_info_tab[uVar2].sta_sec_info,0,0x48);
  uVar1 = sta_info_tab[uVar2].sta_sec_info.key_info.cipher;
  if (uVar1 == '\x01') {
    *(undefined4 *)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn = 0;
    *(undefined4 *)((int)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn + 4) = 0;
    *(uint32_t *)sta_info_tab[uVar2].sta_sec_info.key_info.u = (param->key).array[4];
    *(uint32_t *)(sta_info_tab[uVar2].sta_sec_info.key_info.u + 4) = (param->key).array[5];
    *(uint32_t *)(sta_info_tab[uVar2].sta_sec_info.key_info.u + 8) = (param->key).array[6];
    *(uint32_t *)(sta_info_tab[uVar2].sta_sec_info.key_info.u + 0xc) = (param->key).array[7];
  }
  else {
    if ((uVar1 == '\0') || (uVar1 == '\x03')) {
      next = next * 0x41c64e6d + 0x3039;
      *(ulong *)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn = next >> 0x10;
      *(undefined4 *)((int)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn + 4) = 0;
    }
    else {
      *(undefined4 *)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn = 0;
      *(undefined4 *)((int)&sta_info_tab[uVar2].sta_sec_info.key_info.tx_pn + 4) = 0;
    }
  }
  sta_info_tab[uVar2].sta_sec_info.key_info.valid = true;
  *(sta_mgmt_sec_info **)&sta_info_tab[uVar2].sta_sec_info.pairwise_key =
       &sta_info_tab[uVar2].sta_sec_info;
  return;
}



