pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void sta_mgmt_del_key(sta_info_tag *sta)

{
  (sta->sta_sec_info).key_info.valid = false;
  (sta->sta_sec_info).pairwise_key = (key_info_tag *)0x0;
  sta->ctrl_port_state = '\x01';
  return;
}



int sta_mgmt_send_postponed_frame(vif_info_tag *p_vif_entry,sta_info_tag *p_sta_entry,int limit)

{
  uint8_t access_category;
  int iVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  txdesc *txdesc;
  int iStack36;
  int stop;
  
  iVar1 = 0;
  while( true ) {
    txdesc = (txdesc *)(p_sta_entry->tx_desc_post).first;
    if (txdesc == (txdesc *)0x0) {
      return iVar1;
    }
    iStack36 = 0;
    _Var2 = txl_cntrl_tx_check(p_vif_entry);
    if (CONCAT31(extraout_var,_Var2) == 0) {
      return iVar1;
    }
    _Var2 = apm_tx_int_ps_check(txdesc);
    if (CONCAT31(extraout_var_00,_Var2) == 0) {
      return iVar1;
    }
    txdesc = apm_tx_int_ps_get_postpone(p_vif_entry,p_sta_entry,&iStack36);
    if (iStack36 != 0) break;
    if (txdesc == (txdesc *)0x0) {
      txdesc = (txdesc *)co_list_pop_front(&p_sta_entry->tx_desc_post);
    }
    access_category = (txdesc->host).tid;
    *(undefined *)((int)&txdesc[1].host.packet_addr + 1) = 0;
    iVar1 = iVar1 + 1;
    txl_cntrl_push_int(txdesc,access_category);
    if ((limit != 0) && (iVar1 == limit)) {
      return iVar1;
    }
  }
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void td_timer_end(void *env)

{
  int iVar1;
  bool bVar2;
  undefined *puVar3;
  undefined *puVar4;
  
  iVar1 = _DAT_44b00120;
  if (*(char *)((int)env + 0x23) != '\0') {
    bVar2 = *(int *)((int)env + 0x10) != 0;
    if (*(int *)((int)env + 0x14) != 0) {
      bVar2 = (bool)(bVar2 | 2);
    }
    if (*(int *)((int)env + 0x18) != 0) {
      bVar2 = (bool)(bVar2 | 4);
    }
    if (*(int *)((int)env + 0x1c) != 0) {
      bVar2 = (bool)(bVar2 | 8);
    }
    if (((*(byte *)((int)env + 0x21) ^ bVar2) & 0xc) != 0) {
      if ((bVar2 & 4U) == 0) {
        puVar3 = &UNK_23074b2c;
      }
      else {
        puVar3 = &UNK_23074b28;
      }
      if ((bVar2 & 8U) == 0) {
        puVar4 = &UNK_23074b2c;
      }
      else {
        puVar4 = &UNK_23074b30;
      }
      printf(&DAT_23074b34,puVar3,puVar4);
      ps_traffic_status_update(*(uint8_t *)((int)env + 0x20),bVar2 & 0xc);
    }
    *(bool *)((int)env + 0x21) = bVar2;
  }
  *(undefined4 *)((int)env + 0x10) = 0;
  *(undefined4 *)((int)env + 0x14) = 0;
  *(undefined4 *)((int)env + 0x18) = 0;
  *(undefined4 *)((int)env + 0x1c) = 0;
  *(bool *)((int)env + 0x23) = vif_info_tab[*(byte *)((int)env + 0x20)].chan_ctxt == DAT_4201d1f8;
  mm_timer_set((mm_timer_tag *)env,iVar1 + 1000000);
  return;
}



void td_reset(uint8_t vif_index)

{
  td_env_tag *__s;
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,vif_index);
  __s = td_env + iVar1;
  printf(&DAT_23074b00,iVar1);
  if (td_env[iVar1].is_on != false) {
    mm_timer_clear((mm_timer_tag *)__s);
  }
  memset(__s,0,0x24);
  td_env[iVar1].td_timer.cb = td_timer_end;
  *(td_env_tag **)&td_env[iVar1].td_timer.env = __s;
  td_env[iVar1].vif_index = vif_index;
  return;
}



void td_init(void)

{
  printf(&DAT_23074af4);
  td_reset('\0');
  td_reset('\x01');
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void td_start(uint8_t vif_index)

{
  int iVar1;
  undefined3 in_register_00002029;
  int iVar2;
  
  iVar1 = _DAT_44b00120;
  iVar2 = CONCAT31(in_register_00002029,vif_index);
  if (td_env[iVar2].is_on == false) {
    printf(&DAT_23074b14,iVar2);
    td_env[iVar2].is_on = true;
    mm_timer_set((mm_timer_tag *)(td_env + iVar2),iVar1 + 1000000);
    return;
  }
  return;
}



void td_pck_ind(uint8_t vif_index,uint8_t sta_index,_Bool rx)

{
  undefined3 in_register_00002029;
  int iVar1;
  undefined3 in_register_00002031;
  
  iVar1 = CONCAT31(in_register_00002029,vif_index);
  if (CONCAT31(in_register_00002031,rx) != 0) {
    td_env[iVar1].pck_cnt_rx = td_env[iVar1].pck_cnt_rx + 1;
    return;
  }
  td_env[iVar1].pck_cnt_tx = td_env[iVar1].pck_cnt_tx + 1;
  return;
}



void td_pck_ps_ind(uint8_t vif_index,_Bool rx)

{
  undefined3 in_register_00002029;
  int iVar1;
  undefined3 in_register_0000202d;
  
  iVar1 = CONCAT31(in_register_00002029,vif_index);
  if (CONCAT31(in_register_0000202d,rx) != 0) {
    td_env[iVar1].pck_cnt_rx_ps = td_env[iVar1].pck_cnt_rx_ps + 1;
    return;
  }
  td_env[iVar1].pck_cnt_tx_ps = td_env[iVar1].pck_cnt_tx_ps + 1;
  return;
}



void bl_tpc_update_power_table(int8_t *power_table)

{
  char cVar1;
  int32_t *piVar2;
  char *pcVar3;
  int iStack72;
  int32_t power_os [14];
  
  trpc_update_power((int8_t (*) [8])power_table);
  pcVar3 = power_table + 0x18;
  piVar2 = &iStack72;
  while (pcVar3 != power_table + 0x26) {
    cVar1 = *pcVar3;
    pcVar3 = pcVar3 + 1;
    *piVar2 = (int)cVar1;
    piVar2 = piVar2 + 1;
  }
  rf_pri_update_power_offset(&iStack72);
  return;
}



void bl_tpc_power_table_get(int8_t *power_table_config)

{
  int iVar1;
  
  trpc_power_get(power_table_config);
  iVar1 = 0x18;
  do {
    power_table_config[iVar1] = '\0';
    iVar1 = iVar1 + 1;
  } while (iVar1 != 0x26);
  return;
}



void bl_tpc_update_power_rate_11b(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int8_t *piVar2;
  int iVar3;
  
  iVar3 = 0;
  do {
    piVar1 = power_rate_table + iVar3;
    piVar2 = txpwr_vs_rate_table + iVar3;
    iVar3 = iVar3 + 1;
    *piVar2 = *piVar1;
  } while (iVar3 != 4);
  return;
}



void bl_tpc_update_power_rate_11g(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int iVar2;
  int8_t *piVar3;
  
  iVar2 = 0;
  piVar3 = txpwr_vs_rate_table;
  do {
    piVar1 = power_rate_table + iVar2;
    iVar2 = iVar2 + 1;
    piVar3[8] = *piVar1;
    piVar3 = piVar3 + 1;
  } while (iVar2 != 8);
  return;
}



void bl_tpc_update_power_rate_11n(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int iVar2;
  int8_t *piVar3;
  
  iVar2 = 0;
  piVar3 = txpwr_vs_rate_table;
  do {
    piVar1 = power_rate_table + iVar2;
    iVar2 = iVar2 + 1;
    piVar3[0x10] = *piVar1;
    piVar3 = piVar3 + 1;
  } while (iVar2 != 8);
  return;
}



