pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void tpc_update_tx_power(int8_t pwr)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  
  uVar1 = trpc_get_default_power_idx('\x02','\0');
  _DAT_44b000a0 = CONCAT31(extraout_var,uVar1) | _DAT_44b000a0 & 0xffffff00;
  uVar1 = trpc_get_default_power_idx('\0','\0');
  _DAT_44b000a0 = CONCAT31(extraout_var_00,uVar1) << 8 | _DAT_44b000a0 & 0xffff00ff;
  return;
}



// WARNING: Type propagation algorithm not settling

void tpc_update_vif_tx_power(vif_info_tag *vif,int8_t *pwr,uint8_t *idx)

{
  char cVar1;
  char cVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  int *piVar4;
  
  if (*pwr == '\x7f') {
    return;
  }
  cVar1 = vif->tx_power;
  phy_get_rf_gain_idx(pwr,idx);
  cVar2 = *pwr;
  vif->tx_power = cVar2;
  if (vif->user_tx_power < cVar2) {
    *pwr = vif->user_tx_power;
    phy_get_rf_gain_idx(pwr,idx);
  }
  if (*pwr != cVar1) {
    piVar4 = (int *)(vif->sta_list).first;
    while (piVar4 != (int *)0x0) {
      *(byte *)((int)piVar4 + 0x11a) = *(byte *)((int)piVar4 + 0x11a) | 0x10;
      piVar4 = (int *)*piVar4;
    }
    if (vif->chan_ctxt != (chan_ctxt_tag *)0x0) {
      chan_update_tx_power(vif->chan_ctxt);
      _Var3 = chan_is_on_channel(vif);
      if (CONCAT31(extraout_var,_Var3) != 0) {
        tpc_update_tx_power((vif->chan_ctxt->channel).tx_power);
        return;
      }
    }
  }
  return;
}



uint8_t tpc_get_vif_tx_power_vs_rate(uint32_t rate_config)

{
  uint8_t formatmod;
  byte mcs;
  
  mcs = (byte)rate_config & 0x7f;
  if ((rate_config >> 0xb & 7) == 0) {
    formatmod = (uint8_t)(rate_config & 0x7c);
    if ((rate_config & 0x7c) != 0) {
      mcs = mcs - 4;
      formatmod = '\x01';
    }
  }
  else {
    formatmod = '\x02';
  }
  formatmod = trpc_get_default_power_idx(formatmod,mcs);
  return formatmod;
}



void tpc_update_frame_tx_power(vif_info_tag *vif,txl_frame_desc_tag *frame)

{
  uint32_t uVar1;
  uint8_t uVar2;
  undefined3 extraout_var;
  
  uVar1 = (((frame->txdesc).lmac.hw_desc)->thd).policyentryaddr;
  uVar2 = tpc_get_vif_tx_power_vs_rate(*(uint32_t *)(uVar1 + 0x14));
  *(undefined4 *)(uVar1 + 0x24) = CONCAT31(extraout_var,uVar2);
  return;
}



void txl_int_fake_transfer(txdesc *txdesc,uint8_t access_category)

{
  undefined3 in_register_0000202d;
  int iVar1;
  txl_buffer_tag *ptVar2;
  
  ptVar2 = (txdesc->lmac).buffer;
  (ptVar2->tbd).upatterntx = 0xcafefade;
  iVar1 = CONCAT31(in_register_0000202d,access_category) + 0x16;
  ptVar2->txdesc = txdesc;
  if ((&txl_buffer_env.buf_idx[0].free)[iVar1 * 2] == 0) {
    *(txl_buffer_tag **)(&txl_buffer_env.buf_idx[0].free + iVar1 * 2) = ptVar2;
  }
  else {
    *(txl_buffer_tag **)((&txl_buffer_env.buf_idx[0].free_size)[iVar1 * 2] + 0x10) = ptVar2;
  }
  *(txl_buffer_tag **)(&txl_buffer_env.buf_idx[0].free_size + iVar1 * 2) = ptVar2;
  ptVar2->next = (txl_buffer_tag *)0x0;
  return;
}



void blmac_abs_timer_set(int reg_idx,uint32_t value)

{
  if (9 < reg_idx) {
    assert_err("reg_idx <= 9","module",0x26a0);
  }
  *(uint32_t *)((reg_idx + 0x112c004a) * 4) = value;
  return;
}



void txl_machdr_format(uint32_t machdrptr)

{
  uint uVar1;
  
  if ((*(byte *)(machdrptr + 0x16) & 0xf) == 0) {
    txl_cntrl_env.seqnbr = txl_cntrl_env.seqnbr + 1;
  }
  uVar1 = (uint)txl_cntrl_env.seqnbr;
  *(byte *)(machdrptr + 0x16) = (byte)(uVar1 << 4) | *(byte *)(machdrptr + 0x16) & 0xf;
  *(undefined *)(machdrptr + 0x17) = (char)((uVar1 << 4) >> 8);
  return;
}



void txl_cntrl_init(void)

{
  txl_cntrl_env_tag *ptVar1;
  undefined4 uVar2;
  undefined4 *puVar3;
  
  txl_hwdesc_init();
  txl_buffer_init();
  txl_cfm_init();
  txl_frame_init(false);
  memset(&txl_cntrl_env,0,0x58);
  ptVar1 = &txl_cntrl_env;
  puVar3 = (undefined4 *)&DAT_44a00080;
  do {
    co_list_init(&ptVar1->txlist[0].transmitting);
    ptVar1->txlist[0].last_frame_exch = (tx_hd *)0x0;
    uVar2 = *puVar3;
    ptVar1->txlist[0].chk_state = '\0';
    puVar3 = puVar3 + 1;
    ptVar1->txlist[0].bridgedmacnt = (uint16_t)uVar2;
    ptVar1 = (txl_cntrl_env_tag *)(ptVar1->txlist + 1);
  } while (puVar3 != (undefined4 *)0x44a00094);
  txl_cntrl_env.seqnbr = 0;
  return;
}



_Bool txl_cntrl_tx_check(vif_info_tag *p_vif_entry)

{
  _Bool _Var1;
  
  if (txl_cntrl_env.reset == false) {
    _Var1 = chan_is_tx_allowed(p_vif_entry);
    return _Var1;
  }
  return false;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_cntrl_halt_ac(uint8_t access_category)

{
  undefined3 in_register_00002029;
  
  switch(CONCAT31(in_register_00002029,access_category)) {
  case 0:
    _DAT_44b08180 = 0x10000;
    do {
    } while ((_DAT_44b08188 >> 4 & 3) != 0);
    _DAT_44b08184 = 0x10000;
    break;
  case 1:
    _DAT_44b08180 = 0x20000;
    do {
    } while ((_DAT_44b08188 >> 8 & 3) != 0);
    _DAT_44b08184 = 0x20000;
    break;
  case 2:
    _DAT_44b08180 = 0x40000;
    do {
    } while ((_DAT_44b08188 >> 0xc & 3) != 0);
    _DAT_44b08184 = 0x40000;
    break;
  case 3:
    _DAT_44b08180 = 0x80000;
    do {
    } while ((_DAT_44b08188 >> 0x10 & 3) != 0);
    _DAT_44b08184 = 0x80000;
    break;
  case 4:
    _DAT_44b08180 = 0x8000;
    do {
    } while ((_DAT_44b08188 & 3) != 0);
    _DAT_44b08184 = 0x8000;
    break;
  default:
    assert_err("0","module",0x779);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_cntrl_flush_ac(uint8_t access_category,uint32_t status)

{
  uint uVar1;
  undefined3 in_register_00002029;
  int iVar2;
  uint uVar3;
  
  uVar1 = _DAT_44b0808c;
  iVar2 = CONCAT31(in_register_00002029,access_category);
  uVar3 = 1 << ((uint)access_category & 0x1f);
  txl_cfm_flush(access_category,txl_cfm_env.cfmlist + iVar2,status);
  txl_cfm_flush(access_category,&txl_cntrl_env.txlist[iVar2].transmitting,status);
  txl_cntrl_env.txlist[iVar2].last_frame_exch = (tx_hd *)0x0;
  txl_buffer_reset(iVar2);
  _DAT_44b08088 = uVar3;
  _DAT_44b0808c = ~uVar3 & uVar1;
  return;
}


