pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'txl_cntrl_clear_bcn_ac'
Cause: Exception while decompiling 230058de: Decompiler process died

*/

/*
Unable to decompile 'txl_cntrl_clear_all_ac'
Cause: Exception while decompiling 23005900: Decompiler process died

*/


void txl_cntrl_inc_pck_cnt(void)

{
  txl_cntrl_env.pck_cnt = txl_cntrl_env.pck_cnt + 1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_payload_handle(void)

{
  int iVar1;
  
  while ((_DAT_44a00024 & 0x1f) != 0) {
    iVar1 = __clzsi2(_DAT_44a00024 & 0x1f);
    _DAT_44a00020 = 1 << (0x1fU - iVar1 & 0x1f);
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_payload_handle_backup(void)

{
  ushort uVar1;
  uint uVar2;
  uint uVar3;
  txl_buffer_tag *ptVar4;
  char *condition;
  int line;
  byte bVar5;
  uint reg_idx;
  tx_hd *ptVar6;
  undefined *puVar7;
  txdesc *txdesc;
  tx_hd *ptVar8;
  txl_buffer_env_tag *ptVar9;
  txl_cntrl_env_tag *ptVar10;
  uint uVar11;
  tx_hw_desc *ptVar12;
  
  ptVar9 = &txl_buffer_env;
  ptVar10 = &txl_cntrl_env;
  uVar3 = 0;
  while (ptVar4 = ptVar9->list[0].first, ptVar4 == (txl_buffer_tag *)0x0) {
LAB_230059f6:
    uVar3 = uVar3 + 1;
    ptVar9 = (txl_buffer_env_tag *)&ptVar9->buf_idx[0].free_size;
    ptVar10 = (txl_cntrl_env_tag *)(ptVar10->txlist + 1);
    if (uVar3 == 5) {
      return;
    }
  }
  uVar2 = uVar3 & 0xff;
  ptVar9->list[0].first = ptVar4->next;
  uVar11 = 1 << (uVar3 & 0x1f);
  do {
    txdesc = ptVar4->txdesc;
    if ((txdesc->host).packet_addr != 0) {
      if (uVar3 == 4) {
        reg_idx = (uint)(txdesc->host).vif_idx;
        if ((*(byte *)((int)&ptVar4[1].length + 1) >> 5 & 1) == 0) {
          bVar5 = vif_info_tab[reg_idx].u[0x2ea] & 0xfd;
        }
        else {
          bVar5 = vif_info_tab[reg_idx].u[0x2ea] | 2;
        }
        vif_info_tab[reg_idx].u[0x2ea] = bVar5;
      }
      if ((txdesc->host).tid == -1) {
        uVar1 = (txdesc->host).flags;
        if ((((uVar1 & 8) != 0) && ((*(byte *)&ptVar4[1].length & 0xdc) == 0x10)) &&
           (*(short *)((int)&ptVar4[1].dma_desc[0].src + 2) == 0)) {
          (txdesc->host).flags = uVar1 | 0x20;
          rxu_cntrl_monitor_pm((mac_addr *)&ptVar4[1].lenheader);
        }
        txl_machdr_format((uint32_t)(ptVar4 + 1));
      }
      ptVar4 = (txdesc->lmac).buffer;
      ptVar12 = (txdesc->lmac).hw_desc;
      if (((txdesc->host).flags & 8) == 0) {
        txu_cntrl_tkip_mic_append(txdesc,(uint8_t)uVar2);
        (ptVar12->thd).macctrlinfo1 = (ptVar4->buffer_control).mac_control_info;
      }
      else {
        (ptVar12->thd).macctrlinfo2 = (ptVar12->thd).macctrlinfo2 & 0xff87ffff;
        bVar5 = *(byte *)&ptVar4[1].lenheader;
        (ptVar12->thd).statinfo = 0;
        (ptVar12->thd).macctrlinfo1 = (uint)((bVar5 & 1) == 0) << 9;
      }
      *(txl_buffer_control **)&(ptVar12->thd).policyentryaddr = &ptVar4->buffer_control;
      (ptVar12->thd).phyctrlinfo = (ptVar4->buffer_control).phy_control_info;
    }
    ptVar10->txlist[0].bridgedmacnt = ptVar10->txlist[0].bridgedmacnt + 1;
    ptVar6 = ptVar10->txlist[0].last_frame_exch;
    ptVar8 = &((txdesc->lmac).hw_desc)->thd;
    if (ptVar6 == (tx_hd *)0x0) {
      reg_idx = uVar3;
      if (uVar2 == 2) {
        if ((_DAT_44b08188 >> 0xc & 3) == 2) {
          line = 0x23c;
          condition = "blmac_tx_ac_2_state_getf() != 2";
          goto LAB_23005bec;
        }
        _DAT_44b08180 = 0x800;
        puVar7 = (undefined *)0x61a80;
        _DAT_44b081a4 = ptVar8;
      }
      else {
        if (2 < uVar2) {
          if (uVar2 == 3) {
            if ((_DAT_44b08188 >> 0x10 & 3) != 2) {
              _DAT_44b08180 = 0x1000;
              _DAT_44b081a8 = ptVar8;
              goto LAB_23005c4c;
            }
            line = 0x236;
            condition = "blmac_tx_ac_3_state_getf() != 2";
          }
          else {
            if (uVar2 != 4) goto LAB_23005b9a;
            if ((_DAT_44b08188 & 3) != 2) {
              _DAT_44b08180 = 0x100;
              reg_idx = 4;
              puVar7 = (undefined *)0xc350;
              _DAT_44b08198 = ptVar8;
              goto LAB_23005c08;
            }
            line = 0x22f;
            condition = "blmac_tx_bcn_state_getf() != 2";
          }
LAB_23005bec:
          assert_rec(condition,"module",line);
          goto LAB_23005b5e;
        }
        if (uVar2 == 1) {
          if ((_DAT_44b08188 >> 8 & 3) == 2) {
            line = 0x242;
            condition = "blmac_tx_ac_1_state_getf() != 2";
            goto LAB_23005bec;
          }
          _DAT_44b08180 = 0x400;
          puVar7 = &DAT_001e8480;
          _DAT_44b081a0 = ptVar8;
        }
        else {
LAB_23005b9a:
          if ((_DAT_44b08188 >> 4 & 3) == 2) {
            line = 0x248;
            condition = "blmac_tx_ac_0_state_getf() != 2";
            goto LAB_23005bec;
          }
          _DAT_44b08180 = 0x200;
          _DAT_44b0819c = ptVar8;
LAB_23005c4c:
          puVar7 = (undefined *)0x30d40;
        }
      }
LAB_23005c08:
      blmac_abs_timer_set(reg_idx,(uint32_t)(puVar7 + _DAT_44b00120));
      _DAT_44b0808c = uVar11 | _DAT_44b0808c;
      _DAT_44b08088 = uVar11;
    }
    else {
      *(tx_hd **)&ptVar6->nextfrmexseq_ptr = ptVar8;
      if (uVar2 == 2) {
        _DAT_44b08180 = 8;
      }
      else {
        if (uVar2 < 3) {
          if (uVar2 == 1) {
            _DAT_44b08180 = 4;
          }
          else {
LAB_23005b26:
            _DAT_44b08180 = 2;
          }
        }
        else {
          if (uVar2 == 3) {
            _DAT_44b08180 = 0x10;
          }
          else {
            if (uVar2 != 4) goto LAB_23005b26;
            _DAT_44b08180 = 1;
          }
        }
      }
    }
LAB_23005b5e:
    ptVar4 = ptVar9->list[0].first;
    ptVar10->txlist[0].last_frame_exch = ptVar8;
    if (ptVar4 == (txl_buffer_tag *)0x0) goto LAB_230059f6;
    ptVar9->list[0].first = ptVar4->next;
  } while( true );
}


