pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'txl_cntrl_push_int'
Cause: Exception while decompiling 23005cd2: Decompiler process died

*/

/*
Unable to decompile 'txl_cntrl_push_int_force'
Cause: Exception while decompiling 23005da4: Decompiler process died

*/

/*
Unable to decompile 'txl_cntrl_push'
Cause: Exception while decompiling 23005df2: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_transmit_trigger(void)

{
  uint reg_idx;
  uint uVar1;
  int iVar2;
  uint32_t status;
  tx_hw_desc *ptVar3;
  uint32_t uVar4;
  txdesc *txdesc;
  co_list *list;
  
  if ((_DAT_44b08078 & 0x7c0) == 0) {
    return;
  }
  iVar2 = __clzsi2(_DAT_44b08078 & 0x7c0);
  reg_idx = 0x19U - iVar2 & 0xff;
  if (4 < reg_idx) {
    assert_err("access_category < NX_TXQ_CNT","module",0x90b);
  }
  _DAT_44b0807c = 1 << (reg_idx + 6 & 0x1f);
  list = &txl_cntrl_env.txlist[reg_idx].transmitting;
  uVar1 = ~(1 << (0x19U - iVar2 & 0x1f));
  while( true ) {
    txdesc = (txdesc *)list->first;
    if (txdesc == (txdesc *)0x0) {
      txl_cntrl_env.txlist[reg_idx].last_frame_exch = (tx_hd *)0x0;
      _DAT_44b0808c = uVar1 & _DAT_44b0808c;
      return;
    }
    ptVar3 = (txdesc->lmac).hw_desc;
    status = (ptVar3->thd).statinfo;
    if (-1 < (int)status) break;
    if (((txdesc->host).packet_addr != 0) && ((txdesc->lmac).buffer != (txl_buffer_tag *)0x0)) {
      (txdesc->lmac).buffer = (txl_buffer_tag *)0x0;
    }
    ptVar3->cfm_ptr->status = status;
    uVar4 = (ptVar3->thd).nextfrmexseq_ptr;
    if (uVar4 == 0) {
      txl_cntrl_env.txlist[reg_idx].last_frame_exch = (tx_hd *)0x0;
      _DAT_44b0808c = _DAT_44b0808c & uVar1;
    }
    else {
      if (-1 < *(int *)(uVar4 + 0x3c)) {
        blmac_abs_timer_set(reg_idx,_DAT_44b00120 + TX_TIMEOUT[reg_idx]);
        return;
      }
    }
    co_list_pop_front(list);
    if ((txdesc->host).packet_addr == 0) {
      txl_frame_cfm(txdesc);
    }
    else {
      txl_cfm_push(txdesc,status,(uint8_t)reg_idx);
    }
    blmac_abs_timer_set(reg_idx,_DAT_44b00120 + TX_TIMEOUT[reg_idx]);
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_reset(void)

{
  uint8_t access_category;
  uint16_t uVar1;
  txl_cntrl_env_tag *ptVar2;
  undefined4 *puVar3;
  undefined4 uVar4;
  uint uVar5;
  co_list *list;
  txl_cfm_env_tag *list_00;
  
  uVar1 = txl_cntrl_env.seqnbr;
  ke_evt_clear(0x1f000);
  do {
  } while ((_DAT_44a00010 & 0xffff) != 0xffff);
  txl_cntrl_env.reset = true;
  list_00 = &txl_cfm_env;
  list = &txl_cntrl_env.txlist[0].transmitting;
  uVar5 = 0;
  do {
    _DAT_44a00020 = 1 << (uVar5 & 0x1f);
    access_category = (uint8_t)uVar5;
    txl_cfm_flush(access_category,(co_list *)list_00,0x40000000);
    uVar5 = uVar5 + 1;
    txl_cfm_flush(access_category,list,0x40000000);
    list_00 = (txl_cfm_env_tag *)(list_00->cfmlist + 1);
    list = list + 2;
  } while (uVar5 != 5);
  txl_hwdesc_reset();
  txl_buffer_reinit();
  txl_cfm_init();
  memset(&txl_cntrl_env,0,0x58);
  ptVar2 = &txl_cntrl_env;
  puVar3 = (undefined4 *)&DAT_44a00080;
  txl_cntrl_env.seqnbr = uVar1;
  do {
    co_list_init(&ptVar2->txlist[0].transmitting);
    ptVar2->txlist[0].last_frame_exch = (tx_hd *)0x0;
    uVar4 = *puVar3;
    ptVar2->txlist[0].chk_state = '\0';
    puVar3 = puVar3 + 1;
    ptVar2->txlist[0].bridgedmacnt = (uint16_t)uVar4;
    ptVar2 = (txl_cntrl_env_tag *)(ptVar2->txlist + 1);
  } while (puVar3 != (undefined4 *)0x44a00094);
  return;
}



// WARNING: Type propagation algorithm not settling

void txl_cntrl_env_dump(void)

{
  int iVar1;
  uint32_t uVar2;
  int *piVar3;
  int iVar4;
  int *piVar5;
  co_list *list;
  
  iVar1 = 4;
  do {
    list = (co_list *)((int)&txl_cntrl_env.txlist[0].last_frame_exch + iVar1);
    uVar2 = co_list_cnt(list);
    if (uVar2 != 0) {
      piVar5 = (int *)list->first;
      piVar3 = piVar5;
      while (piVar3 != (int *)0x0) {
        piVar3 = (int *)*piVar3;
      }
      while (piVar5 != (int *)0x0) {
        iVar4 = *(int *)(piVar5[0x1b] + 0x10);
        while (iVar4 != 0) {
          iVar4 = *(int *)(iVar4 + 4);
        }
        piVar5 = (int *)*piVar5;
      }
    }
    iVar1 = iVar1 + 0x10;
  } while (iVar1 != 0x54);
  return;
}



void txl_frame_init_desc(txl_frame_desc_tag *frame,txl_buffer_tag *buffer,tx_hw_desc *hwdesc,
                        txl_buffer_control *bufctrl)

{
  memset(frame,0,0x2d8);
  (hwdesc->thd).upatterntx = 0xcafebabe;
  *(txl_buffer_tag **)&(hwdesc->thd).field_4 = buffer + 1;
  (hwdesc->thd).frmlifetime = 0;
  (hwdesc->thd).optlen[0] = 0;
  (hwdesc->thd).optlen[1] = 0;
  (hwdesc->thd).optlen[2] = 0;
  *(undefined4 *)bufctrl->field_0 = 0xbadcab1e;
  (frame->txdesc).lmac.hw_desc = hwdesc;
  (frame->txdesc).lmac.buffer = buffer;
  (frame->txdesc).umac.buf_control = bufctrl;
  frame->type = '\x01';
  return;
}



// WARNING: Type propagation algorithm not settling

void txl_frame_init(_Bool reset)

{
  tx_hw_desc *ptVar1;
  txl_frame_desc_tag *__s;
  uint8_t uVar2;
  byte bVar3;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  txl_buffer_control *ptVar4;
  uint32_t *puVar5;
  int iVar6;
  
  co_list_init((co_list *)&txl_frame_env);
  co_list_init(&txl_frame_env.desc_done);
  __s = txl_frame_desc;
  ptVar1 = txl_frame_hwdesc_pool;
  puVar5 = txl_frame_pool;
  ptVar4 = txl_frame_buf_ctrl;
  iVar6 = 0;
  do {
    if ((CONCAT31(in_register_00002029,reset) == 0) || ((&__s->type)[1] == '\0')) {
      memset(__s,0,0x2d8);
      (ptVar1->thd).upatterntx = 0xcafebabe;
      (ptVar1->thd).frmlifetime = 0;
      (ptVar1->thd).optlen[0] = 0;
      (ptVar1->thd).optlen[1] = 0;
      (ptVar1->thd).optlen[2] = 0;
      *(undefined4 *)ptVar4->field_0 = 0xbadcab1e;
      *(uint32_t **)&(__s->txdesc).lmac.buffer = puVar5;
      (__s->txdesc).umac.buf_control = ptVar4;
      (__s->txdesc).lmac.hw_desc = ptVar1;
      ptVar1->cfm_ptr = txl_frame_hwdesc_cfms + iVar6;
      *(txl_buffer_tag **)&(ptVar1->thd).field_4 = (txl_buffer_tag *)puVar5 + 1;
      __s->type = '\0';
      co_list_push_back((co_list *)&txl_frame_env,(co_list_hdr *)__s);
    }
    iVar6 = iVar6 + 1;
    __s = __s + 1;
    ptVar1 = ptVar1 + 1;
    puVar5 = (uint32_t *)(((txl_buffer_tag *)puVar5)[1].buffer_control.field_0 + 0x10);
    ptVar4 = ptVar4 + 1;
  } while (iVar6 != 4);
  txl_buffer_control_24G.field_0._0_4_ = 0xbadcab1e;
  txl_buffer_control_24G.mac_control_info = 0;
  txl_buffer_control_24G.phy_control_info = 0;
  uVar2 = phy_get_ntx();
  txl_buffer_control_24G.field_0._4_4_ = CONCAT31(extraout_var,uVar2) << 0xe;
  bVar3 = phy_get_ntx();
  txl_buffer_control_24G.field_0._8_4_ = (1 << ((uint)bVar3 + 1 & 0x1f)) + -1;
  txl_buffer_control_24G.field_0._16_4_ = 0xffff0704;
  txl_buffer_control_24G.field_0._20_4_ = 0x400;
  txl_buffer_control_24G.field_0._12_4_ = 0;
  txl_buffer_control_24G.field_0._24_4_ = 0;
  txl_buffer_control_24G.field_0._28_4_ = 0;
  txl_buffer_control_24G.field_0._32_4_ = 0;
  txl_buffer_control_24G.field_0._40_4_ = 0;
  txl_buffer_control_24G.field_0._44_4_ = 0;
  txl_buffer_control_24G.field_0._48_4_ = 0;
  txl_buffer_control_5G.field_0._0_4_ = 0xbadcab1e;
  txl_buffer_control_5G.mac_control_info = 0;
  txl_buffer_control_5G.phy_control_info = 0;
  uVar2 = phy_get_ntx();
  txl_buffer_control_5G.field_0._4_4_ = CONCAT31(extraout_var_00,uVar2) << 0xe;
  bVar3 = phy_get_ntx();
  txl_buffer_control_5G.field_0._8_4_ = (1 << ((uint)bVar3 + 1 & 0x1f)) + -1;
  txl_buffer_control_5G.field_0._12_4_ = 0;
  txl_buffer_control_5G.field_0._16_4_ = 0xffff0704;
  txl_buffer_control_5G.field_0._20_4_ = iVar6;
  txl_buffer_control_5G.field_0._24_4_ = 0;
  txl_buffer_control_5G.field_0._28_4_ = 0;
  txl_buffer_control_5G.field_0._32_4_ = 0;
  txl_buffer_control_5G.field_0._40_4_ = 0;
  txl_buffer_control_5G.field_0._44_4_ = 0;
  txl_buffer_control_5G.field_0._48_4_ = 0;
  return;
}



// WARNING: Type propagation algorithm not settling

txl_frame_desc_tag * txl_frame_get(int type,int len)

{
  txl_frame_desc_tag *ptVar1;
  tx_hw_desc *ptVar2;
  uint8_t uVar3;
  undefined3 extraout_var;
  uint32_t uVar4;
  uint32_t uVar5;
  txl_buffer_control *__src;
  txl_buffer_control *__dest;
  txl_buffer_tag *ptVar6;
  
  ptVar1 = (txl_frame_desc_tag *)co_list_pop_front((co_list *)&txl_frame_env);
  if (ptVar1 == (txl_frame_desc_tag *)0x0) {
    tx_count = tx_count + 1;
    if (tx_count == 10) {
      tx_count = 0;
      rx_count = 2;
      uVar4 = co_list_cnt((co_list *)&txl_frame_env);
      uVar5 = co_list_cnt(&txl_frame_env.desc_done);
      if ((uVar5 | uVar4) == 0) {
        txl_cntrl_clear_all_ac();
      }
    }
  }
  else {
    if (rx_count == 1) {
      rx_count = 0;
      mac_hw_reset = '\x01';
      vTaskEnterCritical();
      assert_rec("MAC HW RESET include tx and rx","tx rx",0x10b);
      vTaskDelay(200);
      ptVar1 = (txl_frame_desc_tag *)0x0;
      vTaskExitCritical();
    }
    else {
      if (rx_count != 0) {
        rx_count = rx_count - 1;
      }
      ptVar2 = (ptVar1->txdesc).lmac.hw_desc;
      ptVar6 = (ptVar1->txdesc).lmac.buffer;
      (ptVar2->thd).frmlen = len + 4;
      (ptVar2->thd).field_5 = (ptVar2->thd).field_4 + len + -1;
      __dest = &ptVar6->buffer_control;
      if (type == 0) {
        __src = &txl_buffer_control_24G;
      }
      else {
        __src = __dest;
        if (type == 1) {
          __src = &txl_buffer_control_5G;
        }
      }
      memcpy(__dest,__src,0x34);
      uVar3 = tpc_get_vif_tx_power_vs_rate(*(uint32_t *)((ptVar6->buffer_control).field_0 + 0x14));
      *(uint *)((ptVar6->buffer_control).field_0 + 0x24) = CONCAT31(extraout_var,uVar3);
      *(txl_buffer_control **)&(ptVar2->thd).policyentryaddr = __dest;
      (ptVar2->thd).phyctrlinfo = 0;
      (ptVar2->thd).macctrlinfo2 = 0;
      (ptVar2->thd).field_3 = 0;
      (ptVar1->cfm).cfm_func = (cfm_func_ptr *)0x0;
      (ptVar1->cfm).env = (void *)0x0;
    }
  }
  return ptVar1;
}



_Bool txl_frame_push(txl_frame_desc_tag *frame,uint8_t ac)

{
  byte bVar1;
  tx_hw_desc *ptVar2;
  _Bool _Var3;
  
  ptVar2 = (frame->txdesc).lmac.hw_desc;
  if (((ptVar2->thd).field_4 & 1) != 0) {
    assert_err("(thd->datastartptr & 0x01) == 0","module",0x182);
  }
  (ptVar2->thd).nextfrmexseq_ptr = 0;
  (ptVar2->thd).nextmpdudesc_ptr = 0;
  (ptVar2->thd).macctrlinfo2 = (ptVar2->thd).macctrlinfo2 & 0xff87ffff;
  bVar1 = *(byte *)((ptVar2->thd).field_4 + 4);
  (ptVar2->thd).statinfo = 0;
  (ptVar2->thd).macctrlinfo1 = (uint)((bVar1 & 1) == 0) << 9;
  _Var3 = txl_cntrl_push_int((txdesc *)frame,ac);
  return _Var3;
}



_Bool txl_frame_push_force(txl_frame_desc_tag *frame,uint8_t ac)

{
  byte bVar1;
  tx_hw_desc *ptVar2;
  _Bool _Var3;
  
  ptVar2 = (frame->txdesc).lmac.hw_desc;
  if (((ptVar2->thd).field_4 & 1) != 0) {
    assert_err("(thd->datastartptr & 0x01) == 0","module",0x1ad);
  }
  (ptVar2->thd).nextfrmexseq_ptr = 0;
  (ptVar2->thd).nextmpdudesc_ptr = 0;
  (ptVar2->thd).macctrlinfo2 = (ptVar2->thd).macctrlinfo2 & 0xff87ffff;
  bVar1 = *(byte *)((ptVar2->thd).field_4 + 4);
  (ptVar2->thd).statinfo = 0;
  (ptVar2->thd).macctrlinfo1 = (uint)((bVar1 & 1) == 0) << 9;
  _Var3 = txl_cntrl_push_int_force((txdesc *)frame,ac);
  return _Var3;
}



void txl_frame_cfm(txdesc *txdesc)

{
  co_list_push_back(&txl_frame_env.desc_done,(co_list_hdr *)txdesc);
  ke_evt_set(0x20000);
  return;
}



void txl_frame_release(txdesc *txdesc,_Bool postponed)

{
  co_list_hdr *UNRECOVERED_JUMPTABLE;
  undefined3 in_register_0000202d;
  
  if (*(char *)&txdesc[1].host.packet_addr == '\0') {
    co_list_push_back((co_list *)&txl_frame_env,(co_list_hdr *)txdesc);
  }
  if ((CONCAT31(in_register_0000202d,postponed) != 0) &&
     (UNRECOVERED_JUMPTABLE = txdesc[1].list_hdr.next, UNRECOVERED_JUMPTABLE != (co_list_hdr *)0x0))
  {
                    // WARNING: Could not recover jumptable at 0x230065c4. Too many branches
                    // WARNING: Treating indirect jump as call
    (*(code *)UNRECOVERED_JUMPTABLE)(txdesc[1].host.pbuf_addr,0);
    return;
  }
  return;
}


