pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'txl_frame_evt'
Cause: Exception while decompiling 230065d0: Decompiler process died

*/


uint8_t txl_frame_send_null_frame(uint8_t sta_idx,cfm_func_ptr *cfm,void *env)

{
  byte bVar1;
  uint8_t uVar2;
  txl_buffer_tag *ptVar3;
  undefined3 in_register_00002029;
  int iVar4;
  txl_frame_desc_tag *frame;
  uint uVar5;
  int iVar6;
  char acStack56 [4];
  phy_channel_info phy_info;
  
  iVar4 = CONCAT31(in_register_00002029,sta_idx);
  bVar1 = sta_info_tab[iVar4].inst_nbr;
  phy_get_channel((phy_channel_info *)acStack56,'\0');
  frame = txl_frame_get((uint)(acStack56[0] != '\0'),0x18);
  if (frame != (txl_frame_desc_tag *)0x0) {
    tpc_update_frame_tx_power(vif_info_tab + bVar1,frame);
    ptVar3 = (frame->txdesc).lmac.buffer;
    *(undefined *)&ptVar3[1].length = 0x48;
    *(undefined *)((int)&ptVar3[1].length + 1) = 1;
    *(undefined *)((int)&ptVar3[1].length + 2) = 0;
    *(undefined *)((int)&ptVar3[1].length + 3) = 0;
    memcpy(&ptVar3[1].lenheader,&sta_info_tab[iVar4].mac_addr,6);
    memcpy((void *)((int)&ptVar3[1].lenpad + 2),&vif_info_tab[bVar1].mac_addr,6);
    memcpy(&ptVar3[1].next,&sta_info_tab[iVar4].mac_addr,6);
    uVar5 = (uint)txl_cntrl_env.seqnbr;
    txl_cntrl_env.seqnbr = (uint16_t)((uVar5 + 1) * 0x10000 >> 0x10);
    iVar6 = (uVar5 + 1) * 0x100000;
    *(undefined *)((int)&ptVar3[1].txdesc + 2) = (char)((uint)iVar6 >> 0x10);
    *(undefined *)((int)&ptVar3[1].txdesc + 3) = (char)((uint)iVar6 >> 0x18);
    (frame->cfm).cfm_func = cfm;
    (frame->cfm).env = env;
    uVar2 = sta_info_tab[iVar4].inst_nbr;
    (frame->txdesc).host.staid = sta_idx;
    (frame->txdesc).host.vif_idx = uVar2;
    txl_frame_push(frame,'\x03');
  }
  return (uint8_t)(frame == (txl_frame_desc_tag *)0x0);
}



// WARNING: Variable defined which should be unmapped: phy_info

uint8_t txl_frame_send_qosnull_frame(uint8_t sta_idx,uint16_t qos,cfm_func_ptr *cfm,void *env)

{
  txl_buffer_tag *ptVar1;
  uint8_t uVar2;
  undefined3 in_register_00002029;
  int iVar3;
  txl_frame_desc_tag *frame;
  mac_addr *__src;
  uint uVar4;
  char acStack56 [4];
  phy_channel_info phy_info;
  
  iVar3 = CONCAT31(in_register_00002029,sta_idx);
  uVar4 = (uint)sta_info_tab[iVar3].inst_nbr;
  phy_get_channel((phy_channel_info *)acStack56,'\0');
  frame = txl_frame_get((uint)(acStack56[0] != '\0'),0x1a);
  if (frame == (txl_frame_desc_tag *)0x0) {
    uVar2 = '\x01';
  }
  else {
    tpc_update_frame_tx_power(vif_info_tab + uVar4,frame);
    ptVar1 = (frame->txdesc).lmac.buffer;
    *(undefined *)&ptVar1[1].length = 200;
    *(undefined *)((int)&ptVar1[1].length + 1) = 0;
    *(undefined *)((int)&ptVar1[1].length + 2) = 0;
    *(undefined *)((int)&ptVar1[1].length + 3) = 0;
    memcpy(&ptVar1[1].lenheader,&sta_info_tab[iVar3].mac_addr,6);
    __src = &vif_info_tab[uVar4].mac_addr;
    memcpy((void *)((int)&ptVar1[1].lenpad + 2),__src,6);
    uVar2 = vif_info_tab[uVar4].type;
    *(undefined *)&ptVar1[1].length = 200;
    if (uVar2 == '\0') {
      *(undefined *)((int)&ptVar1[1].length + 1) = 1;
      __src = &sta_info_tab[iVar3].mac_addr;
    }
    else {
      *(undefined *)((int)&ptVar1[1].length + 1) = 2;
    }
    memcpy(&ptVar1[1].next,__src,6);
    *(char *)&ptVar1[1].dma_desc[0].src = (char)qos;
    *(undefined *)((int)&ptVar1[1].txdesc + 2) = 0;
    *(undefined *)((int)&ptVar1[1].txdesc + 3) = 0;
    *(undefined *)((int)&ptVar1[1].dma_desc[0].src + 1) = (char)(qos >> 8);
    (frame->cfm).cfm_func = cfm;
    (frame->cfm).env = env;
    uVar2 = sta_info_tab[iVar3].inst_nbr;
    (frame->txdesc).host.staid = sta_idx;
    (frame->txdesc).host.vif_idx = uVar2;
    txl_frame_push(frame,'\x03');
    uVar2 = '\0';
  }
  return uVar2;
}



uint8_t txl_frame_send_eapol_frame
                  (uint8_t sta_idx,cfm_func_ptr *cfm,void *cfm_env,uint8_t *pBuf,uint32_t pBuf_len)

{
  byte bVar1;
  uint8_t uVar2;
  ushort uVar3;
  undefined2 uVar4;
  txl_buffer_tag *ptVar5;
  undefined3 in_register_00002029;
  txl_frame_desc_tag *frame;
  key_info_tag *pkVar6;
  uint32_t uVar7;
  undefined *puVar8;
  int iVar9;
  tx_hw_desc *ptVar10;
  uint16_t uVar11;
  uint uVar12;
  dma_desc *pdVar13;
  uint uVar14;
  dma_desc *unaff_s8;
  mac_addr *pmVar15;
  mac_addr *pmVar16;
  uint uVar17;
  int iVar18;
  char acStack88 [4];
  phy_channel_info phy_info;
  mic_calc mic;
  
  iVar18 = CONCAT31(in_register_00002029,sta_idx);
  bVar1 = sta_info_tab[iVar18].inst_nbr;
  uVar17 = (uint)bVar1;
  phy_get_channel((phy_channel_info *)acStack88,'\0');
  frame = txl_frame_get((uint)(acStack88[0] != '\0'),0x100);
  if (frame == (txl_frame_desc_tag *)0x0) {
    return '\0';
  }
  (frame->txdesc).host.vif_idx = bVar1;
  (frame->txdesc).host.staid = sta_idx;
  (frame->txdesc).host.tid = '\0';
  uVar3 = sta_info_tab[iVar18].seq_nbr[0];
  sta_info_tab[iVar18].seq_nbr[0] = (ushort)(((uint)uVar3 + 1) * 0x100000 >> 0x14);
  (frame->txdesc).host.ethertype = 0x8e88;
  (frame->txdesc).host.sn = uVar3;
  pmVar15 = &sta_info_tab[iVar18].mac_addr;
  (frame->txdesc).host.eth_dest_addr.array[0] = pmVar15->array[0];
  (frame->txdesc).host.eth_dest_addr.array[1] = sta_info_tab[iVar18].mac_addr.array[1];
  (frame->txdesc).host.eth_dest_addr.array[2] = sta_info_tab[iVar18].mac_addr.array[2];
  pmVar16 = &vif_info_tab[uVar17].mac_addr;
  (frame->txdesc).host.eth_src_addr.array[0] = pmVar16->array[0];
  (frame->txdesc).host.eth_src_addr.array[1] = vif_info_tab[uVar17].mac_addr.array[1];
  (frame->txdesc).host.eth_src_addr.array[2] = vif_info_tab[uVar17].mac_addr.array[2];
  tpc_update_frame_tx_power(vif_info_tab + uVar17,frame);
  ptVar5 = (frame->txdesc).lmac.buffer;
  if ((vif_info_tab[uVar17].bss_info.valid_flags & 1) == 0) {
    *(undefined *)&ptVar5[1].length = 8;
    uVar14 = (uint)txl_cntrl_env.seqnbr;
    *(undefined *)((int)&ptVar5[1].length + 1) = 0;
    pdVar13 = ptVar5[1].dma_desc;
    txl_cntrl_env.seqnbr = (uint16_t)((uVar14 + 1) * 0x10000 >> 0x10);
    iVar9 = (uVar14 + 1) * 0x100000;
    *(undefined *)((int)&ptVar5[1].txdesc + 2) = (char)((uint)iVar9 >> 0x10);
    *(undefined *)((int)&ptVar5[1].txdesc + 3) = (char)((uint)iVar9 >> 0x18);
    uVar14 = pBuf_len + 0x20;
  }
  else {
    *(undefined *)&ptVar5[1].length = 0x88;
    *(undefined *)((int)&ptVar5[1].length + 1) = 0;
    pdVar13 = (dma_desc *)((int)&ptVar5[1].dma_desc[0].src + 2);
    uVar14 = pBuf_len + 0x22;
    iVar9 = (uint)(frame->txdesc).host.sn << 0x14;
    *(undefined *)((int)&ptVar5[1].txdesc + 2) = (char)((uint)iVar9 >> 0x10);
    *(undefined *)((int)&ptVar5[1].txdesc + 3) = (char)((uint)iVar9 >> 0x18);
    uVar2 = (frame->txdesc).host.tid;
    *(undefined *)((int)&ptVar5[1].dma_desc[0].src + 1) = 0;
    *(uint8_t *)&ptVar5[1].dma_desc[0].src = uVar2;
  }
  if (0x100 < uVar14) {
    assert_err("length<=NX_TXFRAME_LEN","module",0x591);
  }
  uVar4 = *(undefined2 *)&ptVar5[1].length;
  bVar1 = 1;
  if (vif_info_tab[uVar17].type == '\x02') {
    bVar1 = 2;
  }
  *(char *)&ptVar5[1].length = (char)uVar4;
  *(byte *)((int)&ptVar5[1].length + 1) = (byte)((ushort)uVar4 >> 8) | bVar1;
  *(undefined *)((int)&ptVar5[1].length + 2) = 0;
  *(undefined *)((int)&ptVar5[1].length + 3) = 0;
  *(uint16_t *)&ptVar5[1].lenheader = pmVar15->array[0];
  *(uint16_t *)((int)&ptVar5[1].lenheader + 2) = sta_info_tab[iVar18].mac_addr.array[1];
  *(uint16_t *)&ptVar5[1].lenpad = sta_info_tab[iVar18].mac_addr.array[2];
  *(uint16_t *)((int)&ptVar5[1].lenpad + 2) = pmVar16->array[0];
  *(uint16_t *)&ptVar5[1].flags = vif_info_tab[uVar17].mac_addr.array[1];
  *(uint16_t *)((int)&ptVar5[1].flags + 2) = vif_info_tab[uVar17].mac_addr.array[2];
  if (vif_info_tab[uVar17].type == '\x02') {
    *(uint16_t *)&ptVar5[1].next = pmVar16->array[0];
    *(uint16_t *)((int)&ptVar5[1].next + 2) = vif_info_tab[uVar17].mac_addr.array[1];
    uVar11 = vif_info_tab[uVar17].mac_addr.array[2];
  }
  else {
    *(uint16_t *)&ptVar5[1].next = pmVar15->array[0];
    *(uint16_t *)((int)&ptVar5[1].next + 2) = sta_info_tab[iVar18].mac_addr.array[1];
    uVar11 = sta_info_tab[iVar18].mac_addr.array[2];
  }
  *(uint16_t *)&ptVar5[1].txdesc = uVar11;
  iVar18 = 0;
  if ((vif_info_tab[(frame->txdesc).host.vif_idx].type != '\0') ||
     (uVar17 = (uint)(frame->txdesc).host.staid, sta_info_tab[uVar17].ctrl_port_state != '\x02'))
  goto LAB_23006b64;
  pkVar6 = *sta_info_tab[uVar17].sta_sec_info.cur_key;
  uVar2 = pkVar6->cipher;
  if (uVar2 == '\x01') {
    uVar17 = *(uint *)&pkVar6->tx_pn + 1;
    *(int *)((int)&pkVar6->tx_pn + 4) =
         (uint)(uVar17 < *(uint *)&pkVar6->tx_pn) + *(int *)((int)&pkVar6->tx_pn + 4);
    *(uint *)&pkVar6->tx_pn = uVar17;
    memcpy((frame->txdesc).host.pn,&pkVar6->tx_pn,6);
    iVar9 = 0xc;
LAB_23006cbc:
    iVar18 = 8;
  }
  else {
    if (uVar2 == '\0') {
LAB_23006a9e:
      uVar17 = *(uint *)&pkVar6->tx_pn + 1;
      *(int *)((int)&pkVar6->tx_pn + 4) =
           (uint)(uVar17 < *(uint *)&pkVar6->tx_pn) + *(int *)((int)&pkVar6->tx_pn + 4);
      *(uint *)&pkVar6->tx_pn = uVar17;
      memcpy((frame->txdesc).host.pn,&pkVar6->tx_pn,4);
      iVar9 = 4;
      iVar18 = 4;
    }
    else {
      if (uVar2 == '\x02') {
        uVar17 = *(uint *)&pkVar6->tx_pn + 1;
        *(int *)((int)&pkVar6->tx_pn + 4) =
             (uint)(uVar17 < *(uint *)&pkVar6->tx_pn) + *(int *)((int)&pkVar6->tx_pn + 4);
        *(uint *)&pkVar6->tx_pn = uVar17;
        memcpy((frame->txdesc).host.pn,&pkVar6->tx_pn,6);
        iVar9 = 8;
        goto LAB_23006cbc;
      }
      if (uVar2 == '\x03') goto LAB_23006a9e;
      iVar9 = 0;
      iVar18 = 0;
    }
  }
  iVar18 = iVar18 + iVar9;
  if (iVar18 == 0) goto LAB_23006b64;
  uVar3 = *(ushort *)&ptVar5[1].length;
  uVar14 = uVar14 + iVar18;
  *(char *)&ptVar5[1].length = (char)uVar3;
  *(byte *)((int)&ptVar5[1].length + 1) = (byte)((uint)uVar3 >> 8) | 0x40;
  uVar17 = (uint)vif_info_tab[(frame->txdesc).host.vif_idx].type;
  if (vif_info_tab[(frame->txdesc).host.vif_idx].type == 0) {
    uVar12 = (uint)(frame->txdesc).host.staid;
    if (sta_info_tab[uVar12].ctrl_port_state == '\x02') {
      pkVar6 = *sta_info_tab[uVar12].sta_sec_info.cur_key;
      uVar7 = (((frame->txdesc).lmac.hw_desc)->thd).policyentryaddr;
      uVar2 = pkVar6->cipher;
      if (uVar2 == '\x01') {
        uVar3 = (frame->txdesc).host.pn[0];
        *(ushort *)&pdVar13->src = uVar3 & 0x7f00 | 0x2000 | uVar3 >> 8;
        uVar3 = (ushort)*(byte *)(frame->txdesc).host.pn | (ushort)pkVar6->key_idx << 0xe;
LAB_23006d14:
        *(ushort *)((int)&pdVar13->src + 2) = uVar3 | 0x2000;
        uVar17 = 8;
        *(uint16_t *)&pdVar13->dest = (frame->txdesc).host.pn[1];
        *(uint16_t *)((int)&pdVar13->dest + 2) = (frame->txdesc).host.pn[2];
      }
      else {
        if (uVar2 == '\0') {
LAB_23006b32:
          *(uint16_t *)&pdVar13->src = (frame->txdesc).host.pn[0];
          *(ushort *)((int)&pdVar13->src + 2) =
               (ushort)pkVar6->key_idx << 0xe | (frame->txdesc).host.pn[1];
          uVar17 = 4;
        }
        else {
          if (uVar2 == '\x02') {
            *(uint16_t *)&pdVar13->src = (frame->txdesc).host.pn[0];
            uVar3 = (ushort)pkVar6->key_idx << 0xe;
            goto LAB_23006d14;
          }
          if (uVar2 == '\x03') goto LAB_23006b32;
        }
      }
      *(uint *)(uVar7 + 0xc) = *(uint *)(uVar7 + 0xc) & 0xffc00 | (uint)pkVar6->hw_key_idx;
    }
  }
  else {
    uVar17 = 0;
  }
  pdVar13 = (dma_desc *)((int)&pdVar13->src + uVar17);
  unaff_s8 = pdVar13;
LAB_23006b64:
  *(undefined2 *)&pdVar13->src = 0xaaaa;
  *(undefined2 *)((int)&pdVar13->src + 2) = 3;
  *(undefined2 *)&pdVar13->dest = 0;
  *(uint16_t *)((int)&pdVar13->dest + 2) = (frame->txdesc).host.ethertype;
  memcpy(&pdVar13->length,pBuf,pBuf_len);
  if ((iVar18 != 0) &&
     (pkVar6 = *sta_info_tab[(frame->txdesc).host.staid].sta_sec_info.cur_key,
     pkVar6->cipher == '\x01')) {
    me_mic_init((mic_calc *)&phy_info.info2,(uint32_t *)pkVar6->u,
                &(frame->txdesc).host.eth_dest_addr,&(frame->txdesc).host.eth_src_addr,
                (frame->txdesc).host.tid);
    me_mic_calc((mic_calc *)&phy_info.info2,(uint32_t)unaff_s8,pBuf_len + 8);
    me_mic_end((mic_calc *)&phy_info.info2);
    iVar18 = 0;
    do {
      puVar8 = (undefined *)((int)&phy_info.info2 + iVar18);
      iVar9 = iVar18 + pBuf_len + 8;
      iVar18 = iVar18 + 1;
      *(undefined *)((int)&unaff_s8->length + iVar9 + -8) = *puVar8;
    } while (iVar18 != 8);
  }
  ptVar10 = (frame->txdesc).lmac.hw_desc;
  (ptVar10->thd).field_5 = (ptVar10->thd).field_4 + -1 + uVar14;
  (ptVar10->thd).frmlen = uVar14 + 4;
  if (cfm != (cfm_func_ptr *)0x0) {
    (frame->cfm).cfm_func = cfm;
    (frame->cfm).env = cfm_env;
  }
  txl_frame_push(frame,"\x01"[(frame->txdesc).host.tid]);
  return '\0';
}



void txl_frame_dump(void)

{
  uint32_t uVar1;
  co_list_hdr cVar2;
  co_list_hdr cVar3;
  
  uVar1 = co_list_cnt((co_list *)&txl_frame_env);
  cVar2 = (co_list_hdr)txl_frame_env.desc_free.first;
  if (uVar1 != 0) {
    while (cVar3 = (co_list_hdr)txl_frame_env.desc_done.first, cVar2 != (co_list_hdr)0x0) {
      cVar2 = *(co_list_hdr *)cVar2;
    }
    while (cVar3 != (co_list_hdr)0x0) {
      cVar3 = *(co_list_hdr *)cVar3;
    }
  }
  return;
}



void txl_hwdesc_init(void)

{
  return;
}



void txl_hwdesc_reset(void)

{
  return;
}



void vif_mgmt_bcn_to_evt(void *env)

{
  if (*(int *)((int)env + 0x40) != 0) {
    chan_bcn_to_evt((vif_info_tag *)env);
    return;
  }
  return;
}



void vif_mgmt_init(void)

{
  memset(&vif_mgmt_env,0,0x14);
  co_list_init((co_list *)&vif_mgmt_env);
  co_list_init(&vif_mgmt_env.used_list);
  memset(vif_info_tab,0,0x5d8);
  vif_info_tab[0].type = '\x04';
  vif_info_tab[0].tx_power = '\x7f';
  vif_info_tab[0].user_tx_power = '\x7f';
  vif_info_tab[0].tmr_bcn_to.cb = vif_mgmt_bcn_to_evt;
  vif_info_tab[0].tmr_bcn_to.env = vif_info_tab;
  co_list_push_back((co_list *)&vif_mgmt_env,(co_list_hdr *)vif_info_tab);
  memset(vif_info_tab + 1,0,0x5d8);
  vif_info_tab[1].type = '\x04';
  vif_info_tab[1].tx_power = '\x7f';
  vif_info_tab[1].user_tx_power = '\x7f';
  vif_info_tab[1].tmr_bcn_to.cb = vif_mgmt_bcn_to_evt;
  vif_info_tab[1].tmr_bcn_to.env = vif_info_tab + 1;
  co_list_push_back((co_list *)&vif_mgmt_env,(co_list_hdr *)(vif_info_tab + 1));
  return;
}



