pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t vif_mgmt_register(mac_addr *mac_addr,uint8_t vif_type,_Bool p2p,uint8_t *vif_idx)

{
  uint8_t uVar1;
  vif_info_tag *vif_entry;
  undefined3 in_register_0000202d;
  
  if (vif_mgmt_env.free_list.first == (co_list_hdr *)0x0) {
    uVar1 = '\x01';
  }
  else {
    if (vif_mgmt_env.used_list.first == (co_list_hdr *)0x0) {
      mm_hw_info_set(mac_addr);
    }
    else {
      if (*(int *)mac_addr->array != _DAT_44b00010) {
        return '\x01';
      }
      if (((mac_addr->array[2] ^ _DAT_44b00014) & ~_DAT_44b0001c) != 0) {
        return '\x01';
      }
      mm_env.rx_filter_lmac_enable = mm_env.rx_filter_lmac_enable | 0x10;
      _DAT_44b00060 = mm_env.rx_filter_lmac_enable | mm_env.rx_filter_umac;
    }
    vif_entry = (vif_info_tag *)co_list_pop_front((co_list *)&vif_mgmt_env);
    vif_entry->type = vif_type;
    memcpy(&vif_entry->mac_addr,mac_addr,6);
    uVar1 = (char)((int)&vif_entry[-0xb4b94].key_info[1].tx_pn >> 3) * 's';
    vif_entry->txq_params[1] = 0xa43;
    vif_entry->txq_params[2] = 0x5e432;
    vif_entry->index = uVar1;
    vif_entry->txq_params[0] = 0xa47;
    vif_entry->txq_params[3] = 0x2f322;
    vif_entry->chan_ctxt = (chan_ctxt_tag *)0x0;
    (vif_entry->tbtt_switch).vif_index = uVar1;
    if (CONCAT31(in_register_0000202d,vif_type) == 0) {
      *(vif_info_tag **)&(vif_entry->tbtt_timer).env = vif_entry;
      vif_entry->u[0x1d] = 0;
      vif_mgmt_env.vif_sta_cnt = vif_mgmt_env.vif_sta_cnt + '\x01';
      (vif_entry->tbtt_timer).cb = mm_sta_tbtt;
      vif_entry->u[4] = 0xff;
      vif_entry->u[0x1e] = 0;
    }
    else {
      if (CONCAT31(in_register_0000202d,vif_type) == 2) {
        if (vif_mgmt_env.vif_ap_cnt == '\0') {
          mm_hw_ap_info_set();
        }
        vif_mgmt_env.vif_ap_cnt = vif_mgmt_env.vif_ap_cnt + '\x01';
        mm_bcn_init_vif(vif_entry);
      }
    }
    td_start(vif_entry->index);
    *vif_idx = vif_entry->index;
    co_list_push_back(&vif_mgmt_env.used_list,(co_list_hdr *)vif_entry);
    uVar1 = '\0';
  }
  return uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void vif_mgmt_unregister(uint8_t vif_idx)

{
  vif_info_tag *__s;
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,vif_idx);
  __s = vif_info_tab + iVar1;
  co_list_extract(&vif_mgmt_env.used_list,(co_list_hdr *)__s);
  if (vif_info_tab[iVar1].type == '\0') {
    vif_mgmt_env.vif_sta_cnt = vif_mgmt_env.vif_sta_cnt + -1;
  }
  else {
    if (vif_info_tab[iVar1].type == '\x02') {
      vif_mgmt_env.vif_ap_cnt = vif_mgmt_env.vif_ap_cnt + -1;
      if (vif_mgmt_env.vif_ap_cnt == '\0') {
        mm_hw_ap_info_reset();
      }
    }
  }
  if ((uint)vif_mgmt_env.vif_ap_cnt + (uint)vif_mgmt_env.vif_sta_cnt == 1) {
    mm_env.rx_filter_lmac_enable = mm_env.rx_filter_lmac_enable & 0xffffffef;
    _DAT_44b00060 = mm_env.rx_filter_lmac_enable | mm_env.rx_filter_umac;
    _DAT_44b00020 = vif_mgmt_env.used_list.first[0xe].next;
    _DAT_44b00024 = (uint)*(ushort *)&vif_mgmt_env.used_list.first[0xf].next;
  }
  if (vif_info_tab[iVar1].type == '\x02') {
    txl_cntrl_clear_bcn_ac();
  }
  mm_timer_clear(&vif_info_tab[iVar1].tbtt_timer);
  mm_timer_clear(&vif_info_tab[iVar1].tmr_bcn_to);
  td_reset(vif_info_tab[iVar1].index);
  memset(__s,0,0x5d8);
  vif_info_tab[iVar1].type = '\x04';
  vif_info_tab[iVar1].tx_power = '\x7f';
  vif_info_tab[iVar1].user_tx_power = '\x7f';
  vif_info_tab[iVar1].tmr_bcn_to.cb = vif_mgmt_bcn_to_evt;
  *(vif_info_tag **)&vif_info_tab[iVar1].tmr_bcn_to.env = __s;
  co_list_push_back((co_list *)&vif_mgmt_env,(co_list_hdr *)__s);
  return;
}



void vif_mgmt_add_key(mm_key_add_req *param,uint8_t hw_key_idx)

{
  uint8_t uVar1;
  uint uVar2;
  uint uVar3;
  
  uVar3 = (uint)param->inst_nbr;
  uVar2 = (uint)param->key_idx;
  vif_info_tab[uVar3].key_info[uVar2].hw_key_idx = hw_key_idx;
  vif_info_tab[uVar3].key_info[uVar2].cipher = param->cipher_suite;
  vif_info_tab[uVar3].key_info[uVar2].key_idx = param->key_idx;
  memset(vif_info_tab[uVar3].key_info + uVar2,0,0x48);
  uVar1 = vif_info_tab[uVar3].key_info[uVar2].cipher;
  if (uVar1 == '\x01') {
    *(undefined4 *)&vif_info_tab[uVar3].key_info[uVar2].tx_pn = 0;
    *(undefined4 *)((int)&vif_info_tab[uVar3].key_info[uVar2].tx_pn + 4) = 0;
    *(uint32_t *)vif_info_tab[uVar3].key_info[uVar2].u = (param->key).array[4];
    *(uint32_t *)(vif_info_tab[uVar3].key_info[uVar2].u + 4) = (param->key).array[5];
    *(uint32_t *)(vif_info_tab[uVar3].key_info[uVar2].u + 8) = (param->key).array[6];
    *(uint32_t *)(vif_info_tab[uVar3].key_info[uVar2].u + 0xc) = (param->key).array[7];
  }
  else {
    if ((uVar1 == '\0') || (uVar1 == '\x03')) {
      next = next * 0x41c64e6d + 0x3039;
      *(ulong *)&vif_info_tab[uVar3].key_info[uVar2].tx_pn = next >> 0x10;
      *(undefined4 *)((int)&vif_info_tab[uVar3].key_info[uVar2].tx_pn + 4) = 0;
    }
    else {
      *(undefined4 *)&vif_info_tab[uVar3].key_info[uVar2].tx_pn = 0;
      *(undefined4 *)((int)&vif_info_tab[uVar3].key_info[uVar2].tx_pn + 4) = 0;
    }
  }
  vif_info_tab[uVar3].key_info[uVar2].valid = true;
  vif_info_tab[uVar3].default_key = vif_info_tab[uVar3].key_info + uVar2;
  return;
}



void vif_mgmt_del_key(vif_info_tag *vif,uint8_t keyid)

{
  undefined3 in_register_0000202d;
  _Bool *p_Var1;
  int iVar2;
  
  vif->key_info[CONCAT31(in_register_0000202d,keyid)].valid = false;
  if (vif->default_key == vif->key_info + CONCAT31(in_register_0000202d,keyid)) {
    vif->default_key = (key_info_tag *)0x0;
    p_Var1 = &vif->key_info[0].valid;
    iVar2 = 0;
    do {
      if (*p_Var1 != false) {
        vif->default_key = vif->key_info + iVar2;
        return;
      }
      iVar2 = iVar2 + 1;
      p_Var1 = p_Var1 + 0x68;
    } while (iVar2 != 4);
  }
  return;
}



// WARNING: Type propagation algorithm not settling

void vif_mgmt_send_postponed_frame(vif_info_tag *p_vif_entry)

{
  sta_info_tag *p_sta_entry;
  
  p_sta_entry = (sta_info_tag *)(p_vif_entry->sta_list).first;
  while (p_sta_entry != (sta_info_tag *)0x0) {
    sta_mgmt_send_postponed_frame(p_vif_entry,p_sta_entry,0);
    p_sta_entry = *(sta_info_tag **)&p_sta_entry->list_hdr;
  }
  return;
}



// WARNING: Type propagation algorithm not settling

void vif_mgmt_reset(void)

{
  vif_info_tag *p_vif_entry;
  
  p_vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first;
  while (p_vif_entry != (vif_info_tag *)0x0) {
    vif_mgmt_send_postponed_frame(p_vif_entry);
    p_vif_entry = *(vif_info_tag **)&p_vif_entry->list_hdr;
  }
  return;
}



