pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void vif_mgmt_bcn_to_prog(vif_info_tag *p_vif_entry)

{
  mm_timer_set(&p_vif_entry->tmr_bcn_to,_DAT_44b00120 + 10000);
  return;
}



void vif_mgmt_bcn_recv(vif_info_tag *p_vif_entry)

{
  if (((ps_env.ps_on != false) && ((ps_env.prevent_sleep & 8) == 0)) &&
     (p_vif_entry->prevent_sleep == 0)) {
    mm_timer_clear(&p_vif_entry->tmr_bcn_to);
    vif_mgmt_bcn_to_evt(p_vif_entry);
    return;
  }
  return;
}


/*
Unable to decompile 'vif_mgmt_set_ap_bcn_int'
Cause: Exception while decompiling 230072dc: Decompiler process died

*/


// WARNING: Variable defined which should be unmapped: chan_idx
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void vif_mgmt_switch_channel(vif_info_tag *p_vif_entry)

{
  byte bVar1;
  uint16_t freq;
  uint8_t uVar2;
  void *pvVar3;
  scan_chan_tag *psVar4;
  undefined3 extraout_var;
  uint8_t chan_idx_00;
  uint8_t local_11 [4];
  uint8_t chan_idx;
  
  pvVar3 = ke_msg_alloc(0x58,0xd,0,3);
  local_11[0] = -1;
  chan_ctxt_unlink(p_vif_entry->index);
  freq = (p_vif_entry->csa_channel).prim20_freq;
  chan_idx_00 = (uint8_t)freq;
  psVar4 = me_freq_to_chan_ptr((p_vif_entry->csa_channel).band,freq);
  freq = (p_vif_entry->csa_channel).center1_freq;
  (p_vif_entry->bss_info).chan = psVar4;
  (p_vif_entry->bss_info).center_freq1 = freq;
  (p_vif_entry->bss_info).center_freq2 = (p_vif_entry->csa_channel).center2_freq;
  uVar2 = (p_vif_entry->csa_channel).type;
  (p_vif_entry->bss_info).phy_bw = uVar2;
  if (uVar2 == '\x04') {
    uVar2 = '\x03';
  }
  (p_vif_entry->bss_info).bw = uVar2;
  if (psVar4 == (scan_chan_tag *)0x0) {
    ebreak();
  }
  else {
    (p_vif_entry->csa_channel).tx_power = psVar4->tx_power;
    uVar2 = chan_ctxt_add(&p_vif_entry->csa_channel,local_11);
    psVar4 = (scan_chan_tag *)CONCAT31(extraout_var,uVar2);
    *(uint8_t *)((int)pvVar3 + 1) = uVar2;
    *(uint8_t *)((int)pvVar3 + 2) = local_11[0];
    chan_idx_00 = local_11[0];
    if (p_vif_entry->type != '\0') {
      if ((p_vif_entry->type == '\x02') &&
         (p_vif_entry->u[0x2eb] = 0, psVar4 == (scan_chan_tag *)0x0)) {
        chan_ctxt_link(p_vif_entry->index,local_11[0]);
        mm_bcn_env.update_ongoing = true;
      }
      goto LAB_2300745a;
    }
  }
  p_vif_entry->u[0x1d] = 0;
  if (psVar4 == (scan_chan_tag *)0x0) {
    bVar1 = p_vif_entry->u[4];
    chan_ctxt_link(p_vif_entry->index,chan_idx_00);
    mm_timer_clear(&p_vif_entry->tmr_bcn_to);
    mm_timer_set(&p_vif_entry->tbtt_timer,_DAT_44b00120 + sta_info_tab[bVar1].bcn_int);
    p_vif_entry->u[0x18] = 0;
    p_vif_entry->u[0x1e] = 1;
  }
  else {
    mm_send_connection_loss_ind(p_vif_entry);
  }
LAB_2300745a:
  ke_msg_send(pvVar3);
  return;
}



vif_info_tag * vif_mgmt_get_first_ap_inf(void)

{
  co_list_hdr cVar1;
  co_list_hdr cVar2;
  
  cVar1 = (co_list_hdr)vif_mgmt_env.used_list.first;
  cVar2 = (co_list_hdr)0x0;
  if (vif_mgmt_env.vif_ap_cnt != '\0') {
    while ((cVar2 = cVar1, cVar1 != (co_list_hdr)0x0 && (*(char *)((int)cVar1 + 0x56) != '\x02'))) {
      cVar1 = *(co_list_hdr *)cVar1;
    }
  }
  return (vif_info_tag *)cVar2;
}



void me_init(void)

{
  memset(&me_env,0,0x134);
  ke_state_set(5,0);
  scanu_init();
  apm_init();
  sm_init();
  bam_init();
  return;
}



scan_chan_tag * me_freq_to_chan_ptr(uint8_t band,uint16_t freq)

{
  int iVar1;
  byte bVar2;
  ushort *puVar3;
  undefined3 in_register_00002029;
  scan_chan_tag *psVar4;
  undefined2 in_register_0000202e;
  scan_chan_tag *psVar5;
  scan_chan_tag *psVar6;
  
  if (CONCAT31(in_register_00002029,band) == 0) {
    iVar1 = 4;
    bVar2 = me_env.chan.chan2G4_cnt;
  }
  else {
    iVar1 = 0x58;
    bVar2 = me_env.chan.chan5G_cnt;
  }
  psVar5 = (scan_chan_tag *)((int)&me_env.tx_lft + iVar1);
  psVar6 = psVar5;
  do {
    if (psVar6 == psVar5 + bVar2) {
      return (scan_chan_tag *)0x0;
    }
    psVar4 = psVar6;
    puVar3 = &psVar6->freq;
    psVar6 = psVar6 + 1;
  } while ((uint)*puVar3 != CONCAT22(in_register_0000202e,freq));
  return psVar4;
}



void michael_block(mic_calc *mic_calc_ptr,uint32_t block)

{
  uint uVar1;
  uint uVar2;
  
  uVar1 = block ^ mic_calc_ptr->mic_key_least;
  uVar2 = mic_calc_ptr->mic_key_most ^ (uVar1 >> 0xf | uVar1 << 0x11);
  uVar1 = uVar1 + uVar2;
  uVar2 = (uVar1 >> 8 & 0xff00ff | uVar1 * 0x100 & 0xff00ff00) ^ uVar2;
  uVar1 = uVar1 + uVar2;
  uVar2 = (uVar1 * 8 | uVar1 >> 0x1d) ^ uVar2;
  uVar1 = uVar1 + uVar2;
  uVar2 = (uVar1 >> 2 | uVar1 * 0x40000000) ^ uVar2;
  mic_calc_ptr->mic_key_most = uVar2;
  mic_calc_ptr->mic_key_least = uVar1 + uVar2;
  return;
}



void me_mic_init(mic_calc *mic_calc_ptr,uint32_t *mic_key_ptr,mac_addr *da,mac_addr *sa,uint8_t tid)

{
  uint32_t block;
  uint16_t uVar1;
  uint16_t uVar2;
  uint32_t block_00;
  undefined3 in_register_00002039;
  uint32_t uVar3;
  uint32_t block_01;
  
  block = *(uint32_t *)da->array;
  block_01 = (uint)tid & 7;
  uVar1 = sa->array[0];
  uVar2 = da->array[2];
  block_00 = *(uint32_t *)(sa->array + 1);
  if (CONCAT31(in_register_00002039,tid) == 0xff) {
    block_01 = 0;
  }
  mic_calc_ptr->mic_key_least = *mic_key_ptr;
  uVar3 = mic_key_ptr[1];
  mic_calc_ptr->last_m_i = 0;
  mic_calc_ptr->mic_key_most = uVar3;
  mic_calc_ptr->last_m_i_len = '\0';
  michael_block(mic_calc_ptr,block);
  michael_block(mic_calc_ptr,CONCAT22(uVar1,uVar2));
  michael_block(mic_calc_ptr,block_00);
  michael_block(mic_calc_ptr,block_01);
  return;
}



void me_mic_calc(mic_calc *mic_calc_ptr,uint32_t start_ptr,uint32_t data_len)

{
  uint8_t uVar1;
  uint block;
  uint block_00;
  uint uVar2;
  uint uVar3;
  uint *puVar4;
  uint uVar5;
  uint uVar6;
  uint *puVar7;
  uint uVar8;
  
  puVar7 = (uint *)(start_ptr & 0xfffffffc) + 1;
  block = 4 - (start_ptr & 3) & 0xff;
  uVar3 = (uint)mic_calc_ptr->last_m_i_len;
  uVar2 = *(uint *)(start_ptr & 0xfffffffc) >> ((start_ptr & 3) << 3);
  uVar8 = data_len - block;
  if (data_len < block) {
    uVar2 = uVar2 & 0xffffffffU >> ((4 - data_len) * 8 & 0x1f);
    block = data_len & 0xff;
    uVar8 = 0;
  }
  block = block + uVar3;
  block_00 = uVar2 << ((uVar3 & 3) << 3) | mic_calc_ptr->last_m_i;
  uVar6 = block_00;
  if (3 < block) {
    uVar3 = (4 - uVar3) * 8;
    uVar6 = 0;
    if (uVar3 != 0x20) {
      uVar6 = uVar2 >> (uVar3 & 0x1f);
    }
    block = block - 4;
    michael_block(mic_calc_ptr,block_00);
  }
  uVar1 = (uint8_t)block;
  uVar2 = (4 - block) * 8;
  uVar3 = 0;
  puVar4 = puVar7;
  while (uVar8 >> 2 != uVar3) {
    uVar5 = *puVar4;
    puVar4 = puVar4 + 1;
    block_00 = uVar5 << (block << 3 & 0x1f) | uVar6;
    uVar6 = 0;
    if (uVar2 != 0x20) {
      uVar6 = uVar5 >> (uVar2 & 0x1f);
    }
    michael_block(mic_calc_ptr,block_00);
    uVar3 = uVar3 + 1;
  }
  if ((uVar8 & 0xfffffffc) < uVar8) {
    block_00 = (4 - (uVar8 & 3)) * 8;
    uVar3 = 0;
    if (block_00 != 0x20) {
      uVar3 = 0xffffffff >> (block_00 & 0x1f);
    }
    uVar3 = *(uint *)((int)puVar7 + (uVar8 & 0xfffffffc)) & uVar3;
    uVar8 = block + (uVar8 & 3);
    uVar1 = (uint8_t)uVar8;
    block = uVar6 | uVar3 << (block << 3 & 0x1f);
    uVar6 = block;
    if (3 < uVar8) {
      uVar6 = 0;
      if (uVar2 != 0x20) {
        uVar6 = uVar3 >> (uVar2 & 0x1f);
      }
      uVar1 = uVar1 + -4;
      michael_block(mic_calc_ptr,block);
    }
  }
  mic_calc_ptr->last_m_i_len = uVar1;
  mic_calc_ptr->last_m_i = uVar6;
  return;
}



void me_mic_end(mic_calc *mic_calc_ptr)

{
  uint uVar1;
  
  uVar1 = mic_calc_ptr->last_m_i;
  if (3 < mic_calc_ptr->last_m_i_len) {
    assert_err("mic_calc_ptr->last_m_i_len < 4","module",0x13e);
  }
  michael_block(mic_calc_ptr,0x5a << (((uint)mic_calc_ptr->last_m_i_len & 3) << 3) | uVar1);
  michael_block(mic_calc_ptr,0);
  return;
}



_Bool me_set_sta_ht_vht_param(sta_info_tag *sta,mac_bss_info *bss)

{
  ushort uVar1;
  uint uVar2;
  uint uVar3;
  uint8_t uVar4;
  uint uVar5;
  
