pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar1 = (sta->info).ht_cap.ht_capa_info;
  uVar3 = (uint)(uVar1 >> 1) & 1;
  uVar2 = (int)(uint)uVar1 >> 8 & 3;
  if ((uint)me_env.phy_bw_max < uVar3) {
    uVar3 = (uint)me_env.phy_bw_max;
  }
  (sta->info).phy_bw_max = (uint8_t)uVar3;
  uVar5 = (uint)bss->phy_bw;
  if (bss->phy_bw == 4) {
    uVar5 = 2;
  }
  uVar4 = (uint8_t)uVar5;
  if (uVar3 < uVar5) {
    uVar4 = (uint8_t)uVar3;
  }
  (sta->info).bw_cur = uVar4;
  uVar4 = me_env.stbc_nss;
  if (uVar2 < me_env.stbc_nss) {
    uVar4 = (uint8_t)uVar2;
  }
  (sta->info).stbc_nss = uVar4;
  return (_Bool)(((uint)uVar1 & 0xc) != 0xc);
}



uint8_t me_11n_nss_max(uint8_t *mcs_set)

{
  uint8_t uVar1;
  
  if (mcs_set[3] == '\0') {
    uVar1 = '\x02';
    if ((mcs_set[2] == '\0') && (uVar1 = mcs_set[1], uVar1 != '\0')) {
      uVar1 = '\x01';
    }
  }
  else {
    uVar1 = '\x03';
  }
  return uVar1;
}



uint8_t me_legacy_ridx_min(uint16_t rate_map)

{
  undefined2 in_register_0000202a;
  uint uVar1;
  
  uVar1 = 0;
  do {
    if ((CONCAT22(in_register_0000202a,rate_map) >> (uVar1 & 0x1f) & 1U) != 0) {
      return (uint8_t)uVar1;
    }
    uVar1 = uVar1 + 1;
  } while (uVar1 != 0xc);
  return '\f';
}



uint8_t me_legacy_ridx_max(uint16_t rate_map)

{
  undefined2 in_register_0000202a;
  char cVar1;
  uint uVar2;
  
  if (CONCAT22(in_register_0000202a,rate_map) == 0) {
    return '\f';
  }
  uVar2 = 0xb;
  do {
    cVar1 = '\v' - (char)uVar2;
    if ((CONCAT22(in_register_0000202a,rate_map) >> (uVar2 & 0x1f) & 1U) != 0) goto LAB_23007860;
    uVar2 = uVar2 - 1;
  } while (uVar2 != 0xffffffff);
  cVar1 = '\f';
LAB_23007860:
  return '\v' - cVar1;
}



uint8_t me_rate_translate(uint8_t rate)

{
  uint8_t uVar1;
  byte bVar2;
  byte bVar3;
  
  bVar3 = rate & 0x7f;
  if (bVar3 == 0x16) {
    uVar1 = '\x03';
  }
  else {
    if (bVar3 < 0x17) {
      if (bVar3 == 0xb) {
        return '\x02';
      }
      if (bVar3 < 0xc) {
        if (bVar3 == 2) {
          return '\0';
        }
        bVar2 = 4;
        uVar1 = '\x01';
      }
      else {
        if (bVar3 == 0xc) {
          return '\x04';
        }
        bVar2 = 0x12;
        uVar1 = '\x05';
      }
    }
    else {
      if (bVar3 == 0x30) {
        return '\b';
      }
      if (bVar3 < 0x31) {
        if (bVar3 == 0x18) {
          return '\x06';
        }
        bVar2 = 0x24;
        uVar1 = '\a';
      }
      else {
        if (bVar3 == 0x60) {
          return '\n';
        }
        if (bVar3 == 0x6c) {
          return '\v';
        }
        bVar2 = 0x48;
        uVar1 = '\t';
      }
    }
    if (bVar3 != bVar2) {
      return -1;
    }
  }
  return uVar1;
}



void me_get_basic_rates(mac_rateset *rateset,mac_rateset *basic_ratest)

{
  byte bVar1;
  int iVar2;
  
  basic_ratest->length = '\0';
  iVar2 = 0;
  while (iVar2 < (int)(uint)rateset->length) {
    if ((char)rateset->array[iVar2] < '\0') {
      bVar1 = basic_ratest->length;
      basic_ratest->array[bVar1] = rateset->array[iVar2];
      basic_ratest->length = bVar1 + 1;
    }
    iVar2 = iVar2 + 1;
  }
  return;
}



uint16_t me_legacy_rate_bitfield_build(mac_rateset *rateset,_Bool basic_only)

{
  uint uVar1;
  int iVar2;
  byte bVar3;
  undefined3 extraout_var;
  undefined3 in_register_0000202d;
  
  uVar1 = 0;
  iVar2 = 0;
  while (iVar2 < (int)(uint)rateset->length) {
    if ((CONCAT31(in_register_0000202d,basic_only) == 0) || ((char)rateset->array[iVar2] < '\0')) {
      bVar3 = me_rate_translate(rateset->array[iVar2]);
      if (CONCAT31(extraout_var,bVar3) < 0xc) {
        uVar1 = uVar1 | 1 << ((uint)bVar3 & 0x1f) & 0xffffU;
      }
      else {
        assert_warn("bit_pos < MAC_RATESET_LEN","module",0x1c6);
      }
    }
    iVar2 = iVar2 + 1;
  }
  return (uint16_t)uVar1;
}



uint16_t me_build_capability(uint8_t vif_idx)

{
  ushort uVar1;
  undefined3 in_register_00002029;
  int iVar2;
  ushort uVar3;
  
  iVar2 = CONCAT31(in_register_00002029,vif_idx);
  uVar3 = 0x11;
  if (((vif_info_tab[iVar2].type != '\0') && (uVar3 = 1, vif_info_tab[iVar2].type == '\x02')) &&
     ((*(uint *)&vif_info_tab[iVar2].bss_info.is_supplicant_enabled & 0x12a00) != 0)) {
    uVar3 = 0x11;
  }
  uVar1 = uVar3 | 0x520;
  if ((vif_info_tab[iVar2].bss_info.chan)->band != '\x01') {
    uVar1 = uVar3 | 0x420;
  }
  return (uint16_t)uVar1;
}



void me_init_bcmc_rate(sta_info_tag *sta_entry)

{
  byte bVar1;
  byte rate;
  uint8_t basic_rate_idx;
  int iVar2;
  
  if ((sta_entry->info).rate_set.length == '\0') {
    assert_err("rates->length != 0","module",0x229);
  }
  iVar2 = 0;
  rate = 0;
  while (iVar2 < (int)(uint)(sta_entry->info).rate_set.length) {
    bVar1 = (sta_entry->info).rate_set.array[iVar2];
    if (rate < (bVar1 & 0x7f)) {
      rate = bVar1 & 0x7f;
    }
    iVar2 = iVar2 + 1;
  }
  basic_rate_idx = me_rate_translate(rate);
  rc_init_bcmc_rate(sta_entry,basic_rate_idx);
  (sta_entry->pol_tbl).upd_field = '\0';
  return;
}



void me_tx_cfm_singleton(txdesc *txdesc)

{
  uint8_t sta_idx;
  uint uVar1;
  uint uVar2;
  
  uVar1 = ((txdesc->lmac).hw_desc)->cfm_ptr->status;
  uVar2 = uVar1 & 0x10000;
  uVar1 = uVar1 >> 8 & 0xff;
  if (uVar2 == 0) {
    sta_idx = (txdesc->host).staid;
  }
  else {
    rf_dump_status();
    sta_idx = (txdesc->host).staid;
  }
  rc_update_counters(sta_idx,uVar1 + 1,uVar1 + (uVar2 != 0),false,false);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void me_check_rc(uint8_t sta_idx,_Bool *tx_ampdu)

{
  ushort uVar1;
  ushort uVar2;
  ushort rate_config;
  ushort rate_config_00;
  uint16_t uVar3;
  bool bVar4;
  rc_sta_stats *rc_ss;
  uint uVar5;
  _Bool _Var6;
  uint8_t uVar7;
  uint8_t uVar8;
  undefined3 in_register_00002029;
  uint uVar9;
  undefined3 extraout_var;
  uint uVar10;
  uint32_t uVar11;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint32_t uVar12;
  byte bVar13;
  uint32_t *puVar14;
  uint uVar15;
  int iVar16;
  uint uVar17;
  uint uVar18;
  
  uVar9 = CONCAT31(in_register_00002029,sta_idx);
  if (9 < uVar9) {
    return;
  }
  rc_ss = sta_info_tab[uVar9].pol_tbl.sta_stats;
  if (rc_ss == (rc_sta_stats *)0x0) {
    assert_err("rc_ss != NULL","module",0x826);
  }
  iVar16 = 0;
  if ((int)((100000 - _DAT_44b00120) + rc_ss->last_rc_time) < 0) {
    _Var6 = rc_update_stats(rc_ss,false);
    iVar16 = CONCAT31(extraout_var,_Var6);
    rc_ss->trial_status = '\0';
    rc_ss->sw_retry_step = '\0';
    rc_ss->info = rc_ss->info & 0xef;
    rc_ss->last_rc_time = _DAT_44b00120;
  }
  if (rc_ss->trial_status == '\x01') {
    if ((rc_ss->info & 0x40) == 0) {
      bVar13 = rc_ss->format_mod;
      uVar1 = rc_ss->retry[0].idx;
      uVar15 = (uint)uVar1;
      if (bVar13 < 2) {
        if ((ushort)(rc_ss->rate_stats[uVar15].probability + 0xe667) < 0xd99b) {
          uVar7 = '\n';
        }
        else {
          uVar7 = '\x05';
        }
      }
      else {
        uVar7 = ((char)*(undefined2 *)((int)&rc_ss->avg_ampdu_len + 2) + '\b') * '\x02';
      }
      rc_ss->sample_wait = uVar7;
      next = next * 0x41c64e6d + 0x3039;
      uVar5 = (next >> 0x10) % (uint)rc_ss->no_samples;
      if (uVar5 != uVar15) {
        uVar2 = rc_ss->retry[1].idx;
        if (((uVar5 != (uint)uVar2) && (uVar18 = (uint)rc_ss->retry[2].idx, uVar5 != uVar18)) &&
           (puVar14 = &rc_ss->last_rc_time + uVar5 * 3, *(ushort *)(puVar14 + 2) < 0xf334)) {
          rate_config = *(ushort *)((int)puVar14 + 10);
          uVar10 = rc_get_duration((uint)rate_config);
          rate_config_00 = rc_ss->rate_stats[uVar15].rate_config;
          if (bVar13 < 2) {
            uVar15 = rc_get_duration((uint)rate_config_00);
            if (uVar15 < uVar10) {
              uVar11 = 0;
              bVar4 = 0x13 < *(byte *)(puVar14 + 3);
            }
            else {
              uVar11 = 0;
              bVar4 = true;
            }
          }
          else {
            uVar17 = 0x20;
            uVar15 = rc_get_duration((uint)rc_ss->rate_stats[(uint)uVar2].rate_config);
            if (*(char *)((int)puVar14 + 0xd) == '\0') {
              uVar17 = (uint)*(ushort *)((int)&rc_ss->avg_ampdu_len + 2);
            }
            if (uVar15 <= uVar10) {
              uVar7 = rc_get_nss(rate_config_00);
              uVar8 = rc_get_nss(rate_config);
              if ((CONCAT31(extraout_var_00,uVar7) - 1U < CONCAT31(extraout_var_01,uVar8)) ||
                 (uVar15 = rc_get_duration((uint)rc_ss->rate_stats[uVar18].rate_config),
                 uVar15 <= uVar10)) {
                if (uVar17 <= *(byte *)(puVar14 + 3)) {
                  bVar13 = rc_ss->sample_slow + 1;
                  rc_ss->sample_slow = bVar13;
                  if (bVar13 < 3) goto LAB_2300964c;
                  if (0xf < bVar13) {
                    rc_ss->sample_slow = '\x0f';
                  }
                }
                goto LAB_23009626;
              }
            }
LAB_2300964c:
            uVar11 = rc_calc_tp(rc_ss,(uint8_t)uVar5);
            bVar4 = true;
            if ((*(byte *)((int)puVar14 + 0xe) & 0xf) < 10) {
              bVar4 = uVar17 <= *(byte *)(puVar14 + 3);
            }
          }
          uVar12 = rc_ss->retry[1].tp;
          (rc_ss->max_tp_2_trial).idx = uVar2;
          (rc_ss->max_tp_2_trial).tp = uVar12;
          if (bVar4) {
            uVar12 = rc_ss->retry[0].tp;
            rc_ss->info = rc_ss->info & 0xfd;
            rc_ss->retry[1].tp = uVar12;
            rc_ss->retry[1].idx = uVar1;
            rc_ss->retry[0].tp = uVar11;
            rc_ss->retry[0].idx = (uint16_t)uVar5;
          }
          else {
            rc_ss->info = rc_ss->info | 2;
            rc_ss->retry[1].tp = uVar11;
            rc_ss->retry[1].idx = (uint16_t)uVar5;
          }
          rc_ss->trial_status = '\x02';
          goto LAB_2300958c;
        }
      }
    }
LAB_23009626:
    rc_ss->trial_status = '\0';
  }
  else {
    if (rc_ss->trial_status == '\x03') {
      if ((rc_ss->info & 2) == 0) {
        rc_ss->retry[0].idx = rc_ss->retry[1].idx;
        rc_ss->retry[0].tp = rc_ss->retry[1].tp;
      }
      uVar3 = (rc_ss->max_tp_2_trial).idx;
      rc_ss->trial_status = '\0';
      rc_ss->retry[1].idx = uVar3;
      uVar11 = (rc_ss->max_tp_2_trial).tp;
      (rc_ss->max_tp_2_trial).tp = 0;
      rc_ss->retry[1].tp = uVar11;
      (rc_ss->max_tp_2_trial).idx = 0xff;
      goto LAB_2300958c;
    }
  }
  if (iVar16 == 0) {
    return;
  }
LAB_2300958c:
  sta_info_tab[uVar9].pol_tbl.upd_field = sta_info_tab[uVar9].pol_tbl.upd_field | 1;
  return;
}


