pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'me_update_buffer_control'
Cause: Exception while decompiling 23007ab2: Decompiler process died

*/


void me_init_rate(sta_info_tag *sta_entry)

{
  rc_init(sta_entry);
  me_update_buffer_control(sta_entry);
  return;
}



void me_bw_check(int param_1,int param_2)

{
  short sVar1;
  short sVar2;
  byte bVar3;
  
  sVar2 = **(short **)(param_2 + 0x4c);
  bVar3 = 0;
  if ((param_1 != 0) && (bVar3 = me_env.phy_bw_max, me_env.phy_bw_max != '\0')) {
    bVar3 = *(byte *)(param_1 + 3) & 3;
    if ((*(byte *)(param_1 + 3) & 3) != 0) {
      sVar1 = 10;
      if (bVar3 != 1) {
        sVar1 = -10;
      }
      sVar2 = sVar2 + sVar1;
      bVar3 = 1;
    }
  }
  *(byte *)(param_2 + 0x82) = bVar3;
  *(byte *)(param_2 + 0x83) = bVar3;
  *(short *)(param_2 + 0x50) = sVar2;
  *(undefined2 *)(param_2 + 0x52) = 0;
  return;
}



void me_beacon_check(uint8_t vif_idx,uint16_t length,uint32_t bcn_addr)

{
  byte bVar1;
  uint8_t uVar2;
  uint8_t uVar3;
  undefined3 in_register_00002029;
  int iVar4;
  int iVar5;
  undefined4 uVar6;
  uint8_t *puVar7;
  undefined2 in_register_0000202e;
  uint uVar8;
  uint16_t uVar9;
  scan_chan_tag *psVar10;
  uint uVar11;
  byte bVar12;
  char cStack51;
  int8_t iStack50;
  uint8_t auStack49 [2];
  uint8_t csa_mode;
  int8_t pwr;
  uint8_t idx;
  
  iVar4 = CONCAT31(in_register_00002029,vif_idx);
  psVar10 = vif_info_tab[iVar4].bss_info.chan;
  vif_info_tab[iVar4].bss_info.prot_status = 0;
  uVar8 = CONCAT22(in_register_0000202e,length) - 0x24;
  bVar1 = vif_info_tab[iVar4].bss_info.phy_bw;
  uVar2 = vif_info_tab[iVar4].bss_info.power_constraint;
  bcn_addr = bcn_addr + 0x24;
  uVar11 = uVar8 & 0xffff;
  if ((psVar10->band == '\0') && (iVar5 = mac_ie_find(bcn_addr,uVar11,0x2a), iVar5 != 0)) {
    bVar12 = *(byte *)(iVar5 + 2);
    uVar9 = vif_info_tab[iVar4].bss_info.prot_status & 0xfff8;
    if ((bVar12 & 1) != 0) {
      uVar9 = uVar9 | 1;
    }
    vif_info_tab[iVar4].bss_info.prot_status = uVar9;
    if ((bVar12 & 2) != 0) {
      vif_info_tab[iVar4].bss_info.prot_status = vif_info_tab[iVar4].bss_info.prot_status | 2;
    }
    if ((bVar12 & 4) != 0) {
      vif_info_tab[iVar4].bss_info.prot_status = vif_info_tab[iVar4].bss_info.prot_status | 4;
    }
  }
  uVar6 = 0;
  if (me_env.ht_supported != false) {
    uVar6 = mac_ie_find(bcn_addr,uVar11,0x3d);
  }
  me_bw_check(uVar6,0,&vif_info_tab[iVar4].bss_info);
  uVar11 = me_extract_csa(bcn_addr,uVar11,&cStack51,iVar4 * 0x5d8 + 0x4201a9d8);
  if ((uVar11 & 0xff) != 0) {
    bVar12 = (byte)(uVar11 & 0xff);
    if (vif_info_tab[iVar4].type == '\0') {
      if ((vif_info_tab[iVar4].u[0x1d] == 0) && (cStack51 == '\x01')) {
        mm_send_csa_traffic_ind(vif_info_tab[iVar4].index,false);
      }
      vif_info_tab[iVar4].u[0x1d] = bVar12;
    }
    else {
      if (vif_info_tab[iVar4].type == '\x02') {
        vif_info_tab[iVar4].u[0x2eb] = bVar12;
      }
    }
  }
  me_extract_power_constraint
            (bcn_addr,(uint16_t)(uVar8 * 0x10000 >> 0x10),&vif_info_tab[iVar4].bss_info);
  uVar3 = vif_info_tab[iVar4].bss_info.power_constraint;
  if (uVar3 != uVar2) {
    iStack50 = (vif_info_tab[iVar4].bss_info.chan)->tx_power - uVar3;
    tpc_update_vif_tx_power(vif_info_tab + iVar4,&iStack50,auStack49);
  }
  if (bVar1 < vif_info_tab[iVar4].bss_info.phy_bw) {
    puVar7 = (uint8_t *)ke_msg_alloc(0x3b,0,5,0xc);
    if (vif_info_tab[iVar4].chan_ctxt == (chan_ctxt_tag *)0x0) {
      assert_err("vif->chan_ctxt != NULL","module",0x39);
    }
    *puVar7 = (vif_info_tab[iVar4].chan_ctxt)->idx;
    puVar7[1] = (vif_info_tab[iVar4].bss_info.chan)->band;
    puVar7[2] = vif_info_tab[iVar4].bss_info.phy_bw;
    *(uint16_t *)(puVar7 + 4) = (vif_info_tab[iVar4].bss_info.chan)->freq;
    *(uint16_t *)(puVar7 + 6) = vif_info_tab[iVar4].bss_info.center_freq1;
    *(uint16_t *)(puVar7 + 8) = vif_info_tab[iVar4].bss_info.center_freq2;
    puVar7[10] = ((vif_info_tab[iVar4].chan_ctxt)->channel).tx_power;
    ke_msg_send(puVar7);
  }
  return;
}



void me_sta_bw_nss_max_upd(uint8_t sta_idx,uint8_t bw,uint8_t nss)

{
  byte bVar1;
  byte bVar2;
  uint8_t sta_idx_00;
  uint8_t nss_max;
  uint8_t bw_max;
  undefined3 in_register_00002029;
  int iVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 in_register_0000202d;
  uint uVar4;
  undefined3 in_register_00002031;
  uint uVar5;
  
  iVar3 = CONCAT31(in_register_00002029,sta_idx);
  bVar1 = sta_info_tab[iVar3].inst_nbr;
  if (me_env.ht_supported == false) {
    assert_err("me_env.ht_supported","module",0x429);
  }
  nss_max = me_11n_nss_max(sta_info_tab[iVar3].info.ht_cap.mcs_rate);
  bw_max = me_11n_nss_max(me_env.ht_cap.mcs_rate);
  uVar5 = CONCAT31(extraout_var_00,bw_max);
  if (CONCAT31(extraout_var,nss_max) < CONCAT31(extraout_var_00,bw_max)) {
    uVar5 = CONCAT31(extraout_var,nss_max);
  }
  nss_max = (uint8_t)uVar5;
  if (CONCAT31(in_register_00002031,nss) < uVar5) {
    nss_max = nss;
  }
  bVar2 = sta_info_tab[iVar3].info.phy_bw_max;
  uVar5 = (uint)bVar2;
  if (bVar2 == 4) {
    uVar5 = 3;
  }
  uVar4 = (uint)vif_info_tab[bVar1].bss_info.bw;
  if (CONCAT31(in_register_0000202d,bw) < uVar4) {
    uVar4 = CONCAT31(in_register_0000202d,bw);
  }
  bw_max = (uint8_t)uVar4;
  if (uVar5 < uVar4) {
    bw_max = (uint8_t)uVar5;
  }
  sta_idx_00 = sta_info_tab[iVar3].staid;
  sta_info_tab[iVar3].info.bw_cur = bw_max;
  rc_update_bw_nss_max(sta_idx_00,bw_max,nss_max);
  sta_info_tab[iVar3].pol_tbl.upd_field = sta_info_tab[iVar3].pol_tbl.upd_field | 8;
  return;
}



// WARNING: Could not reconcile some variable overlaps

uint8_t me_add_chan_ctx(uint8_t *p_chan_idx,scan_chan_tag *p_chan,uint32_t center_freq1,
                       uint32_t center_freq2,uint8_t ch_width)

{
  uint8_t uVar1;
  uint8_t uStack28;
  uint8_t uStack27;
  uint16_t uStack26;
  mm_chan_ctxt_add_req req;
  
  uStack28 = p_chan->band;
  req._0_2_ = (uint16_t)center_freq1;
  uStack26 = p_chan->freq;
  req.prim20_freq = (uint16_t)center_freq2;
  req.center1_freq._0_1_ = p_chan->tx_power;
  uStack27 = ch_width;
  uVar1 = chan_ctxt_add((mm_chan_ctxt_add_req *)&uStack28,p_chan_idx);
  return uVar1;
}



uint8_t rc_get_nss(uint16_t rate_config)

{
  undefined2 in_register_0000202a;
  
