pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if ((CONCAT22(in_register_0000202a,rate_config) >> 0xb & 7U) - 2 < 2) {
    return (uint8_t)((byte)(CONCAT22(in_register_0000202a,rate_config) >> 3) & 3);
  }
  return '\0';
}



uint8_t rc_get_mcs_index(uint16_t rate_config)

{
  undefined2 in_register_0000202a;
  byte bVar1;
  uint uVar2;
  
  uVar2 = CONCAT22(in_register_0000202a,rate_config) >> 0xb & 7;
  if (uVar2 < 2) {
    bVar1 = (byte)rate_config & 0x7f;
  }
  else {
    bVar1 = 0;
    if (uVar2 < 4) {
      bVar1 = (byte)rate_config & 7;
    }
  }
  return (uint8_t)bVar1;
}



uint16_t rc_set_previous_mcs_index(rc_sta_stats *rc_ss,uint16_t rate_config)

{
  uint uVar1;
  uint8_t uVar2;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  
  uVar2 = rc_get_mcs_index(rate_config);
  _uVar2 = CONCAT31(extraout_var,uVar2);
  uVar1 = CONCAT22(in_register_0000202e,rate_config) >> 0xb & 7;
  if (uVar1 < 2) {
    if (rc_ss->r_idx_min < _uVar2) {
      rate_config = rate_config & 0xff80 | (short)_uVar2 - 1U;
    }
  }
  else {
    if ((uVar1 < 4) && (_uVar2 != 0)) {
      rate_config = rate_config & 0xfff8 | (short)_uVar2 - 1U;
      if (rc_ss->short_gi != '\0') {
        rate_config = rate_config | 0x200;
      }
    }
  }
  return rate_config;
}



uint16_t rc_set_next_mcs_index(rc_sta_stats *rc_ss,uint16_t rate_config)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined2 in_register_0000202e;
  uint uVar2;
  
  uVar1 = rc_get_mcs_index(rate_config);
  _uVar1 = CONCAT31(extraout_var,uVar1);
  uVar2 = CONCAT22(in_register_0000202e,rate_config) >> 0xb & 7;
  if (uVar2 < 2) {
    if ((_uVar1 < rc_ss->r_idx_max) && ((rc_ss->rate_map_l >> (_uVar1 + 1 & 0x1f) & 1) != 0)) {
      rate_config = rate_config & 0xff80 | (ushort)(_uVar1 + 1);
    }
  }
  else {
    if ((uVar2 < 4) && (_uVar1 < rc_ss->mcs_max)) {
      uVar1 = rc_get_nss(rate_config);
      if ((*(byte *)((int)&rc_ss->rate_map + CONCAT31(extraout_var_00,uVar1)) >> (_uVar1 + 1 & 0x1f)
          & 1) != 0) {
        rate_config = rate_config & 0xfff8 | (ushort)(_uVar1 + 1);
        if (rc_ss->short_gi != '\0') {
          rate_config = rate_config | 0x200;
        }
      }
    }
  }
  return rate_config;
}



_Bool is_cck_group(uint16_t rate_config)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  
  if ((rate_config & 0x3000) == 0) {
    uVar1 = rc_get_mcs_index(rate_config);
    return (_Bool)(CONCAT31(extraout_var,uVar1) < 4);
  }
  return false;
}



void rc_update_retry_chain(rc_sta_stats *rc_ss,uint32_t *cur_tp)

{
  ushort uVar1;
  ushort uVar2;
  int iVar3;
  uint uVar4;
  _Bool _Var5;
  ushort uVar6;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  ushort *puVar7;
  int iVar8;
  uint32_t uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  uint uVar13;
  
  uVar6 = rc_ss->no_samples;
  uVar13 = (uint)uVar6;
  if (((rc_ss->info & 4) == 0) && (cur_tp[uVar13 - 1] < *cur_tp)) {
    rc_ss->retry[0].idx = 0;
    rc_ss->retry[0].tp = 0;
    uVar4 = 1;
  }
  else {
    rc_ss->retry[0].idx = uVar6 - 1;
    uVar4 = 2;
    rc_ss->retry[0].tp = cur_tp[uVar13 - 1];
  }
  uVar1 = rc_ss->retry[0].idx;
  _Var5 = is_cck_group(*(uint16_t *)((int)(&rc_ss->last_rc_time + (uint)uVar1 * 3) + 10));
  if (CONCAT31(extraout_var,_Var5) == 0) {
    uVar12 = 0;
    while ((int)uVar12 < (int)(uVar13 - 1)) {
      _Var5 = is_cck_group(*(uint16_t *)((int)(&rc_ss->last_rc_time + uVar12 * 3) + 10));
      if (CONCAT31(extraout_var_00,_Var5) != 0) {
        *(undefined *)((int)(&rc_ss->last_rc_time + uVar12 * 3) + 0xf) = 0;
      }
      uVar12 = uVar12 + 1 & 0xffff;
    }
    *(undefined *)((int)(&rc_ss->last_rc_time + (uint)uVar1 * 3) + 0xf) = 1;
  }
  uVar9 = rc_ss->retry[0].tp;
  rc_ss->retry[1].idx = uVar1;
  rc_ss->retry[1].tp = uVar9;
  iVar3 = uVar13 - uVar4;
  do {
    iVar8 = iVar3;
    uVar12 = uVar4;
    uVar4 = uVar12 + 1 & 0xffff;
    if (uVar13 <= uVar12) goto LAB_230081c4;
    iVar3 = iVar8 + -1;
  } while (rc_ss->rate_stats[iVar8].rate_allowed == false);
  rc_ss->retry[1].idx = uVar6 - (short)uVar12;
  rc_ss->retry[1].tp = cur_tp[iVar8];
LAB_230081c4:
  uVar12 = (uint)rc_ss->retry[1].idx;
  uVar4 = uVar13 - uVar4;
  do {
    uVar10 = uVar4;
    uVar11 = uVar12;
    if (uVar13 <= (uVar13 - uVar10 & 0xffff)) break;
    uVar4 = uVar10 - 1;
    uVar11 = uVar10;
  } while (rc_ss->rate_stats[uVar10].rate_allowed == false);
  uVar13 = cur_tp[uVar11];
  puVar7 = &rc_ss->rate_stats[0].probability;
  uVar6 = rc_ss->rate_stats[uVar11].probability;
  uVar4 = 0;
  do {
    if (uVar12 <= (uVar4 & 0xffff)) {
      rc_ss->retry[2].idx = (uint16_t)uVar11;
      uVar9 = cur_tp[uVar11];
      rc_ss->retry[3].idx = 0;
      rc_ss->retry[2].tp = uVar9;
      rc_ss->retry[3].tp = *cur_tp;
      return;
    }
    if ((*(char *)((int)puVar7 + 7) != '\0') && ((uVar4 & 0xffff) != (uint)uVar1)) {
      uVar2 = *puVar7;
      if (uVar2 < 0xf333) {
        if (uVar6 <= uVar2) {
          uVar9 = cur_tp[uVar4];
          goto LAB_230082a8;
        }
      }
      else {
        uVar9 = cur_tp[uVar4];
        if (uVar13 <= uVar9) {
LAB_230082a8:
          uVar13 = uVar9;
          uVar11 = uVar4;
          uVar6 = uVar2;
        }
      }
    }
    uVar4 = uVar4 + 1;
    puVar7 = puVar7 + 6;
  } while( true );
}



uint16_t rc_get_lowest_rate_config(rc_sta_stats *rc_ss)

{
  byte bVar1;
  uint16_t uVar2;
  
  bVar1 = rc_ss->format_mod;
  if (bVar1 < 2) {
    uVar2 = (uint16_t)rc_ss->r_idx_min;
    if (rc_ss->r_idx_min == 0) {
      return 0x400;
    }
  }
  else {
    if (3 < bVar1) {
      return 0;
    }
    if (rc_ss->r_idx_min == '\0') {
      return 0x400;
    }
    uVar2 = (ushort)bVar1 << 0xb;
  }
  return uVar2;
}



// WARNING: Variable defined which should be unmapped: rc_ss_tmp

void rc_sort_samples_tp(rc_sta_stats *rc_ss,uint32_t *cur_tp)

{
  ushort uVar1;
  uint32_t *puVar2;
  ushort uVar3;
  uint32_t uVar4;
  ushort uVar5;
  rc_rate_stats *__src;
  ushort uVar6;
  rc_rate_stats *__src_00;
  undefined auStack44 [4];
  rc_rate_stats rc_ss_tmp;
  
  uVar5 = rc_ss->no_samples;
  uVar1 = uVar5 - 1;
  while (uVar6 = uVar1, uVar5 != 0) {
    puVar2 = cur_tp + 1;
    uVar5 = 0;
    uVar3 = 1;
    __src = rc_ss->rate_stats + 1;
    while (uVar1 = uVar5, uVar3 < uVar6) {
      __src_00 = __src + 1;
      if (puVar2[1] < *puVar2) {
        memmove(auStack44,__src,0xc);
        memmove(__src,__src_00,0xc);
        memmove(__src_00,auStack44,0xc);
        uVar4 = puVar2[1];
        puVar2[1] = *puVar2;
        *puVar2 = uVar4;
        uVar5 = uVar3;
      }
      uVar3 = uVar3 + 1;
      puVar2 = puVar2 + 1;
      __src = __src_00;
    }
  }
  return;
}



