pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint16_t rc_get_initial_rate_config(rc_sta_stats *rc_ss)

{
  byte bVar1;
  byte bVar2;
  ushort uVar3;
  int iVar4;
  ushort uVar5;
  
  bVar1 = rc_ss->format_mod;
  if (bVar1 < 2) {
    uVar3 = (ushort)rc_ss->r_idx_max;
    uVar5 = (ushort)bVar1 << 0xb | (ushort)rc_ss->p_type << 10;
  }
  else {
    if (3 < bVar1) {
      return 0;
    }
    bVar2 = rc_ss->no_ss;
    iVar4 = __clzsi2((uint)*(byte *)((int)&rc_ss->rate_map + (uint)bVar2));
    uVar5 = (ushort)rc_ss->short_gi << 9 | (ushort)bVar1 << 0xb | (ushort)rc_ss->bw_max << 7 |
            (ushort)bVar2 << 3;
    uVar3 = 0x1fU - (short)iVar4 & 0xff;
  }
  return (uint16_t)(uVar5 | uVar3);
}



void rc_calc_prob_ewma(rc_rate_stats *rc_rs)

{
  ushort uVar1;
  uint uVar2;
  uint uVar3;
  
  uVar1 = rc_rs->attempts;
  if (uVar1 != 0) {
    rc_rs->sample_skipped = '\0';
    uVar3 = (uint)rc_rs->success << 0x10;
    uVar2 = uVar3 / uVar1;
    if (rc_rs->old_prob_available == false) {
      if (uVar3 < uVar1) {
        rc_rs->probability = 0;
      }
      else {
        rc_rs->probability = (short)uVar2 - 1;
      }
    }
    else {
      rc_rs->probability = (uint16_t)((uint)rc_rs->probability * 0x60 + uVar2 * 0x20 >> 7);
    }
    rc_rs->old_prob_available = true;
    return;
  }
  if (rc_rs->sample_skipped != -1) {
    rc_rs->sample_skipped = rc_rs->sample_skipped + '\x01';
  }
  return;
}



_Bool rc_check_valid_rate(rc_sta_stats *rc_ss,uint16_t rate_config)

{
  uint8_t uVar1;
  byte bVar2;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  uint uVar3;
  
  uVar3 = CONCAT22(in_register_0000202e,rate_config) >> 0xb & 7;
  if (uVar3 < 2) {
    bVar2 = rc_get_mcs_index(rate_config);
    uVar3 = (uint)rc_ss->rate_map_l;
  }
  else {
    if (3 < uVar3) {
      return true;
    }
    uVar1 = rc_get_nss(rate_config);
    bVar2 = rc_get_mcs_index(rate_config);
    uVar3 = (uint)*(byte *)((int)&rc_ss->rate_map + CONCAT31(extraout_var,uVar1));
  }
  return (_Bool)((byte)(uVar3 >> ((uint)bVar2 & 0x1f)) & 1);
}



uint16_t rc_new_random_rate(rc_sta_stats *rc_ss)

{
  byte bVar1;
  byte bVar2;
  uint uVar3;
  int iVar4;
  uint16_t uVar5;
  uint uVar6;
  ushort uVar7;
  uint uVar8;
  
  bVar1 = rc_ss->bw_max;
  uVar8 = 0;
  next = next * 0x41c64e6d + 0x3039;
  bVar2 = rc_ss->format_mod;
  uVar6 = next >> 0x10;
  uVar5 = (uint16_t)(((uint)bVar2 << 0x1b) >> 0x10);
  if (bVar1 != 0) {
    uVar8 = (uint)bVar1 - 1 & 0xff;
  }
  uVar7 = (ushort)(next >> 0x10);
  if (bVar2 < 2) {
    uVar8 = (int)(uVar6 & 0x7f) % (((uint)rc_ss->r_idx_max - (uint)rc_ss->r_idx_min) + 1) +
            (uint)rc_ss->r_idx_min;
    uVar6 = uVar8 & 0xff;
    if ((rc_ss->rate_map_l >> (uVar8 & 0x1f) & 1) == 0) {
      uVar6 = (uint)rc_ss->r_idx_max;
    }
    uVar5 = uVar5 | (ushort)uVar6;
    if (uVar6 == 0) {
      uVar5 = uVar5 | 0x400;
    }
    else {
      if ((uVar6 - 1 & 0xff) < 3) {
        uVar5 = uVar5 | uVar7 & 0x400 | (ushort)rc_ss->p_type << 10;
      }
    }
  }
  else {
    if (bVar2 < 4) {
      bVar2 = rc_ss->r_idx_min;
      if ((bVar2 < 4) && ((int)(uVar6 << 0x14) < 0)) {
        uVar8 = (int)(uVar6 & 0x7f) % (((uint)rc_ss->r_idx_max - (uint)bVar2) + 1) + (uint)bVar2;
        uVar6 = uVar8 & 0xff;
        if ((rc_ss->rate_map_l >> (uVar8 & 0x1f) & 1) == 0) {
          uVar6 = (uint)rc_ss->r_idx_max;
        }
        uVar5 = 0x400;
        if (uVar6 != 0) {
          uVar5 = (ushort)rc_ss->p_type << 10 | uVar7 & 0x400 | (ushort)uVar6;
        }
      }
      else {
        uVar7 = (ushort)rc_ss->mcs_max;
        iVar4 = (int)((int)uVar6 >> 3 & 3U) % ((uint)rc_ss->no_ss + 1);
        uVar3 = (int)(uVar6 & 7) % ((uint)rc_ss->mcs_max + 1);
        if ((*(byte *)((int)&rc_ss->rate_map + iVar4) >> (uVar3 & 0x1f) & 1) != 0) {
          uVar7 = (ushort)uVar3 & 0xff;
        }
        uVar5 = uVar5 | (ushort)((int)((int)uVar6 >> 9 & 1U) % ((uint)rc_ss->short_gi + 1) << 9) |
                        (ushort)(iVar4 << 3) |
                ((short)((int)((int)uVar6 >> 7 & 3U) % (((uint)bVar1 - uVar8) + 1)) + (short)uVar8)
                * 0x80 | uVar7;
      }
    }
  }
  return uVar5;
}



void rc_update_counters(uint8_t sta_idx,uint32_t attempts,uint32_t failures,_Bool tx_ampdu,
                       _Bool retry_required)

{
  short sVar1;
  rc_sta_stats *prVar2;
  undefined3 in_register_00002029;
  uint uVar3;
  uint8_t uVar4;
  uint32_t *puVar5;
  ushort *puVar6;
  
  uVar3 = CONCAT31(in_register_00002029,sta_idx);
  if (9 < uVar3) {
    return;
  }
  if (sta_info_tab[uVar3].inst_nbr != -1) {
    prVar2 = sta_info_tab[uVar3].pol_tbl.sta_stats;
    if (prVar2 == (rc_sta_stats *)0x0) {
      assert_err("rc_ss != NULL","module",0x7ce);
    }
    puVar6 = &prVar2->retry[0].idx;
    prVar2->ampdu_packets = prVar2->ampdu_packets + 1;
    prVar2->ampdu_len = prVar2->ampdu_len + 1;
    do {
      if (attempts == 0) break;
      puVar5 = &prVar2->last_rc_time + (uint)*puVar6 * 3;
      if (failures < 4) {
        *(short *)(puVar5 + 1) = *(short *)(puVar5 + 1) + (short)attempts;
        sVar1 = (short)failures;
        failures = 0;
        *(short *)((int)puVar5 + 6) = ((short)attempts - sVar1) + *(short *)((int)puVar5 + 6);
        attempts = 0;
      }
      else {
        *(short *)(puVar5 + 1) = *(short *)(puVar5 + 1) + 4;
        attempts = attempts - 4;
        failures = failures - 4;
      }
      if (*(ushort *)(puVar5 + 1) < *(ushort *)((int)puVar5 + 6)) {
        assert_err("rc_rs->attempts >= rc_rs->success","module",0x7fa);
      }
      puVar6 = puVar6 + 4;
    } while (puVar6 != &(prVar2->max_tp_2_trial).idx);
    if (prVar2->trial_status == '\0') {
      if (prVar2->sample_wait != '\0') {
        prVar2->sample_wait = prVar2->sample_wait + -1;
        return;
      }
      uVar4 = '\x01';
    }
    else {
      if (prVar2->trial_status != '\x02') {
        return;
      }
      if ((sta_info_tab[uVar3].pol_tbl.upd_field & 1) != 0) {
        return;
      }
      uVar4 = '\x03';
    }
    prVar2->trial_status = uVar4;
  }
  return;
}



uint32_t rc_get_duration(uint param_1)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  uint32_t uVar2;
  undefined3 extraout_var_00;
  uint uVar3;
  
  uVar1 = rc_get_mcs_index((uint16_t)param_1);
  _uVar1 = CONCAT31(extraout_var,uVar1);
  uVar3 = (int)param_1 >> 0xb & 7;
  if (uVar3 < 2) {
    if (_uVar1 < 4) {
      uVar2 = rc_duration_cck[(int)param_1 >> 10 & 1U | _uVar1 << 1];
    }
    else {
      uVar2 = rc_duration_non_ht[_uVar1 - 4];
    }
  }
  else {
    uVar2 = 0;
    if (uVar3 < 4) {
      uVar1 = rc_get_nss((uint16_t)param_1);
      uVar2 = rc_duration_ht_ampdu[_uVar1 << 3 | param_1 >> 9 & 1 | param_1 >> 6 & 6] /
              (CONCAT31(extraout_var_00,uVar1) + 1U);
    }
  }
  return uVar2;
}



