pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void rc_update_bw_nss_max(uint8_t sta_idx,uint8_t bw_max,uint8_t nss_max)

{
  ushort uVar1;
  rc_sta_stats *rc_ss;
  uint16_t uVar2;
  undefined3 in_register_00002029;
  int iVar3;
  undefined2 extraout_var;
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  uint32_t *puVar4;
  uint uVar5;
  ushort *puVar6;
  uint16_t *puVar7;
  uint uVar8;
  uint32_t local_48;
  uint32_t cur_tp [10];
  
  iVar3 = CONCAT31(in_register_00002029,sta_idx);
  rc_ss = sta_info_tab[iVar3].pol_tbl.sta_stats;
  if (rc_ss == (rc_sta_stats *)0x0) {
    assert_err("rc_ss != NULL","module",0x969);
  }
  if (((uint)rc_ss->bw_max != CONCAT31(in_register_0000202d,bw_max)) ||
     ((uint)rc_ss->no_ss != CONCAT31(in_register_00002031,nss_max))) {
    rc_ss->bw_max = bw_max;
    if (3 < CONCAT31(in_register_0000202d,bw_max)) {
      assert_err("rc_ss->bw_max <= BW_160MHZ","module",0x96f);
    }
    rc_ss->no_ss = nss_max;
    if (7 < CONCAT31(in_register_00002031,nss_max)) {
      assert_err("rc_ss->no_ss < 8","module",0x971);
    }
    if (rc_ss->fixed_rate_cfg == 0xffff) {
      uVar2 = rc_get_lowest_rate_config(rc_ss);
      rc_ss->rate_stats[0].rate_config = uVar2;
      uVar2 = rc_get_initial_rate_config(rc_ss);
      rc_ss->rate_stats[(uint)rc_ss->no_samples - 1].rate_config = uVar2;
      uVar5 = 1;
LAB_230088ac:
      uVar1 = rc_ss->no_samples;
      if ((int)uVar5 < (int)((uint)uVar1 - 1)) {
        do {
          uVar2 = rc_new_random_rate(rc_ss);
          uVar8 = 0;
          puVar6 = &rc_ss->rate_stats[0].rate_config;
          while( true ) {
            if (rc_ss->no_samples <= uVar8) {
              rc_ss->rate_stats[uVar5].rate_config = uVar2;
              uVar5 = uVar5 + 1 & 0xffff;
              goto LAB_230088ac;
            }
            if ((uint)*puVar6 == CONCAT22(extraout_var,uVar2)) break;
            uVar8 = uVar8 + 1;
            puVar6 = puVar6 + 6;
          }
        } while( true );
      }
      puVar7 = &rc_ss->rate_stats[0].probability;
      uVar5 = 0;
      puVar4 = &local_48;
      while ((uint)uVar1 != uVar5) {
        *(undefined *)(puVar7 + 3) = 0;
        *(undefined *)((int)puVar7 + 7) = 1;
        *puVar7 = 0;
        *(undefined *)((int)puVar7 + 5) = 0;
        *puVar4 = 0;
        uVar5 = uVar5 + 1 & 0xffff;
        puVar7 = puVar7 + 6;
        puVar4 = puVar4 + 1;
      }
      rc_sort_samples_tp(rc_ss,&local_48);
      rc_update_retry_chain(rc_ss,&local_48);
      sta_info_tab[iVar3].pol_tbl.upd_field = sta_info_tab[iVar3].pol_tbl.upd_field | 1;
    }
  }
  return;
}



void rc_init_bcmc_rate(sta_info_tag *sta_entry,uint8_t basic_rate_idx)

{
  undefined3 in_register_0000202d;
  txl_buffer_control *ptVar1;
  uint uVar2;
  
  ptVar1 = (sta_entry->pol_tbl).buf_ctrl;
  uVar2 = 0;
  if (CONCAT31(in_register_0000202d,basic_rate_idx) < 4) {
    uVar2 = SEXT24((short)((sta_entry->pol_tbl).ppdu_tx_cfg & 0x400));
  }
  uVar2 = CONCAT31(in_register_0000202d,basic_rate_idx) | uVar2 | 0x20000000;
  *(uint *)(ptVar1->field_0 + 0x14) = uVar2;
  *(uint *)(ptVar1->field_0 + 0x18) = uVar2;
  *(uint *)(ptVar1->field_0 + 0x1c) = uVar2;
  *(uint *)(ptVar1->field_0 + 0x20) = uVar2;
  return;
}



_Bool rc_check_fixed_rate_config(rc_sta_stats *rc_ss,uint16_t fixed_rate_config)

{
  uint8_t uVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  uint uVar3;
  uint uVar4;
  
  uVar4 = (uint)rc_ss->format_mod;
  uVar3 = ((uint)fixed_rate_config & 0x3800) >> 0xb;
  if (uVar4 < uVar3) {
    return false;
  }
  if (rc_ss->format_mod == 4) {
    if (uVar3 != uVar4) {
      return false;
    }
LAB_2300899e:
    if ((fixed_rate_config & 0x3000) == 0) {
LAB_230089f6:
      if (((CONCAT22(in_register_0000202e,fixed_rate_config) >> 10 & 1U) == 0) &&
         (rc_ss->p_type == '\x01')) {
        return false;
      }
      goto LAB_230089d0;
    }
  }
  else {
    if (1 < (uVar4 - 2 & 0xff)) goto LAB_2300899e;
    if ((fixed_rate_config & 0x3000) == 0) {
      if (3 < rc_ss->r_idx_min) {
        return false;
      }
      goto LAB_230089f6;
    }
  }
  if (((((fixed_rate_config & 0x200) != 0) && (rc_ss->short_gi == '\0')) ||
      ((uint)rc_ss->bw_max < (CONCAT22(in_register_0000202e,fixed_rate_config) >> 7 & 3U))) ||
     (uVar1 = rc_get_nss(fixed_rate_config), (uint)rc_ss->no_ss < CONCAT31(extraout_var,uVar1))) {
    return false;
  }
LAB_230089d0:
  _Var2 = rc_check_valid_rate(rc_ss,fixed_rate_config);
  return _Var2;
}



uint32_t rc_calc_tp(rc_sta_stats *rc_ss,uint8_t sample_idx)

{
  ushort uVar1;
  ushort rate_config;
  uint uVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  int iVar4;
  uint32_t uVar5;
  undefined3 in_register_0000202d;
  
  uVar1 = *(ushort *)(&rc_ss->last_rc_time + CONCAT31(in_register_0000202d,sample_idx) * 3 + 2);
  if (uVar1 < 0x1999) {
    uVar5 = 0;
  }
  else {
    rate_config = *(ushort *)
                   ((int)(&rc_ss->last_rc_time + CONCAT31(in_register_0000202d,sample_idx) * 3) + 10
                   );
    uVar2 = 0;
    _Var3 = is_cck_group(rate_config);
    if (CONCAT31(extraout_var,_Var3) == 0) {
      uVar2 = 0x35390 / (uint)*(ushort *)((int)&rc_ss->avg_ampdu_len + 2);
    }
    iVar4 = rc_get_duration((uint)rate_config);
    uVar5 = (((uint)uVar1 * 1000) / (iVar4 + uVar2)) * 1000000 >> 0x10;
  }
  return uVar5;
}



_Bool rc_update_stats(rc_sta_stats *rc_ss,_Bool init)

{
  byte bVar1;
  ushort rate_config;
  _Bool _Var2;
  uint16_t rate_config_00;
  uint32_t uVar3;
  undefined2 extraout_var_03;
  undefined3 extraout_var;
  undefined2 extraout_var_04;
  undefined3 extraout_var_00;
  undefined2 extraout_var_05;
  undefined3 extraout_var_01;
  undefined2 extraout_var_06;
  undefined3 extraout_var_02;
  uint uVar4;
  undefined3 in_register_0000202d;
  rc_rate_stats *prVar5;
  uint32_t *cur_tp_00;
  uint32_t *puVar6;
  uint uVar7;
  ushort rate_config_01;
  uint16_t uVar8;
  uint8_t *puVar9;
  uint16_t *puVar10;
  uint16_t *puVar11;
  uint uVar12;
  char cVar13;
  uint16_t uStack148;
  ushort uStack146;
  uint16_t new_rate_cfg_array [6];
  step old_retry [4];
  uint32_t cur_tp [10];
  
