pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  memcpy(new_rate_cfg_array + 4,rc_ss->retry,0x20);
  if (rc_ss->ampdu_packets != 0) {
    rate_config = rc_ss->ampdu_len;
    *(undefined4 *)&rc_ss->ampdu_len = 0;
    rc_ss->avg_ampdu_len =
         ((int)((uint)rate_config << 0x10) / (int)(uint)rc_ss->ampdu_packets) * 0x20 +
         rc_ss->avg_ampdu_len * 0x60 >> 7;
  }
  rate_config = rc_ss->no_samples;
  cur_tp_00 = (uint32_t *)&old_retry[3].idx;
  rc_ss->sample_slow = '\0';
  puVar9 = &rc_ss->rate_stats[0].n_retry;
  uVar7 = 0;
  puVar6 = cur_tp_00;
  while ((uint)rate_config != uVar7) {
    *puVar6 = 0;
    *puVar9 = '\0';
    puVar9[1] = '\x01';
    uVar7 = uVar7 + 1 & 0xffff;
    puVar6 = puVar6 + 1;
    puVar9 = puVar9 + 0xc;
  }
  rate_config_00 = rc_ss->fixed_rate_cfg;
  uVar12 = 0;
  if (rate_config_00 == 0xffff) {
    while (uVar12 < rc_ss->no_samples) {
      rc_calc_prob_ewma(rc_ss->rate_stats + uVar12);
      uVar3 = rc_calc_tp(rc_ss,(uint8_t)uVar12);
      *(uint32_t *)(&old_retry[3].idx + uVar12 * 2) = uVar3;
      uVar12 = uVar12 + 1 & 0xffff;
    }
    rc_sort_samples_tp(rc_ss,cur_tp_00);
    rc_update_retry_chain(rc_ss,cur_tp_00);
    if (CONCAT31(in_register_0000202d,init) == 0) {
      rate_config = rc_ss->no_samples;
      if (9 < rate_config) {
        cVar13 = '\0';
        rate_config = rc_ss->rate_stats[rc_ss->retry[0].idx].rate_config;
        uVar7 = (uint)rate_config;
        rate_config_01 = rc_ss->rate_stats[rc_ss->retry[1].idx].rate_config;
        memset(&uStack148,-1,0xc);
        do {
          switch(cVar13) {
          case '\x01':
            if ((((int)uVar7 >> 0xb & 6U) != 0) && (rc_ss->short_gi == '\x01')) {
              if ((rate_config & 0x200) == 0) {
                uStack146 = rate_config | 0x200;
              }
              else {
                uStack146 = rate_config & 0xfdff;
              }
            }
            break;
          case '\x02':
            rate_config_00 = rc_set_next_mcs_index(rc_ss,rate_config);
            if ((uVar7 != CONCAT22(extraout_var_03,rate_config_00)) &&
               (_Var2 = rc_check_valid_rate(rc_ss,rate_config_00), CONCAT31(extraout_var,_Var2) != 0
               )) {
              new_rate_cfg_array[0] = rate_config_00;
            }
            break;
          case '\x03':
            rate_config_00 = rc_set_previous_mcs_index(rc_ss,rate_config);
            if ((uVar7 != CONCAT22(extraout_var_04,rate_config_00)) &&
               (_Var2 = rc_check_valid_rate(rc_ss,rate_config_00),
               CONCAT31(extraout_var_00,_Var2) != 0)) {
              new_rate_cfg_array[1] = rate_config_00;
            }
            break;
          case '\x04':
            rate_config_00 = rc_set_next_mcs_index(rc_ss,rate_config_01);
            if (((uint)rate_config_01 != CONCAT22(extraout_var_05,rate_config_00)) &&
               (_Var2 = rc_check_valid_rate(rc_ss,rate_config_00),
               CONCAT31(extraout_var_01,_Var2) != 0)) {
              new_rate_cfg_array[2] = rate_config_00;
            }
            break;
          case '\x05':
            rate_config_00 = rc_set_previous_mcs_index(rc_ss,rate_config_01);
            if (((uint)rate_config_01 != CONCAT22(extraout_var_06,rate_config_00)) &&
               (_Var2 = rc_check_valid_rate(rc_ss,rate_config_00),
               CONCAT31(extraout_var_02,_Var2) != 0)) {
              new_rate_cfg_array[3] = rate_config_00;
            }
            break;
          default:
            uStack148 = rc_new_random_rate(rc_ss);
          }
          cVar13 = cVar13 + '\x01';
        } while (cVar13 != '\x06');
        rate_config = rc_ss->no_samples;
        uVar12 = 1;
        uVar7 = 0;
        while (uVar12 < rate_config) {
          puVar6 = &rc_ss->last_rc_time + uVar12 * 3;
          if ((((*(short *)(puVar6 + 2) < 0) && (*(byte *)(puVar6 + 3) < 0xb)) ||
              ((uint)rc_ss->retry[0].idx == uVar12)) ||
             ((((uint)rc_ss->retry[1].idx == uVar12 || ((uint)rc_ss->retry[2].idx == uVar12)) ||
              (5 < uVar7)))) {
            uVar12 = uVar12 + 1 & 0xffff;
          }
          else {
            rate_config_00 = (&uStack148)[uVar7];
            if (rate_config_00 != 0xffff) {
              uVar4 = 0;
              puVar11 = &rc_ss->rate_stats[0].rate_config;
              while (uVar4 < rate_config) {
                if (*puVar11 == rate_config_00) goto LAB_23008d8e;
                uVar4 = uVar4 + 1;
                puVar11 = puVar11 + 6;
              }
              *(uint16_t *)((int)puVar6 + 10) = rate_config_00;
              *(undefined2 *)(puVar6 + 2) = 0;
              *(undefined *)((int)puVar6 + 0xd) = 0;
              uVar12 = uVar12 + 1 & 0xffff;
            }
LAB_23008d8e:
            uVar7 = uVar7 + 1;
          }
          *(undefined2 *)(puVar6 + 1) = 0;
          *(undefined2 *)((int)puVar6 + 6) = 0;
        }
        *(undefined4 *)rc_ss->rate_stats = 0;
        goto LAB_23008c54;
      }
      prVar5 = rc_ss->rate_stats;
      rate_config_01 = 0;
      while (rate_config != rate_config_01) {
        rate_config_01 = rate_config_01 + 1;
        prVar5->attempts = 0;
        prVar5->success = 0;
        prVar5 = prVar5 + 1;
      }
    }
  }
  else {
    bVar1 = rc_ss->info;
    uVar12 = 0;
    if ((bVar1 & 0x20) != 0) {
      while (uVar8 = (uint16_t)uVar12, uVar12 < uVar7) {
        if (rc_ss->rate_stats[uVar12].rate_config == rate_config_00) goto LAB_23008de8;
        uVar12 = uVar12 + 1 & 0xff;
      }
      if (uVar7 == uVar12) {
        uVar12 = uVar12 - 1 & 0xff;
        uVar8 = (uint16_t)uVar12;
        *(uint16_t *)((int)(&rc_ss->last_rc_time + uVar12 * 3) + 10) = rate_config_00;
        *(undefined2 *)(&rc_ss->last_rc_time + uVar12 * 3 + 2) = 0;
      }
LAB_23008de8:
      rc_ss->retry[0].idx = uVar8;
      rc_ss->retry[1].idx = uVar8;
      rc_ss->retry[2].idx = uVar8;
      rc_ss->retry[0].tp = 0;
      rc_ss->retry[1].tp = 0;
      rc_ss->retry[2].tp = 0;
      prVar5 = rc_ss->rate_stats;
      uVar12 = 0;
      while (uVar7 != uVar12) {
        prVar5->attempts = 0;
        prVar5->success = 0;
        uVar12 = uVar12 + 1 & 0xffff;
        prVar5 = prVar5 + 1;
      }
      rc_ss->info = bVar1 & 0x9f | 0x40;
      init = true;
      goto LAB_23008c54;
    }
    uVar7 = (uint)*(byte *)&rc_ss->retry[0].idx;
    rc_calc_prob_ewma(rc_ss->rate_stats + uVar7);
    *(undefined2 *)(&rc_ss->last_rc_time + uVar7 * 3 + 1) = 0;
    *(undefined2 *)((int)(&rc_ss->last_rc_time + uVar7 * 3) + 6) = 0;
    *(undefined4 *)rc_ss->rate_stats = 0;
  }
  init = false;
LAB_23008c54:
  puVar10 = &rc_ss->retry[0].idx;
  puVar11 = new_rate_cfg_array;
  do {
    if (puVar11[6] != *puVar10) {
      return true;
    }
    puVar10 = puVar10 + 4;
    puVar11 = puVar11 + 4;
  } while (puVar10 != &(rc_ss->max_tp_2_trial).idx);
  return init;
}



