pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rc_init(sta_info_tag *sta_entry)

{
  byte bVar1;
  ushort uVar2;
  uint uVar3;
  step *psVar4;
  uint8_t uVar5;
  uint8_t uVar6;
  _Bool _Var7;
  byte bVar8;
  uint16_t rate_map;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined3 extraout_var_05;
  undefined3 extraout_var_06;
  undefined2 extraout_var_07;
  int iVar9;
  short sVar10;
  uint *puVar11;
  uint *puVar12;
  uint uVar13;
  ushort *puVar14;
  uint uVar15;
  uint uVar16;
  rc_sta_stats *__s;
  txl_buffer_control *ptVar17;
  uint uVar18;
  rc_sta_stats *rc_ss;
  uint uVar19;
  uint8_t *mcs_set;
  ushort *puVar20;
  
  bVar8 = sta_entry->staid;
  ptVar17 = (sta_entry->pol_tbl).buf_ctrl;
  if (9 < bVar8) {
    assert_err("sta_entry->staid < NX_REMOTE_STA_MAX","module",0x85f);
  }
  uVar16 = (uint)sta_entry->staid;
  __s = sta_stats + uVar16;
  (sta_entry->pol_tbl).sta_stats = __s;
  uVar5 = phy_get_ntx();
  uVar18 = CONCAT31(extraout_var,uVar5) << 0xe;
  memset(__s,0,200);
  if (((sta_entry->info).capa_flags & 2) == 0) {
    rate_map = me_legacy_rate_bitfield_build((mac_rateset *)&sta_entry->info,false);
    sta_stats[uVar16].rate_map_l = rate_map;
    uVar5 = me_legacy_ridx_min(rate_map);
    sta_stats[uVar16].r_idx_min = uVar5;
    if (0xb < CONCAT31(extraout_var_05,uVar5)) {
      assert_err("rc_ss->r_idx_min < MAC_RATESET_LEN","module",0x8f4);
    }
    uVar5 = me_legacy_ridx_max(sta_stats[uVar16].rate_map_l);
    sta_stats[uVar16].r_idx_max = uVar5;
    if (0xb < CONCAT31(extraout_var_06,uVar5)) {
      assert_err("rc_ss->r_idx_max < MAC_RATESET_LEN","module",0x8f6);
    }
    sta_stats[uVar16].mcs_max = -1;
    uVar5 = (sta_entry->info).bw_cur;
    sta_stats[uVar16].bw_max = uVar5;
    if (uVar5 != '\0') {
      assert_err("rc_ss->bw_max == BW_20MHZ","module",0x8f9);
    }
    sta_stats[uVar16].p_type = (byte)((int)(uint)(sta_entry->pol_tbl).ppdu_tx_cfg >> 10) & 1;
  }
  else {
    rate_map = me_legacy_rate_bitfield_build((mac_rateset *)&sta_entry->info,false);
    mcs_set = (sta_entry->info).ht_cap.mcs_rate;
    sta_stats[uVar16].format_mod = '\x02';
    sta_stats[uVar16].rate_map_l = rate_map;
    uVar5 = me_11n_nss_max(mcs_set);
    uVar6 = me_11n_nss_max(me_env.ht_cap.mcs_rate);
    uVar19 = CONCAT31(extraout_var_00,uVar5);
    if (CONCAT31(extraout_var_01,uVar6) < CONCAT31(extraout_var_00,uVar5)) {
      uVar19 = CONCAT31(extraout_var_01,uVar6);
    }
    sta_stats[uVar16].no_ss = (uint8_t)uVar19;
    if (3 < uVar19) {
      assert_err("rc_ss->no_ss <= 3","module",0x8a6);
    }
    memcpy(&sta_stats[uVar16].rate_map,mcs_set,4);
    rate_map = sta_stats[uVar16].rate_map_l;
    *(undefined *)&sta_stats[uVar16].rate_map = 0xff;
    sta_stats[uVar16].mcs_max = '\a';
    uVar5 = me_legacy_ridx_min(rate_map);
    sta_stats[uVar16].r_idx_min = uVar5;
    if (0xc < CONCAT31(extraout_var_02,uVar5)) {
      assert_err("(rc_ss->r_idx_min <= HW_RATE_54MBPS) || (rc_ss->r_idx_min == MAC_RATESET_LEN)",
                 "module",0x8b8);
    }
    uVar5 = me_legacy_ridx_max(sta_stats[uVar16].rate_map_l);
    sta_stats[uVar16].r_idx_max = uVar5;
    if (0xc < CONCAT31(extraout_var_03,uVar5)) {
      assert_err("(rc_ss->r_idx_max <= HW_RATE_54MBPS) || (rc_ss->r_idx_max == MAC_RATESET_LEN)",
                 "module",0x8be);
    }
    sta_stats[uVar16].p_type = (byte)((int)(uint)(sta_entry->pol_tbl).ppdu_tx_cfg >> 10) & 1;
    _Var7 = phy_ldpc_tx_supported();
    uVar2 = (sta_entry->info).ht_cap.ht_capa_info;
    if ((CONCAT31(extraout_var_04,_Var7) != 0) && ((uVar2 & 1) != 0)) {
      uVar18 = uVar18 | 0x40;
    }
    if ((int)((uint)uVar2 << 0x14) < 0) {
      sVar10 = 0x2000;
    }
    else {
      sVar10 = 0x1000;
    }
    sta_stats[uVar16].max_amsdu_len = sVar10 - 0x101;
    bVar1 = (sta_entry->info).bw_cur;
    sta_stats[uVar16].bw_max = bVar1;
    if (3 < bVar1) {
      assert_err("rc_ss->bw_max <= BW_160MHZ","module",0x8d5);
    }
    uVar5 = (sta_entry->info).bw_cur;
    if (uVar5 == '\0') {
      if (((sta_entry->info).ht_cap.ht_capa_info & 0x20) != 0) {
        uVar5 = '\x01';
        goto LAB_2300909a;
      }
    }
    else {
      if ((uVar5 == '\x01') && (((sta_entry->info).ht_cap.ht_capa_info & 0x40) != 0)) {
LAB_2300909a:
        sta_stats[uVar16].short_gi = uVar5;
      }
    }
  }
  if (sta_stats[uVar16].format_mod < 2) {
    uVar19 = (uint)sta_stats[uVar16].rate_map_l;
    uVar15 = 1 - (uint)sta_stats[uVar16].p_type;
    uVar13 = (((int)uVar19 >> 1 & 1U) + ((int)uVar19 >> 2 & 1U) << (uVar15 & 0x1f)) + (uVar19 & 1) +
             (((int)uVar19 >> 3 & 1U) << (uVar15 & 0x1f)) & 0xffff;
    uVar15 = 4;
    do {
      uVar3 = uVar15 & 0x1f;
      uVar15 = uVar15 + 1;
      uVar13 = uVar13 + ((int)uVar19 >> uVar3 & 1U) & 0xffff;
    } while (uVar15 != 0xc);
LAB_230091b4:
    if (10 < uVar13) {
      sta_stats[uVar16].no_samples = 10;
      goto LAB_230091c8;
    }
    sta_stats[uVar16].no_samples = (uint16_t)uVar13;
    if (uVar13 != 0) goto LAB_230091c8;
  }
  else {
    if (sta_stats[uVar16].format_mod < 4) {
      uVar19 = (uint)*(byte *)&sta_stats[uVar16].rate_map;
      iVar9 = 8;
      uVar15 = 0;
      do {
        uVar13 = uVar19 & 1;
        iVar9 = iVar9 + -1;
        uVar19 = uVar19 >> 1;
        uVar15 = uVar15 + (1 << ((uint)sta_stats[uVar16].short_gi & 0x1f)) * uVar13 & 0xffff;
      } while (iVar9 != 0);
      uVar13 = (uint)sta_stats[uVar16].rate_map_l;
      uVar19 = 1 - (uint)sta_stats[uVar16].p_type;
      uVar13 = uVar15 + (((int)uVar13 >> 1 & 1U) + ((int)uVar13 >> 2 & 1U) << (uVar19 & 0x1f)) +
                        (uVar13 & 1) + (((int)uVar13 >> 3 & 1U) << (uVar19 & 0x1f)) & 0xffff;
      goto LAB_230091b4;
    }
    sta_stats[uVar16].no_samples = 0;
  }
  assert_err("rc_ss->no_samples >= 1","module",0x8ff);
  if (10 < sta_stats[uVar16].no_samples) {
    assert_err("rc_ss->no_samples <= RC_MAX_N_SAMPLE","module",0x900);
  }
LAB_230091c8:
  rc_ss = sta_info_tab[sta_entry->staid].pol_tbl.sta_stats;
  if (rc_ss == (rc_sta_stats *)0x0) {
    assert_err("rc_ss != NULL","module",0x6e4);
  }
  uVar2 = rc_ss->no_samples;
  puVar20 = &rc_ss->rate_stats[0].rate_config;
  uVar19 = 0;
  puVar14 = puVar20;
  while (uVar19 != (uint)uVar2) {
    *puVar14 = 0xffff;
    uVar19 = uVar19 + 1 & 0xffff;
    puVar14 = puVar14 + 6;
  }
  rate_map = rc_get_lowest_rate_config(rc_ss);
  rc_ss->rate_stats[0].rate_config = rate_map;
  rate_map = rc_get_initial_rate_config(rc_ss);
  rc_ss->rate_stats[uVar19 - 1].rate_config = rate_map;
  uVar19 = 1;
LAB_23009232:
  do {
    uVar2 = rc_ss->no_samples;
    if ((int)((uint)uVar2 - 1) <= (int)uVar19) {
      rc_ss->retry[0].idx = (uint16_t)((uint)uVar2 - 1);
      rc_ss->retry[2].idx = uVar2 - 3;
      rc_ss->avg_ampdu_len = 0x10000;
      rc_ss->retry[1].idx = uVar2 - 2;
      rc_ss->fixed_rate_cfg = 0xffff;
      rc_ss->retry[0].tp = 0;
      rc_ss->retry[1].tp = 0;
      rc_ss->retry[2].tp = 0;
      rc_ss->retry[3].idx = 0;
      rc_ss->retry[3].tp = 0;
      rc_ss->info = '\0';
      rc_update_stats(rc_ss,true);
      rc_ss->sample_wait = '\x05';
      puVar11 = (uint *)(ptVar17->field_0 + 0x14);
      do {
        psVar4 = __s->retry;
        puVar12 = puVar11 + 1;
        __s = (rc_sta_stats *)&__s->rate_stats[0].probability;
        *puVar11 = (uint)sta_stats[uVar16].rate_stats[*(byte *)&psVar4->idx].rate_config |
                   0x80000000;
        puVar11 = puVar12;
      } while (puVar12 != (uint *)(ptVar17->field_0 + 0x24));
      sta_stats[uVar16].last_rc_time = _DAT_44b00120;
      *(undefined4 *)ptVar17->field_0 = 0xbadcab1e;
      *(uint *)(ptVar17->field_0 + 0xc) = ((uint)bVar8 + 8 & 0xff) << 10;
      *(undefined4 *)(ptVar17->field_0 + 0x10) = 0xffff0704;
      *(uint *)(ptVar17->field_0 + 4) = uVar18;
      bVar8 = phy_get_ntx();
      *(int *)(ptVar17->field_0 + 8) = (1 << ((uint)bVar8 + 1 & 0x1f)) + -1;
      ((sta_entry->pol_tbl).buf_ctrl)->mac_control_info = 0x2200;
      ((sta_entry->pol_tbl).buf_ctrl)->phy_control_info = sta_entry->paid_gid;
      (sta_entry->pol_tbl).upd_field = (sta_entry->pol_tbl).upd_field | 0x11;
      return;
    }
    rate_map = rc_new_random_rate(rc_ss);
    uVar15 = 0;
    puVar14 = puVar20;
    while (uVar15 < rc_ss->no_samples) {
      if ((uint)*puVar14 == CONCAT22(extraout_var_07,rate_map)) goto LAB_23009232;
      uVar15 = uVar15 + 1;
      puVar14 = puVar14 + 6;
    }
    rc_ss->rate_stats[uVar19].rate_config = rate_map;
    uVar19 = uVar19 + 1 & 0xffff;
  } while( true );
}



