pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rc_check(uint8_t sta_idx,_Bool *tx_ampdu)

{
  ushort uVar1;
  ushort uVar2;
  ushort rate_config;
  ushort rate_config_00;
  uint16_t uVar3;
  bool bVar4;
  rc_sta_stats *rc_ss;
  uint uVar5;
  _Bool _Var6;
  uint8_t uVar7;
  uint8_t uVar8;
  undefined3 in_register_00002029;
  uint uVar9;
  undefined3 extraout_var;
  uint uVar10;
  uint32_t uVar11;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint32_t uVar12;
  byte bVar13;
  uint32_t *puVar14;
  uint uVar15;
  int iVar16;
  uint uVar17;
  uint uVar18;
  
  uVar9 = CONCAT31(in_register_00002029,sta_idx);
  if (9 < uVar9) {
    return;
  }
  rc_ss = sta_info_tab[uVar9].pol_tbl.sta_stats;
  if (rc_ss == (rc_sta_stats *)0x0) {
    assert_err("rc_ss != NULL","module",0x826);
  }
  iVar16 = 0;
  if ((int)((100000 - _DAT_44b00120) + rc_ss->last_rc_time) < 0) {
    _Var6 = rc_update_stats(rc_ss,false);
    iVar16 = CONCAT31(extraout_var,_Var6);
    rc_ss->trial_status = '\0';
    rc_ss->sw_retry_step = '\0';
    rc_ss->info = rc_ss->info & 0xef;
    rc_ss->last_rc_time = _DAT_44b00120;
  }
  if (rc_ss->trial_status == '\x01') {
    if ((rc_ss->info & 0x40) == 0) {
      bVar13 = rc_ss->format_mod;
      uVar1 = rc_ss->retry[0].idx;
      uVar15 = (uint)uVar1;
      if (bVar13 < 2) {
        if ((ushort)(rc_ss->rate_stats[uVar15].probability + 0xe667) < 0xd99b) {
          uVar7 = '\n';
        }
        else {
          uVar7 = '\x05';
        }
      }
      else {
        uVar7 = ((char)*(undefined2 *)((int)&rc_ss->avg_ampdu_len + 2) + '\b') * '\x02';
      }
      rc_ss->sample_wait = uVar7;
      next = next * 0x41c64e6d + 0x3039;
      uVar5 = (next >> 0x10) % (uint)rc_ss->no_samples;
      if (uVar5 != uVar15) {
        uVar2 = rc_ss->retry[1].idx;
        if (((uVar5 != (uint)uVar2) && (uVar18 = (uint)rc_ss->retry[2].idx, uVar5 != uVar18)) &&
           (puVar14 = &rc_ss->last_rc_time + uVar5 * 3, *(ushort *)(puVar14 + 2) < 0xf334)) {
          rate_config = *(ushort *)((int)puVar14 + 10);
          uVar10 = rc_get_duration((uint)rate_config);
          rate_config_00 = rc_ss->rate_stats[uVar15].rate_config;
          if (bVar13 < 2) {
            uVar15 = rc_get_duration((uint)rate_config_00);
            if (uVar15 < uVar10) {
              uVar11 = 0;
              bVar4 = 0x13 < *(byte *)(puVar14 + 3);
            }
            else {
              uVar11 = 0;
              bVar4 = true;
            }
          }
          else {
            uVar17 = 0x20;
            uVar15 = rc_get_duration((uint)rc_ss->rate_stats[(uint)uVar2].rate_config);
            if (*(char *)((int)puVar14 + 0xd) == '\0') {
              uVar17 = (uint)*(ushort *)((int)&rc_ss->avg_ampdu_len + 2);
            }
            if (uVar15 <= uVar10) {
              uVar7 = rc_get_nss(rate_config_00);
              uVar8 = rc_get_nss(rate_config);
              if ((CONCAT31(extraout_var_00,uVar7) - 1U < CONCAT31(extraout_var_01,uVar8)) ||
                 (uVar15 = rc_get_duration((uint)rc_ss->rate_stats[uVar18].rate_config),
                 uVar15 <= uVar10)) {
                if (uVar17 <= *(byte *)(puVar14 + 3)) {
                  bVar13 = rc_ss->sample_slow + 1;
                  rc_ss->sample_slow = bVar13;
                  if (bVar13 < 3) goto LAB_2300964c;
                  if (0xf < bVar13) {
                    rc_ss->sample_slow = '\x0f';
                  }
                }
                goto LAB_23009626;
              }
            }
LAB_2300964c:
            uVar11 = rc_calc_tp(rc_ss,(uint8_t)uVar5);
            bVar4 = true;
            if ((*(byte *)((int)puVar14 + 0xe) & 0xf) < 10) {
              bVar4 = uVar17 <= *(byte *)(puVar14 + 3);
            }
          }
          uVar12 = rc_ss->retry[1].tp;
          (rc_ss->max_tp_2_trial).idx = uVar2;
          (rc_ss->max_tp_2_trial).tp = uVar12;
          if (bVar4) {
            uVar12 = rc_ss->retry[0].tp;
            rc_ss->info = rc_ss->info & 0xfd;
            rc_ss->retry[1].tp = uVar12;
            rc_ss->retry[1].idx = uVar1;
            rc_ss->retry[0].tp = uVar11;
            rc_ss->retry[0].idx = (uint16_t)uVar5;
          }
          else {
            rc_ss->info = rc_ss->info | 2;
            rc_ss->retry[1].tp = uVar11;
            rc_ss->retry[1].idx = (uint16_t)uVar5;
          }
          rc_ss->trial_status = '\x02';
          goto LAB_2300958c;
        }
      }
    }
LAB_23009626:
    rc_ss->trial_status = '\0';
  }
  else {
    if (rc_ss->trial_status == '\x03') {
      if ((rc_ss->info & 2) == 0) {
        rc_ss->retry[0].idx = rc_ss->retry[1].idx;
        rc_ss->retry[0].tp = rc_ss->retry[1].tp;
      }
      uVar3 = (rc_ss->max_tp_2_trial).idx;
      rc_ss->trial_status = '\0';
      rc_ss->retry[1].idx = uVar3;
      uVar11 = (rc_ss->max_tp_2_trial).tp;
      (rc_ss->max_tp_2_trial).tp = 0;
      rc_ss->retry[1].tp = uVar11;
      (rc_ss->max_tp_2_trial).idx = 0xff;
      goto LAB_2300958c;
    }
  }
  if (iVar16 == 0) {
    return;
  }
LAB_2300958c:
  sta_info_tab[uVar9].pol_tbl.upd_field = sta_info_tab[uVar9].pol_tbl.upd_field | 1;
  return;
}



uint8_t rxu_cntrl_machdr_len_get(uint16_t frame_cntl)

{
  uint8_t uVar1;
  
  uVar1 = '\x18';
  if ((frame_cntl & 0x300) == 0x300) {
    uVar1 = '\x1e';
  }
  if ((frame_cntl & 0xfc) == 0x88) {
    uVar1 = uVar1 + '\x02';
  }
  if ((short)frame_cntl < 0) {
    uVar1 = uVar1 + '\x04';
  }
  return uVar1;
}



_Bool rxu_cntrl_protected_handle(uint8_t *frame,uint32_t statinfo)

{
  ushort *puVar1;
  uint uVar2;
  vif_info_tag *pvVar3;
  int iVar4;
  
  uVar2 = statinfo & 0x1c;
  puVar1 = (ushort *)(frame + DAT_4201b9d0);
  if (uVar2 == 0x18) {
    DAT_4201b9d0 = DAT_4201b9d0 + 8;
    DAT_4201b9dc = (uint)puVar1[3];
    DAT_4201b9d8 = (uint)puVar1[2] << 0x10 | (uint)*(byte *)(puVar1 + 1) |
                   ((uint)*puVar1 & 0xff) << 8;
    DAT_4201b9f8 = DAT_4201b9f8 | 3;
    if ((statinfo & 0x400) == 0) {
      iVar4 = (uint)DAT_4201b9d1 * 0x1b0 + 0x40;
      pvVar3 = (vif_info_tag *)sta_info_tab;
    }
    else {
      iVar4 = (uint)(puVar1[1] >> 0xe) * 0x68 + (uint)DAT_4201b9d2 * 0x5d8 + 0x420;
      pvVar3 = vif_info_tab;
    }
    key = (key_info_tag *)((int)&(pvVar3->list_hdr).next + iVar4);
  }
  else {
    if (uVar2 == 0x1c) {
      if ((statinfo & 0x400) == 0) {
        iVar4 = (uint)DAT_4201b9d1 * 0x1b0 + 0x40;
        pvVar3 = (vif_info_tag *)sta_info_tab;
      }
      else {
        iVar4 = (uint)(puVar1[1] >> 0xe) * 0x68 + (uint)DAT_4201b9d2 * 0x5d8 + 0x420;
        pvVar3 = vif_info_tab;
      }
      key = (key_info_tag *)((int)&(pvVar3->list_hdr).next + iVar4);
      DAT_4201b9d0 = DAT_4201b9d0 + 8;
      DAT_4201b9dc = (uint)puVar1[3];
      DAT_4201b9d8 = CONCAT22(puVar1[2],*puVar1);
      DAT_4201b9f8 = DAT_4201b9f8 | 2;
    }
    else {
      if (uVar2 != 0x14) {
        return false;
      }
      DAT_4201b9d0 = DAT_4201b9d0 + 4;
    }
  }
  return true;
}


