pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'rxu_mpdu_upload_and_indicate'
Cause: Exception while decompiling 23009828: Decompiler process died

*/


undefined4 rxu_mgt_frame_check(rx_swdesc *param_1,uint param_2)

{
  char cVar1;
  ushort length;
  bool bVar2;
  ushort uVar3;
  int8_t iVar4;
  ushort *bcn_addr;
  ushort uVar5;
  _Bool _Var6;
  ke_state_t kVar7;
  undefined3 extraout_var;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  undefined3 extraout_var_00;
  undefined2 *puVar8;
  byte sta_idx;
  byte bw;
  uint8_t nss;
  co_list_hdr cVar9;
  char *pcVar10;
  uint uVar11;
  uint uVar12;
  ke_task_id_t dest_id;
  rx_dmadesc *prVar13;
  uint uVar14;
  vif_info_tag *vif;
  int8_t iStack73;
  phy_channel_info apStack72 [2];
  
  sta_idx = (byte)param_2;
  prVar13 = param_1->dma_hdrdesc;
  iStack73 = '\0';
  bcn_addr = *(ushort **)((prVar13->hd).first_pbd_ptr + 0x18);
  length = *bcn_addr;
  if ((length & 0x400) != 0) {
    return 1;
  }
  if ((*(byte *)(bcn_addr + 0xb) & 0xf) != 0) {
    return 1;
  }
  if ((param_2 == 0xff) && (DAT_4201b9d2 = 0xff, ((prVar13->hd).statinfo & 0x600) == 0)) {
    cVar9 = (co_list_hdr)vif_mgmt_env.used_list.first;
    if (((length == 0xb0) || (bVar2 = true, length == 0)) &&
       ((((bVar2 = true, *(char *)(bcn_addr + 2) == *(char *)(bcn_addr + 8) &&
          (*(char *)((int)bcn_addr + 5) == *(char *)((int)bcn_addr + 0x11))) &&
         (*(char *)(bcn_addr + 3) == *(char *)(bcn_addr + 9))) &&
        ((*(char *)((int)bcn_addr + 7) == *(char *)((int)bcn_addr + 0x13) &&
         (*(char *)(bcn_addr + 4) == *(char *)(bcn_addr + 10))))))) {
      bVar2 = *(char *)((int)bcn_addr + 9) != *(char *)((int)bcn_addr + 0x15);
    }
    while (DAT_4201b9d2 = sta_idx, cVar9 != (co_list_hdr)0x0) {
      if (((*(char *)&((co_list_hdr *)((int)cVar9 + 0x50))->next == *(char *)(bcn_addr + 2)) &&
          (*(char *)((int)cVar9 + 0x51) == *(char *)((int)bcn_addr + 5))) &&
         ((*(char *)((int)cVar9 + 0x52) == *(char *)(bcn_addr + 3) &&
          (((*(char *)((int)cVar9 + 0x53) == *(char *)((int)bcn_addr + 7) &&
            (*(char *)&((co_list_hdr *)((int)cVar9 + 0x54))->next == *(char *)(bcn_addr + 4))) &&
           (*(char *)((int)cVar9 + 0x55) == *(char *)((int)bcn_addr + 9))))))) {
        if (*(char *)((int)cVar9 + 0x56) == '\0') {
          if (bVar2) {
LAB_23009a66:
            DAT_4201b9d2 = *(byte *)((int)cVar9 + 0x57);
            break;
          }
        }
        else {
          if ((*(char *)((int)cVar9 + 0x56) == '\x02') && (!bVar2)) goto LAB_23009a66;
        }
      }
      cVar9 = *(co_list_hdr *)cVar9;
    }
  }
  phyif_utils_decode((phyif_utils_recvtable_t *)&(prVar13->hd).recvec1a,&iStack73);
  iVar4 = iStack73;
  bw = DAT_4201b9d0;
  uVar3 = *bcn_addr;
  uVar14 = (uint)DAT_4201b9d0;
  uVar11 = (uint)DAT_4201b9d2;
  length = (prVar13->hd).frmlen;
  uVar12 = (uint)length;
  if (DAT_4201b9d2 == 0xff) {
    if (param_2 != uVar11) {
      DAT_4201b9d2 = sta_info_tab[param_2].inst_nbr;
      uVar11 = (uint)DAT_4201b9d2;
      goto LAB_23009ab4;
    }
    nss = '\x04';
    vif = (vif_info_tag *)0x0;
  }
  else {
LAB_23009ab4:
    vif = vif_info_tab + uVar11;
    nss = vif_info_tab[uVar11].type;
  }
  uVar5 = uVar3 & 0xfc;
  if (uVar5 == 0x50) {
    if (vif == (vif_info_tag *)0x0) goto LAB_23009af0;
    bVar2 = true;
    dest_id = 4;
    goto LAB_23009c10;
  }
  if (uVar5 < 0x51) {
    if (uVar5 == 0x20) {
LAB_23009b3e:
      _Var6 = apm_embedded_enabled(vif);
      if (CONCAT31(extraout_var,_Var6) == 0) {
LAB_23009af0:
        rxu_mpdu_upload_and_indicate(param_1);
        return 1;
      }
LAB_23009c0c:
      bVar2 = true;
      dest_id = 7;
      goto LAB_23009c10;
    }
    if (uVar5 < 0x21) {
      if ((uVar3 & 0xfc) == 0) goto LAB_23009b3e;
      if (uVar5 != 0x10) goto LAB_23009af0;
    }
    else {
      if (uVar5 != 0x30) {
        if (uVar5 != 0x40) goto LAB_23009af0;
        goto LAB_23009b3e;
      }
    }
    if (nss != '\0') goto LAB_23009af0;
  }
  else {
    if (uVar5 != 0xb0) {
      if (0xb0 < uVar5) {
        if (uVar5 != 0xc0) {
          if ((uVar5 != 0xd0) || (pcVar10 = (char *)((int)bcn_addr + uVar14), param_2 == 0xff))
          goto LAB_23009af0;
          cVar1 = *pcVar10;
          if (cVar1 == '\a') {
            if (pcVar10[1] == '\0') {
              if ((sta_info_tab[param_2].info.capa_flags & 2) == 0) {
                return 0;
              }
              bw = pcVar10[2];
              nss = -1;
              if (1 < bw) {
                return 0;
              }
            }
            else {
              if (pcVar10[1] != '\x01') goto LAB_23009af0;
              if ((sta_info_tab[param_2].info.capa_flags & 2) == 0) {
                return 0;
              }
              nss = -1;
              if ((pcVar10[2] & 1U) != 0) {
                nss = '\0';
              }
              bw = 0xff;
            }
            me_sta_bw_nss_max_upd(sta_idx,bw,nss);
            return 0;
          }
          if (cVar1 == '\b') {
            if ((int)(uVar12 - uVar14) < 4) {
              return 0;
            }
            if ((DAT_4201b9d2 == 0xff) ||
               ((byte)(vif_info_tab[DAT_4201b9d2].type | pcVar10[1]) != 0)) goto LAB_23009af0;
            dest_id = 6;
          }
          else {
            if (cVar1 != '\x03') goto LAB_23009af0;
            dest_id = 8;
          }
          bVar2 = false;
          goto LAB_23009c10;
        }
LAB_23009b64:
        if (param_2 == 0xff) {
          return 0;
        }
        goto LAB_23009b6e;
      }
      if (uVar5 != 0x80) {
        if (uVar5 != 0xa0) goto LAB_23009af0;
        goto LAB_23009b64;
      }
      kVar7 = ke_state_get(4);
      bVar2 = CONCAT22(extraout_var_01,kVar7) != 1;
      if (bVar2) {
        dest_id = 0xff;
      }
      else {
        dest_id = 4;
      }
      bVar2 = !bVar2;
      if (param_2 != 0xff) {
        if (vif->active != false) {
          me_beacon_check(DAT_4201b9d2,length,(uint32_t)bcn_addr);
        }
LAB_23009be6:
        if (dest_id != 0xff) goto LAB_23009c10;
        goto LAB_23009af0;
      }
      kVar7 = ke_state_get(4);
      if ((CONCAT22(extraout_var_02,kVar7) == 1) ||
         (_Var6 = apm_embedded_enabled(vif), CONCAT31(extraout_var_00,_Var6) == 0))
      goto LAB_23009be6;
      goto LAB_23009c0c;
    }
LAB_23009b6e:
    if (nss != '\0') goto LAB_23009b3e;
  }
  bVar2 = false;
  dest_id = 6;
LAB_23009c10:
  puVar8 = (undefined2 *)
           ke_msg_alloc(0x2c00,dest_id,0xb,(uint16_t)((uVar12 + 0x1c) * 0x10000 >> 0x10));
  if (puVar8 != (undefined2 *)0x0) {
    phy_get_channel(apStack72,'\0');
    if (!bVar2) {
      if ((bw & 1) != 0) {
        assert_warn("(machdr_length & 0x1) == 0","module",0x64d);
      }
      uVar12 = uVar12 - uVar14 & 0xffff;
      bcn_addr = (ushort *)((int)bcn_addr + uVar14);
    }
    *puVar8 = (short)uVar12;
    uVar11 = 0;
    while (bw = DAT_4201b9d2, (uVar12 + 3 & 0xfffffffc) != uVar11) {
      *(undefined4 *)((int)puVar8 + uVar11 + 0x1c) = *(undefined4 *)((int)bcn_addr + uVar11);
      uVar11 = uVar11 + 4;
    }
    puVar8[1] = uVar3;
    *(byte *)((int)puVar8 + 7) = sta_idx;
    *(byte *)(puVar8 + 4) = bw;
    *(int8_t *)(puVar8 + 0xd) = iVar4;
    *(int8_t *)((int)puVar8 + 0x19) = iVar4;
    puVar8[2] = (short)(apStack72[0].info1 >> 0x10);
    *(char *)(puVar8 + 3) = (char)apStack72[0].info1;
    *(undefined *)(puVar8 + 0xc) = *(undefined *)((int)&(prVar13->hd).recvec1c + 3);
    if ((dest_id == 7) && ((uVar3 & 0xfc) == 0)) {
      *(uint32_t *)(puVar8 + 8) = (prVar13->hd).tsflo;
      *(uint32_t *)(puVar8 + 10) = (prVar13->hd).tsfhi;
      *(byte *)((int)puVar8 + 0x1b) = (byte)((prVar13->hd).recvec1a >> 0xc) & 0xf;
    }
    ke_msg_send(puVar8);
  }
  return 0;
}



void rxu_cntrl_init(void)

{
  co_list_init((co_list *)&swdesc);
  co_list_init((co_list *)&DAT_4201ba00);
  co_list_init((co_list *)&DAT_4201ba14);
  co_list_init((co_list *)&DAT_4201ba1c);
  DAT_4201ba2a = 0xffff;
  return;
}


