pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'rxu_cntrl_frame_handle'
Cause: Exception while decompiling 23009dea: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rxu_cntrl_monitor_pm(mac_addr *addr)

{
  if (DAT_4201ba37 == '\0') {
    _DAT_4201ba30 = addr->array[0];
    _DAT_4201ba32 = addr->array[1];
    _DAT_4201ba34 = addr->array[2];
    _DAT_4201ba36 = 0x100;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t rxu_cntrl_get_pm(void)

{
  _DAT_4201ba36 = 0;
  return DAT_4201ba36;
}



void rxu_cntrl_evt(int dummy)

{
  ke_evt_clear(0x80000);
  if (swdesc != (rx_swdesc *)0x0) {
    ke_evt_set(0x20000000);
    return;
  }
  return;
}



// WARNING: Variable defined which should be unmapped: pkt

void rxu_swdesc_upload_evt(int arg)

{
  rx_swdesc *swdesc;
  uint uVar1;
  int iVar2;
  uint32_t uVar3;
  uint32_t *puVar4;
  uint32_t *puVar5;
  uint32_t uVar6;
  uint32_t local_48;
  wifi_pkt pkt;
  
  ke_evt_clear(0x20000000);
  swdesc = (rx_swdesc *)co_list_pop_front((co_list *)&swdesc);
  while (swdesc != (rx_swdesc *)0x0) {
    uVar1 = (uint)(swdesc->dma_hdrdesc->hd).frmlen;
    memset(&local_48,0,0x28);
    puVar4 = (uint32_t *)&local_48;
    uVar6 = (swdesc->dma_hdrdesc->hd).first_pbd_ptr;
    puVar5 = puVar4;
    while ((uVar1 != 0 && (puVar5 != pkt.pkt + 3))) {
      swdesc->pbd_count = swdesc->pbd_count + '\x01';
      uVar3 = *(uint32_t *)(uVar6 + 8);
      *puVar5 = uVar3;
      *(short *)(puVar4 + 8) = ((short)*(undefined4 *)(uVar6 + 0xc) + 1) - (short)uVar3;
      puVar5[4] = uVar6 + 0x1c;
      *(undefined4 *)(uVar6 + 0x14) = 1;
      if (uVar1 < 0x350) {
        uVar1 = 0;
      }
      else {
        uVar1 = uVar1 - 0x350;
      }
      uVar6 = *(uint32_t *)(uVar6 + 4);
      puVar5 = puVar5 + 1;
      puVar4 = (uint32_t *)((int)puVar4 + 2);
    }
    swdesc->use_in_tcpip = '\x01';
    swdesc->dma_hdrdesc->use_in_tcpip = 1;
    iVar2 = tcpip_stack_input(swdesc,swdesc->status,&(swdesc->dma_hdrdesc->hd).frmlen,
                              swdesc->dma_hdrdesc->payl_offset,(wifi_pkt *)&local_48);
    if (iVar2 == 0) {
      vTaskEnterCritical();
      rxl_cntrl_env.packet_stack_cnt = rxl_cntrl_env.packet_stack_cnt + swdesc->pbd_count;
      vTaskExitCritical();
    }
    else {
      rxl_mpdu_free(swdesc);
    }
    swdesc = (rx_swdesc *)co_list_pop_front((co_list *)&swdesc);
  }
  return;
}



void scanu_confirm(uint8_t status)

{
  uint8_t *puVar1;
  uint8_t *puVar2;
  
  if (scanu_env.joining == false) {
    puVar2 = (uint8_t *)ke_msg_alloc(0x1001,scanu_env.src_id,4,1);
    puVar1 = (uint8_t *)0x0;
  }
  else {
    puVar2 = (uint8_t *)ke_msg_alloc(0x1003,scanu_env.src_id,4,1);
    puVar1 = (uint8_t *)ke_msg_alloc(0x1003,0xd,4,1);
  }
  *puVar2 = status;
  ke_msg_free(&scanu_env.param[-1].add_ies);
  scanu_env.param = (scanu_start_req *)0x0;
  ke_msg_send(puVar2);
  if (puVar1 != (uint8_t *)0x0) {
    *puVar1 = status;
    ke_msg_send(puVar1);
  }
  ke_state_set(4,0);
  return;
}



void scanu_raw_send_cfm(uint8_t status,ke_task_id_t dst_id)

{
  undefined3 in_register_00002029;
  undefined4 *puVar1;
  
  puVar1 = (undefined4 *)ke_msg_alloc(0x1006,dst_id,4,4);
  *puVar1 = CONCAT31(in_register_00002029,status);
  ke_msg_send();
  return;
}



void scanu_init(void)

{
  ke_state_set(4,0);
  memset(&scanu_env,0,0x194);
  scanu_env.dma_desc.dma_desc = &scanu_add_ie;
  scanu_env.dma_desc.cb = scanu_dma_cb;
  scanu_env.dma_desc.env = (void *)0x0;
  scanu_add_ie.dma_desc.dest = 0x42047ddc;
  return;
}



mac_scan_result * scanu_find_result(mac_addr *bssid_ptr,_Bool allocate)

{
  undefined3 in_register_0000202d;
  mac_scan_result *pmVar1;
  
  pmVar1 = scanu_env.scan_result;
  do {
    if (pmVar1->valid_flag == false) {
      if (CONCAT31(in_register_0000202d,allocate) != 0) {
        return pmVar1;
      }
    }
    else {
      if ((((*(char *)(pmVar1->bssid).array == *(char *)bssid_ptr->array) &&
           (*(char *)((int)(pmVar1->bssid).array + 1) == *(char *)((int)bssid_ptr->array + 1))) &&
          (*(char *)((pmVar1->bssid).array + 1) == *(char *)(bssid_ptr->array + 1))) &&
         (((*(char *)((int)(pmVar1->bssid).array + 3) == *(char *)((int)bssid_ptr->array + 3) &&
           (*(char *)((pmVar1->bssid).array + 2) == *(char *)(bssid_ptr->array + 2))) &&
          (*(char *)((int)(pmVar1->bssid).array + 5) == *(char *)((int)bssid_ptr->array + 5))))) {
        return pmVar1;
      }
    }
    pmVar1 = pmVar1 + 1;
    if (pmVar1 == (mac_scan_result *)&scanu_env.src_id) {
      return (mac_scan_result *)0x0;
    }
  } while( true );
}



// WARNING: Restarted to delay deadcode elimination for space: ram

undefined4 scanu_frame_handler(ushort *param_1)

{
  undefined uVar1;
  uint8_t band;
  _Bool _Var2;
  ushort uVar3;
  scanu_start_req *psVar4;
  sm_connect_req *psVar5;
  uchar uVar6;
  ke_state_t kVar7;
  uint16_t uVar8;
  int iVar9;
  undefined2 extraout_var;
  mac_scan_result *pmVar10;
  scan_chan_tag *psVar11;
  void *__src;
  byte bVar12;
  uint16_t freq;
  uint __n;
  undefined *puVar13;
  uint8_t *puVar14;
  undefined *puVar15;
  uint8_t *rsn_ie;
  SecurityMode_t *security_mode;
  char cVar16;
  uint uVar17;
  uint uVar18;
  mac_bss_info *bss;
  int iVar19;
  Cipher_t *mcstCipher;
  Cipher_t *mcstCipher_00;
  Cipher_t *ucstCipher;
  uint32_t uVar20;
  mac_ssid *pmVar21;
  uint uVar22;
  ushort *buffer;
  mac_rateset *mac_rate_set_ptr;
  Cipher_t *ucstCipher_00;
  undefined uStack100;
  undefined local_63 [47];
  
  psVar4 = scanu_env.param;
  buffer = param_1 + 0x20;
  uVar22 = (uint)(scanu_env.param)->vif_idx;
  iVar9 = mac_ie_find(buffer,(uint)*param_1 - 0x24 & 0xffff,0);
  if (iVar9 != 0) {
    bVar12 = *(byte *)(iVar9 + 1);
    uVar17 = (uint)bVar12;
    if (bVar12 < 0x21) {
      if (bVar12 == 0) goto LAB_2300a9ca;
    }
    else {
      uVar17 = 0x20;
    }
    puVar13 = (undefined *)(iVar9 + 2);
    if (*(char *)(iVar9 + 2) != '\0') {
      uStack100 = (undefined)uVar17;
      puVar15 = &uStack100;
      uVar18 = uVar17;
      while( true ) {
        uVar18 = uVar18 - 1;
        puVar15 = puVar15 + 1;
        if (uVar18 == 0xffffffff) break;
        uVar1 = *puVar13;
        puVar13 = puVar13 + 1;
        *puVar15 = uVar1;
      }
      local_63[uVar17] = 0;
    }
  }
LAB_2300a9ca:
  kVar7 = ke_state_get(4);
  if (((CONCAT22(extraout_var,kVar7) != 1) ||
      (pmVar10 = scanu_find_result((mac_addr *)(param_1 + 0x16),true),
      pmVar10 == (mac_scan_result *)0x0)) ||
     ((((byte)scanu_env.bssid.array[0] & 1) == 0 &&
      (((((*(byte *)(param_1 + 0x16) != (byte)scanu_env.bssid.array[0] ||
          (*(char *)((int)param_1 + 0x2d) != scanu_env.bssid.array[0]._1_1_)) ||
         (*(char *)(param_1 + 0x17) != (char)scanu_env.bssid.array[1])) ||
        ((*(char *)((int)param_1 + 0x2f) != scanu_env.bssid.array[1]._1_1_ ||
         (*(char *)(param_1 + 0x18) != (char)scanu_env.bssid.array[2])))) ||
       (*(char *)((int)param_1 + 0x31) != scanu_env.bssid.array[2]._1_1_)))))) goto LAB_2300b100;
  (pmVar10->bssid).array[0] = param_1[0x16];
  (pmVar10->bssid).array[1] = param_1[0x17];
  (pmVar10->bssid).array[2] = param_1[0x18];
  pmVar10->beacon_period = param_1[0x1e];
  uVar3 = param_1[0x1f];
  pmVar10->cap_info = uVar3;
  freq = uVar3 & 1;
  if ((uVar3 & 1) == 0) {
    freq = 2;
  }
  pmVar10->bsstype = freq;
  uVar3 = *param_1;
  uVar17 = (uint)uVar3 - 0x24 & 0xffff;
  iVar9 = mac_ie_find(buffer,uVar17,0);
  if (iVar9 == 0) {
    (pmVar10->ssid).length = '\0';
  }
  else {
    bVar12 = *(byte *)(iVar9 + 1);
    uVar18 = (uint)bVar12;
    if (bVar12 < 0x21) {
      if (bVar12 == 0) goto LAB_2300aa9e;
    }
    else {
      uVar18 = 0x20;
    }
    rsn_ie = (uint8_t *)(iVar9 + 2);
    if (*(char *)(iVar9 + 2) != '\0') {
      (pmVar10->ssid).length = (uint8_t)uVar18;
      puVar14 = (pmVar10->ssid).array;
      while (uVar18 = uVar18 - 1, uVar18 != 0xffffffff) {
        band = *rsn_ie;
        rsn_ie = rsn_ie + 1;
        *puVar14 = band;
        puVar14 = puVar14 + 1;
      }
    }
  }
LAB_2300aa9e:
  pmVar10->ppm_rel = *(int8_t *)(param_1 + 0xd);
  pmVar10->ppm_abs = *(int8_t *)((int)param_1 + 0x19);
  if (psVar4->ssid_cnt != '\0') {
    uVar18 = 0;
    pmVar21 = psVar4->ssid;
    while ((int)uVar18 < (int)(uint)psVar4->ssid_cnt) {
      if (pmVar21->length == 0) goto LAB_2300ab3c;
      __n = (uint)(pmVar10->ssid).length;
      if ((__n == (uint)pmVar21->length) &&
         (iVar9 = memcmp(pmVar21->array,(pmVar10->ssid).array,__n), iVar9 == 0)) break;
      uVar18 = uVar18 + 1;
      pmVar21 = pmVar21 + 1;
    }
    if ((uint)psVar4->ssid_cnt == uVar18) goto LAB_2300b100;
  }
LAB_2300ab3c:
  iVar9 = mac_ie_find(buffer,uVar17,3);
  if (iVar9 == 0) {
    if (pmVar10->rssi < *(char *)(param_1 + 0xc)) {
      psVar11 = me_freq_to_chan_ptr(*(uint8_t *)(param_1 + 3),param_1[2]);
      pmVar10->chan = psVar11;
      cVar16 = *(char *)(param_1 + 0xc);
      goto LAB_2300ab8c;
    }
  }
  else {
    bVar12 = *(byte *)(iVar9 + 2);
    band = *(uint8_t *)(param_1 + 3);
    if (band == '\0') {
      if ((uint)bVar12 - 1 < 0xe) {
        if (bVar12 == 0xe) {
          freq = 0x9b4;
        }
        else {
          freq = (ushort)bVar12 * 5 + 0x967;
        }
      }
      else {
LAB_2300afea:
        freq = 0xffff;
      }
    }
    else {
      if ((band != '\x01') || (0xa4 < (uint)bVar12 - 1)) goto LAB_2300afea;
      freq = (ushort)bVar12 * 5 + 5000;
    }
    psVar11 = me_freq_to_chan_ptr(band,freq);
    pmVar10->chan = psVar11;
    cVar16 = *(char *)(param_1 + 0xc);
    if (pmVar10->rssi < cVar16) {
LAB_2300ab8c:
      pmVar10->rssi = cVar16;
    }
  }
  if (scanu_env.joining != false) {
    bss = &vif_info_tab[uVar22].bss_info;
    vif_info_tab[uVar22].bss_info.bsstype = pmVar10->bsstype;
    mac_rate_set_ptr = &vif_info_tab[uVar22].bss_info.rate_set;
    *(undefined4 *)vif_info_tab[uVar22].bss_info.bssid.array = *(undefined4 *)(pmVar10->bssid).array
    ;
    vif_info_tab[uVar22].bss_info.bssid.array[2] = (pmVar10->bssid).array[2];
    vif_info_tab[uVar22].bss_info.cap_info = pmVar10->cap_info;
    vif_info_tab[uVar22].bss_info.beacon_period = pmVar10->beacon_period;
    memcpy(&vif_info_tab[uVar22].bss_info.ssid,&pmVar10->ssid,0x22);
    psVar11 = pmVar10->chan;
    vif_info_tab[uVar22].bss_info.valid_flags = 0;
    vif_info_tab[uVar22].bss_info.chan = psVar11;
    vif_info_tab[uVar22].bss_info.ppm_rel = pmVar10->ppm_rel;
    vif_info_tab[uVar22].bss_info.ppm_abs = pmVar10->ppm_abs;
    freq = (uint16_t)(((uint)uVar3 - 0x24) * 0x10000 >> 0x10);
    me_extract_rate_set((uint32_t)buffer,freq,mac_rate_set_ptr);
    if (pmVar10->chan->band == '\0') {
      uVar8 = me_legacy_rate_bitfield_build(mac_rate_set_ptr,true);
      if ((uVar8 & 0xf) == 0) {
        vif_info_tab[uVar22].bss_info.high_11b_rate = '\x01';
      }
      else {
        iVar9 = __clzsi2((uint)uVar8 & 0xf);
        vif_info_tab[uVar22].bss_info.high_11b_rate = '\x1f' - (char)iVar9;
      }
    }
    iVar9 = mac_vsie_find(buffer,uVar17,&DAT_230750d0,5);
    if (iVar9 == 0) {
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[0] = 0xa43;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[1] = 0xa43;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[2] = 0xa43;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[3] = 0xa43;
    }
    else {
      vif_info_tab[uVar22].bss_info.edca_param.qos_info = *(uint8_t *)(iVar9 + 8);
      vif_info_tab[uVar22].bss_info.cap_info = vif_info_tab[uVar22].bss_info.cap_info | 0x200;
      uVar18 = *(uint *)(iVar9 + 10);
      bVar12 = (byte)(uVar18 >> 3) & 2;
      vif_info_tab[uVar22].bss_info.edca_param.acm = bVar12;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[1] = uVar18 & 0xf | (uVar18 >> 8) << 4;
      uVar18 = *(uint *)(iVar9 + 0xe);
      bVar12 = (byte)(uVar18 >> 4) & 1 | bVar12;
      vif_info_tab[uVar22].bss_info.edca_param.acm = bVar12;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[0] = uVar18 & 0xf | (uVar18 >> 8) << 4;
      uVar18 = *(uint *)(iVar9 + 0x12);
      bVar12 = bVar12 | (byte)(uVar18 >> 2) & 4;
      vif_info_tab[uVar22].bss_info.edca_param.acm = bVar12;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[2] = uVar18 & 0xf | (uVar18 >> 8) << 4;
      uVar18 = *(uint *)(iVar9 + 0x16);
      vif_info_tab[uVar22].bss_info.edca_param.acm = bVar12 | (byte)(uVar18 >> 1) & 8;
      __n = vif_info_tab[uVar22].bss_info.valid_flags;
      vif_info_tab[uVar22].bss_info.edca_param.ac_param[3] = uVar18 & 0xf | (uVar18 >> 8) << 4;
      vif_info_tab[uVar22].bss_info.valid_flags = __n | 1;
    }
    uVar18 = 0;
    if (me_env.ht_supported != false) {
      uVar18 = vif_info_tab[uVar22].bss_info.valid_flags & 1;
      if (uVar18 != 0) {
        iVar9 = mac_ie_find(buffer,uVar17,0x2d);
        if (iVar9 != 0) {
          vif_info_tab[uVar22].bss_info.ht_cap.ht_capa_info = *(uint16_t *)(iVar9 + 2);
          vif_info_tab[uVar22].bss_info.ht_cap.a_mpdu_param = *(uint8_t *)(iVar9 + 4);
          iVar19 = 0;
          do {
            vif_info_tab[uVar22].bss_info.ht_cap.mcs_rate[iVar19] = *(uint8_t *)(iVar9 + 5 + iVar19)
            ;
            iVar19 = iVar19 + 1;
          } while (iVar19 != 0x10);
          vif_info_tab[uVar22].bss_info.ht_cap.ht_extended_capa = *(uint16_t *)(iVar9 + 0x15);
          vif_info_tab[uVar22].bss_info.ht_cap.tx_beamforming_capa = (uint)*(ushort *)(iVar9 + 0x17)
          ;
          vif_info_tab[uVar22].bss_info.ht_cap.asel_capa = *(uint8_t *)(iVar9 + 0x1b);
          vif_info_tab[uVar22].bss_info.valid_flags = vif_info_tab[uVar22].bss_info.valid_flags | 2;
        }
        uVar18 = mac_ie_find(buffer,uVar17,0x3d);
      }
    }
    _Var2 = (sm_env.connect_param)->is_supplicant_enabled;
    vif_info_tab[uVar22].bss_info.is_supplicant_enabled = _Var2;
    if ((_Var2 != false) && (-1 < (int)vif_info_tab[uVar22].bss_info.valid_flags)) {
      security_mode = &vif_info_tab[uVar22].bss_info.wpa_wpa2_wep;
      memset(security_mode,0,2);
      mcstCipher = &vif_info_tab[uVar22].bss_info.rsn_mcstCipher;
      ucstCipher_00 = &vif_info_tab[uVar22].bss_info.rsn_ucstCipher;
      memset(mcstCipher,0,1);
      memset(ucstCipher_00,0,1);
      mcstCipher_00 = &vif_info_tab[uVar22].bss_info.wpa_mcstCipher;
      memset(mcstCipher_00,0,1);
      ucstCipher = &vif_info_tab[uVar22].bss_info.wpa_ucstCipher;
      memset(ucstCipher,0,1);
      vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len = '\0';
      vif_info_tab[uVar22].bss_info.is_pmf_required = false;
      vif_info_tab[uVar22].bss_info.is_wpa2_prefered = false;
      __src = (void *)mac_ie_find(buffer,uVar17,0x30);
      rsn_ie = vif_info_tab[uVar22].bss_info.rsn_wpa_ie;
      if (__src != (void *)0x0) {
        __n = (uint)*(byte *)((int)__src + 1) + 2 & 0xff;
        vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len = (uint8_t)__n;
        memcpy(rsn_ie,__src,__n);
        uVar6 = process_rsn_ie(rsn_ie,mcstCipher,ucstCipher_00,
                               &vif_info_tab[uVar22].bss_info.is_pmf_required,security_mode,
                               *(_Bool *)(uVar22 * 0x5d8 + 0x4201a800));
        __n = *(uint *)&vif_info_tab[uVar22].bss_info.wpa_ucstCipher;
        vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len = uVar6;
        printf("wpa2/wpa3 pairwise ccmp:%d,tkip:%d,wep104:%d,wep:40:%d\r\n",__n >> 0x13 & 1,
               __n >> 0x12 & 1,__n >> 0x11 & 1,__n >> 0x10 & 1);
        __n = *(uint *)&vif_info_tab[uVar22].bss_info.wpa_ucstCipher;
        printf("wpa2/wpa3 group ccmp:%d,tkip:%d,wep104:%d,wep:40:%d\r\n",__n >> 0xb & 1,
               __n >> 10 & 1,__n >> 9 & 1,__n >> 8 & 1);
        printf("wpa2/wpa3 is_pmf_required:%d\r\n",
               (uint)vif_info_tab[uVar22].bss_info.is_pmf_required);
      }
      __src = (void *)mac_vsie_find(buffer,uVar17,&DAT_230750d8,4);
      if (__src != (void *)0x0) {
        *(byte *)&vif_info_tab[uVar22].bss_info.wpa_wpa2_wep =
             *(byte *)&vif_info_tab[uVar22].bss_info.wpa_wpa2_wep | 8;
        if (vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len == '\0') {
          __n = (uint)*(byte *)((int)__src + 1) + 2 & 0xff;
          vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len = (uint8_t)__n;
          memcpy(rsn_ie,__src,__n);
          uVar6 = process_wpa_ie(rsn_ie,mcstCipher_00,ucstCipher);
          vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len = uVar6;
        }
      }
      psVar5 = sm_env.connect_param;
      (sm_env.connect_param)->flags = 0;
      if ((*(uint *)&vif_info_tab[uVar22].bss_info.is_supplicant_enabled & 0x12800) == 0) {
        if ((vif_info_tab[uVar22].bss_info.cap_info & 0x10) == 0) {
          uVar20 = 2;
          goto LAB_2300afbc;
        }
        *(byte *)&vif_info_tab[uVar22].bss_info.wpa_wpa2_wep =
             *(byte *)&vif_info_tab[uVar22].bss_info.wpa_wpa2_wep | 2;
        psVar5->auth_type = '\x01';
      }
      else {
        uVar20 = 9;
LAB_2300afbc:
        psVar5->flags = uVar20;
      }
      memcpy(psVar5->ie_buf,rsn_ie,(uint)vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len);
      (sm_env.connect_param)->ie_len = (ushort)vif_info_tab[uVar22].bss_info.rsn_wpa_ie_len;
      __n = *(uint *)&vif_info_tab[uVar22].bss_info.is_supplicant_enabled;
      printf("AP Security mode: wep:%d,wpa:%d,wpa2:%d,wpa3:%d\r\n",__n >> 9 & 1,__n >> 0xb & 1,
             __n >> 0xd & 1,__n >> 0x10 & 1);
    }
    me_bw_check(uVar18,0,bss);
    me_extract_power_constraint((uint32_t)buffer,freq,bss);
    me_extract_country_reg(buffer,uVar17,bss);
    me_extract_mobility_domain((uint32_t)buffer,freq,bss);
    vif_info_tab[uVar22].bss_info.valid_flags =
         vif_info_tab[uVar22].bss_info.valid_flags | 0x80000000;
  }
  if (pmVar10->valid_flag == false) {
    scanu_env.result_cnt = scanu_env.result_cnt + 1;
  }
  if (psVar4->ssid_cnt != '\0') {
    pmVar10->valid_flag = true;
  }
LAB_2300b100:
  ke_msg_forward_and_change_id(param_1,0x1004,0xd,4);
  return 1;
}



mac_scan_result * scanu_search_by_bssid(mac_addr *bssid)

{
  mac_scan_result *pmVar1;
  
  pmVar1 = scanu_find_result(bssid,false);
  return pmVar1;
}



mac_scan_result * scanu_search_by_ssid(mac_ssid *ssid,int *idx)

{
  scanu_env_tag *psVar1;
  int iVar2;
  int iVar3;
  mac_scan_result *pmVar4;
  int8_t iVar5;
  
  pmVar4 = (mac_scan_result *)0x0;
  if (ssid->length != '\0') {
    psVar1 = &scanu_env;
    iVar3 = 0;
    pmVar4 = (mac_scan_result *)0x0;
    iVar5 = -0x80;
    do {
      if (psVar1->scan_result[0].valid_flag == false) {
        return pmVar4;
      }
      if (((iVar5 < psVar1->scan_result[0].rssi) &&
          ((uint)ssid->length == (uint)psVar1->scan_result[0].ssid.length)) &&
         (iVar2 = memcmp(psVar1->scan_result[0].ssid.array,ssid->array,(uint)ssid->length),
         iVar2 == 0)) {
        iVar5 = psVar1->scan_result[0].rssi;
        pmVar4 = psVar1->scan_result;
        *idx = iVar3;
      }
      iVar3 = iVar3 + 1;
      psVar1 = (scanu_env_tag *)(psVar1->scan_result[0].ssid.array + 0x19);
    } while (iVar3 != 6);
  }
  return pmVar4;
}



