pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void scanu_rm_exist_ssid(mac_ssid *ssid,int index)

{
  int iVar1;
  
  if ((index < 0) || (ssid == (mac_ssid *)0x0)) {
    return;
  }
  if (((scanu_env.scan_result[index].valid_flag != false) &&
      ((uint)ssid->length == (uint)scanu_env.scan_result[index].ssid.length)) &&
     (iVar1 = memcmp(scanu_env.scan_result[index].ssid.array,ssid->array,(uint)ssid->length),
     iVar1 == 0)) {
    memset(scanu_env.scan_result + index,0,0x38);
    return;
  }
  return;
}



void scanu_scan_next(void)

{
  byte bVar1;
  int iVar2;
  scanu_start_req *psVar3;
  uint uVar4;
  void *pvVar5;
  uint uVar6;
  uint8_t *puVar7;
  undefined *puVar8;
  undefined *puVar9;
  uint32_t *puVar10;
  me_env_tag *pmVar11;
  short sVar12;
  int iVar13;
  undefined *puVar14;
  int iVar15;
  scanu_add_ie_tag *psVar16;
  uint8_t *puVar17;
  uint uVar18;
  int iVar19;
  int iVar20;
  
  psVar3 = scanu_env.param;
  while( true ) {
    if (1 < scanu_env.band) {
      scanu_confirm('\0');
      return;
    }
    uVar18 = 0;
    puVar7 = &(scanu_env.param)->chan[0].band;
    while ((int)uVar18 < (int)(uint)(scanu_env.param)->chan_cnt) {
      if (*puVar7 == scanu_env.band) goto LAB_2300b27a;
      uVar18 = uVar18 + 1;
      puVar7 = puVar7 + 6;
    }
    if ((uint)(scanu_env.param)->chan_cnt != uVar18) break;
    scanu_env.band = scanu_env.band + '\x01';
  }
LAB_2300b27a:
  pvVar5 = ke_msg_alloc(0x800,2,4,0x154);
  *(uint8_t *)((int)pvVar5 + 0x14e) = psVar3->vif_idx;
  *(undefined4 *)((int)pvVar5 + 0x140) = *(undefined4 *)(psVar3->bssid).array;
  *(uint16_t *)((int)pvVar5 + 0x144) = (psVar3->bssid).array[2];
  *(uint8_t *)((int)pvVar5 + 0x150) = psVar3->ssid_cnt;
  *(_Bool *)((int)pvVar5 + 0x151) = psVar3->no_cck;
  while ((int)uVar18 < (int)(uint)psVar3->chan_cnt) {
    if (*(uint8_t *)(&psVar3->chan[uVar18].freq + 1) == scanu_env.band) {
      bVar1 = *(byte *)((int)pvVar5 + 0x14f);
      memcpy((void *)((uint)bVar1 * 6 + (int)pvVar5),psVar3->chan + uVar18,6);
      *(char *)((int)pvVar5 + 0x14f) = bVar1 + 1;
    }
    uVar18 = uVar18 + 1;
  }
  iVar19 = 0xfc;
  iVar20 = 0;
  while (iVar20 < (int)(uint)psVar3->ssid_cnt) {
    memcpy((void *)((int)pvVar5 + iVar19),(void *)((int)&psVar3->chan[0].freq + iVar19),0x22);
    iVar20 = iVar20 + 1;
    iVar19 = iVar19 + 0x22;
  }
  uVar18 = (uint)(scanu_env.param)->add_ie_len;
  puVar10 = scanu_add_ie.buf;
  if (200 < (scanu_env.param)->add_ie_len) {
    uVar18 = 0;
  }
  if ((scanu_env.band == '\x01') || ((scanu_env.param)->no_cck != false)) {
    iVar19 = 4;
    iVar20 = 8;
  }
  else {
    iVar19 = 0;
    iVar20 = 0xc;
  }
  scan_probe_req_ie.buf[0]._0_1_ = 1;
  scan_probe_req_ie.buf[0]._1_1_ = 8;
  iVar13 = 0;
  do {
    iVar15 = iVar19 + iVar13;
    iVar2 = iVar13 + 2;
    iVar13 = iVar13 + 1;
    *(uint8_t *)((int)scan_probe_req_ie.buf + iVar2) = mac_id2rate[iVar15];
  } while (iVar13 != 8);
  puVar14 = (undefined *)((int)scan_probe_req_ie.buf + 10);
  if ((uVar18 != 0) && ((char)scanu_add_ie.buf[0] == '\n')) {
    uVar6 = (uint)scanu_add_ie.buf[0]._1_1_ + 2 & 0xff;
    uVar4 = uVar6;
    psVar16 = &scanu_add_ie;
    while( true ) {
      uVar4 = uVar4 - 1;
      if (uVar4 == 0xffffffff) break;
      *puVar14 = *(undefined *)psVar16->buf;
      psVar16 = (scanu_add_ie_tag *)((int)&(psVar16->dma_desc).src + 1);
      puVar14 = puVar14 + 1;
    }
    puVar14 = (undefined *)((int)scan_probe_req_ie.buf + uVar6 + 10);
    puVar10 = (uint32_t *)((int)scanu_add_ie.buf + uVar6);
    uVar18 = uVar18 - uVar6 & 0xffff;
  }
  if (iVar20 != 8) {
    uVar4 = iVar20 - 8U & 0xff;
    *puVar14 = 0x32;
    puVar14[1] = (char)uVar4;
    iVar19 = uVar4 + 2;
    puVar7 = mac_id2rate;
    puVar17 = puVar14 + 2;
    while( true ) {
      uVar4 = uVar4 - 1;
      if (uVar4 == 0xffffffff) break;
      *puVar17 = puVar7[8];
      puVar7 = puVar7 + 1;
      puVar17 = puVar17 + 1;
    }
    puVar14 = puVar14 + iVar19;
  }
  if (scanu_env.band == '\0') {
    *puVar14 = 3;
    puVar14[1] = 1;
    puVar14 = puVar14 + 3;
  }
  if ((uVar18 != 0) && (*(char *)puVar10 == ';')) {
    uVar4 = 0;
    uVar6 = (uint)*(byte *)((int)puVar10 + 1) + 2 & 0xff;
    while (uVar6 != uVar4) {
      puVar8 = (undefined *)((int)puVar10 + uVar4);
      puVar9 = puVar14 + uVar4;
      uVar4 = uVar4 + 1;
      *puVar9 = *puVar8;
    }
    puVar14 = puVar14 + uVar6;
    puVar10 = (uint32_t *)((int)puVar10 + uVar6);
    uVar18 = uVar18 - uVar6 & 0xffff;
  }
  if (me_env.ht_supported != false) {
    *puVar14 = 0x2d;
    puVar14[1] = 0x1a;
    puVar8 = puVar14 + 0x1c;
    pmVar11 = &me_env;
    puVar14 = puVar14 + 2;
    while (puVar8 != puVar14) {
      *puVar14 = *(undefined *)&(pmVar11->ht_cap).ht_capa_info;
      pmVar11 = (me_env_tag *)((int)&pmVar11->active_vifs + 1);
      puVar14 = puVar14 + 1;
    }
  }
  sVar12 = (short)puVar14;
  if (uVar18 != 0) {
    uVar4 = 0;
    do {
      puVar8 = (undefined *)((int)puVar10 + uVar4);
      puVar9 = puVar14 + uVar4;
      uVar4 = uVar4 + 1;
      *puVar9 = *puVar8;
    } while (uVar18 != uVar4);
    sVar12 = sVar12 + (short)uVar18;
  }
  *(short *)((int)pvVar5 + 0x14c) = sVar12 + -0x7d04;
  *(undefined4 *)((int)pvVar5 + 0x148) = 0;
  ke_msg_send(pvVar5);
  return;
}



void scanu_dma_cb(void)

{
  byte bVar1;
  int iVar2;
  scanu_start_req *psVar3;
  uint uVar4;
  void *pvVar5;
  uint uVar6;
  uint8_t *puVar7;
  undefined *puVar8;
  undefined *puVar9;
  uint32_t *puVar10;
  me_env_tag *pmVar11;
  short sVar12;
  int iVar13;
  undefined *puVar14;
  int iVar15;
  scanu_add_ie_tag *psVar16;
  uint8_t *puVar17;
  uint uVar18;
  int iVar19;
  int iVar20;
  
  psVar3 = scanu_env.param;
  while( true ) {
    if (1 < scanu_env.band) {
      scanu_confirm('\0');
      return;
    }
    uVar18 = 0;
    puVar7 = &(scanu_env.param)->chan[0].band;
    while ((int)uVar18 < (int)(uint)(scanu_env.param)->chan_cnt) {
      if (*puVar7 == scanu_env.band) goto LAB_2300b27a;
      uVar18 = uVar18 + 1;
      puVar7 = puVar7 + 6;
    }
    if ((uint)(scanu_env.param)->chan_cnt != uVar18) break;
    scanu_env.band = scanu_env.band + '\x01';
  }
LAB_2300b27a:
  pvVar5 = ke_msg_alloc(0x800,2,4,0x154);
  *(uint8_t *)((int)pvVar5 + 0x14e) = psVar3->vif_idx;
  *(undefined4 *)((int)pvVar5 + 0x140) = *(undefined4 *)(psVar3->bssid).array;
  *(uint16_t *)((int)pvVar5 + 0x144) = (psVar3->bssid).array[2];
  *(uint8_t *)((int)pvVar5 + 0x150) = psVar3->ssid_cnt;
  *(_Bool *)((int)pvVar5 + 0x151) = psVar3->no_cck;
  while ((int)uVar18 < (int)(uint)psVar3->chan_cnt) {
    if (*(uint8_t *)(&psVar3->chan[uVar18].freq + 1) == scanu_env.band) {
      bVar1 = *(byte *)((int)pvVar5 + 0x14f);
      memcpy((void *)((uint)bVar1 * 6 + (int)pvVar5),psVar3->chan + uVar18,6);
      *(char *)((int)pvVar5 + 0x14f) = bVar1 + 1;
    }
    uVar18 = uVar18 + 1;
  }
  iVar19 = 0xfc;
  iVar20 = 0;
  while (iVar20 < (int)(uint)psVar3->ssid_cnt) {
    memcpy((void *)((int)pvVar5 + iVar19),(void *)((int)&psVar3->chan[0].freq + iVar19),0x22);
    iVar20 = iVar20 + 1;
    iVar19 = iVar19 + 0x22;
  }
  uVar18 = (uint)(scanu_env.param)->add_ie_len;
  puVar10 = scanu_add_ie.buf;
  if (200 < (scanu_env.param)->add_ie_len) {
    uVar18 = 0;
  }
  if ((scanu_env.band == '\x01') || ((scanu_env.param)->no_cck != false)) {
    iVar19 = 4;
    iVar20 = 8;
  }
  else {
    iVar19 = 0;
    iVar20 = 0xc;
  }
  scan_probe_req_ie.buf[0]._0_1_ = 1;
  scan_probe_req_ie.buf[0]._1_1_ = 8;
  iVar13 = 0;
  do {
    iVar15 = iVar19 + iVar13;
    iVar2 = iVar13 + 2;
    iVar13 = iVar13 + 1;
    *(uint8_t *)((int)scan_probe_req_ie.buf + iVar2) = mac_id2rate[iVar15];
  } while (iVar13 != 8);
  puVar14 = (undefined *)((int)scan_probe_req_ie.buf + 10);
  if ((uVar18 != 0) && ((char)scanu_add_ie.buf[0] == '\n')) {
    uVar6 = (uint)scanu_add_ie.buf[0]._1_1_ + 2 & 0xff;
    uVar4 = uVar6;
    psVar16 = &scanu_add_ie;
    while( true ) {
      uVar4 = uVar4 - 1;
      if (uVar4 == 0xffffffff) break;
      *puVar14 = *(undefined *)psVar16->buf;
      psVar16 = (scanu_add_ie_tag *)((int)&(psVar16->dma_desc).src + 1);
      puVar14 = puVar14 + 1;
    }
    puVar14 = (undefined *)((int)scan_probe_req_ie.buf + uVar6 + 10);
    puVar10 = (uint32_t *)((int)scanu_add_ie.buf + uVar6);
    uVar18 = uVar18 - uVar6 & 0xffff;
  }
  if (iVar20 != 8) {
    uVar4 = iVar20 - 8U & 0xff;
    *puVar14 = 0x32;
    puVar14[1] = (char)uVar4;
    iVar19 = uVar4 + 2;
    puVar7 = mac_id2rate;
    puVar17 = puVar14 + 2;
    while( true ) {
      uVar4 = uVar4 - 1;
      if (uVar4 == 0xffffffff) break;
      *puVar17 = puVar7[8];
      puVar7 = puVar7 + 1;
      puVar17 = puVar17 + 1;
    }
    puVar14 = puVar14 + iVar19;
  }
  if (scanu_env.band == '\0') {
    *puVar14 = 3;
    puVar14[1] = 1;
    puVar14 = puVar14 + 3;
  }
  if ((uVar18 != 0) && (*(char *)puVar10 == ';')) {
    uVar4 = 0;
    uVar6 = (uint)*(byte *)((int)puVar10 + 1) + 2 & 0xff;
    while (uVar6 != uVar4) {
      puVar8 = (undefined *)((int)puVar10 + uVar4);
      puVar9 = puVar14 + uVar4;
      uVar4 = uVar4 + 1;
      *puVar9 = *puVar8;
    }
    puVar14 = puVar14 + uVar6;
    puVar10 = (uint32_t *)((int)puVar10 + uVar6);
    uVar18 = uVar18 - uVar6 & 0xffff;
  }
  if (me_env.ht_supported != false) {
    *puVar14 = 0x2d;
    puVar14[1] = 0x1a;
    puVar8 = puVar14 + 0x1c;
    pmVar11 = &me_env;
    puVar14 = puVar14 + 2;
    while (puVar8 != puVar14) {
      *puVar14 = *(undefined *)&(pmVar11->ht_cap).ht_capa_info;
      pmVar11 = (me_env_tag *)((int)&pmVar11->active_vifs + 1);
      puVar14 = puVar14 + 1;
    }
  }
  sVar12 = (short)puVar14;
  if (uVar18 != 0) {
    uVar4 = 0;
    do {
      puVar8 = (undefined *)((int)puVar10 + uVar4);
      puVar9 = puVar14 + uVar4;
      uVar4 = uVar4 + 1;
      *puVar9 = *puVar8;
    } while (uVar18 != uVar4);
    sVar12 = sVar12 + (short)uVar18;
  }
  *(short *)((int)pvVar5 + 0x14c) = sVar12 + -0x7d04;
  *(undefined4 *)((int)pvVar5 + 0x148) = 0;
  ke_msg_send(pvVar5);
  return;
}



