pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void scanu_start(void)

{
  scanu_env_tag *psVar1;
  
  if (scanu_env.joining == false) {
    psVar1 = &scanu_env;
    do {
      psVar1->scan_result[0].valid_flag = false;
      psVar1->scan_result[0].rssi = -0x80;
      psVar1 = (scanu_env_tag *)(psVar1->scan_result[0].ssid.array + 0x19);
    } while (psVar1 != (scanu_env_tag *)0x4201bb94);
    scanu_env.result_cnt = 0;
  }
  ke_state_set(4,1);
  if ((scanu_env.param)->add_ies != 0) {
    if ((scanu_env.param)->add_ie_len < 0xc9) {
      scanu_add_ie.dma_desc.src = (scanu_env.param)->add_ies;
      scanu_add_ie.dma_desc.length = (scanu_env.param)->add_ie_len;
      hal_dma_push(&scanu_env.dma_desc,0);
      return;
    }
  }
  scanu_scan_next();
  return;
}



uint16_t txl_get_seq_ctrl(void)

{
  uint uVar1;
  
  uVar1 = (uint)txl_cntrl_env.seqnbr;
  txl_cntrl_env.seqnbr = (uint16_t)((uVar1 + 1) * 0x10000 >> 0x10);
  return (uint16_t)((uVar1 + 1) * 0x100000 >> 0x10);
}



void sm_delete_resources(vif_info_tag *vif)

{
  undefined *puVar1;
  undefined *puVar2;
  void *pvVar3;
  byte *pbVar4;
  
  puVar1 = (undefined *)ke_msg_alloc(0x1413,5,6,2);
  puVar2 = (undefined *)ke_msg_alloc(0x1411,5,6,2);
  *puVar1 = 0;
  puVar1[1] = vif->index;
  ke_msg_send(puVar1);
  if (vif->active != false) {
    pvVar3 = ke_msg_alloc(0x1e,0,6,4);
    *(undefined *)((int)pvVar3 + 2) = 0;
    *(uint8_t *)((int)pvVar3 + 3) = vif->index;
    ke_msg_send();
  }
  if (vif->u[4] != 0xff) {
    pbVar4 = (byte *)ke_msg_alloc(0xc,0,6,1);
    *pbVar4 = vif->u[4];
    ke_msg_send();
  }
  if (vif->chan_ctxt != (chan_ctxt_tag *)0x0) {
    chan_ctxt_unlink(vif->index);
  }
  *puVar2 = 0;
  puVar2[1] = vif->index;
  ke_msg_send(puVar2);
  (vif->bss_info).valid_flags = 0;
  return;
}



void sm_frame_tx_cfm_handler(void *env,uint32_t status)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(6);
  if (((status & 0x40030000) != 0) && (CONCAT22(extraout_var,kVar1) - 5U < 2)) {
    txl_frame_push((txl_frame_desc_tag *)env,'\x03');
    *(undefined *)((int)env + 0x2d6) = 1;
  }
  return;
}



void sm_init(void)

{
  sm_env.connect_param = (sm_connect_req *)0x0;
  ke_state_set(6,0);
  return;
}



void sm_get_bss_params(mac_addr **bssid,scan_chan_tag **chan)

{
  byte bVar1;
  sm_connect_req *ssid;
  int iVar2;
  int iVar3;
  mac_scan_result *pmVar4;
  mac_addr *bssid_00;
  mac_addr *pmVar5;
  int local_34;
  int index;
  
  ssid = sm_env.connect_param;
  *bssid = (mac_addr *)0x0;
  *chan = (scan_chan_tag *)0x0;
  bssid_00 = &ssid->bssid;
  local_34 = -1;
  printf("===start sm_get_bss_params===\r\n");
  iVar2 = 0;
  pmVar5 = bssid_00;
  do {
    iVar3 = iVar2 + 1;
    printf("bssid[%d] = 0x%x\r\n",iVar2,(uint)pmVar5->array[0]);
    pmVar5 = (mac_addr *)(pmVar5->array + 1);
    iVar2 = iVar3;
  } while (iVar3 != 3);
  bVar1 = *(byte *)(ssid->bssid).array;
  if (((bVar1 & 1) == 0) &&
     ((((bVar1 != 0 || (*(char *)((int)(ssid->bssid).array + 1) != '\0')) ||
       (*(char *)((ssid->bssid).array + 1) != '\0')) ||
      (((*(char *)((int)(ssid->bssid).array + 3) != '\0' ||
        (*(char *)((ssid->bssid).array + 2) != '\0')) ||
       (*(char *)((int)(ssid->bssid).array + 5) != '\0')))))) {
    printf("search bssid \r\n ");
    *bssid = bssid_00;
    pmVar4 = scanu_search_by_bssid(bssid_00);
    if (pmVar4 == (mac_scan_result *)0x0) goto LAB_2300b794;
  }
  else {
    printf("search ssid = %s\r\n",(ssid->ssid).array);
    pmVar4 = scanu_search_by_ssid((mac_ssid *)ssid,&local_34);
    printf("result ssid index = %d\r\n",local_34);
    if (pmVar4 == (mac_scan_result *)0x0) {
LAB_2300b794:
      if ((ssid->chan).freq != 0xffff) {
        *chan = &ssid->chan;
      }
      goto LAB_2300b756;
    }
    if (-1 < local_34) {
      *(mac_scan_result **)bssid = pmVar4;
      sm_env.exist_ssid_idx = local_34;
    }
  }
  *chan = pmVar4->chan;
LAB_2300b756:
  printf("===end sm_get_bss_params===\r\n");
  return;
}



// WARNING: Could not reconcile some variable overlaps

void sm_scan_bss(mac_addr *bssid,scan_chan_tag *chan_1)

{
  uint8_t uVar1;
  byte bVar2;
  undefined2 uVar3;
  sm_connect_req *__src;
  int iVar4;
  void *__dest;
  void *__src_00;
  undefined2 *puVar5;
  int *piVar6;
  undefined2 local_2c;
  undefined2 uStack42;
  uint8_t chan_cnt [2];
  scan_chan_tag *chan [2];
  
  __src = sm_env.connect_param;
  __dest = ke_msg_alloc(0x1000,4,6,0x154);
  uVar1 = __src->vif_idx;
  *(undefined4 *)((int)__dest + 0x148) = 0;
  *(uint8_t *)((int)__dest + 0x14e) = uVar1;
  *(undefined2 *)((int)__dest + 0x14c) = 0;
  memcpy((void *)((int)__dest + 0xfc),__src,0x22);
  *(undefined *)((int)__dest + 0x150) = 1;
  if (bssid == (mac_addr *)0x0) {
    bssid = &mac_addr_bcst;
  }
  memcpy((void *)((int)__dest + 0x140),bssid,6);
  uVar3 = me_env.chan._252_2_;
  if (chan_1 == (scan_chan_tag *)0x0) {
    _chan_cnt = 0x4201b004;
    *(undefined *)((int)__dest + 0x14f) = 0;
    puVar5 = &local_2c;
    local_2c = uVar3;
    piVar6 = (int *)chan_cnt;
    do {
      iVar4 = 0;
      while (iVar4 < (int)(uint)*(byte *)puVar5) {
        __src_00 = (void *)(iVar4 * 6 + *piVar6);
        if ((*(byte *)((int)__src_00 + 3) & 2) == 0) {
          bVar2 = *(byte *)((int)__dest + 0x14f);
          *(char *)((int)__dest + 0x14f) = bVar2 + 1;
          memcpy((void *)((uint)bVar2 * 6 + (int)__dest),__src_00,6);
        }
        iVar4 = iVar4 + 1;
      }
      puVar5 = (undefined2 *)((int)puVar5 + 1);
      piVar6 = piVar6 + 1;
    } while (puVar5 != &uStack42);
  }
  else {
    memcpy(__dest,chan_1,6);
    *(undefined *)((int)__dest + 0x14f) = 1;
  }
  ke_msg_send(__dest);
  ke_state_set(6,1);
  return;
}



void sm_join_bss(mac_addr *bssid,scan_chan_tag *chan,_Bool passive)

{
  sm_connect_req *__src;
  void *__dest;
  undefined3 in_register_00002031;
  
  __src = sm_env.connect_param;
  __dest = ke_msg_alloc(0x1002,4,6,0x154);
  memcpy(__dest,chan,6);
  *(undefined *)((int)__dest + 0x14f) = 1;
  memcpy((void *)((int)__dest + 0xfc),__src,0x22);
  *(undefined *)((int)__dest + 0x150) = 1;
  *(undefined2 *)((int)__dest + 0x14c) = 0;
  *(undefined4 *)((int)__dest + 0x148) = 0;
  *(uint8_t *)((int)__dest + 0x14e) = __src->vif_idx;
  memcpy((void *)((int)__dest + 0x140),bssid,6);
  if (CONCAT31(in_register_00002031,passive) != 0) {
    *(byte *)((int)__dest + 3) = *(byte *)((int)__dest + 3) | 1;
  }
  sm_env.join_passive = passive;
  ke_msg_send(__dest);
  ke_state_set(6,2);
  return;
}



