pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

uint8_t sm_add_chan_ctx(uint8_t *p_chan_idx)

{
  uint8_t uVar1;
  scan_chan_tag *psVar2;
  uint uVar3;
  uint8_t uStack28;
  uint8_t uStack27;
  uint16_t uStack26;
  mm_chan_ctxt_add_req req;
  
  uVar3 = (uint)(sm_env.connect_param)->vif_idx;
  psVar2 = vif_info_tab[uVar3].bss_info.chan;
  uStack27 = vif_info_tab[uVar3].bss_info.phy_bw;
  uStack28 = psVar2->band;
  uStack26 = psVar2->freq;
  req._0_4_ = *(undefined4 *)&vif_info_tab[uVar3].bss_info.center_freq1;
  req.center1_freq._0_1_ = psVar2->tx_power;
  uVar1 = chan_ctxt_add((mm_chan_ctxt_add_req *)&uStack28,p_chan_idx);
  return uVar1;
}



void sm_send_next_bss_param(void)

{
  co_list_hdr *pcVar1;
  
  pcVar1 = co_list_pop_front(&sm_env.bss_config);
  if (pcVar1 == (co_list_hdr *)0x0) {
    assert_err("msg != NULL","module",0x1a0);
  }
  ke_msg_send(pcVar1 + 3);
  return;
}



void sm_set_bss_param(void)

{
  sm_connect_req *psVar1;
  vif_info_tag *pvVar2;
  uint16_t uVar3;
  undefined *puVar4;
  void *__dest;
  undefined4 *puVar5;
  uint16_t *puVar6;
  undefined *puVar7;
  undefined2 extraout_var;
  uint32_t *puVar8;
  bool bVar9;
  uint32_t uVar10;
  uint uVar11;
  int iVar12;
  
  psVar1 = sm_env.connect_param;
  uVar11 = (uint)(sm_env.connect_param)->vif_idx;
  puVar4 = (undefined *)ke_msg_alloc(0x1413,5,6,2);
  __dest = ke_msg_alloc(0x18,0,6,7);
  puVar5 = (undefined4 *)ke_msg_alloc(0x16,0,6,8);
  puVar6 = (uint16_t *)ke_msg_alloc(0x14,0,6,4);
  puVar7 = (undefined *)ke_msg_alloc(0x1411,5,6,2);
  co_list_init(&sm_env.bss_config);
  *puVar4 = 1;
  puVar4[1] = psVar1->vif_idx;
  co_list_push_back(&sm_env.bss_config,(co_list_hdr *)(puVar4 + -0xc));
  pvVar2 = vif_info_tab + uVar11;
  memcpy(__dest,&vif_info_tab[uVar11].bss_info.bssid,6);
  *(uint8_t *)((int)__dest + 6) = psVar1->vif_idx;
  co_list_push_back(&sm_env.bss_config,(co_list_hdr *)((int)__dest + -0xc));
  *(uint8_t *)((int)puVar5 + 5) = (vif_info_tab[uVar11].bss_info.chan)->band;
  uVar3 = me_legacy_rate_bitfield_build(&vif_info_tab[uVar11].bss_info.rate_set,true);
  *puVar5 = CONCAT22(extraout_var,uVar3);
  *(uint8_t *)(puVar5 + 1) = psVar1->vif_idx;
  co_list_push_back(&sm_env.bss_config,(co_list_hdr *)(puVar5 + -3));
  *puVar6 = vif_info_tab[uVar11].bss_info.beacon_period;
  iVar12 = 0;
  *(uint8_t *)(puVar6 + 1) = psVar1->vif_idx;
  co_list_push_back(&sm_env.bss_config,(co_list_hdr *)(puVar6 + -6));
  do {
    puVar8 = (uint32_t *)ke_msg_alloc(0x1a,0,6,8);
    uVar10 = (pvVar2->bss_info).edca_param.ac_param[0];
    *(undefined *)((int)puVar8 + 5) = (char)iVar12;
    *puVar8 = uVar10;
    *(uint8_t *)((int)puVar8 + 6) = psVar1->vif_idx;
    bVar9 = false;
    if ((ps_env.uapsd_timeout != 0) &&
       ((char)vif_info_tab[uVar11].bss_info.edca_param.qos_info < '\0')) {
      bVar9 = (mac_ac2uapsd[iVar12] & psVar1->uapsd_queues) != 0;
    }
    *(bool *)(puVar8 + 1) = bVar9;
    iVar12 = iVar12 + 1;
    co_list_push_back(&sm_env.bss_config,(co_list_hdr *)(puVar8 + -3));
    pvVar2 = (vif_info_tag *)&pvVar2->prevent_sleep;
  } while (iVar12 != 4);
  *puVar7 = 1;
  puVar7[1] = psVar1->vif_idx;
  co_list_push_back(&sm_env.bss_config,(co_list_hdr *)(puVar7 + -0xc));
  sm_send_next_bss_param();
  ke_state_set(6,4);
  return;
}



void sm_disconnect_process(vif_info_tag *vif,uint16_t reason)

{
  uint16_t *puVar1;
  
  puVar1 = (uint16_t *)ke_msg_alloc(0x1805,0xd,6,4);
  sm_delete_resources(vif);
  *puVar1 = reason;
  *(uint8_t *)(puVar1 + 1) = vif->index;
  if (sm_env.ft_over_ds != false) {
    *(undefined *)((int)puVar1 + 3) = 1;
  }
  ke_msg_send(puVar1);
  return;
}



void sm_deauth_cfm(void *env,uint32_t status)

{
  sm_disconnect_process((vif_info_tag *)env,0);
  return;
}



void sm_disconnect(uint8_t vif_index,uint16_t reason_code)

{
  byte bVar1;
  _Bool _Var2;
  uint16_t uVar3;
  undefined3 in_register_00002029;
  int iVar4;
  txl_frame_desc_tag *frame;
  undefined2 extraout_var_00;
  undefined3 extraout_var;
  vif_info_tag *vif;
  tx_hw_desc *ptVar5;
  txl_buffer_tag *ptVar6;
  
  iVar4 = CONCAT31(in_register_00002029,vif_index);
  vif = vif_info_tab + iVar4;
  if ((vif_info_tab[iVar4].type == '\0') && (vif_info_tab[iVar4].active != false)) {
    bVar1 = vif_info_tab[iVar4].u[4];
    ke_state_set(6,8);
    frame = txl_frame_get((uint)((vif_info_tab[iVar4].bss_info.chan)->band != '\0'),0x100);
    if (frame != (txl_frame_desc_tag *)0x0) {
      tpc_update_frame_tx_power(vif,frame);
      ptVar6 = (frame->txdesc).lmac.buffer;
      *(undefined *)&ptVar6[1].length = 0xc0;
      *(undefined *)((int)&ptVar6[1].length + 1) = 0;
      *(undefined *)((int)&ptVar6[1].length + 2) = 0;
      *(undefined *)((int)&ptVar6[1].length + 3) = 0;
      memcpy(&ptVar6[1].lenheader,&sta_info_tab[bVar1].mac_addr,6);
      memcpy((void *)((int)&ptVar6[1].lenpad + 2),&vif_info_tab[iVar4].mac_addr,6);
      memcpy(&ptVar6[1].next,&sta_info_tab[bVar1].mac_addr,6);
      uVar3 = txl_get_seq_ctrl();
      *(undefined *)((int)&ptVar6[1].txdesc + 2) = (char)uVar3;
      *(undefined *)((int)&ptVar6[1].txdesc + 3) = (char)(uVar3 >> 8);
      (frame->cfm).cfm_func = sm_deauth_cfm;
      *(vif_info_tag **)&(frame->cfm).env = vif;
      (frame->txdesc).host.vif_idx = vif_index;
      (frame->txdesc).host.staid = vif_info_tab[iVar4].u[4];
      uVar3 = me_build_deauthenticate((uint32_t)ptVar6[1].dma_desc,reason_code);
      ptVar5 = (frame->txdesc).lmac.hw_desc;
      (ptVar5->thd).frmlen = CONCAT22(extraout_var_00,uVar3) + 0x1c;
      (ptVar5->thd).field_5 = (ptVar5->thd).field_4 + 0x17 + CONCAT22(extraout_var_00,uVar3);
      _Var2 = txl_frame_push(frame,'\x03');
      if (CONCAT31(extraout_var,_Var2) != 0) {
        return;
      }
      vif = (vif_info_tag *)(frame->cfm).env;
    }
    sm_disconnect_process(vif,0);
    return;
  }
  return;
}



void sm_connect_ind(uint16_t status)

{
  sm_connect_req *ssid;
  sm_connect_ind *psVar1;
  int index;
  undefined2 in_register_0000202a;
  uint8_t uVar2;
  uint uVar3;
  chan_ctxt_tag *pcVar4;
  uint uVar5;
  
