pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  index = sm_env.exist_ssid_idx;
  psVar1 = sm_env.connect_ind;
  ssid = sm_env.connect_param;
  uVar5 = (uint)(sm_env.connect_param)->vif_idx;
  (sm_env.connect_ind)->vif_idx = (sm_env.connect_param)->vif_idx;
  memcpy(&psVar1->bssid,&vif_info_tab[uVar5].bss_info.bssid,6);
  psVar1->ap_idx = vif_info_tab[uVar5].u[4];
  printf("ind ix %p, chan_ctxt is %p\r\n",psVar1,vif_info_tab[uVar5].chan_ctxt);
  pcVar4 = vif_info_tab[uVar5].chan_ctxt;
  psVar1->ch_idx = '\0';
  if (pcVar4 == (chan_ctxt_tag *)0x0) {
    psVar1->band = '\0';
    psVar1->center_freq = 0;
    psVar1->center_freq1 = 0;
    psVar1->center_freq2 = 0;
    psVar1->width = '\0';
  }
  else {
    psVar1->band = ((vif_info_tab[uVar5].chan_ctxt)->channel).band;
    psVar1->center_freq = ((vif_info_tab[uVar5].chan_ctxt)->channel).prim20_freq;
    psVar1->center_freq1 = (uint)((vif_info_tab[uVar5].chan_ctxt)->channel).center1_freq;
    psVar1->center_freq2 = (uint)((vif_info_tab[uVar5].chan_ctxt)->channel).center2_freq;
    psVar1->width = ((vif_info_tab[uVar5].chan_ctxt)->channel).type;
  }
  uVar2 = '\0';
  uVar3 = vif_info_tab[uVar5].bss_info.valid_flags & 1;
  psVar1->qos = SUB41(uVar3,0);
  if (uVar3 != 0) {
    uVar2 = vif_info_tab[uVar5].bss_info.edca_param.acm;
  }
  psVar1->acm = uVar2;
  psVar1->roamed = false;
  if (CONCAT22(in_register_0000202a,status) == 0) {
    ke_state_set(6,0);
  }
  else {
    ke_state_set(6,8);
    printf("connect failure, ssid = %s, index = %d\r\n",(ssid->ssid).array,index);
    if (-1 < index) {
      printf("from sm_connect_ind to scanu_rm_exist_ssid\r\n");
      scanu_rm_exist_ssid((mac_ssid *)ssid,index);
      sm_env.exist_ssid_idx = -1;
    }
    sm_delete_resources(vif_info_tab + uVar5);
  }
  ke_msg_free(sm_env.connect_param[-1].phrase_pmk + 0x37);
  sm_env.connect_param = (sm_connect_req *)0x0;
  sm_env.ft_over_ds = false;
  psVar1->status_code = status;
  ke_msg_send(psVar1);
  sm_env.connect_ind = (sm_connect_ind *)0x0;
  return;
}



void sm_supplicant_deauth_cfm(void *env,uint32_t status)

{
  if (-1 < (int)(status << 8)) {
    printf("sm deauth frame transmit failure\r\n");
  }
  sm_connect_ind(8);
  return;
}



void sm_auth_send(uint16_t auth_seq,uint32_t *challenge)

{
  byte bVar1;
  sm_connect_req *psVar2;
  txl_buffer_tag *ptVar3;
  uint16_t uVar4;
  undefined2 in_register_0000202a;
  txl_frame_desc_tag *frame;
  undefined2 extraout_var;
  tx_hw_desc *ptVar5;
  uint uVar6;
  int iVar7;
  
  psVar2 = sm_env.connect_param;
  uVar6 = (uint)(sm_env.connect_param)->vif_idx;
  bVar1 = vif_info_tab[uVar6].u[4];
  frame = txl_frame_get((uint)((vif_info_tab[uVar6].bss_info.chan)->band != '\0'),0x100);
  if (frame != (txl_frame_desc_tag *)0x0) {
    tpc_update_frame_tx_power(vif_info_tab + uVar6,frame);
    ptVar3 = (frame->txdesc).lmac.buffer;
    *(undefined *)&ptVar3[1].length = 0xb0;
    *(undefined *)((int)&ptVar3[1].length + 1) = 0;
    *(undefined *)((int)&ptVar3[1].length + 2) = 0;
    *(undefined *)((int)&ptVar3[1].length + 3) = 0;
    memcpy(&ptVar3[1].lenheader,&sta_info_tab[bVar1].mac_addr,6);
    memcpy((void *)((int)&ptVar3[1].lenpad + 2),&vif_info_tab[uVar6].mac_addr,6);
    memcpy(&ptVar3[1].next,&sta_info_tab[bVar1].mac_addr,6);
    uVar4 = txl_get_seq_ctrl();
    *(undefined *)((int)&ptVar3[1].txdesc + 2) = (char)uVar4;
    *(undefined *)((int)&ptVar3[1].txdesc + 3) = (char)(uVar4 >> 8);
    (frame->txdesc).host.vif_idx = vif_info_tab[uVar6].index;
    bVar1 = vif_info_tab[uVar6].u[4];
    (frame->txdesc).umac.head_len = '\0';
    (frame->txdesc).umac.tail_len = '\0';
    (frame->txdesc).host.staid = bVar1;
    iVar7 = 0x18;
    if ((psVar2->auth_type == '\x01') && (CONCAT22(in_register_0000202a,auth_seq) == 3)) {
      txu_cntrl_protect_mgmt_frame((txdesc *)frame,(uint32_t)(ptVar3 + 1),0x18);
      iVar7 = (uint)(frame->txdesc).umac.head_len + 0x18;
    }
    uVar4 = me_build_authenticate
                      ((int)&ptVar3[1].length + iVar7,(ushort)psVar2->auth_type,auth_seq,0,challenge
                      );
    bVar1 = (frame->txdesc).umac.tail_len;
    ptVar5 = (frame->txdesc).lmac.hw_desc;
    *(txl_frame_desc_tag **)&(frame->cfm).env = frame;
    iVar7 = CONCAT22(extraout_var,uVar4) + (uint)bVar1 + iVar7;
    (frame->cfm).cfm_func = sm_frame_tx_cfm_handler;
    (ptVar5->thd).frmlen = iVar7 + 4;
    (ptVar5->thd).field_5 = (ptVar5->thd).field_4 + -1 + iVar7;
    txl_frame_push(frame,'\x03');
    ke_timer_set(0x1806,6,0x32000);
    ke_state_set(6,5);
    return;
  }
  sm_connect_ind(1);
  return;
}



// WARNING: Variable defined which should be unmapped: ie_addr
// WARNING: Could not reconcile some variable overlaps

void sm_assoc_req_send(void)

{
  byte bVar1;
  sm_connect_req *con_par;
  sm_connect_ind *psVar2;
  txl_buffer_tag *ptVar3;
  uint16_t uVar4;
  txl_frame_desc_tag *frame;
  undefined2 extraout_var;
  tx_hw_desc *ptVar5;
  _Bool _Var6;
  sm_connect_ind *psVar7;
  uint uVar8;
  mac_addr *old_ap_addr_ptr;
  uint16_t uStack54;
  uint16_t ie_len;
  uint32_t uStack52;
  uint32_t ie_addr;
  
  con_par = sm_env.connect_param;
  uVar8 = (uint)(sm_env.connect_param)->vif_idx;
  bVar1 = vif_info_tab[uVar8].u[4];
  frame = txl_frame_get((uint)((vif_info_tab[uVar8].bss_info.chan)->band != '\0'),0x100);
  psVar2 = sm_env.connect_ind;
  if (frame == (txl_frame_desc_tag *)0x0) {
    sm_connect_ind(4);
  }
  else {
    tpc_update_frame_tx_power(vif_info_tab + uVar8,frame);
    ptVar3 = (frame->txdesc).lmac.buffer;
    old_ap_addr_ptr = (mac_addr *)0x0;
    _Var6 = sm_env.ft_over_ds;
    if (sm_env.ft_over_ds != false) {
      _Var6 = true;
      old_ap_addr_ptr = &sm_env.ft_old_bssid;
    }
    *(_Bool *)&ptVar3[1].length = _Var6;
    *(undefined *)((int)&ptVar3[1].length + 1) = 0;
    *(undefined *)((int)&ptVar3[1].length + 2) = 0;
    *(undefined *)((int)&ptVar3[1].length + 3) = 0;
    memcpy(&ptVar3[1].lenheader,&sta_info_tab[bVar1].mac_addr,6);
    memcpy((void *)((int)&ptVar3[1].lenpad + 2),&vif_info_tab[uVar8].mac_addr,6);
    memcpy(&ptVar3[1].next,&sta_info_tab[bVar1].mac_addr,6);
    uVar4 = txl_get_seq_ctrl();
    *(undefined *)((int)&ptVar3[1].txdesc + 2) = (char)uVar4;
    *(undefined *)((int)&ptVar3[1].txdesc + 3) = (char)(uVar4 >> 8);
    uVar4 = me_build_associate_req
                      ((uint32_t)ptVar3[1].dma_desc,&vif_info_tab[uVar8].bss_info,old_ap_addr_ptr,
                       vif_info_tab[uVar8].index,(uint32_t *)&stack0xffffffcc,&uStack54,con_par);
    ptVar5 = (frame->txdesc).lmac.hw_desc;
    (frame->txdesc).host.vif_idx = vif_info_tab[uVar8].index;
    bVar1 = vif_info_tab[uVar8].u[4];
    *(txl_frame_desc_tag **)&(frame->cfm).env = frame;
    (frame->txdesc).host.staid = bVar1;
    (frame->cfm).cfm_func = sm_frame_tx_cfm_handler;
    (ptVar5->thd).field_5 = (ptVar5->thd).field_4 + 0x17 + CONCAT22(extraout_var,uVar4);
    (ptVar5->thd).frmlen = CONCAT22(extraout_var,uVar4) + 0x1c;
    psVar7 = psVar2;
    while (psVar7 != (sm_connect_ind *)((int)&psVar2->status_code + (uint)uStack54)) {
      *(undefined *)psVar7->assoc_ie_buf = *(undefined *)((uStack52 - (int)psVar2) + (int)psVar7);
      psVar7 = (sm_connect_ind *)((int)&psVar7->status_code + 1);
    }
    psVar2->assoc_req_ie_len = uStack54;
    txl_frame_push(frame,'\x03');
    ke_timer_set(0x1806,6,0x32000);
    ke_state_set(6,6);
  }
  return;
}



void sm_assoc_done(uint16_t aid)

{
  sm_connect_req *psVar1;
  uint16_t *puVar2;
  
  psVar1 = sm_env.connect_param;
  puVar2 = (uint16_t *)ke_msg_alloc(0x1e,0,6,4);
  *puVar2 = aid;
  *(undefined *)(puVar2 + 1) = 1;
  *(uint8_t *)((int)puVar2 + 3) = psVar1->vif_idx;
  ke_msg_send();
  ke_state_set(6,7);
  return;
}



void sm_auth_handler(rxu_mgt_ind *param)

{
  uint16_t auth_seq;
  uint32_t *challenge;
  
  ke_timer_clear(0x1806,6);
  if (param[1].center_freq != 0) {
    if (((sm_env.connect_param)->auth_type != '\x01') ||
       ((sm_env.connect_param)->is_supplicant_enabled == false)) {
      printf("Authentication failure, Wlan802.11 status code = %d\r\n");
      sm_connect_ind(2);
      return;
    }
    (sm_env.connect_param)->auth_type = '\0';
    challenge = (uint32_t *)0x0;
    auth_seq = 1;
LAB_2300c2aa:
    sm_auth_send(auth_seq,challenge);
    return;
  }
  if (param[1].length != 0) {
    if (param[1].length != 1) {
      return;
    }
    if (param[1].framectrl != 4) {
      if (param[1].framectrl != 2) {
        sm_connect_ind(3);
        assert_warn("0","module",0x374);
        return;
      }
      if (param->length < 0x88) {
        printf("Drop illegal auth packet length %u\r\n");
        return;
      }
      challenge = (uint32_t *)&param[1].inst_nbr;
      auth_seq = 3;
      goto LAB_2300c2aa;
    }
  }
  sm_assoc_req_send();
  return;
}



void sm_assoc_rsp_handler(rxu_mgt_ind *param)

{
  uint8_t *puVar1;
  byte bVar2;
  ushort uVar3;
  int iVar4;
  sm_connect_ind *psVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint8_t uStack50;
  int8_t aiStack49 [3];
  uint8_t idx;
  int8_t pwr;
  
