pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  psVar5 = sm_env.connect_ind;
  uVar8 = (uint)(sm_env.connect_param)->vif_idx;
  uStack50 = '\0';
  bVar2 = vif_info_tab[uVar8].u[4];
  ke_timer_clear(0x1806,6);
  uVar6 = (uint)param[1].framectrl;
  if (param[1].framectrl == 0) {
    if (5 < param->length) {
      uVar6 = (uint)param->length - 6 & 0xffff;
    }
    sm_assoc_done((ushort)(((uint)param[1].center_freq << 0x12) >> 0x12));
    me_init_rate(sta_info_tab + bVar2);
    aiStack49[0] = (vif_info_tab[uVar8].bss_info.chan)->tx_power -
                   vif_info_tab[uVar8].bss_info.power_constraint;
    tpc_update_vif_tx_power(vif_info_tab + uVar8,aiStack49,&uStack50);
    uVar3 = psVar5->assoc_req_ie_len;
    uVar7 = 0;
    while (uVar6 != uVar7) {
      puVar1 = &param[1].band + uVar7;
      iVar4 = uVar7 + uVar3;
      uVar7 = uVar7 + 1;
      *(uint8_t *)((int)psVar5->assoc_ie_buf + iVar4) = *puVar1;
    }
    psVar5->assoc_rsp_ie_len = (uint16_t)uVar6;
    if ((*(uint *)&vif_info_tab[uVar8].bss_info.is_supplicant_enabled & 0x12a00) != 0) {
      supplicantInitSession
                (&sta_conn_info,(CHAR *)vif_info_tab[uVar8].bss_info.ssid.array,
                 (ushort)vif_info_tab[uVar8].bss_info.ssid.length,
                 (CHAR *)&vif_info_tab[uVar8].bss_info.bssid,(UINT8 *)&vif_info_tab[uVar8].mac_addr)
      ;
    }
  }
  else {
    printf("Association failure, Wlan802.11 status code = %d\r\n",uVar6);
    sm_connect_ind(5);
  }
  return;
}



int sm_deauth_handler(rxu_mgt_ind *param)

{
  byte bVar1;
  ushort reason;
  sm_connect_req *psVar2;
  ke_state_t kVar3;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  
  psVar2 = sm_env.connect_param;
  bVar1 = param->inst_nbr;
  kVar3 = ke_state_get(6);
  if (CONCAT22(extraout_var,kVar3) != 8) {
    kVar3 = ke_state_get(6);
    if (CONCAT22(extraout_var_00,kVar3) == 0) {
      if (vif_info_tab[bVar1].active == false) {
        return 0;
      }
      reason = param[1].length;
      ke_state_set(6,8);
      printf("Deauth by AP, Wlan802.11 reason code = %d\r\n",(uint)reason);
      sm_disconnect_process(vif_info_tab + bVar1,reason);
      return 0;
    }
    if (psVar2->vif_idx == param->inst_nbr) {
      sm_connect_ind(6);
      return 0;
    }
  }
  return 2;
}



void sm_handle_supplicant_result(uint8_t sta_id,uint16_t reason_code)

{
  byte bVar1;
  txl_buffer_tag *ptVar2;
  _Bool _Var3;
  uint16_t status;
  undefined3 in_register_00002029;
  int iVar4;
  txl_frame_desc_tag *frame;
  undefined2 extraout_var_00;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  tx_hw_desc *ptVar5;
  uint uVar6;
  
  iVar4 = CONCAT31(in_register_00002029,sta_id);
  bVar1 = sta_info_tab[iVar4].inst_nbr;
  uVar6 = (uint)bVar1;
  if (CONCAT22(in_register_0000202e,reason_code) == 0) {
    sta_info_tab[iVar4].ctrl_port_state = '\x02';
    status = 0;
  }
  else {
    if (CONCAT22(in_register_0000202e,reason_code) == 0xf) {
      printf(
            "4-way handshake timeout failure, wlan 802.11 reason code = %u,                try to transmit deauth frame\r\n"
            );
    }
    frame = txl_frame_get((uint)((vif_info_tab[uVar6].bss_info.chan)->band != '\0'),0x100);
    if (frame == (txl_frame_desc_tag *)0x0) {
      status = 10;
    }
    else {
      tpc_update_frame_tx_power(vif_info_tab + uVar6,frame);
      ptVar2 = (frame->txdesc).lmac.buffer;
      *(undefined *)&ptVar2[1].length = 0xc0;
      *(undefined *)((int)&ptVar2[1].length + 1) = 0;
      *(undefined *)((int)&ptVar2[1].length + 2) = 0;
      *(undefined *)((int)&ptVar2[1].length + 3) = 0;
      memcpy(&ptVar2[1].lenheader,&sta_info_tab[iVar4].mac_addr,6);
      memcpy((void *)((int)&ptVar2[1].lenpad + 2),&vif_info_tab[uVar6].mac_addr,6);
      memcpy(&ptVar2[1].next,&sta_info_tab[iVar4].mac_addr,6);
      status = txl_get_seq_ctrl();
      *(undefined *)((int)&ptVar2[1].txdesc + 2) = (char)status;
      *(undefined *)((int)&ptVar2[1].txdesc + 3) = (char)(status >> 8);
      (frame->cfm).cfm_func = sm_supplicant_deauth_cfm;
      *(vif_info_tag **)&(frame->cfm).env = vif_info_tab + uVar6;
      (frame->txdesc).host.vif_idx = bVar1;
      (frame->txdesc).host.staid = sta_id;
      status = me_build_deauthenticate((uint32_t)ptVar2[1].dma_desc,reason_code);
      ptVar5 = (frame->txdesc).lmac.hw_desc;
      (ptVar5->thd).frmlen = CONCAT22(extraout_var_00,status) + 0x1c;
      (ptVar5->thd).field_5 = (ptVar5->thd).field_4 + 0x17 + CONCAT22(extraout_var_00,status);
      _Var3 = txl_frame_push(frame,'\x03');
      if (CONCAT31(extraout_var,_Var3) != 0) {
        return;
      }
      status = 9;
    }
  }
  sm_connect_ind(status);
  return;
}



undefined2 * txu_cntrl_sec_hdr_append(int param_1,undefined2 *param_2,int param_3)

{
  uint8_t uVar1;
  ushort uVar2;
  undefined2 *puVar3;
  int iVar4;
  key_info_tag *pkVar5;
  
  pkVar5 = *sta_info_tab[*(byte *)(param_1 + 0x30)].sta_sec_info.cur_key;
  if (pkVar5 == (key_info_tag *)0x0) {
    return param_2;
  }
  if (((vif_info_tab[*(byte *)(param_1 + 0x2f)].flags & 2) != 0) &&
     ((uint)sta_info_tab[*(byte *)(param_1 + 0x30)].ctrl_port_ethertype ==
      (((uint)*(ushort *)(param_1 + 0x20) & 0xff) << 8 | (uint)(*(ushort *)(param_1 + 0x20) >> 8))))
  {
    return param_2;
  }
  uVar1 = pkVar5->cipher;
  if (uVar1 == '\x01') {
    param_2[-4] = *(ushort *)(param_1 + 0x22) & 0x7f00 | 0x2000 | *(ushort *)(param_1 + 0x22) >> 8;
    uVar2 = (ushort)*(byte *)(param_1 + 0x22) | (ushort)pkVar5->key_idx << 0xe;
LAB_2300c744:
    puVar3 = param_2 + -4;
    param_2[-3] = uVar2 | 0x2000;
    param_2[-2] = *(undefined2 *)(param_1 + 0x24);
    param_2[-1] = *(undefined2 *)(param_1 + 0x26);
  }
  else {
    if (uVar1 != '\0') {
      if (uVar1 == '\x02') {
        param_2[-4] = *(undefined2 *)(param_1 + 0x22);
        uVar2 = (ushort)pkVar5->key_idx << 0xe;
        goto LAB_2300c744;
      }
      puVar3 = param_2;
      if (uVar1 != '\x03') goto LAB_2300c6f6;
    }
    puVar3 = param_2 + -2;
    *puVar3 = *(undefined2 *)(param_1 + 0x22);
    param_2[-1] = (ushort)pkVar5->key_idx << 0xe | *(ushort *)(param_1 + 0x24);
  }
LAB_2300c6f6:
  if (param_3 == 0) {
    iVar4 = *(int *)(param_1 + 0x68) + 0xf0;
  }
  else {
    iVar4 = *(int *)(param_1 + 0x54);
  }
  *(uint *)(iVar4 + 0xc) = (uint)pkVar5->hw_key_idx | *(uint *)(iVar4 + 0xc) & 0xffc00;
  return puVar3;
}



int txu_cntrl_sechdr_len_compute(txdesc *txdesc,int *tail_len)

{
  byte bVar1;
  uint8_t uVar2;
  ushort uVar3;
  int iVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  key_info_tag *pkVar8;
  
  bVar1 = (txdesc->host).vif_idx;
  pkVar8 = *sta_info_tab[(txdesc->host).staid].sta_sec_info.cur_key;
  *tail_len = 0;
  if (pkVar8 == (key_info_tag *)0x0) {
    return 0;
  }
  if (((vif_info_tab[bVar1].flags & 2) != 0) &&
     (uVar3 = (txdesc->host).ethertype,
     (uint)sta_info_tab[(txdesc->host).staid].ctrl_port_ethertype ==
     (((uint)uVar3 & 0xff) << 8 | (uint)(uVar3 >> 8)))) {
    return 0;
  }
  uVar2 = pkVar8->cipher;
  if (uVar2 == '\x01') {
    iVar4 = 0xc;
LAB_2300c83a:
    *tail_len = iVar4;
    if (((txdesc->host).flags & 1) == 0) {
      uVar7 = *(uint *)&pkVar8->tx_pn;
      iVar4 = *(int *)((int)&pkVar8->tx_pn + 4);
      uVar6 = uVar7 + 1;
      *(uint *)&pkVar8->tx_pn = uVar6;
      *(int *)((int)&pkVar8->tx_pn + 4) = (uint)(uVar6 < uVar7) + iVar4;
      memcpy((txdesc->host).pn,&pkVar8->tx_pn,6);
    }
    iVar4 = 8;
  }
  else {
    if (uVar2 != '\0') {
      if (uVar2 == '\x02') {
        iVar4 = 8;
        goto LAB_2300c83a;
      }
      if (uVar2 != '\x03') {
        return 0;
      }
    }
    *tail_len = 4;
    iVar4 = 4;
    if (((txdesc->host).flags & 1) == 0) {
      uVar7 = *(uint *)&pkVar8->tx_pn;
      iVar5 = *(int *)((int)&pkVar8->tx_pn + 4);
      uVar6 = uVar7 + 1;
      *(uint *)&pkVar8->tx_pn = uVar6;
      *(int *)((int)&pkVar8->tx_pn + 4) = (uint)(uVar6 < uVar7) + iVar5;
      memcpy((txdesc->host).pn,&pkVar8->tx_pn,4);
    }
  }
  return iVar4;
}



