pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void txu_cntrl_frame_build(txdesc *txdesc,uint32_t buf)

{
  uint8_t uVar1;
  byte bVar2;
  int iVar3;
  ushort *puVar4;
  ushort *puVar5;
  uint uVar6;
  ushort uVar7;
  ushort uVar8;
  ushort *puVar9;
  uint uVar10;
  key_info_tag *pkVar11;
  
  uVar8 = (txdesc->host).ethertype;
  if (0x5ff < (((uint)uVar8 & 0xff) << 8 | (uint)(uVar8 >> 8))) {
    *(undefined2 *)(buf - 8) = 0xaaaa;
    *(undefined2 *)(buf - 6) = 3;
    *(undefined2 *)(buf - 4) = 0;
    *(uint16_t *)(buf - 2) = (txdesc->host).ethertype;
  }
  iVar3 = txu_cntrl_sec_hdr_append(txdesc,1);
  uVar6 = (uint)(txdesc->host).staid;
  uVar1 = (txdesc->host).tid;
  uVar10 = (uint)(txdesc->host).vif_idx;
  pkVar11 = *sta_info_tab[uVar6].sta_sec_info.cur_key;
  puVar9 = (ushort *)(iVar3 + -0x1a);
  if (uVar1 == -1) {
    puVar9 = (ushort *)(iVar3 + -0x18);
  }
  puVar4 = puVar9 + 0xc;
  puVar5 = (ushort *)0x0;
  if (((txdesc->host).flags & 0x100) != 0) {
    puVar5 = puVar9 + -3;
    puVar9 = puVar5;
  }
  if (uVar1 == -1) {
    *(undefined *)puVar9 = 0;
    *(undefined *)((int)puVar9 + 1) = 0;
    *(undefined *)(puVar9 + 0xb) = 0;
    *(undefined *)((int)puVar9 + 0x17) = 0;
  }
  else {
    *(undefined *)puVar9 = 0x80;
    *(undefined *)((int)puVar9 + 1) = 0;
    *puVar4 = (ushort)(txdesc->host).tid;
    iVar3 = (uint)(txdesc->host).sn << 0x14;
    *(char *)(puVar9 + 0xb) = (char)((uint)iVar3 >> 0x10);
    *(undefined *)((int)puVar9 + 0x17) = (char)((uint)iVar3 >> 0x18);
    if (((txdesc->host).flags & 0x200) != 0) {
      *puVar4 = *puVar4 | 0x10;
    }
  }
  uVar7 = *puVar9;
  *(byte *)puVar9 = (byte)uVar7 | 8;
  *(undefined *)((int)puVar9 + 1) = (char)((uint)uVar7 >> 8);
  uVar8 = (txdesc->host).flags;
  if ((int)((uint)uVar8 << 0x14) < 0) {
    uVar7 = uVar7 & 0xfcff | 8;
LAB_2300c97c:
    *(char *)puVar9 = (char)uVar7;
    *(undefined *)((int)puVar9 + 1) = (char)(uVar7 >> 8);
  }
  else {
    if ((uVar8 & 0x100) != 0) {
      uVar7 = uVar7 | 0x308;
      goto LAB_2300c97c;
    }
    if (vif_info_tab[uVar10].type == '\0') {
      uVar7 = uVar7 | 0x108;
      goto LAB_2300c97c;
    }
    if (vif_info_tab[uVar10].type == '\x02') {
      uVar7 = uVar7 | 0x208;
      goto LAB_2300c97c;
    }
  }
  if (((txdesc->host).flags & 4) != 0) {
    uVar8 = *puVar9;
    *(char *)puVar9 = (char)uVar8;
    *(byte *)((int)puVar9 + 1) = (byte)((uint)uVar8 >> 8) | 0x20;
  }
  puVar9[5] = vif_info_tab[uVar10].mac_addr.array[0];
  puVar9[6] = vif_info_tab[uVar10].mac_addr.array[1];
  puVar9[7] = vif_info_tab[uVar10].mac_addr.array[2];
  bVar2 = *(byte *)((int)puVar9 + 1) & 3;
  if (bVar2 == 1) {
    puVar9[2] = sta_info_tab[uVar6].mac_addr.array[0];
    puVar9[3] = sta_info_tab[uVar6].mac_addr.array[1];
    puVar9[4] = sta_info_tab[uVar6].mac_addr.array[2];
    puVar9[8] = (txdesc->host).eth_dest_addr.array[0];
    puVar9[9] = (txdesc->host).eth_dest_addr.array[1];
    uVar8 = (txdesc->host).eth_dest_addr.array[2];
  }
  else {
    if (bVar2 == 2) {
      puVar9[2] = (txdesc->host).eth_dest_addr.array[0];
      puVar9[3] = (txdesc->host).eth_dest_addr.array[1];
      puVar9[4] = (txdesc->host).eth_dest_addr.array[2];
      puVar9[8] = (txdesc->host).eth_src_addr.array[0];
      puVar9[9] = (txdesc->host).eth_src_addr.array[1];
      uVar8 = (txdesc->host).eth_src_addr.array[2];
    }
    else {
      if (bVar2 != 0) {
        puVar5[2] = sta_info_tab[uVar6].mac_addr.array[0];
        puVar5[3] = sta_info_tab[uVar6].mac_addr.array[1];
        puVar5[4] = sta_info_tab[uVar6].mac_addr.array[2];
        puVar5[8] = (txdesc->host).eth_dest_addr.array[0];
        puVar5[9] = (txdesc->host).eth_dest_addr.array[1];
        puVar5[10] = (txdesc->host).eth_dest_addr.array[2];
        puVar5[0xc] = (txdesc->host).eth_src_addr.array[0];
        puVar5[0xd] = (txdesc->host).eth_src_addr.array[1];
        puVar5[0xe] = (txdesc->host).eth_src_addr.array[2];
        goto LAB_2300ca20;
      }
      puVar9[2] = (txdesc->host).eth_dest_addr.array[0];
      puVar9[3] = (txdesc->host).eth_dest_addr.array[1];
      puVar9[4] = (txdesc->host).eth_dest_addr.array[2];
      puVar9[8] = vif_info_tab[uVar10].bss_info.bssid.array[0];
      puVar9[9] = vif_info_tab[uVar10].bss_info.bssid.array[1];
      uVar8 = vif_info_tab[uVar10].bss_info.bssid.array[2];
    }
  }
  puVar9[10] = uVar8;
LAB_2300ca20:
  if ((pkVar11 != (key_info_tag *)0x0) &&
     (((vif_info_tab[uVar10].flags & 2) == 0 ||
      (uVar8 = (txdesc->host).ethertype,
      (uint)sta_info_tab[(txdesc->host).staid].ctrl_port_ethertype !=
      (((uint)uVar8 & 0xff) << 8 | (uint)(uVar8 >> 8)))))) {
    uVar8 = *puVar9;
    *(char *)puVar9 = (char)uVar8;
    *(byte *)((int)puVar9 + 1) = (byte)((uint)uVar8 >> 8) | 0x40;
  }
  return;
}


/*
Unable to decompile 'txu_cntrl_push'
Cause: Exception while decompiling 2300cb86: Decompiler process died

*/


void txu_cntrl_tkip_mic_append(txdesc *txdesc,uint8_t ac)

{
  uint8_t uVar1;
  byte bVar2;
  byte bVar3;
  txl_buffer_tag *ptVar4;
  uint32_t uVar5;
  int iVar6;
  key_info_tag *pkVar7;
  int iVar8;
  tx_pbd *ptVar9;
  undefined *puVar10;
  undefined *puVar11;
  tx_pbd *ptVar12;
  txl_buffer_tag *ptVar13;
  undefined auStack48 [4];
  mic_calc mic;
  
  pkVar7 = *sta_info_tab[(txdesc->host).staid].sta_sec_info.cur_key;
  if (pkVar7 != (key_info_tag *)0x0) {
    uVar1 = pkVar7->cipher;
    ptVar4 = (txdesc->lmac).buffer;
    if (uVar1 != '\x01') {
      if ((uVar1 == '\0') || (uVar1 == '\x03')) {
        ptVar9 = &ptVar4->tbd;
        do {
          ptVar12 = ptVar9;
          ptVar9 = (tx_pbd *)ptVar12->next;
        } while (ptVar9 != (tx_pbd *)0x0);
        *(tx_pbd **)&ptVar12->next = &ptVar4->tkip_mic_icv_pbd;
        *(uint8_t **)&(ptVar4->tkip_mic_icv_pbd).datastartptr = ptVar4->tkip_mic_icv;
        *(uint8_t **)&(ptVar4->tkip_mic_icv_pbd).dataendptr = ptVar4->tkip_mic_icv + 3;
        (ptVar4->tkip_mic_icv_pbd).upatterntx = 0xcafefade;
        (ptVar4->tkip_mic_icv_pbd).bufctrlinfo = 0;
        (ptVar4->tkip_mic_icv_pbd).next = 0;
      }
      return;
    }
    ptVar9 = &ptVar4->tbd;
    do {
      ptVar12 = ptVar9;
      ptVar9 = (tx_pbd *)ptVar12->next;
    } while (ptVar9 != (tx_pbd *)0x0);
    bVar2 = (txdesc->umac).head_len;
    bVar3 = (txdesc->umac).hdr_len_802_2;
    *(tx_pbd **)&ptVar12->next = &ptVar4->tkip_mic_icv_pbd;
    *(uint8_t **)&(ptVar4->tkip_mic_icv_pbd).datastartptr = ptVar4->tkip_mic_icv;
    *(uint8_t **)&(ptVar4->tkip_mic_icv_pbd).dataendptr = ptVar4->tkip_mic_icv + 0xb;
    (ptVar4->tkip_mic_icv_pbd).upatterntx = 0xcafefade;
    (ptVar4->tkip_mic_icv_pbd).bufctrlinfo = 0;
    (ptVar4->tkip_mic_icv_pbd).next = 0;
    ptVar13 = (txdesc->lmac).buffer;
    me_mic_init((mic_calc *)auStack48,(uint32_t *)pkVar7->u,&(txdesc->host).eth_dest_addr,
                &(txdesc->host).eth_src_addr,(txdesc->host).tid);
    me_mic_calc((mic_calc *)auStack48,(int)ptVar4 + (uint)bVar2 + (0x14c - (uint)bVar3),
                (uint)(txdesc->umac).hdr_len_802_2);
    uVar5 = (ptVar13->tbd).next;
    while (uVar5 != 0) {
      iVar6 = *(int *)(uVar5 + 4);
      if (iVar6 == 0) {
        me_mic_end((mic_calc *)auStack48);
        iVar8 = *(int *)(uVar5 + 8);
        do {
          puVar10 = auStack48 + iVar6;
          puVar11 = (undefined *)(iVar8 + iVar6);
          iVar6 = iVar6 + 1;
          *puVar11 = *puVar10;
        } while (iVar6 != 8);
        return;
      }
      me_mic_calc((mic_calc *)auStack48,*(uint32_t *)(uVar5 + 8),
                  (*(int *)(uVar5 + 0xc) + 1) - *(uint32_t *)(uVar5 + 8));
      uVar5 = *(uint32_t *)(uVar5 + 4);
    }
    me_mic_end((mic_calc *)auStack48);
    ebreak();
  }
  return;
}



