pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void txu_cntrl_cfm(txdesc *txdesc)

{
  ushort uVar1;
  tx_cfm_tag *ptVar2;
  uint32_t *puVar3;
  
  puVar3 = (uint32_t *)(txdesc->host).status_addr;
  ptVar2 = ((txdesc->lmac).hw_desc)->cfm_ptr;
  uVar1 = (txdesc->host).flags;
  if ((uVar1 & 8) == 0) {
    if ((uVar1 & 0x200) == 0) goto LAB_2300cefc;
  }
  else {
    if (((uVar1 & 0x20) != 0) && (-1 < (int)(ptVar2->status << 8))) {
      rxu_cntrl_get_pm();
    }
    if (((txdesc->host).flags & 0x200) == 0) goto LAB_2300cefc;
    if ((txdesc->host).staid == -1) {
      assert_err("txdesc->host.staid != INVALID_STA_IDX","module",0x3a9);
    }
    txl_frame_send_qosnull_frame((txdesc->host).staid,0x17,(cfm_func_ptr *)0x0,(void *)0x0);
  }
  sta_info_tab[(txdesc->host).staid].ps_service_period = 0;
LAB_2300cefc:
  ptVar2->status = ptVar2->status | 1;
  *(undefined2 *)&ptVar2->credits = 0x101;
  txdesc[-1].buf[0x6b] = 0;
  *puVar3 = ptVar2->status;
  return;
}



void txu_cntrl_protect_mgmt_frame(txdesc *txdesc,uint32_t frame,uint16_t hdr_len)

{
  byte bVar1;
  ushort uVar2;
  uint uVar3;
  undefined2 in_register_00002032;
  uint uStack20;
  int tail_len;
  
  bVar1 = (txdesc->umac).head_len;
  uVar3 = (uint)bVar1;
  if (bVar1 == 0) {
    uVar3 = txu_cntrl_sechdr_len_compute(txdesc,(int *)&uStack20);
    (txdesc->umac).head_len = (uint8_t)uVar3;
    (txdesc->umac).tail_len = (uint8_t)uStack20;
  }
  else {
    uStack20 = (uint)(txdesc->umac).tail_len;
  }
  uVar2 = *(ushort *)frame;
  *(undefined *)frame = *(undefined *)frame;
  *(byte *)(frame + 1) = (byte)((uint)uVar2 >> 8) | 0x40;
  txu_cntrl_sec_hdr_append(txdesc,CONCAT22(in_register_00002032,hdr_len) + frame + uVar3,0);
  return;
}



int _aid_list_delete(uint8_t *mac)

{
  int iVar1;
  int iVar2;
  apm *paVar3;
  
  paVar3 = &apm_env;
  iVar1 = 0;
  do {
    if (paVar3->aid_list[0].used != '\0') {
      iVar2 = memcmp(paVar3->aid_list,mac,6);
      if (iVar2 == 0) {
        memset(paVar3->aid_list,0,6);
        apm_env.aid_list[iVar1].used = '\0';
        return 0;
      }
    }
    iVar1 = iVar1 + 1;
    paVar3 = (apm *)((int)&(paVar3->bss_config).first + 3);
  } while (iVar1 != 10);
  return -1;
}



void apm_sta_delete(uint8_t sta_idx,uint8_t *mac)

{
  uint8_t *puVar1;
  uint8_t *puVar2;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0x1409,5,7,2);
  puVar2 = (uint8_t *)ke_msg_alloc(0x1c09,0xd,7,1);
  _aid_list_delete(mac);
  mm_sec_machwkey_del(sta_idx + '\b');
  apm_env.assoc_sta_count = apm_env.assoc_sta_count + -1;
  *puVar2 = sta_idx;
  ke_msg_send(puVar2);
  *puVar1 = sta_idx;
  puVar1[1] = '\0';
  ke_msg_send(puVar1);
  return;
}



void apm_tx_cfm_handler(uint8_t *param_1,int param_2)

{
  if (-1 < param_2 << 8) {
    _aid_list_delete(param_1);
    ke_msg_free(param_1 + -0xc);
    printf("apm mlme assoc rsp send failed:%d,aid:%d\n",(uint)*(ushort *)(param_1 + 0x44));
    apm_env.assoc_sta_count = apm_env.assoc_sta_count + -1;
    return;
  }
  if (*(short *)(param_1 + 0x44) != 0) {
    ke_msg_send();
    return;
  }
  ke_msg_free(param_1 + -0xc);
  return;
}



void apm_init(void)

{
  memset(&apm_env,0,0x60);
  apm_env.aging_sta_idx = '\0';
  apm_env._22_2_ = 0xc00;
  ke_state_set(7,0);
  return;
}



void apm_start_cfm(int param_1)

{
  byte bVar1;
  uint16_t uVar2;
  apm_start_req *__src;
  undefined *puVar3;
  void *pvVar4;
  uint uVar5;
  int iVar6;
  
  __src = apm_env.param;
  puVar3 = (undefined *)ke_msg_alloc(0x1c01,0xd,7,4);
  if (param_1 == 0) {
    uVar5 = (uint)__src->vif_idx;
    pvVar4 = ke_msg_alloc(0x1e,0,7,4);
    iVar6 = uVar5 + 10;
    *(undefined *)((int)pvVar4 + 2) = 1;
    *(uint8_t *)((int)pvVar4 + 3) = vif_info_tab[uVar5].index;
    ke_msg_send();
    vif_info_tab[uVar5].flags = __src->flags;
    uVar2 = __src->ctrl_port_ethertype;
    vif_info_tab[uVar5].u[0x2ee] = 0;
    *(uint16_t *)(vif_info_tab[uVar5].u + 0x2f0) = uVar2;
    puVar3[2] = (vif_info_tab[uVar5].chan_ctxt)->idx;
    puVar3[3] = __src->vif_idx + '\n';
    memcpy(&sta_info_tab[iVar6].info,__src,0xd);
    sta_info_tab[iVar6].ctrl_port_state = '\x02';
    me_init_bcmc_rate(sta_info_tab + iVar6);
    bVar1 = sta_info_tab[iVar6].pol_tbl.upd_field;
    sta_info_tab[iVar6].mac_addr.array[0] = 1;
    sta_info_tab[iVar6].pol_tbl.upd_field = bVar1 | 0x10;
    sta_info_tab[iVar6].staid = __src->vif_idx + '\n';
  }
  *puVar3 = (char)param_1;
  puVar3[1] = __src->vif_idx;
  ke_timer_set(0x1c0a,7,5000000);
  ke_msg_send(puVar3);
  ke_msg_free(__src[-1].phrase + 0x35);
  apm_env.param = (apm_start_req *)0x0;
  ke_state_set(7,0);
  return;
}



void apm_send_next_bss_param(void)

{
  co_list_hdr *pcVar1;
  
  pcVar1 = co_list_pop_front(&apm_env.bss_config);
  if (pcVar1 == (co_list_hdr *)0x0) {
    assert_err("msg != NULL","module",0xbf);
  }
  ke_msg_send(pcVar1 + 3);
  return;
}



void apm_set_bss_param(void)

{
  byte bVar1;
  apm_start_req *rateset;
  uint16_t uVar2;
  undefined *puVar3;
  void *__dest;
  undefined4 *puVar4;
  uint16_t *puVar5;
  undefined *puVar6;
  undefined2 extraout_var;
  
  rateset = apm_env.param;
  bVar1 = (apm_env.param)->vif_idx;
  puVar3 = (undefined *)ke_msg_alloc(0x1413,5,7,2);
  __dest = ke_msg_alloc(0x18,0,7,7);
  puVar4 = (undefined4 *)ke_msg_alloc(0x16,0,7,8);
  puVar5 = (uint16_t *)ke_msg_alloc(0x14,0,7,4);
  puVar6 = (undefined *)ke_msg_alloc(0x1411,5,7,2);
  *puVar3 = 1;
  puVar3[1] = vif_info_tab[bVar1].index;
  co_list_push_back(&apm_env.bss_config,(co_list_hdr *)(puVar3 + -0xc));
  memcpy(__dest,&vif_info_tab[bVar1].mac_addr,6);
  *(uint8_t *)((int)__dest + 6) = rateset->vif_idx;
  co_list_push_back(&apm_env.bss_config,(co_list_hdr *)((int)__dest + -0xc));
  *(uint8_t *)((int)puVar4 + 5) = (rateset->chan).band;
  uVar2 = me_legacy_rate_bitfield_build((mac_rateset *)rateset,true);
  *puVar4 = CONCAT22(extraout_var,uVar2);
  *(uint8_t *)(puVar4 + 1) = rateset->vif_idx;
  co_list_push_back(&apm_env.bss_config,(co_list_hdr *)(puVar4 + -3));
  *puVar5 = rateset->bcn_int;
  *(uint8_t *)(puVar5 + 1) = rateset->vif_idx;
  co_list_push_back(&apm_env.bss_config,(co_list_hdr *)(puVar5 + -6));
  *puVar6 = 1;
  puVar6[1] = rateset->vif_idx;
  co_list_push_back(&apm_env.bss_config,(co_list_hdr *)(puVar6 + -0xc));
  apm_send_next_bss_param();
  ke_state_set(7,1);
  return;
}



