pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void apm_stop(vif_info_tag *vif)

{
  undefined *puVar1;
  undefined *puVar2;
  void *pvVar3;
  
  puVar1 = (undefined *)ke_msg_alloc(0x1413,5,7,2);
  puVar2 = (undefined *)ke_msg_alloc(0x1411,5,7,2);
  ke_timer_clear(0x1c0a,7);
  *puVar1 = 0;
  puVar1[1] = vif->index;
  ke_msg_send(puVar1);
  if (vif->active != false) {
    pvVar3 = ke_msg_alloc(0x1e,0,7,4);
    *(undefined *)((int)pvVar3 + 2) = 0;
    *(uint8_t *)((int)pvVar3 + 3) = vif->index;
    ke_msg_send();
  }
  if (vif->chan_ctxt != (chan_ctxt_tag *)0x0) {
    chan_ctxt_unlink(vif->index);
  }
  *puVar2 = 0;
  puVar2[1] = vif->index;
  ke_msg_send(puVar2);
  return;
}



_Bool apm_tx_int_ps_check(txdesc *txdesc)

{
  byte bVar1;
  undefined uVar2;
  
  if (vif_info_tab[(txdesc->host).vif_idx].type == '\x02') {
    bVar1 = (txdesc->host).staid;
    uVar2 = 1;
    if (((bVar1 < 0xc) && (sta_info_tab[bVar1].ps_state == '\x01')) &&
       ((sta_info_tab[bVar1].ps_service_period & 3U) == 0)) {
      (txdesc->host).flags = (txdesc->host).flags | 0x1000;
      uVar2 = 0;
    }
  }
  else {
    uVar2 = 1;
  }
  return (_Bool)uVar2;
}



void apm_tx_int_ps_postpone(txdesc *txdesc,sta_info_tag *sta)

{
  byte bVar1;
  sta_ps_traffic sVar2;
  sta_ps_traffic sVar3;
  uint16_t *puVar4;
  
  if ((int)((uint)(txdesc->host).flags << 0x13) < 0) {
    bVar1 = (sta->info).uapsd_queues;
    sVar2 = sta->traffic_avail;
    if ((mac_ac2uapsd[(txdesc->host).tid] & bVar1) == 0) {
      if ((sVar2 & PS_TRAFFIC_INT) != 0) {
        return;
      }
      sVar3 = PS_TRAFFIC_INT;
    }
    else {
      sVar3 = UAPSD_TRAFFIC_INT;
      if ((sVar2 & UAPSD_TRAFFIC_INT) != 0) {
        return;
      }
    }
    sta->traffic_avail = sVar2 | sVar3;
    if (((mac_ac2uapsd[(txdesc->host).tid] & bVar1) == 0) || (bVar1 == 0xf)) {
      puVar4 = (uint16_t *)ke_msg_alloc(0x41,0,5,4);
      *puVar4 = sta->aid;
      *(uint8_t *)((int)puVar4 + 3) = sta->inst_nbr;
      *(undefined *)(puVar4 + 1) = 1;
      ke_msg_send();
      return;
    }
  }
  return;
}



// WARNING: Type propagation algorithm not settling

txdesc * apm_tx_int_ps_get_postpone(vif_info_tag *vif,sta_info_tag *sta,int *stop)

{
  uint8_t uVar1;
  ushort uVar2;
  co_list_hdr cVar3;
  co_list_hdr element;
  uint16_t *puVar4;
  co_list_hdr *pcVar5;
  uint uVar6;
  int *piVar7;
  sta_ps_traffic sVar8;
  sta_ps_traffic sVar9;
  co_list_hdr prev_element;
  
  sVar8 = vif->type;
  if ((sVar8 == PS_TRAFFIC_INT) && (uVar6 = sta->ps_service_period, uVar6 != 0)) {
    sVar9 = PS_TRAFFIC_HOST;
    if ((uVar6 & 1) == 0) {
      sVar9 = UAPSD_TRAFFIC_HOST;
      sVar8 = UAPSD_TRAFFIC_INT;
    }
    if ((sVar8 & sta->traffic_avail) != 0) {
      cVar3 = (co_list_hdr)(sta->tx_desc_post).first;
      prev_element = (co_list_hdr)(co_list_hdr *)0x0;
      while( true ) {
        element = cVar3;
        if (element == (co_list_hdr)0x0) {
          assert_warn("txdesc","module",0x16f);
          *stop = 1;
          return (txdesc *)0x0;
        }
        if (((mac_ac2uapsd[*(byte *)((int)element + 0x2e)] & (sta->info).uapsd_queues) == 0) !=
            (uVar6 == 2)) break;
        cVar3 = *(co_list_hdr *)element;
        prev_element = element;
      }
      co_list_remove(&sta->tx_desc_post,(co_list_hdr *)prev_element,(co_list_hdr *)element);
      *(char *)((int)element + 0x2e) = ((sta->ps_service_period & 8U) != 0) + '\x03';
      if (prev_element == (co_list_hdr)0x0) {
        piVar7 = (int *)(sta->tx_desc_post).first;
      }
      else {
        piVar7 = (int *)((co_list_hdr *)prev_element)->next;
      }
      while (piVar7 != (int *)0x0) {
        if (((mac_ac2uapsd[*(byte *)((int)piVar7 + 0x2e)] & (sta->info).uapsd_queues) == 0) !=
            (sta->ps_service_period == 2)) goto LAB_2300d610;
        piVar7 = (int *)*piVar7;
      }
      sVar8 = ~sVar8 & sta->traffic_avail;
      sta->traffic_avail = sVar8;
      if ((sVar8 & sVar9) == 0) {
        puVar4 = (uint16_t *)ke_msg_alloc(0x41,0,5,4);
        *puVar4 = sta->aid;
        uVar1 = sta->inst_nbr;
        *(undefined *)(puVar4 + 1) = 0;
        *(uint8_t *)((int)puVar4 + 3) = uVar1;
        ke_msg_send();
      }
      else {
LAB_2300d610:
        pcVar5 = ((co_list_hdr *)((int)element + 0x68))->next;
        uVar2 = *(ushort *)&pcVar5[0x53].next;
        *(char *)&pcVar5[0x53].next = (char)uVar2;
        *(byte *)((int)&pcVar5[0x53].next + 1) = (byte)((uint)uVar2 >> 8) | 0x20;
      }
      return (txdesc *)element;
    }
    *stop = 1;
  }
  else {
    *stop = 0;
  }
  return (txdesc *)0x0;
}



void apm_tx_int_ps_clear(vif_info_tag *vif,uint8_t sta_idx)

{
  sta_ps_traffic sVar1;
  uint8_t uVar2;
  uint16_t *puVar3;
  undefined3 in_register_0000202d;
  int iVar4;
  
  iVar4 = CONCAT31(in_register_0000202d,sta_idx);
  if (vif->type != '\x02') {
    return;
  }
  sta_mgmt_send_postponed_frame(vif,sta_info_tab + iVar4,0);
  sVar1 = sta_info_tab[iVar4].traffic_avail;
  if (((sVar1 & (PS_TRAFFIC_INT|UAPSD_TRAFFIC_INT)) != 0) &&
     (sta_info_tab[iVar4].traffic_avail = sVar1 & ~(PS_TRAFFIC_INT|UAPSD_TRAFFIC_INT),
     (sVar1 & ~(PS_TRAFFIC_INT|UAPSD_TRAFFIC_INT)) == 0)) {
    puVar3 = (uint16_t *)ke_msg_alloc(0x41,0,5,4);
    *puVar3 = sta_info_tab[iVar4].aid;
    uVar2 = sta_info_tab[iVar4].inst_nbr;
    *(undefined *)(puVar3 + 1) = 0;
    *(uint8_t *)((int)puVar3 + 3) = uVar2;
    ke_msg_send();
    return;
  }
  return;
}



void apm_sta_fw_delete(uint8_t sta_idx)

{
  undefined3 in_register_00002029;
  
  apm_sta_delete(sta_idx,(uint8_t *)&sta_info_tab[CONCAT31(in_register_00002029,sta_idx)].mac_addr);
  return;
}



void apm_sta_add(uint8_t sta_idx)

{
  undefined3 in_register_00002029;
  int iVar1;
  uint32_t *puVar2;
  
  iVar1 = CONCAT31(in_register_00002029,sta_idx);
  puVar2 = (uint32_t *)ke_msg_alloc(0x1c08,0xd,7,0x1c);
  sta_info_tab[iVar1].ctrl_port_state = '\x02';
  *puVar2 = sta_info_tab[iVar1].info.capa_flags;
  memcpy(puVar2 + 1,&sta_info_tab[iVar1].mac_addr,6);
  *(uint8_t *)((int)puVar2 + 0xb) = sta_info_tab[iVar1].staid;
  *(uint8_t *)((int)puVar2 + 10) = sta_info_tab[iVar1].inst_nbr;
  *(int8_t *)(puVar2 + 3) = sta_info_tab[iVar1].rssi;
  puVar2[4] = sta_info_tab[iVar1].tsflo;
  puVar2[5] = sta_info_tab[iVar1].tsfhi;
  *(uint8_t *)(puVar2 + 6) = sta_info_tab[iVar1].data_rate;
  ke_msg_send(puVar2);
  return;
}



void apm_send_mlme(vif_info_tag *vif,uint16_t fctl,mac_addr *ra,cfm_func_ptr *cfm_func,void *env,
                  uint16_t status_code)

{
  uint8_t uVar1;
  txl_buffer_tag *ptVar2;
  uint16_t uVar3;
  txl_frame_desc_tag *frame;
  undefined2 in_register_0000202e;
  uint uVar4;
  int iVar5;
  tx_hw_desc *ptVar6;
  
  _uVar3 = CONCAT22(in_register_0000202e,fctl);
  frame = txl_frame_get((uint)(((vif->bss_info).chan)->band != '\0'),0x100);
  if (frame == (txl_frame_desc_tag *)0x0) {
    return;
  }
  ptVar2 = (frame->txdesc).lmac.buffer;
  *(undefined *)((int)&ptVar2[1].length + 1) = (char)(fctl >> 8);
  *(char *)&ptVar2[1].length = (char)fctl;
  *(undefined *)((int)&ptVar2[1].length + 2) = 0;
  *(undefined *)((int)&ptVar2[1].length + 3) = 0;
  memcpy(&ptVar2[1].lenheader,ra,6);
  memcpy((void *)((int)&ptVar2[1].lenpad + 2),&vif->mac_addr,6);
  memcpy(&ptVar2[1].next,&vif->mac_addr,6);
  uVar4 = (uint)txl_cntrl_env.seqnbr;
  txl_cntrl_env.seqnbr = (uint16_t)((uVar4 + 1) * 0x10000 >> 0x10);
  iVar5 = (uVar4 + 1) * 0x100000;
  *(undefined *)((int)&ptVar2[1].txdesc + 2) = (char)((uint)iVar5 >> 0x10);
  *(undefined *)((int)&ptVar2[1].txdesc + 3) = (char)((uint)iVar5 >> 0x18);
  if (_uVar3 == 0xb0) {
    uVar3 = me_build_authenticate((uint32_t)ptVar2[1].dma_desc,0,2,0,(uint32_t *)0x0);
    _uVar3 = (uint)uVar3;
  }
  else {
    if (_uVar3 == 0xc0) {
      uVar3 = me_build_deauthenticate((uint32_t)ptVar2[1].dma_desc,status_code);
      _uVar3 = (uint)uVar3;
    }
    else {
      if (_uVar3 == 0x50) {
        uVar3 = me_build_probe_rsp((uint32_t)ptVar2[1].dma_desc,vif->index);
        _uVar3 = (uint)uVar3;
      }
      else {
        uVar4 = 0x18;
        if ((_uVar3 & 0xffffffdf) != 0x10) goto LAB_2300d868;
        uVar3 = me_build_associate_rsp
                          ((uint32_t)ptVar2[1].dma_desc,vif->index,status_code,(me_sta_add_req *)env
                          );
        _uVar3 = (uint)uVar3;
      }
    }
  }
  uVar4 = _uVar3 + 0x18 & 0xffff;
LAB_2300d868:
  ptVar6 = (frame->txdesc).lmac.hw_desc;
  (ptVar6->thd).frmlen = uVar4 + 4;
  (ptVar6->thd).field_5 = (ptVar6->thd).field_4 + -1 + uVar4;
  uVar1 = vif->index;
  (frame->txdesc).umac.head_len = '\0';
  (frame->txdesc).umac.tail_len = '\0';
  (frame->txdesc).host.vif_idx = uVar1;
  (frame->txdesc).host.staid = -1;
  (frame->cfm).cfm_func = cfm_func;
  (frame->cfm).env = env;
  txl_frame_push(frame,'\x03');
  return;
}



_Bool apm_embedded_enabled(vif_info_tag *vif)

{
  _Bool _Var1;
  
  if (vif != (vif_info_tag *)0x0) {
    _Var1 = false;
    if (vif->type == '\x02') {
      _Var1 = apm_env.apm_emb_enabled;
    }
    return (_Bool)(_Var1 & 1);
  }
  return apm_env.apm_emb_enabled;
}



void apm_bcn_set(void)

{
  byte bVar1;
  apm_start_req *paVar2;
  _Bool _Var3;
  uint32_t *puVar4;
  undefined3 extraout_var;
  
  paVar2 = apm_env.param;
  puVar4 = (uint32_t *)
           ke_msg_alloc(0x3f,0,7,(uint16_t)
                                 (((uint)(apm_env.param)->bcn_len + 0xc) * 0x10000 >> 0x10));
  *puVar4 = paVar2->bcn_addr;
  *(uint16_t *)(puVar4 + 1) = paVar2->bcn_len;
  *(uint16_t *)((int)puVar4 + 6) = paVar2->tim_oft;
  *(uint8_t *)(puVar4 + 2) = paVar2->tim_len;
  bVar1 = paVar2->vif_idx;
  *(byte *)((int)puVar4 + 9) = bVar1;
  _Var3 = apm_embedded_enabled(vif_info_tab + bVar1);
  if (CONCAT31(extraout_var,_Var3) == 0) {
    memcpy(puVar4 + 3,(void *)&paVar2->field_0xa7,(uint)paVar2->bcn_len);
  }
  else {
    memcpy(puVar4 + 3,apm_env.bcn_buf,(uint)paVar2->bcn_len);
    ke_free(apm_env.bcn_buf);
    apm_env.bcn_buf = (uint8_t *)0x0;
  }
  ke_msg_send(puVar4);
  ke_state_set(7,2);
  return;
}



