pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void apm_probe_req_handler(ushort *param_1)

{
  uint8_t uVar1;
  ushort uVar2;
  int iVar3;
  vif_info_tag *vif;
  uint __n;
  scan_chan_tag *psVar4;
  int iVar5;
  uint uVar6;
  
  if (*(byte *)(param_1 + 4) == 0xff) {
    vif = vif_mgmt_get_first_ap_inf();
    if (vif == (vif_info_tag *)0x0) {
      return;
    }
  }
  else {
    vif = vif_info_tab + *(byte *)(param_1 + 4);
  }
  iVar3 = mac_ie_find(param_1 + 0x1a,(uint)*param_1 - 0x18 & 0xffff,0);
  if ((iVar3 == 0) || (*(byte *)(iVar3 + 1) == 0)) {
    if (apm_env.hidden_ssid != '\0') {
      return;
    }
  }
  else {
    __n = (uint)(vif->bss_info).ssid.length;
    if (__n != (uint)*(byte *)(iVar3 + 1)) {
      return;
    }
    iVar3 = memcmp((void *)(iVar3 + 2),(vif->bss_info).ssid.array,__n);
    if (iVar3 != 0) {
      return;
    }
  }
  iVar3 = mac_ie_find(param_1 + 0x1a,(uint)*param_1 - 0x18 & 0xffff,3);
  if (iVar3 == 0) goto LAB_2300da50;
  psVar4 = (vif->bss_info).chan;
  uVar1 = psVar4->band;
  uVar2 = psVar4->freq;
  __n = (uint)uVar2;
  if (uVar1 == '\0') {
    uVar6 = 0;
    if (((__n - 0x96c & 0xffff) < 0x49) && (uVar6 = 0xe, uVar2 != 0x9b4)) {
      iVar5 = -0x967;
LAB_2300dac6:
      uVar6 = (int)(__n + iVar5) / 5;
    }
  }
  else {
    uVar6 = 0;
    if ((uVar1 == '\x01') && (uVar6 = 0, (__n - 0x138d & 0xffff) < 0x335)) {
      iVar5 = -5000;
      goto LAB_2300dac6;
    }
  }
  if ((uint)*(byte *)(iVar3 + 2) != uVar6) {
    return;
  }
LAB_2300da50:
  apm_send_mlme(vif,0x50,(mac_addr *)(param_1 + 0x13),(cfm_func_ptr *)0x0,(void *)0x0,0);
  return;
}



void apm_auth_handler(rxu_mgt_ind *param)

{
  byte bVar1;
  mac_addr *addr;
  uint8_t sta_idx;
  undefined3 extraout_var;
  
  bVar1 = param->inst_nbr;
  if (bVar1 != 0xff) {
    addr = (mac_addr *)(param[1].sa + 1);
    sta_idx = hal_machw_search_addr(addr);
    if (CONCAT31(extraout_var,sta_idx) != 0xff) {
      apm_sta_delete(sta_idx,(uint8_t *)addr);
    }
    apm_send_mlme(vif_info_tab + bVar1,0xb0,addr,(cfm_func_ptr *)0x0,(void *)0x0,0);
    return;
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void apm_assoc_req_handler(ushort *param_1,int param_2)

{
  uint8_t uVar1;
  IEEEtypes_Addr_t IVar2;
  uint8_t uVar3;
  ushort *puVar4;
  byte bVar5;
  uint16_t status_code;
  IEEEtypes_MacAddr_t *peerMacAddr;
  int iVar6;
  int iVar7;
  undefined2 extraout_var;
  uint8_t *puVar8;
  int iVar9;
  uint16_t fctl;
  uint __n;
  mac_rateset *pmVar10;
  IEEEtypes_Addr_t *pIVar11;
  IEEEtypes_Addr_t *pIVar12;
  uint uVar13;
  apm *paVar14;
  mac_addr *ra;
  short sVar15;
  uint uVar16;
  Cipher_t aCStack84 [4];
  undefined2 uStack80;
  
  uVar16 = (uint)*(byte *)(param_1 + 4);
  if (*(byte *)(param_1 + 4) == 0xff) {
    return;
  }
  peerMacAddr = (IEEEtypes_MacAddr_t *)ke_msg_alloc(0x1407,5,7,0x58);
  ra = (mac_addr *)(param_1 + 0x13);
  memset(peerMacAddr,0,0x58);
  memcpy(peerMacAddr,ra,6);
  (peerMacAddr + 0xc)[1] = *(IEEEtypes_Addr_t *)(param_1 + 4);
  *(undefined4 *)(peerMacAddr + 0xc + 4) = *(undefined4 *)(param_1 + 8);
  *(undefined4 *)(peerMacAddr + 0xd + 2) = *(undefined4 *)(param_1 + 10);
  (peerMacAddr + 0xe)[0] = *(IEEEtypes_Addr_t *)(param_1 + 0xc);
  (peerMacAddr + 0xe)[1] = *(IEEEtypes_Addr_t *)((int)param_1 + 0x1b);
  if (param_2 == 0) {
    puVar4 = param_1 + 0x1c;
    uVar13 = (uint)*param_1 - 0x1c;
  }
  else {
    puVar4 = param_1 + 0x1f;
    uVar13 = (uint)*param_1 - 0x22;
  }
  status_code = 0x33;
  if (param_1[0x1b] <= vif_info_tab[uVar16].bss_info.max_listen_interval) {
    uVar13 = uVar13 & 0xffff;
    iVar6 = mac_ie_find(puVar4,uVar13,0);
    if (((iVar6 == 0) ||
        (__n = (uint)vif_info_tab[uVar16].bss_info.ssid.length, __n != (uint)*(byte *)(iVar6 + 1)))
       || (iVar6 = memcmp((void *)(iVar6 + 2),vif_info_tab[uVar16].bss_info.ssid.array,__n),
          iVar6 != 0)) {
      status_code = 1;
    }
    else {
      iVar7 = mac_ie_find(puVar4,uVar13,1);
      status_code = 0x12;
      if (iVar7 != 0) {
        __n = (uint)*(byte *)(iVar7 + 1);
        puVar8 = (uint8_t *)(iVar7 + 2);
        uStack80 = uStack80 & 0xff00 | (ushort)*(byte *)(iVar7 + 1);
        pmVar10 = (mac_rateset *)&uStack80;
        while( true ) {
          __n = __n - 1;
          pmVar10 = (mac_rateset *)pmVar10->array;
          if (__n == 0xffffffff) break;
          uVar1 = *puVar8;
          puVar8 = puVar8 + 1;
          pmVar10->length = uVar1;
        }
        iVar7 = mac_ie_find(puVar4,uVar13,0x32);
        if (iVar7 != 0) {
          bVar5 = *(byte *)(iVar7 + 1);
          __n = 0;
          while ((uint)bVar5 != __n) {
            *(undefined *)((int)&uStack80 + (byte)uStack80 + __n + 1) =
                 *(undefined *)(iVar7 + 2 + __n);
            __n = __n + 1;
          }
          uStack80 = uStack80 & 0xff00 | (ushort)(byte)(bVar5 + (byte)uStack80);
        }
        status_code = me_legacy_rate_bitfield_build((mac_rateset *)&uStack80,false);
        (peerMacAddr + 1)[0] = '\0';
        __n = 0;
        while (__n < vif_info_tab[uVar16].bss_info.rate_set.length) {
          iVar7 = (int)&vif_info_tab[uVar16].list_hdr.next + __n;
          bVar5 = me_rate_translate(*(uint8_t *)(iVar7 + 0x3b1));
          if ((CONCAT22(extraout_var,status_code) >> ((uint)bVar5 & 0x1f) & 1U) == 0) {
            if (*(char *)(iVar7 + 0x3b1) < '\0') {
              status_code = 0x12;
              goto fail;
            }
          }
          else {
            bVar5 = (peerMacAddr + 1)[0];
            (peerMacAddr + 1)[(uint)bVar5 + 1] = *(IEEEtypes_Addr_t *)(iVar7 + 0x3b1);
            (peerMacAddr + 1)[0] = bVar5 + 1;
          }
          __n = __n + 1 & 0xff;
        }
        iVar7 = mac_ie_find(puVar4,uVar13,0x2d);
        if (iVar7 != 0) {
          *(undefined2 *)(peerMacAddr + 3 + 2) = *(undefined2 *)(iVar7 + 2);
          pIVar11 = (IEEEtypes_Addr_t *)(iVar7 + 5);
          (peerMacAddr + 3)[4] = *(IEEEtypes_Addr_t *)(iVar7 + 4);
          pIVar12 = peerMacAddr + 3 + 5;
          while (pIVar12 != peerMacAddr + 6 + 3) {
            IVar2 = *pIVar11;
            pIVar11 = pIVar11 + 1;
            *pIVar12 = IVar2;
            pIVar12 = pIVar12 + 1;
          }
          *(undefined2 *)(peerMacAddr + 6 + 4) = *(undefined2 *)(iVar7 + 0x15);
          *(uint *)(peerMacAddr + 7 + 2) = (uint)*(ushort *)(iVar7 + 0x17);
          (peerMacAddr + 8)[0] = *(IEEEtypes_Addr_t *)(iVar7 + 0x1b);
          *(uint *)(peerMacAddr + 10 + 4) = *(uint *)(peerMacAddr + 10 + 4) | 2;
        }
        iVar7 = mac_vsie_find(puVar4,uVar13,&DAT_23075444,4);
        if (iVar7 != 0) {
          bVar5 = *(byte *)(iVar7 + 8);
          *(uint *)(peerMacAddr + 10 + 4) = *(uint *)(peerMacAddr + 10 + 4) | 1;
          (peerMacAddr + 0xb)[4] = bVar5 & 0xf;
          (peerMacAddr + 0xb)[5] = bVar5 >> 4 & 6;
        }
        memset((mac_rateset *)&uStack80,0,2);
        memset(aCStack84,0,1);
        iVar7 = mac_ie_find(puVar4,uVar13,0x30);
        if (iVar7 == 0) {
          iVar7 = mac_vsie_find(puVar4,uVar13,&DAT_2307544c,4);
          if (iVar7 != 0) {
            uStack80 = uStack80 | 8;
            aCStack84[0] = (Cipher_t)((byte)aCStack84[0] | 4);
          }
        }
        else {
          uStack80 = uStack80 | 0x20;
          aCStack84[0] = (Cipher_t)((byte)aCStack84[0] | 8);
        }
        if (uap_conn_info != (cm_ConnectionInfo_t *)0x0) {
          status_code = 0x2e;
          if ((uStack80 & 0x28) == 0) goto fail;
          InitStaKeyInfo(uap_conn_info,(SecurityMode_t *)(mac_rateset *)&uStack80,aCStack84,0,'\0');
          cm_SetPeerAddr(uap_conn_info,(IEEEtypes_MacAddr_t *)0x0,peerMacAddr);
        }
        uVar3 = apm_env.max_sta_supported;
        uVar1 = apm_env.assoc_sta_count;
        *(undefined2 *)(peerMacAddr + 0xb + 2) = 0;
        if (uVar1 < uVar3) {
          paVar14 = &apm_env;
          iVar7 = -1;
          do {
            sVar15 = (short)iVar6;
            if (paVar14->aid_list[0].used == '\0') {
              if (iVar7 == -1) {
                iVar7 = iVar6;
              }
            }
            else {
              iVar9 = memcmp(paVar14->aid_list,ra,6);
              if (iVar9 == 0) {
                apm_env.aid_list[iVar6].used = '\x01';
                goto LAB_2300dee6;
              }
            }
            sVar15 = (short)iVar7;
            iVar6 = iVar6 + 1;
            paVar14 = (apm *)((int)&(paVar14->bss_config).first + 3);
          } while (iVar6 != 10);
          if (iVar7 != -1) {
            memcpy(apm_env.aid_list + iVar7,ra,6);
            apm_env.aid_list[iVar7].used = '\x01';
LAB_2300dee6:
            *(short *)(peerMacAddr + 0xb + 2) = sVar15 + 1;
            apm_env.assoc_sta_count = apm_env.assoc_sta_count + '\x01';
            status_code = 0;
            goto fail;
          }
        }
        status_code = 0x11;
      }
    }
  }
fail:
  fctl = 0x30;
  if (param_2 == 0) {
    fctl = 0x10;
  }
  apm_send_mlme(vif_info_tab + uVar16,fctl,ra,apm_tx_cfm_handler,peerMacAddr,status_code);
  return;
}



void apm_deauth_handler(rxu_mgt_ind *param)

{
  if ((param->inst_nbr != -1) && (param->sta_idx != -1)) {
    apm_sta_delete(param->sta_idx,param[1].sa + 1);
    return;
  }
  return;
}



void apm_disassoc_handler(rxu_mgt_ind *param)

{
  byte bVar1;
  
