pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  bVar1 = param->inst_nbr;
  if ((bVar1 != 0xff) && (param->sta_idx != -1)) {
    apm_sta_delete(param->sta_idx,(uint8_t *)(mac_addr *)(param[1].sa + 1));
    apm_send_mlme(vif_info_tab + bVar1,0xc0,(mac_addr *)(param[1].sa + 1),(cfm_func_ptr *)0x0,
                  (void *)0x0,2);
    return;
  }
  return;
}



void apm_beacon_handler(rxu_mgt_ind *param)

{
  return;
}



void apm_sta_remove(uint8_t vif_idx,uint8_t sta_idx)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  
  apm_send_mlme(vif_info_tab + CONCAT31(in_register_00002029,vif_idx),0xc0,
                &sta_info_tab[CONCAT31(in_register_0000202d,sta_idx)].mac_addr,(cfm_func_ptr *)0x0,
                (void *)0x0,2);
  apm_sta_delete(sta_idx,(uint8_t *)&sta_info_tab[CONCAT31(in_register_0000202d,sta_idx)].mac_addr);
  return;
}



char * cfg_api_element_dump(void *val,CFG_ELEMENT_TYPE type,char *strs)

{
  int iVar1;
  char *pcVar2;
  
  switch((uint)type - 1 & 0xff) {
  case 0:
    if (*(char *)val == '\0') {
      pcVar2 = "False";
    }
    else {
      pcVar2 = "True";
    }
    iVar1 = snprintf(strs,0xf,"%s",pcVar2);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "Boolean";
    break;
  case 1:
    iVar1 = snprintf(strs,0xf,"%d",(int)*(char *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "SINT8";
    break;
  case 2:
    iVar1 = snprintf(strs,0xf,"%u",(uint)*(byte *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "UINT8";
    break;
  case 3:
    iVar1 = snprintf(strs,0xf,"%d",(int)*(short *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "SINT16";
    break;
  case 4:
    iVar1 = snprintf(strs,0xf,"%u",(uint)*(ushort *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "UINT16";
    break;
  case 5:
    iVar1 = snprintf(strs,0xf,"%ld",*(undefined4 *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "SINT32";
    break;
  case 6:
    iVar1 = snprintf(strs,0xf,"%lu",*(undefined4 *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "UINT32";
    break;
  case 7:
    iVar1 = snprintf(strs,0xf,"%lu",*(undefined4 *)val);
    if (iVar1 < 0) {
      iVar1 = 0;
    }
    strs[iVar1] = '\0';
    pcVar2 = "STRING";
    break;
  default:
    return (char *)0x0;
  }
  return pcVar2;
}



int cfg_api_element_general_set(cfg_element_entry *entry,void *arg1,void *arg2)

{
  undefined uVar1;
  undefined2 uVar2;
  uint uVar3;
  undefined4 *puVar4;
  
  printf("  updating element: %s\r\n",entry->name);
  uVar3 = (uint)entry->type - 1 & 0xffff;
  if (6 < uVar3) {
    return 0;
  }
  puVar4 = (undefined4 *)entry->val;
  switch(uVar3) {
  default:
    uVar1 = *(undefined *)arg1;
    break;
  case 1:
    uVar1 = *(undefined *)arg1;
    break;
  case 3:
    uVar2 = *(undefined2 *)arg1;
    goto LAB_2300e1dc;
  case 4:
    uVar2 = *(undefined2 *)arg1;
LAB_2300e1dc:
    *(undefined2 *)puVar4 = uVar2;
    return 0;
  case 5:
  case 6:
    *puVar4 = *(undefined4 *)arg1;
    return 0;
  }
  *(undefined *)puVar4 = uVar1;
  return 0;
}



int cfg_api_element_general_get(cfg_element_entry *entry,void *arg1,void *arg2)

{
  return 0;
}



int cfg_api_element_set(uint32_t task,uint32_t element,uint32_t type,void *arg1,void *arg2)

{
  cfg_element_entry *pcVar1;
  
  pcVar1 = cfg_entrys_mm;
  while (pcVar1 < &_fsymc_info_bloop) {
    if ((pcVar1->task == task) && ((uint)pcVar1->element == element)) {
      if ((uint)pcVar1->type == type) goto LAB_2300e244;
      printf("type %lu NOT matched on element: %lu %lu %u\r\n",type,task,element);
    }
    pcVar1 = pcVar1 + 1;
  }
  if (pcVar1 != (cfg_element_entry *)&_fsymc_info_bloop) {
LAB_2300e244:
    (*pcVar1->set)(pcVar1,arg1,arg2);
  }
  return 0;
}



void co_list_init(co_list *list)

{
  list->first = (co_list_hdr *)0x0;
  list->last = (co_list_hdr *)0x0;
  return;
}



void co_list_push_back(co_list *list,co_list_hdr *list_hdr)

{
  if (list_hdr == (co_list_hdr *)0x0) {
    assert_err("list_hdr != NULL","module",0x47);
  }
  if (list->first == (co_list_hdr *)0x0) {
    list->first = list_hdr;
  }
  else {
    list->last->next = list_hdr;
  }
  list->last = list_hdr;
  list_hdr->next = (co_list_hdr *)0x0;
  return;
}



void co_list_push_front(co_list *list,co_list_hdr *list_hdr)

{
  if (list_hdr == (co_list_hdr *)0x0) {
    assert_err("list_hdr != NULL","module",0x5e);
  }
  if (list->first == (co_list_hdr *)0x0) {
    list->last = list_hdr;
  }
  list_hdr->next = list->first;
  list->first = list_hdr;
  return;
}



co_list_hdr * co_list_pop_front(co_list *list)

{
  co_list_hdr *pcVar1;
  
  pcVar1 = list->first;
  if (pcVar1 != (co_list_hdr *)0x0) {
    list->first = pcVar1->next;
  }
  return pcVar1;
}



// WARNING: Type propagation algorithm not settling

void co_list_extract(co_list *list,co_list_hdr *list_hdr)

{
  co_list_hdr cVar1;
  co_list_hdr cVar2;
  
  if (list == (co_list *)0x0) {
    assert_err("list != NULL","module",0x81);
  }
  cVar1 = (co_list_hdr)list->first;
  if (cVar1 != (co_list_hdr)0x0) {
    if (cVar1 == (co_list_hdr)list_hdr) {
      list->first = list_hdr->next;
    }
    else {
      do {
        cVar2 = cVar1;
        cVar1 = *(co_list_hdr *)cVar2;
        if (cVar1 == (co_list_hdr)0x0) {
          return;
        }
      } while (cVar1 != (co_list_hdr)list_hdr);
      if (list->last == list_hdr) {
        *(co_list_hdr *)&((co_list_hdr *)&list->last)->next = cVar2;
      }
      *(co_list_hdr **)cVar2 = list_hdr->next;
    }
  }
  return;
}



// WARNING: Type propagation algorithm not settling

uint32_t co_list_cnt(co_list *list)

{
  uint32_t uVar1;
  int *piVar2;
  
