pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  piVar2 = (int *)list->first;
  uVar1 = 0;
  while (piVar2 != (int *)0x0) {
    uVar1 = uVar1 + 1;
    piVar2 = (int *)*piVar2;
  }
  return uVar1;
}



// WARNING: Type propagation algorithm not settling

void co_list_insert(co_list *list,co_list_hdr *element,
                   anon_subr__Bool_co_list_hdr_ptr_co_list_hdr_ptr *cmp)

{
  co_list_hdr cVar1;
  co_list_hdr cVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  co_list_hdr cVar4;
  
  cVar1 = (co_list_hdr)list->first;
  cVar4 = (co_list_hdr)(co_list_hdr *)0x0;
  while (cVar2 = cVar1, cVar2 != (co_list_hdr)0x0) {
    _Var3 = (*cmp)(element,(co_list_hdr *)cVar2);
    if (CONCAT31(extraout_var,_Var3) != 0) goto LAB_2300e398;
    cVar1 = *(co_list_hdr *)cVar2;
    cVar4 = cVar2;
  }
  list->last = element;
LAB_2300e398:
  *(co_list_hdr *)&element->next = cVar2;
  if (cVar4 == (co_list_hdr)0x0) {
    list->first = element;
  }
  else {
    ((co_list_hdr *)cVar4)->next = element;
  }
  return;
}



// WARNING: Type propagation algorithm not settling

void co_list_insert_after(co_list *list,co_list_hdr *prev_element,co_list_hdr *element)

{
  co_list_hdr cVar1;
  
  cVar1 = (co_list_hdr)list->first;
  if (prev_element == (co_list_hdr *)0x0) {
    co_list_push_front(list,element);
    return;
  }
  while( true ) {
    if (cVar1 == (co_list_hdr)0x0) {
      return;
    }
    if (cVar1 == (co_list_hdr)prev_element) break;
    cVar1 = *(co_list_hdr *)cVar1;
  }
  element->next = *(co_list_hdr **)cVar1;
  *(co_list_hdr **)cVar1 = element;
  if (element->next != (co_list_hdr *)0x0) {
    return;
  }
  list->last = element;
  return;
}



void co_list_remove(co_list *list,co_list_hdr *prev_element,co_list_hdr *element)

{
  if (list == (co_list *)0x0) {
    assert_err("list != NULL","module",0x168);
  }
  if (prev_element == (co_list_hdr *)0x0) {
    if (element == (co_list_hdr *)0x0) goto LAB_2300e43c;
LAB_2300e456:
    list->first = element->next;
  }
  else {
    if (prev_element->next != element) {
      assert_err("(prev_element == NULL) || (prev_element->next == element)","module",0x169);
    }
    if (element == (co_list_hdr *)0x0) {
LAB_2300e43c:
      assert_err("element != NULL","module",0x16a);
      if (prev_element == (co_list_hdr *)0x0) goto LAB_2300e456;
    }
    prev_element->next = element->next;
    if (list->last == element) {
      list->last = prev_element;
    }
  }
  element->next = (co_list_hdr *)0x0;
  return;
}



uint32_t co_crc32(uint32_t addr,uint32_t len,uint32_t crc)

{
  uint32_t uVar1;
  byte *pbVar2;
  
  uVar1 = 0;
  while (uVar1 != len) {
    pbVar2 = (byte *)(uVar1 + addr);
    uVar1 = uVar1 + 1;
    crc = crc << 8 ^ crc_tab[crc >> 0x18 ^ (uint)*pbVar2];
  }
  return crc;
}


/*
Unable to decompile 'ke_evt_set'
Cause: Exception while decompiling 2300e49c: Decompiler process died

*/

/*
Unable to decompile 'ke_evt_clear'
Cause: Exception while decompiling 2300e4b4: Decompiler process died

*/


void bl_event_handle(int param)

{
  ke_evt_clear(0x40000000);
  bl_main_event_handle();
  return;
}


/*
Unable to decompile 'bl_fw_statistic_dump'
Cause: Exception while decompiling 2300e4e4: Decompiler process died

*/


void bl60x_fw_dump_statistic(int forced)

{
  if (forced != 0) {
    bl_fw_statistic_dump(0);
    return;
  }
  ke_evt_set(0x20);
  return;
}



void ke_evt_schedule(void)

{
  int iVar1;
  evt_ptr_t *peVar2;
  
  while (ke_env.evt_field != 0) {
    iVar1 = __clzsi2(ke_env.evt_field);
    peVar2 = ke_evt_hdlr[iVar1].func;
    if ((0x1a < iVar1) || (peVar2 == (evt_ptr_t *)0x0)) {
      assert_err("(event < KE_EVT_MAX) && ke_evt_hdlr[event].func","module",0xdd);
    }
    (*peVar2)(ke_evt_hdlr[iVar1].param);
  }
  return;
}



void ke_init(void)

{
  ke_env.mblock_first = ke_mem_init();
  ke_env.queue_saved.first = (co_list_hdr *)0x0;
  ke_env.queue_saved.last = (co_list_hdr *)0x0;
  ke_env.queue_sent.first = (co_list_hdr *)0x0;
  ke_env.queue_sent.last = (co_list_hdr *)0x0;
  ke_env.queue_timer.first = (co_list_hdr *)0x0;
  ke_env.queue_timer.last = (co_list_hdr *)0x0;
  ke_evt_clear(0xffffffff);
  return;
}


/*
Unable to decompile 'ke_mem_init'
Cause: Exception while decompiling 2300e5dc: Decompiler process died

*/

/*
Unable to decompile 'ke_malloc'
Cause: Exception while decompiling 2300e602: Decompiler process died

*/

/*
Unable to decompile 'ke_free'
Cause: Exception while decompiling 2300e696: Decompiler process died

*/


void * ke_msg_alloc(ke_msg_id_t id,ke_task_id_t dest_id,ke_task_id_t src_id,uint16_t param_len)

{
  undefined4 *puVar1;
  undefined2 in_register_00002036;
  
  puVar1 = (undefined4 *)ke_malloc(CONCAT22(in_register_00002036,param_len) + 0xc);
  if (puVar1 == (undefined4 *)0x0) {
    assert_err("msg != NULL","module",0x50);
  }
  *(ke_msg_id_t *)(puVar1 + 1) = id;
  *(ke_task_id_t *)((int)puVar1 + 6) = dest_id;
  *(ke_task_id_t *)(puVar1 + 2) = src_id;
  *(uint16_t *)((int)puVar1 + 10) = param_len;
  *puVar1 = 0;
  memset(puVar1 + 3,0,CONCAT22(in_register_00002036,param_len));
  return puVar1 + 3;
}



void ke_msg_send(int param_1)

{
  if (*(byte *)(param_1 + -6) < 0xf) {
    if (*(byte *)(param_1 + -6) < 0xd) {
      co_list_push_back(&ke_env.queue_sent,(co_list_hdr *)(param_1 + -0xc));
      ke_evt_set(0x1000000);
      return;
    }
  }
  else {
    assert_err("id <= TASK_MAX","module",0xb6);
  }
  bl_rx_e2a_handler((void *)(param_1 + -8));
  ke_free((co_list_hdr *)(param_1 + -0xc));
  return;
}



void ke_msg_send_basic(ke_msg_id_t id,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_msg_alloc(id,dest_id,src_id,0);
  ke_msg_send();
  return;
}



void ke_msg_forward_and_change_id
               (void *param_ptr,ke_msg_id_t msg_id,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  *(ke_msg_id_t *)((int)param_ptr + -8) = msg_id;
  *(ke_task_id_t *)((int)param_ptr + -6) = dest_id;
  *(ke_task_id_t *)((int)param_ptr + -4) = src_id;
  ke_msg_send();
  return;
}


