pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'ke_msg_free'
Cause: Exception while decompiling 2300e860: Decompiler process died

*/


_Bool cmp_dest_id(co_list_hdr *msg,uint32_t dest_id)

{
  return (_Bool)((uint)*(ushort *)((int)&msg[1].next + 2) == dest_id);
}



_Bool ke_task_local(ke_task_id_t id)

{
  undefined2 in_register_0000202a;
  
  if (0xe < CONCAT22(in_register_0000202a,id)) {
    assert_err("id <= TASK_MAX","module",0xb6);
  }
  return (_Bool)(CONCAT22(in_register_0000202a,id) < 0xd);
}



ke_msg_func_t * ke_handler_search(ke_msg_id_t msg_id,ke_state_handler *state_handler)

{
  undefined2 in_register_0000202a;
  int iVar1;
  
  iVar1 = (uint)state_handler->msg_cnt - 1;
  if (iVar1 == -1) {
    return (ke_msg_func_t *)0x0;
  }
  do {
    if ((uint)state_handler->msg_table[iVar1].id == CONCAT22(in_register_0000202a,msg_id)) {
      if (state_handler->msg_table[iVar1].func == (ke_msg_func_t *)0x0) {
        assert_err("state_handler->msg_table[i].func","module",0xf4);
      }
      return state_handler->msg_table[iVar1].func;
    }
    iVar1 = iVar1 + -1;
  } while (iVar1 != -1);
  return (ke_msg_func_t *)0x0;
}


/*
Unable to decompile 'ke_state_set'
Cause: Exception while decompiling 2300e902: Decompiler process died

*/


ke_state_t ke_state_get(ke_task_id_t id)

{
  uint uVar1;
  _Bool _Var2;
  undefined2 in_register_0000202a;
  undefined3 extraout_var;
  uint uVar3;
  
  uVar1 = (uint)id & 0xff;
  uVar3 = CONCAT22(in_register_0000202a,id) >> 8;
  if (0xd < uVar1) {
    assert_err("type < TASK_MAX","module",0xd7);
  }
  _Var2 = ke_task_local((ke_task_id_t)uVar1);
  if (CONCAT31(extraout_var,_Var2) == 0) {
    assert_err("ke_task_local(type)","module",0xd8);
  }
  if (TASK_DESC[uVar1].idx_max <= uVar3) {
    assert_err("idx < TASK_DESC[type].idx_max","module",0xd9);
  }
  return TASK_DESC[uVar1].state[uVar3];
}


/*
Unable to decompile 'ke_task_schedule'
Cause: Exception while decompiling 2300ea9a: Decompiler process died

*/


int ke_msg_discard(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  return 0;
}



int ke_msg_save(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  return 2;
}


/*
Unable to decompile 'ke_timer_hw_set'
Cause: Exception while decompiling 2300ec08: Decompiler process died

*/


_Bool cmp_abs_time(co_list_hdr *timerA,co_list_hdr *timerB)

{
  return (_Bool)((co_list_hdr *)0x11e1a300 <
                (co_list_hdr *)((int)timerA[2].next - (int)timerB[2].next));
}



_Bool cmp_timer_id(co_list_hdr *timer,uint32_t timer_task)

{
  if ((uint)*(ushort *)&timer[1].next == timer_task >> 0x10) {
    return (_Bool)((uint)*(ushort *)((int)&timer[1].next + 2) == (timer_task & 0xffff));
  }
  return false;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ke_timer_set(ke_msg_id_t timer_id,ke_task_id_t task_id,uint32_t delay)

{
  bool bVar1;
  co_list_hdr *pcVar2;
  undefined2 in_register_0000202a;
  char *condition;
  co_list_hdr *element;
  undefined2 in_register_0000202e;
  int line;
  
  if (delay == 0) {
    line = 0x8c;
    condition = "delay > 0";
  }
  else {
    if (delay < 300000000) goto LAB_2300ecb6;
    line = 0x8d;
    condition = "delay < KE_TIMER_DELAY_MAX";
  }
  assert_err(condition,"module",line);
LAB_2300ecb6:
  bVar1 = false;
  if ((ke_env.queue_timer.first != (co_list_hdr *)0x0) &&
     ((uint)*(ushort *)&ke_env.queue_timer.first[1].next == CONCAT22(in_register_0000202a,timer_id))
     ) {
    bVar1 = (uint)*(ushort *)((int)&ke_env.queue_timer.first[1].next + 2) ==
            CONCAT22(in_register_0000202e,task_id);
  }
  element = ke_queue_extract(&ke_env.queue_timer,cmp_timer_id,
                             CONCAT22(in_register_0000202a,timer_id) << 0x10 |
                             CONCAT22(in_register_0000202e,task_id));
  if (element == (co_list_hdr *)0x0) {
    element = (co_list_hdr *)ke_malloc(0xc);
    if (element == (co_list_hdr *)0x0) {
      assert_err("timer","module",0x9d);
    }
    *(ke_msg_id_t *)&element[1].next = timer_id;
    *(ke_task_id_t *)((int)&element[1].next + 2) = task_id;
  }
  pcVar2 = (co_list_hdr *)(delay + _DAT_44b00120);
  element[2].next = pcVar2;
  co_list_insert(&ke_env.queue_timer,element,cmp_abs_time);
  if ((bVar1) || (ke_env.queue_timer.first == element)) {
    ke_timer_hw_set(ke_env.queue_timer.first);
  }
  if ((int)((int)pcVar2 - _DAT_44b00120) < 0) {
    ke_evt_set(0x4000000);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ke_timer_clear(ke_msg_id_t timer_id,ke_task_id_t task_id)

{
  co_list_hdr *pcVar1;
  undefined2 in_register_0000202a;
  co_list_hdr *mem_ptr;
  undefined2 in_register_0000202e;
  
  mem_ptr = ke_env.queue_timer.first;
  if (ke_env.queue_timer.first == (co_list_hdr *)0x0) {
    return;
  }
  if (((uint)*(ushort *)&ke_env.queue_timer.first[1].next == CONCAT22(in_register_0000202a,timer_id)
      ) && ((uint)*(ushort *)((int)&ke_env.queue_timer.first[1].next + 2) ==
            CONCAT22(in_register_0000202e,task_id))) {
    co_list_pop_front(&ke_env.queue_timer);
    pcVar1 = ke_env.queue_timer.first;
    ke_timer_hw_set(ke_env.queue_timer.first);
    if ((pcVar1 != (co_list_hdr *)0x0) && ((int)((int)pcVar1[2].next - _DAT_44b00120) < 0)) {
      assert_err("!first || !ke_time_past(first->time)","module",0xd7);
    }
  }
  else {
    mem_ptr = ke_queue_extract(&ke_env.queue_timer,cmp_timer_id,
                               CONCAT22(in_register_0000202a,timer_id) << 0x10 |
                               CONCAT22(in_register_0000202e,task_id));
    if (mem_ptr == (co_list_hdr *)0x0) {
      return;
    }
  }
  ke_free(mem_ptr);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ke_timer_schedule(int dummy)

{
  co_list_hdr *mem_ptr;
  
