pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  while( true ) {
    ke_evt_clear(0x4000000);
    mem_ptr = ke_env.queue_timer.first;
    if (ke_env.queue_timer.first == (co_list_hdr *)0x0) {
      ke_timer_hw_set(0);
      return;
    }
    if ((-1 < (int)ke_env.queue_timer.first[2].next + (-0x32 - _DAT_44b00120)) &&
       (ke_timer_hw_set(ke_env.queue_timer.first), -1 < (int)((int)mem_ptr[2].next - _DAT_44b00120))
       ) break;
    mem_ptr = co_list_pop_front(&ke_env.queue_timer);
    ke_msg_send_basic(*(ke_msg_id_t *)&mem_ptr[1].next,*(ke_task_id_t *)((int)&mem_ptr[1].next + 2),
                      0xff);
    ke_free(mem_ptr);
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl60x_current_time_us(longlong *time_now)

{
  undefined4 uVar1;
  
  uVar1 = _DAT_44b080a8;
  *(undefined4 *)time_now = _DAT_44b080a4;
  *(undefined4 *)((int)time_now + 4) = uVar1;
  return;
}



byte * mac_ie_find(byte *param_1,int param_2,uint param_3)

{
  byte *pbVar1;
  
  pbVar1 = param_1 + param_2;
  while( true ) {
    if (pbVar1 <= param_1) {
      return (byte *)0;
    }
    if ((uint)*param_1 == param_3) break;
    param_1 = param_1 + (uint)param_1[1] + 2;
  }
  return param_1;
}



char * mac_vsie_find(char *param_1,int param_2,int param_3,int param_4)

{
  int iVar1;
  char *pcVar2;
  int iVar3;
  
  pcVar2 = param_1 + param_2;
  while (param_1 < pcVar2) {
    if (*param_1 == -0x23) {
      iVar3 = 0;
      do {
        if (param_4 == iVar3) {
          return param_1;
        }
        iVar1 = iVar3 + 2;
        iVar3 = iVar3 + 1;
      } while (*(char *)(param_3 + iVar3 + -1) == param_1[iVar1]);
    }
    param_1 = param_1 + (uint)(byte)param_1[1] + 2;
  }
  if (param_1 != pcVar2) {
    puts("--->>> addr != end\r\n");
    return (char *)0;
  }
  return (char *)0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BufferDesc_t *
GetTxEAPOLBuffer(cm_ConnectionInfo_t *connPtr,EAPOL_KeyMsg_Tx_t **ppTxEapol,BufferDesc_t *pBufDesc)

{
  char "GetTxEAPOLBuffer" [17];
  void *pvVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"GetTxEAPOLBuffer");
  if (pBufDesc == (BufferDesc_t *)0x0) {
    pBufDesc = (BufferDesc_t *)ke_malloc(0xc);
    if (pBufDesc != (BufferDesc_t *)0x0) {
      memset(pBufDesc,0,0xc);
      pvVar1 = ke_malloc(0x200);
      pBufDesc->Buffer = pvVar1;
      if (pvVar1 != (void *)0x0) goto LAB_2300efca;
    }
    pBufDesc = (BufferDesc_t *)0x0;
  }
  else {
LAB_2300efca:
    *(cm_ConnectionInfo_t **)&pBufDesc->intf = connPtr;
    *ppTxEapol = (EAPOL_KeyMsg_Tx_t *)pBufDesc->Buffer;
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075db0);
  }
  return pBufDesc;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void UpdateEAPOLWcbLenAndTransmit(BufferDesc_t *pBufDesc,UINT16 frameLen)

{
  char "UpdateEAPOLWcbLenAndTransmit" [29];
  undefined2 in_register_0000202e;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"UpdateEAPOLWcbLenAndTransmit");
  txl_frame_send_eapol_frame
            (*(uint8_t *)(pBufDesc->intf + 1),(cfm_func_ptr *)0x0,(void *)0x0,
             (uint8_t *)((int)pBufDesc->Buffer + 0xe),CONCAT22(in_register_0000202e,frameLen) + 4);
  ke_free(pBufDesc->Buffer);
  ke_free(pBufDesc);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075dd8);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN keyMgmtProcessMsgExt(keyMgmtInfoSta_t *pKeyMgmtInfoSta,EAPOL_KeyMsg_t *pKeyMsg)

{
  char "keyMgmtProcessMsgExt" [21];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtProcessMsgExt");
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075df8);
  return 1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtInitSta(cm_ConnectionInfo_t *connPtr)

{
  char "KeyMgmtInitSta" [15];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtInitSta");
  KeyMgmtSta_InitSession(&connPtr->suppData->keyMgmtInfoSta);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e10);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void keyMgmtSta_StartSession(cm_ConnectionInfo_t *connPtr,CHAR *pBssid,UINT8 *pStaAddr)

{
  char "keyMgmtSta_StartSession" [24];
  supplicantData *psVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtSta_StartSession");
  psVar1 = connPtr->suppData;
  *(cm_ConnectionInfo_t **)&(psVar1->keyMgmtInfoSta).connPtr = connPtr;
  memcpy(connPtr->suppData->localStaAddr,pStaAddr,6);
  memcpy(connPtr->suppData->localBssid,pBssid,6);
  keyMgmtSta_StartSession_internal(&psVar1->keyMgmtInfoSta,10000000);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075ebc);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void init_customApp_mibs(supplicantData_t *suppData)

{
  char "init_customApp_mibs" [20];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"init_customApp_mibs");
  memset(&suppData->customMIB_RSNStats,0,3);
  memset(&suppData->customMIB_RSNConfig,0,0x1c);
  *(ushort *)&(suppData->customMIB_RSNConfig).wpaType =
       (ushort)(suppData->customMIB_RSNConfig).wpaType | 1;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075eec);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT8 supplicantIsEnabled(void *connectionPtr)

{
  byte bVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantIsEnabled");
  bVar1 = 0;
  if (*(int *)((int)connectionPtr + 8) != 0) {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"supplicantIsEnabled");
    bVar1 = (byte)((uint)*(undefined4 *)(*(int *)((int)connectionPtr + 8) + 0x34) >> 8) & 1;
  }
  return (UINT8)bVar1;
}



