pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantInitSession
               (cm_ConnectionInfo_t *connPtr,CHAR *pSsid,UINT16 len,CHAR *pBssid,UINT8 *pStaAddr)

{
  char "supplicantInitSession" [22];
  UINT8 UVar1;
  undefined3 extraout_var;
  undefined2 in_register_00002032;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantInitSession");
  UVar1 = supplicantIsEnabled(connPtr);
  if (CONCAT31(extraout_var,UVar1) != 0) {
    KeyMgmtInitSta(connPtr);
    memcpy((connPtr->suppData->hashSsId).SsId,pSsid,CONCAT22(in_register_00002032,len));
    (connPtr->suppData->hashSsId).Len = (IEEEtypes_Len_t)len;
    keyMgmtSta_StartSession(connPtr,pBssid,pStaAddr);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075ed4);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantDisable(cm_ConnectionInfo_t *connPtr)

{
  char "supplicantDisable" [18];
  UINT8 UVar1;
  undefined3 extraout_var;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantDisable");
  UVar1 = supplicantIsEnabled(connPtr);
  if (CONCAT31(extraout_var,UVar1) != 0) {
    mm_timer_clear(&(connPtr->suppData->keyMgmtInfoSta).rsnTimer);
    *(byte *)&connPtr->suppData->customMIB_RSNConfig =
         *(byte *)&connPtr->suppData->customMIB_RSNConfig & 0xfe;
    init_customApp_mibs((supplicantData_t *)connPtr->suppData);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f14);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantEnable(void *connectionPtr,int security_mode,void *mcstCipher,void *ucstCipher,
                     _Bool is_pmf_required)

{
  char "supplicantEnable" [17];
  int iVar1;
  UINT8 *__src;
  undefined3 in_register_00002039;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantEnable");
  *(byte *)(*(int *)((int)connectionPtr + 8) + 0x35) =
       *(byte *)(*(int *)((int)connectionPtr + 8) + 0x35) | 1;
  if (security_mode - 4U < 3) {
    *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x36) =
         *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x36) | 0x20;
    *(byte *)(*(int *)((int)connectionPtr + 8) + 0x35) =
         *(byte *)(*(int *)((int)connectionPtr + 8) + 0x35) | 4;
    *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x4e) =
         *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x4e) | 1;
    memcpy((void *)(*(int *)((int)connectionPtr + 8) + 0x38),mcstCipher,1);
    memcpy((void *)(*(int *)((int)connectionPtr + 8) + 0x39),ucstCipher,1);
    if (CONCAT31(in_register_00002039,is_pmf_required) == 0) {
      *(undefined *)(*(int *)((int)connectionPtr + 8) + 0x3d) = 2;
    }
    else {
      *(undefined *)(*(int *)((int)connectionPtr + 8) + 0x3d) = 6;
    }
    iVar1 = *(int *)((int)connectionPtr + 8);
    __src = "";
  }
  else {
    if (security_mode != 3) goto LAB_2300f482;
    *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x36) =
         *(ushort *)(*(int *)((int)connectionPtr + 8) + 0x36) | 8;
    memcpy((void *)(*(int *)((int)connectionPtr + 8) + 0x38),mcstCipher,1);
    memcpy((void *)(*(int *)((int)connectionPtr + 8) + 0x39),ucstCipher,1);
    *(undefined *)(*(int *)((int)connectionPtr + 8) + 0x3d) = 2;
    iVar1 = *(int *)((int)connectionPtr + 8);
    __src = "";
  }
  memcpy((void *)(iVar1 + 0x3a),__src,3);
LAB_2300f482:
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f28);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT16 keyMgmtFormatWpaRsnIe
                 (cm_ConnectionInfo_t *connPtr,UINT8 *pos,IEEEtypes_MacAddr_t *pBssid,
                 IEEEtypes_MacAddr_t *pStaAddr,UINT8 *pPmkid,BOOLEAN addPmkid)

{
  char "keyMgmtFormatWpaRsnIe" [22];
  uint16_t uVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtFormatWpaRsnIe");
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f3c);
  uVar1 = mm_get_rsn_wpa_ie(connPtr->staId,pos);
  return (UINT16)uVar1;
}



// WARNING: Variable defined which should be unmapped: pTxEapol
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

Status_e GeneratePWKMsg2(BufferDesc_t *pEAPoLBufDesc,UINT8 *pSNonce,UINT8 *pEAPOLMICKey,
                        UINT8 forceKeyDescVersion)

{
  EAPOL_KeyMsg_Tx_t *pEVar1;
  char "GeneratePWKMsg2" [16];
  cm_ConnectionInfo_t *connPtr;
  Status_e SVar2;
  UINT16 frameLen;
  BufferDesc_t *pBufDesc;
  EAPOL_KeyMsg_t *pRxEapol;
  EAPOL_KeyMsg_Tx_t *pEStack36;
  EAPOL_KeyMsg_Tx_t *pTxEapol;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"GeneratePWKMsg2");
  connPtr = (cm_ConnectionInfo_t *)pEAPoLBufDesc->intf;
  pRxEapol = (EAPOL_KeyMsg_t *)pEAPoLBufDesc->Buffer;
  pBufDesc = GetTxEAPOLBuffer(connPtr,&pEStack36,(BufferDesc_t *)0x0);
  if (pBufDesc == (BufferDesc_t *)0x0) {
    SVar2 = FAIL;
  }
  else {
    KeyMgmtSta_PrepareEAPOLFrame
              (pEStack36,pRxEapol,(IEEEtypes_MacAddr_t *)connPtr->suppData->localBssid,
               (IEEEtypes_MacAddr_t *)connPtr->suppData->localStaAddr,pSNonce);
    pEVar1 = pEStack36;
    if ((pEStack36->keyMsg).desc_type != '\x01') {
      frameLen = keyMgmtFormatWpaRsnIe
                           (connPtr,(pEStack36->keyMsg).key_data,
                            (IEEEtypes_MacAddr_t *)connPtr->suppData->localBssid,
                            (IEEEtypes_MacAddr_t *)connPtr->suppData->localStaAddr,(UINT8 *)0x0,0);
      *(char *)&(pEVar1->keyMsg).key_material_len = (char)frameLen;
      *(undefined *)((int)&(pEVar1->keyMsg).key_material_len + 1) = (char)(frameLen >> 8);
    }
    frameLen = KeyMgmtSta_PopulateEAPOLLengthMic(pEStack36,pEAPOLMICKey,'\x01',forceKeyDescVersion);
    UpdateEAPOLWcbLenAndTransmit(pBufDesc,frameLen);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e20);
    SVar2 = FW_SUCCESS;
  }
  return SVar2;
}



