pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN KeyMgmtStaHsk_Recvd_PWKMsg1
                  (BufferDesc_t *pEAPoLBufDesc,IEEEtypes_MacAddr_t *sa,IEEEtypes_MacAddr_t *da)

{
  char "KeyMgmtStaHsk_Recvd_PWKMsg1" [28];
  int iVar1;
  int iVar2;
  Status_e SVar3;
  EAPOL_KeyMsg_t *pEVar4;
  BOOLEAN BVar5;
  UINT8 *pPMK;
  undefined3 extraout_var;
  int iVar6;
  keyMgmtInfoSta_t *pKeyMgmtInfoSta;
  BOOLEAN in_fa0;
  
  iVar6 = pEAPoLBufDesc->intf;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtStaHsk_Recvd_PWKMsg1");
  iVar1 = *(int *)(iVar6 + 8);
  pKeyMgmtInfoSta = (keyMgmtInfoSta_t *)(iVar1 + 0x54);
  pEVar4 = GetKeyMsgNonceFromEAPOL(pEAPoLBufDesc,pKeyMgmtInfoSta);
  if (pEVar4 == (EAPOL_KeyMsg_t *)0x0) {
LAB_2300f69e:
    iVar2 = 0;
  }
  else {
    iVar2 = supplicantAkmIsWpaWpa2((AkmSuite_t *)(*(int *)(iVar6 + 8) + 0x3a));
    if (iVar2 != 0) {
      BVar5 = supplicantAkmIsWpaWpa2Psk((AkmSuite_t *)(*(int *)(iVar6 + 8) + 0x3a));
      if ((BVar5 == 0) ||
         (pPMK = pmkCacheFindPSK((UINT8 *)(*(int *)(iVar6 + 8) + 6),
                                 *(UINT8 *)(*(int *)(iVar6 + 8) + 5)), pPMK == (UINT8 *)0x0))
      goto LAB_2300f69e;
      supplicantAkmUsesKdf((AkmSuite_t *)(*(int *)(iVar6 + 8) + 0x3a));
      KeyMgmtSta_DeriveKeys
                (pPMK,da,sa,(UINT8 *)pKeyMgmtInfoSta,(UINT8 *)(iVar1 + 0x74),(UINT8 *)(iVar1 + 0x94)
                 ,(UINT8 *)(iVar1 + 0xa4),(KeyData_t *)(iVar1 + 0x128),in_fa0);
      iVar2 = 1;
    }
    SVar3 = GeneratePWKMsg2(pEAPoLBufDesc,(UINT8 *)(iVar1 + 0x74),(UINT8 *)(iVar1 + 0x94),'\0');
    if (CONCAT31(extraout_var,SVar3) == 0) {
      if (iVar2 == 1) {
        updateApReplayCounter(pKeyMgmtInfoSta,(UINT8 *)pEVar4->replay_cnt);
        *(undefined4 *)(iVar1 + 0xcc) = 0;
      }
    }
    else {
      iVar2 = 0;
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e50);
  }
  return iVar2;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantInit(supplicantData_t *suppData)

{
  char "supplicantInit" [15];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantInit");
  init_customApp_mibs(suppData);
  memset(&suppData->currParams,0xff,4);
  memset(&suppData->keyMgmtInfoSta,0,0x144);
  (suppData->keyMgmtInfoSta).sta_MIC_Error.disableStaAsso = 0;
  (suppData->keyMgmtInfoSta).sta_MIC_Error.MICCounterMeasureEnabled = 1;
  (suppData->keyMgmtInfoSta).sta_MIC_Error.status = NO_MIC_FAILURE;
  KeyMgmtResetCounter(&suppData->keyMgmtInfoSta);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f54);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void allocSupplicantData(void *connectionPtr)

{
  char "allocSupplicantData" [20];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"allocSupplicantData");
  if (*(int *)((int)connectionPtr + 8) == 0) {
    if ((*(char *)connectionPtr == '\0') && (keyMgmt_SuppData[0].inUse == 0)) {
      keyMgmt_SuppData[0].inUse = 1;
      supplicantInit(keyMgmt_SuppData);
      *(undefined4 *)((int)connectionPtr + 8) = 0x4201153c;
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075dc4);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT16 keyMgmtGetKeySize(cm_ConnectionInfo_t *connPtr,UINT8 isPairwise)

{
  char "keyMgmtGetKeySize" [18];
  UINT16 UVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtGetKeySize");
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f64);
  UVar1 = keyMgmtGetKeySize_internal(&connPtr->suppData->customMIB_RSNConfig,isPairwise);
  return UVar1;
}



// WARNING: Variable defined which should be unmapped: key_add_req
// WARNING: Could not reconcile some variable overlaps

uint8_t add_key_to_mac(cm_ConnectionInfo_t *connPtr,UINT8 pairwise)

{
  uint32_t uVar1;
  uint32_t uVar2;
  size_t __n;
  uint8_t uVar3;
  UINT16 UVar4;
  apInfo_t *paVar5;
  undefined3 in_register_0000202d;
  int iVar6;
  KeyData_t *__src;
  byte bStack60;
  byte bStack59;
  mm_key_add_req key_add_req;
  
  iVar6 = CONCAT31(in_register_0000202d,pairwise);
  __n = 0x10;
  if (connPtr->conType == '\0') {
    UVar4 = keyMgmtGetKeySize(connPtr,pairwise);
    __n = (uint)UVar4 & 0xff;
  }
  memset(&bStack60,0,0x2c);
  key_add_req.key.array[7]._3_1_ = iVar6 != 0;
  key_add_req.key.array[7]._1_1_ = connPtr->instNbr;
  if (iVar6 == 0) {
    bStack59 = 0xff;
    if (connPtr->conType == '\0') {
      __src = &(connPtr->suppData->keyMgmtInfoSta).GRKey;
      bStack60 = (byte)(connPtr->suppData->keyMgmtInfoSta).GRKey.KeyIndex;
    }
    else {
      paVar5 = cm_GetApInfo(connPtr);
      __src = &(paVar5->bssData).grpKeyData;
      bStack60 = (byte)(paVar5->bssData).grpKeyData.KeyIndex;
    }
  }
  else {
    bStack59 = connPtr->staId;
    if (connPtr->conType == '\0') {
      __src = &(connPtr->suppData->keyMgmtInfoSta).PWKey;
    }
    else {
      __src = (KeyData_t *)((connPtr->TxRxCipherKeyBuf).cipher_key.ckd + 0x20);
    }
  }
  memcpy(&key_add_req.key,__src,__n);
  uVar2 = key_add_req.key.array[6];
  uVar1 = key_add_req.key.array[3];
  key_add_req.key_idx = (uint8_t)__n;
  if (__n == 0x10) {
    key_add_req.key.array[7]._0_1_ = 2;
  }
  else {
    if (__n == 0x20) {
      key_add_req.key.array[7]._0_1_ = 1;
      if (iVar6 != 0) {
        key_add_req.key.array[3] = key_add_req.key.array[5];
        key_add_req.key.array[5] = uVar1;
        key_add_req.key.array[6] = key_add_req.key.array[4];
        key_add_req.key.array[4] = uVar2;
      }
    }
    else {
      if (__n == 0xd) {
        key_add_req.key.array[7]._0_1_ = 3;
      }
      else {
        if (__n == 5) {
          key_add_req.key.array[7]._0_1_ = 0;
        }
        else {
          assert_err("0","module",0x783);
        }
      }
    }
  }
  printf("set key:sta_idx:%d, inst_nbr:%d, key_idx:%d,cipher_suite:%d,key_len:%d\r\n",(uint)bStack59
         ,(uint)key_add_req.key.array[7]._1_1_,(uint)bStack60,(uint)(byte)key_add_req.key.array[7],
         (uint)key_add_req.key_idx);
  uVar3 = mm_sec_machwkey_wr((mm_key_add_req *)&bStack60);
  return uVar3;
}



