pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BufferReturnNotify_t * keyMgmtKeyGroupTxDone(void)

{
  cm_ConnectionInfo_t *connPtr;
  uint8_t uVar1;
  cm_ConnectionInfo_t **in_a0;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyGroupTxDone");
  connPtr = *in_a0;
  if (connPtr->gtkHwKeyId != -1) {
    mm_sec_machwkey_del(connPtr->gtkHwKeyId);
  }
  uVar1 = add_key_to_mac(connPtr,'\0');
  connPtr->gtkHwKeyId = uVar1;
  (connPtr->suppData->keyMgmtInfoSta).RSNDataTrafficEnabled = 1;
  if ((connPtr->suppData->keyMgmtInfoSta).RSNSecured == 0) {
    (connPtr->suppData->keyMgmtInfoSta).RSNSecured = 1;
    sm_handle_supplicant_result(connPtr->staId,0);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyGroupTxDone");
  return (BufferReturnNotify_t *)0x0;
}



// WARNING: Variable defined which should be unmapped: pTxEapol
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

Status_e GenerateGrpMsg2(BufferDesc_t *pEAPoLBufDesc,keyMgmtInfoSta_t *pKeyMgmtInfoSta)

{
  char "GenerateGrpMsg2" [16];
  UINT16 frameLen_00;
  BufferDesc_t *pBufDesc;
  supplicantData *psVar1;
  cm_ConnectionInfo_t *connPtr;
  EAPOL_KeyMsg_t *pRxEapol;
  UINT16 frameLen;
  EAPOL_KeyMsg_Tx_t *pEStack36;
  EAPOL_KeyMsg_Tx_t *pTxEapol;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"GenerateGrpMsg2");
  connPtr = (cm_ConnectionInfo_t *)pEAPoLBufDesc->intf;
  pRxEapol = (EAPOL_KeyMsg_t *)pEAPoLBufDesc->Buffer;
  pBufDesc = GetTxEAPOLBuffer(connPtr,&pEStack36,(BufferDesc_t *)0x0);
  if (pBufDesc != (BufferDesc_t *)0x0) {
    psVar1 = connPtr->suppData;
    KeyMgmtSta_PrepareEAPOLFrame
              (pEStack36,pRxEapol,(IEEEtypes_MacAddr_t *)psVar1->localBssid,
               (IEEEtypes_MacAddr_t *)psVar1->localStaAddr,(UINT8 *)0x0);
    frameLen_00 = KeyMgmtSta_PopulateEAPOLLengthMic
                            (pEStack36,pKeyMgmtInfoSta->EAPOL_MIC_Key,'\x01','\0');
    keyMgmtKeyGroupTxDone();
    UpdateEAPOLWcbLenAndTransmit(pBufDesc,frameLen_00);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e40);
  }
  return (Status_e)(pBufDesc == (BufferDesc_t *)0x0);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

EAPOL_KeyMsg_t * KeyMgmtStaHsk_Recvd_GrpMsg1(BufferDesc_t *pEAPoLBufDesc)

{
  char "KeyMgmtStaHsk_Recvd_GrpMsg1" [28];
  keyMgmtInfoSta_t *pKeyMgmtInfoSta;
  Status_e SVar1;
  EAPOL_KeyMsg_t *pEVar2;
  undefined3 extraout_var;
  
  pKeyMgmtInfoSta = (keyMgmtInfoSta_t *)(*(int *)(pEAPoLBufDesc->intf + 8) + 0x54);
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtStaHsk_Recvd_GrpMsg1");
  pEVar2 = ProcessRxEAPOL_GrpMsg1(pEAPoLBufDesc,pKeyMgmtInfoSta);
  if ((pEVar2 == (EAPOL_KeyMsg_t *)0x0) ||
     (SVar1 = GenerateGrpMsg2(pEAPoLBufDesc,pKeyMgmtInfoSta), CONCAT31(extraout_var,SVar1) != 0)) {
    pEVar2 = (EAPOL_KeyMsg_t *)0x0;
  }
  else {
    updateApReplayCounter(pKeyMgmtInfoSta,(UINT8 *)pEVar2->replay_cnt);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e88);
  }
  return pEVar2;
}



// WARNING: Variable defined which should be unmapped: key_add_req
// WARNING: Could not reconcile some variable overlaps

uint8_t add_mfp_key_to_mac(cm_ConnectionInfo_t *connPtr,UINT8 pairwise)

{
  uint8_t uVar1;
  UINT16 UVar2;
  undefined3 extraout_var;
  undefined3 in_register_0000202d;
  KeyData_t *__src;
  undefined2 uStack60;
  mm_key_add_req key_add_req;
  
  UVar2 = keyMgmtGetKeySize(connPtr,pairwise);
  memset(&uStack60,0,0x2c);
  key_add_req.key.array[7]._1_1_ = connPtr->instNbr;
  key_add_req.key_idx = (uint8_t)((uint)UVar2 & 0xff);
  key_add_req.key.array[7]._0_1_ = 5;
  uStack60 = 0xff04;
  if (CONCAT31(in_register_0000202d,pairwise) == 0) {
    if (connPtr->conType != '\0') goto LAB_2300fc4a;
    __src = &(connPtr->suppData->keyMgmtInfoSta).GRKey;
  }
  else {
    if (connPtr->conType != '\0') goto LAB_2300fc4a;
    __src = &(connPtr->suppData->keyMgmtInfoSta).PWKey;
  }
  memcpy(&key_add_req.key,__src,(uint)UVar2 & 0xff);
LAB_2300fc4a:
  printf("set mfp key:sta_idx:%d, inst_nbr:%d, key_idx:%d,cipher_suite:%d,key_len:%d\r\n",
         (uint)uStack60._1_1_,(uint)key_add_req.key.array[7]._1_1_,(uint)(byte)uStack60,
         (uint)(byte)key_add_req.key.array[7],(uint)key_add_req.key_idx);
  uVar1 = mm_sec_machwkey_wr((mm_key_add_req *)&uStack60);
  printf("mfp hw id: %d\n",CONCAT31(extraout_var,uVar1));
  return uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void keyMgmtPlumbPairwiseKey(cm_ConnectionInfo_t *connPtr)

{
  char "keyMgmtPlumbPairwiseKey" [24];
  uint8_t uVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtPlumbPairwiseKey");
  memcpy(&(connPtr->suppData->keyMgmtInfoSta).PWKey,&(connPtr->suppData->keyMgmtInfoSta).newPWKey,
         0x28);
  uVar1 = add_key_to_mac(connPtr,'\x01');
  connPtr->ptkHwKeyId = uVar1;
  if ((connPtr->suppData->customMIB_RSNConfig).AKM.akmType == AKM_SHA256_PSK) {
    uVar1 = add_mfp_key_to_mac(connPtr,'\x01');
    connPtr->mfpHwKeyId = uVar1;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075f78);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BufferReturnNotify_t * keyMgmtKeyPairwiseTxDone(void)

{
  cm_ConnectionInfo_t **in_a0;
  cm_ConnectionInfo_t *connPtr;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyPairwiseTxDone");
  connPtr = *in_a0;
  keyMgmtPlumbPairwiseKey(connPtr);
  (connPtr->suppData->keyMgmtInfoSta).pwkHandshakeComplete = 1;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyPairwiseTxDone");
  return (BufferReturnNotify_t *)0x0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

Status_e GeneratePWKMsg4(BufferDesc_t *pEAPoLBufDesc,keyMgmtInfoSta_t *pKeyMgmtInfoSta,
                        BOOLEAN groupKeyReceived)

{
  char "GeneratePWKMsg4" [16];
  Status_e SVar1;
  UINT16 frameLen;
  BufferDesc_t *pBufDesc;
  supplicantData *psVar2;
  cm_ConnectionInfo_t *connPtr;
  EAPOL_KeyMsg_t *pRxEapol;
  EAPOL_KeyMsg_Tx_t *pEStack52;
  EAPOL_KeyMsg_Tx_t *pTxEapol;
  
