pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"GeneratePWKMsg4");
  connPtr = (cm_ConnectionInfo_t *)pEAPoLBufDesc->intf;
  pRxEapol = (EAPOL_KeyMsg_t *)pEAPoLBufDesc->Buffer;
  pBufDesc = GetTxEAPOLBuffer(connPtr,&pEStack52,(BufferDesc_t *)0x0);
  if (pBufDesc == (BufferDesc_t *)0x0) {
    SVar1 = FAIL;
  }
  else {
    psVar2 = connPtr->suppData;
    KeyMgmtSta_PrepareEAPOLFrame
              (pEStack52,pRxEapol,(IEEEtypes_MacAddr_t *)psVar2->localBssid,
               (IEEEtypes_MacAddr_t *)psVar2->localStaAddr,(UINT8 *)0x0);
    frameLen = KeyMgmtSta_PopulateEAPOLLengthMic
                         (pEStack52,pKeyMgmtInfoSta->EAPOL_MIC_Key,'\x01','\0');
    UpdateEAPOLWcbLenAndTransmit(pBufDesc,frameLen);
    if (groupKeyReceived == 0) {
      keyMgmtKeyPairwiseTxDone();
    }
    else {
      dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyPairAndGroupTxDone");
      keyMgmtKeyPairwiseTxDone();
      keyMgmtKeyGroupTxDone();
      dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"keyMgmtKeyPairAndGroupTxDone");
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e30);
    SVar1 = FW_SUCCESS;
  }
  return SVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

EAPOL_KeyMsg_t * KeyMgmtStaHsk_Recvd_PWKMsg3(BufferDesc_t *pEAPoLBufDesc)

{
  char "KeyMgmtStaHsk_Recvd_PWKMsg3" [28];
  int iVar1;
  keyMgmtInfoSta_t *pKeyMgmtInfoSta;
  Status_e SVar2;
  EAPOL_KeyMsg_t *pEVar3;
  undefined3 extraout_var;
  
  iVar1 = pEAPoLBufDesc->intf;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtStaHsk_Recvd_PWKMsg3");
  pKeyMgmtInfoSta = (keyMgmtInfoSta_t *)(*(int *)(iVar1 + 8) + 0x54);
  pEVar3 = ProcessRxEAPOL_PwkMsg3(pEAPoLBufDesc,pKeyMgmtInfoSta);
  if ((pEVar3 != (EAPOL_KeyMsg_t *)0x0) &&
     (SVar2 = GeneratePWKMsg4(pEAPoLBufDesc,pKeyMgmtInfoSta,(uint)(pEVar3->desc_type == '\x02')),
     CONCAT31(extraout_var,SVar2) == 0)) {
    updateApReplayCounter(pKeyMgmtInfoSta,(UINT8 *)pEVar3->replay_cnt);
    pEVar3 = (EAPOL_KeyMsg_t *)0x0;
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075e6c);
  }
  return pEVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ProcessKeyMgmtDataSta(BufferDesc_t *pBufDesc,IEEEtypes_MacAddr_t *sa,IEEEtypes_MacAddr_t *da)

{
  char "ProcessKeyMgmtDataSta" [22];
  void *pvVar1;
  
  pvVar1 = pBufDesc->Buffer;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"ProcessKeyMgmtDataSta");
  if ((*(byte *)((int)pvVar1 + 6) & 8) == 0) {
    KeyMgmtStaHsk_Recvd_GrpMsg1(pBufDesc);
  }
  else {
    if ((*(byte *)((int)pvVar1 + 5) & 1) == 0) {
      KeyMgmtStaHsk_Recvd_PWKMsg1(pBufDesc,sa,da);
    }
    else {
      KeyMgmtStaHsk_Recvd_PWKMsg3(pBufDesc);
    }
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075ea4);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT8 ProcessEAPoLPkt(BufferDesc_t *bufDesc,IEEEtypes_MacAddr_t *sa,IEEEtypes_MacAddr_t *da)

{
  char "ProcessEAPoLPkt" [16];
  UINT8 UVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"ProcessEAPoLPkt");
  if (*(char *)((int)bufDesc->Buffer + 1) == '\x03') {
    dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"ProcessEAPoLKeyPkt");
    if (*(char *)bufDesc->intf == '\x02') {
      ProcessKeyMgmtDataAp(bufDesc);
    }
    else {
      ProcessKeyMgmtDataSta(bufDesc,sa,da);
    }
    UVar1 = '\x01';
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"ProcessEAPoLKeyPkt");
  }
  else {
    UVar1 = '\0';
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23075da0);
  return UVar1;
}



uchar process_rsn_ie(uint8_t *rsn_ie,Cipher_t *mcstCipher,Cipher_t *ucstCipher,
                    _Bool *is_pmf_required,SecurityMode_t *security_mode,_Bool wpa2_prefered)

{
  int iVar1;
  UINT8 *__s2;
  Cipher_t CVar2;
  undefined3 in_register_0000203d;
  uint uVar3;
  uint8_t *__s1;
  uint8_t *__dest;
  ushort auStack66 [2];
  uint16_t akmp_count;
  
  __s1 = rsn_ie + 0xe;
  __dest = rsn_ie + 10;
  if (*(short *)(rsn_ie + 8) == 2) {
    rsn_ie[9] = '\0';
    rsn_ie[1] = rsn_ie[1] + -4;
    rsn_ie[8] = '\x01';
    iVar1 = memcmp(__s1,"",4);
    if (iVar1 == 0) {
      memcpy(__dest,__s1,4);
    }
    memcpy(__s1,rsn_ie + 0x12,0xc);
  }
  memcpy(auStack66,__s1,2);
  uVar3 = 0;
  while (uVar3 < auStack66[0]) {
    iVar1 = memcmp(__dest + (uVar3 + 1) * 4 + 2,"",4);
    if (iVar1 == 0) {
      *(byte *)security_mode = *(byte *)security_mode | 0x20;
    }
    else {
      iVar1 = memcmp(__dest + (uVar3 + 1) * 4 + 2,"",4);
      if (iVar1 == 0) {
        *(byte *)&security_mode->field_0x1 = *(byte *)&security_mode->field_0x1 | 1;
      }
    }
    uVar3 = uVar3 + 1 & 0xff;
  }
  if (auStack66[0] == 2) {
    rsn_ie[1] = '\x14';
    auStack66[0] = 1;
    memcpy(__s1,auStack66,2);
    __s1 = rsn_ie + 0x14;
    if (CONCAT31(in_register_0000203d,wpa2_prefered) == 0) {
      __s2 = "";
    }
    else {
      __s2 = "";
    }
    iVar1 = memcmp(__s1,__s2,4);
    if (iVar1 == 0) {
      memcpy(rsn_ie + 0x10,__s1,6);
    }
    memcpy(__s1,rsn_ie + 0x18,2);
  }
  if (((*(byte *)&security_mode->field_0x1 & 1) != 0) &&
     (((*(byte *)security_mode & 0x20) == 0 || (CONCAT31(in_register_0000203d,wpa2_prefered) == 0)))
     ) {
    *is_pmf_required = true;
    rsn_ie[0x14] = -0x40;
    rsn_ie[0x16] = '\0';
    rsn_ie[1] = rsn_ie[1] + '\x02';
    rsn_ie[0x17] = '\0';
    memcpy(rsn_ie + 0x18,"",4);
    rsn_ie[1] = rsn_ie[1] + '\x04';
  }
  iVar1 = memcmp(__dest,"",4);
  if (iVar1 == 0) {
    CVar2 = (Cipher_t)((byte)*ucstCipher | 8);
LAB_230101f8:
    *ucstCipher = CVar2;
  }
  else {
    iVar1 = memcmp(__dest,"",4);
    if (iVar1 == 0) {
      CVar2 = (Cipher_t)((byte)*ucstCipher | 4);
      goto LAB_230101f8;
    }
  }
  __s1 = rsn_ie + 4;
  iVar1 = memcmp(__s1,"",4);
  if (iVar1 == 0) {
    CVar2 = (Cipher_t)((byte)*mcstCipher | 8);
  }
  else {
    iVar1 = memcmp(__s1,"",4);
    if (iVar1 == 0) {
      CVar2 = (Cipher_t)((byte)*mcstCipher | 4);
    }
    else {
      iVar1 = memcmp(__s1,"",4);
      if (iVar1 == 0) {
        CVar2 = (Cipher_t)((byte)*mcstCipher | 2);
      }
      else {
        iVar1 = memcmp(__s1,"",4);
        if (iVar1 != 0) goto LAB_2301021a;
        CVar2 = (Cipher_t)((byte)*mcstCipher | 1);
      }
    }
  }
  *mcstCipher = CVar2;
LAB_2301021a:
  return (uchar)(rsn_ie[1] + '\x02');
}



uchar process_wpa_ie(uint8_t *wpa_ie,Cipher_t *mcstCipher,Cipher_t *ucstCipher)

{
  int iVar1;
  Cipher_t CVar2;
  uint8_t *__dest;
  uint8_t *__s1;
  
  __dest = wpa_ie + 0xe;
  if (*(short *)(wpa_ie + 0xc) == 2) {
    wpa_ie[1] = '\x16';
    __s1 = wpa_ie + 0x12;
    wpa_ie[0xc] = '\x01';
    wpa_ie[0xd] = '\0';
    iVar1 = memcmp(__s1,"",4);
    if (iVar1 == 0) {
      memcpy(__dest,__s1,4);
    }
    memcpy(__s1,wpa_ie + 0x16,8);
  }
  iVar1 = memcmp(__dest,"",4);
  if (iVar1 == 0) {
    CVar2 = (Cipher_t)((byte)*ucstCipher | 8);
LAB_23010382:
    *ucstCipher = CVar2;
  }
  else {
    iVar1 = memcmp(__dest,"",4);
    if (iVar1 == 0) {
      CVar2 = (Cipher_t)((byte)*ucstCipher | 4);
      goto LAB_23010382;
    }
  }
  __dest = wpa_ie + 8;
  iVar1 = memcmp(__dest,"",4);
  if (iVar1 == 0) {
    CVar2 = (Cipher_t)((byte)*mcstCipher | 8);
  }
  else {
    iVar1 = memcmp(__dest,"",4);
    if (iVar1 == 0) {
      CVar2 = (Cipher_t)((byte)*mcstCipher | 4);
    }
    else {
      iVar1 = memcmp(__dest,"",4);
      if (iVar1 == 0) {
        CVar2 = (Cipher_t)((byte)*mcstCipher | 2);
      }
      else {
        iVar1 = memcmp(__dest,"",4);
        if (iVar1 != 0) goto LAB_230103a4;
        CVar2 = (Cipher_t)((byte)*mcstCipher | 1);
      }
    }
  }
  *mcstCipher = CVar2;
LAB_230103a4:
  return (uchar)(wpa_ie[1] + '\x02');
}



