pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void keyMgmtStaRsnSecuredTimeoutHandler(void *env)

{
  char "keyMgmtStaRsnSecuredTimeoutHandler" [35];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtStaRsnSecuredTimeoutHandler");
  if ((env != (void *)0x0) && (*(int *)((int)env + 0x78) == 0)) {
    sm_handle_supplicant_result(*(uint8_t *)(*(int *)((int)env + 0x118) + 1),0xf);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230762f8);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantGenerateRand(UINT8 *dataOut,UINT32 length)

{
  char "supplicantGenerateRand" [23];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantGenerateRand");
  bl_rand_stream(dataOut,length);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230760a8);
  return;
}



void ComputeEAPOL_MIC(EAPOL_KeyMsg_t *pKeyMsg,UINT16 data_length,UINT8 *MIC_Key,UINT8 MIC_Key_length
                     ,UINT8 micKeyDescVersion)

{
  undefined2 in_register_0000202e;
  undefined3 in_register_00002035;
  undefined3 in_register_00002039;
  uint uVar1;
  uchar *output;
  int iStack24;
  int len;
  UINT8 *pMicData;
  
  uVar1 = CONCAT31(in_register_00002039,micKeyDescVersion);
  iStack24 = CONCAT22(in_register_0000202e,data_length);
  if (uVar1 == 0) {
    uVar1 = (uint)*(byte *)&(pKeyMsg->key_info).field_0x1 & 7;
  }
  output = pKeyMsg->key_MIC;
  len = (int)pKeyMsg;
  if (uVar1 == 1) {
    Bl_hmac_md5((UINT8 *)pKeyMsg,iStack24,MIC_Key,CONCAT31(in_register_00002035,MIC_Key_length),
                output);
  }
  else {
    if (uVar1 == 2) {
      Bl_hmac_sha1((uchar **)&len,&iStack24,1,MIC_Key,CONCAT31(in_register_00002035,MIC_Key_length),
                   output,0x10);
    }
    else {
      bl_aes_cmac(MIC_Key,(UINT8 *)pKeyMsg,iStack24,output);
    }
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT16 keyMgmtGetKeySize_internal(RSNConfig_t *pRsnConfig,UINT8 isPairwise)

{
  Cipher_t CVar1;
  char "keyMgmtGetKeySize_internal" [27];
  UINT16 UVar2;
  undefined3 in_register_0000202d;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtGetKeySize_internal");
  if (CONCAT31(in_register_0000202d,isPairwise) == 0) {
    CVar1 = pRsnConfig->mcstCipher;
    UVar2 = 0x10;
    if (((((byte)CVar1 & 8) == 0) && (UVar2 = 0xd, ((byte)CVar1 & 2) == 0)) &&
       (UVar2 = 0x20, ((byte)CVar1 & 1) != 0)) {
      UVar2 = 5;
    }
  }
  else {
    UVar2 = 0x20;
    if (((byte)pRsnConfig->ucstCipher & 8) != 0) {
      UVar2 = 0x10;
    }
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230760c0);
  return UVar2;
}



// WARNING: Variable defined which should be unmapped: tmpLo
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int isApReplayCounterFresh(keyMgmtInfoSta_t *pKeyMgmtInfoSta,UINT8 *pRxReplayCount)

{
  char "isApReplayCounterFresh" [23];
  uint uVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  uint uStack24;
  UINT32 tmpHi;
  UINT32 tmpLo;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"isApReplayCounterFresh");
  memcpy(&uStack24,pRxReplayCount,4);
  memcpy(&tmpHi,pRxReplayCount + 4,4);
  uVar3 = uStack24 * 0x1000000 + (uStack24 >> 0x18) + (uStack24 & 0xff00) * 0x100 +
          (uStack24 >> 8 & 0xff00);
  uVar2 = pKeyMgmtInfoSta->apCounterHi;
  uVar1 = 1;
  if ((uVar3 <= uVar2) && (uVar1 = 0, uVar2 == uVar3)) {
    uVar1 = 1;
    uVar4 = tmpHi * 0x1000000 + (tmpHi >> 0x18) + (tmpHi & 0xff00) * 0x100 + (tmpHi >> 8 & 0xff00);
    uVar3 = pKeyMgmtInfoSta->apCounterLo;
    if ((uVar4 <= uVar3) && ((uVar1 = 0, uVar3 == uVar4 && ((uVar2 | uVar3) == 0)))) {
      uVar1 = (uint)(pKeyMgmtInfoSta->apCounterZeroDone == 0);
    }
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230760dc);
  return uVar1;
}



// WARNING: Variable defined which should be unmapped: tmpLo
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void updateApReplayCounter(keyMgmtInfoSta_t *pKeyMgmtStaInfo,UINT8 *pRxReplayCount)

{
  char "updateApReplayCounter" [22];
  uint uVar1;
  uint uVar2;
  uint uStack24;
  UINT32 tmpHi;
  UINT32 tmpLo;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"updateApReplayCounter");
  memcpy(&uStack24,pRxReplayCount,4);
  memcpy(&tmpHi,pRxReplayCount + 4,4);
  uVar2 = uStack24 * 0x1000000 + (uStack24 >> 0x18) + (uStack24 & 0xff00) * 0x100 +
          (uStack24 >> 8 & 0xff00);
  uVar1 = tmpHi * 0x1000000 + (tmpHi >> 0x18) + (tmpHi & 0xff00) * 0x100 + (tmpHi >> 8 & 0xff00);
  pKeyMgmtStaInfo->apCounterHi = uVar2;
  pKeyMgmtStaInfo->apCounterLo = uVar1;
  if ((uVar2 | uVar1) == 0) {
    pKeyMgmtStaInfo->apCounterZeroDone = 1;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230760f4);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void formEAPOLEthHdr(EAPOL_KeyMsg_Tx_t *pTxEapol,IEEEtypes_MacAddr_t *da,IEEEtypes_MacAddr_t *sa)

{
  char "formEAPOLEthHdr" [16];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"formEAPOLEthHdr");
  memcpy(pTxEapol,da,6);
  memcpy((pTxEapol->ethHdr).sa,sa,6);
  *(undefined *)&(pTxEapol->ethHdr).type = 0x88;
  *(undefined *)((int)&(pTxEapol->ethHdr).type + 1) = 0x8e;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x2307610c);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN IsEAPOL_MICValid(EAPOL_KeyMsg_t *pKeyMsg,UINT8 *pMICKey)

{
  UINT8 *__src;
  int iVar1;
  undefined auStack48 [4];
  UINT8 msgMIC [16];
  
  __src = pKeyMsg->key_MIC;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"IsEAPOL_MICValid");
  memcpy(auStack48,__src,0x10);
  memset(__src,0,0x10);
  ComputeEAPOL_MIC(pKeyMsg,(UINT16)(((uint)CONCAT21((pKeyMsg->hdr_8021x).pckt_body_len,
                                                    *(undefined *)
                                                     ((int)&(pKeyMsg->hdr_8021x).pckt_body_len + 1))
                                    + 4) * 0x10000 >> 0x10),pMICKey,'\x10','\0');
  iVar1 = memcmp(__src,auStack48,0x10);
  if (iVar1 == 0) {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"IsEAPOL_MICValid");
  }
  return (uint)(iVar1 == 0);
}



