pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT16 KeyMgmtSta_PopulateEAPOLLengthMic
                 (EAPOL_KeyMsg_Tx_t *pTxEapol,UINT8 *pEAPOLMICKey,UINT8 eapolProtocolVersion,
                 UINT8 forceKeyDescVersion)

{
  undefined uVar1;
  ushort uVar2;
  char "KeyMgmtSta_PopulateEAPOLLengthMic" [34];
  UINT16 UVar3;
  uint uVar4;
  
  UVar3 = 0;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_PopulateEAPOLLengthMic");
  if (pTxEapol != (EAPOL_KeyMsg_Tx_t *)0x0) {
    uVar1 = *(undefined *)((int)&(pTxEapol->keyMsg).key_material_len + 1);
    uVar2 = (pTxEapol->keyMsg).key_material_len;
    uVar4 = (uint)uVar2 + 0x5f & 0xffff;
    UVar3 = (UINT16)uVar4;
    (pTxEapol->keyMsg).hdr_8021x.pckt_type = IEEE_8021X_PACKET_TYPE_EAPOL_KEY;
    *(char *)&(pTxEapol->keyMsg).hdr_8021x.pckt_body_len = (char)(uVar4 >> 8);
    *(undefined *)((int)&(pTxEapol->keyMsg).hdr_8021x.pckt_body_len + 1) = (char)uVar4;
    *(undefined *)&(pTxEapol->keyMsg).key_material_len = uVar1;
    (pTxEapol->keyMsg).hdr_8021x.protocol_ver = eapolProtocolVersion;
    *(undefined *)((int)&(pTxEapol->keyMsg).key_material_len + 1) =
         (char)((uint)CONCAT21(uVar2,uVar1) >> 8);
    ComputeEAPOL_MIC(&pTxEapol->keyMsg,(UINT16)(((uint)uVar2 + 99) * 0x10000 >> 0x10),pEAPOLMICKey,
                     '\x10',forceKeyDescVersion);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076130);
  }
  return UVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

KDE_t * parseKeyKDE(IEEEtypes_InfoElementHdr_t *pIe)

{
  char "parseKeyKDE" [12];
  int iVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"parseKeyKDE");
  if (((pIe->ElementId != ELEM_ID_VENDOR_SPECIFIC) || (pIe->Len < 8)) ||
     (iVar1 = memcmp(pIe + 1,"",3), iVar1 != 0)) {
    pIe = (IEEEtypes_InfoElementHdr_t *)0x0;
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076154);
  }
  return (KDE_t *)pIe;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

KDE_t * parseKeyKDE_DataType(UINT8 *pData,SINT32 dataLen,IEEEtypes_KDEDataType_e KDEDataType)

{
  KDE_t *pKVar1;
  undefined3 in_register_00002031;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"parseKeyKDE_DataType");
  if (pData != (UINT8 *)0x0) {
    while (2 < dataLen) {
      if (((IEEEtypes_InfoElementHdr_t *)pData)->ElementId == ELEM_ID_VENDOR_SPECIFIC) {
        pKVar1 = parseKeyKDE((IEEEtypes_InfoElementHdr_t *)pData);
        if ((pKVar1 != (KDE_t *)0x0) &&
           ((uint)pKVar1->dataType == CONCAT31(in_register_00002031,KDEDataType))) {
          return pKVar1;
        }
        if (((IEEEtypes_InfoElementHdr_t *)pData)->Len == '\0') {
          dataLen = 2;
        }
      }
      dataLen = dataLen + (-2 - (uint)((IEEEtypes_InfoElementHdr_t *)pData)->Len);
      pData = (UINT8 *)(&((IEEEtypes_InfoElementHdr_t *)pData)[1].ElementId +
                       (uint)((IEEEtypes_InfoElementHdr_t *)pData)->Len);
    }
    pData = (UINT8 *)0x0;
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"parseKeyKDE_DataType");
  }
  return (KDE_t *)pData;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

KDE_t * parseKeyDataGTK(UINT8 *pKey,UINT16 len,KeyData_t *pGRKey)

{
  char "parseKeyDataGTK" [16];
  KDE_t *pKVar1;
  undefined2 in_register_0000202e;
  undefined auStack40 [4];
  UINT8 buf [8];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"parseKeyDataGTK");
  pKVar1 = parseKeyKDE_DataType(pKey,CONCAT22(in_register_0000202e,len),KDE_DATA_TYPE_GTK);
  if (pKVar1 != (KDE_t *)0x0) {
    memcpy(pGRKey,&pKVar1[1].length,(uint)pKVar1->length - 6);
    pGRKey->KeyIndex = (ushort)pKVar1->data[0] & 3;
    memcpy(auStack40,pGRKey->TxMICKey,8);
    memcpy(pGRKey->TxMICKey,pGRKey->RxMICKey,8);
    memcpy(pGRKey->RxMICKey,auStack40,8);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076178);
  return pKVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtSta_ApplyKEK(EAPOL_KeyMsg_t *pKeyMsg,KeyData_t *pGRKey,UINT8 *EAPOL_Encr_Key)

{
  byte bVar1;
  undefined uVar2;
  uint3 uVar3;
  char "KeyMgmtSta_ApplyKEK" [20];
  UINT8 *cipher;
  uint uVar4;
  int iVar5;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_ApplyKEK");
  bVar1 = pKeyMsg->key_RSC[1];
  cipher = pKeyMsg->key_data;
  pGRKey->TxIV16 = (ushort)bVar1 << 8;
  pGRKey->TxIV16 = CONCAT11(bVar1,pKeyMsg->key_RSC[0]);
  pGRKey->TxIV32 = 0xffffffff;
  uVar2 = *(undefined *)((int)&pKeyMsg->key_material_len + 1);
  uVar3 = CONCAT21(pKeyMsg->key_material_len,uVar2);
  uVar4 = (uint)uVar3 & 0xffff;
  *(undefined *)((int)&pKeyMsg->key_material_len + 1) = (char)(uVar4 >> 8);
  bVar1 = *(byte *)&(pKeyMsg->key_info).field_0x1;
  *(undefined *)&pKeyMsg->key_material_len = uVar2;
  if ((bVar1 & 7) == 1) {
    RC4_Encrypt(EAPOL_Encr_Key,pKeyMsg->EAPOL_key_IV,0x10,cipher,(ushort)uVar3,0x100);
  }
  else {
    BL_AesUnWrap(EAPOL_Encr_Key,'\x02',(uVar4 >> 3) - 1,cipher,(UINT8 *)0x0,cipher);
    iVar5 = (uint)pKeyMsg->key_material_len - 8;
    *(char *)&pKeyMsg->key_material_len = (char)((uint)(iVar5 * 0x10000) >> 0x10);
    *(undefined *)((int)&pKeyMsg->key_material_len + 1) = (char)((uint)iVar5 >> 8);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076188);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN KeyMgmtSta_IsRxEAPOLValid(keyMgmtInfoSta_t *pKeyMgmtInfoSta,EAPOL_KeyMsg_t *pKeyMsg)

{
  BOOLEAN BVar1;
  int iVar2;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_IsRxEAPOLValid");
  if ((((pKeyMgmtInfoSta == (keyMgmtInfoSta_t *)0x0) || (pKeyMsg == (EAPOL_KeyMsg_t *)0x0)) ||
      (iVar2 = isApReplayCounterFresh(pKeyMgmtInfoSta,(UINT8 *)pKeyMsg->replay_cnt), iVar2 == 0)) ||
     (((*(byte *)&pKeyMsg->key_info & 1) != 0 &&
      ((((*(byte *)&(pKeyMsg->key_info).field_0x1 & 8) != 0 &&
        (iVar2 = memcmp(pKeyMsg->key_nonce,pKeyMgmtInfoSta,0x20), iVar2 != 0)) ||
       (BVar1 = IsEAPOL_MICValid(pKeyMsg,pKeyMgmtInfoSta->EAPOL_MIC_Key), BVar1 == 0)))))) {
    BVar1 = 0;
  }
  else {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_IsRxEAPOLValid");
    BVar1 = 1;
  }
  return BVar1;
}



