pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtSta_PrepareEAPOLFrame
               (EAPOL_KeyMsg_Tx_t *pTxEapol,EAPOL_KeyMsg_t *pRxEapol,IEEEtypes_MacAddr_t *da,
               IEEEtypes_MacAddr_t *sa,UINT8 *pSNonce)

{
  byte bVar1;
  byte bVar2;
  UINT32 UVar3;
  char "KeyMgmtSta_PrepareEAPOLFrame" [29];
  byte bVar4;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_PrepareEAPOLFrame");
  if ((pTxEapol != (EAPOL_KeyMsg_Tx_t *)0x0) && (pRxEapol != (EAPOL_KeyMsg_t *)0x0)) {
    memset(pTxEapol,0,0x72);
    formEAPOLEthHdr(pTxEapol,da,sa);
    (pTxEapol->keyMsg).desc_type = pRxEapol->desc_type;
    bVar4 = *(byte *)&(pRxEapol->key_info).field_0x1 & 8;
    bVar1 = *(byte *)&(pTxEapol->keyMsg).key_info.field_0x1;
    bVar2 = *(byte *)&(pTxEapol->keyMsg).key_info;
    *(byte *)&(pTxEapol->keyMsg).key_info.field_0x1 = bVar1 & 0xf7 | bVar4;
    *(byte *)&(pTxEapol->keyMsg).key_info = bVar2 | 1;
    *(byte *)&(pTxEapol->keyMsg).key_info = bVar2 & 0xfd | 1 | *(byte *)&pRxEapol->key_info & 2;
    UVar3 = pRxEapol->replay_cnt[0];
    *(char *)(pTxEapol->keyMsg).replay_cnt = (char)*(undefined3 *)pRxEapol->replay_cnt;
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 1) = (char)(UVar3 >> 8);
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 2) = (char)(UVar3 >> 0x10);
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 3) = (char)(UVar3 >> 0x18);
    UVar3 = pRxEapol->replay_cnt[1];
    *(char *)((pTxEapol->keyMsg).replay_cnt + 1) = (char)*(undefined3 *)(pRxEapol->replay_cnt + 1);
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 5) = (char)(UVar3 >> 8);
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 6) = (char)(UVar3 >> 0x10);
    *(undefined *)((int)(pTxEapol->keyMsg).replay_cnt + 7) = (char)(UVar3 >> 0x18);
    *(byte *)&(pTxEapol->keyMsg).key_info.field_0x1 =
         bVar1 & 0xf0 | bVar4 | *(byte *)&(pRxEapol->key_info).field_0x1 & 7;
    if (pSNonce != (UINT8 *)0x0) {
      memcpy((pTxEapol->keyMsg).key_nonce,pSNonce,0x20);
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230761b8);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN supplicantAkmIsWpaWpa2(AkmSuite_t *pAkm)

{
  int iVar1;
  BOOLEAN BVar2;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantAkmIsWpaWpa2");
  iVar1 = memcmp(pAkm,"",3);
  if ((iVar1 == 0) || (iVar1 = memcmp(pAkm,"",3), iVar1 == 0)) {
    BVar2 = 1;
  }
  else {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"supplicantAkmIsWpaWpa2");
    BVar2 = 0;
  }
  return BVar2;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN supplicantAkmIsWpa2(AkmSuite_t *pAkm)

{
  int iVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantAkmIsWpa2");
  iVar1 = memcmp(pAkm,"",3);
  if (iVar1 != 0) {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"supplicantAkmIsWpa2");
  }
  return (uint)(iVar1 == 0);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN supplicantAkmIsWpaWpa2Psk(AkmSuite_t *pAkm)

{
  char "supplicantAkmIsWpaWpa2Psk" [26];
  uint uVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantAkmIsWpaWpa2Psk");
  uVar1 = supplicantAkmIsWpaWpa2(pAkm);
  if (uVar1 == 0) {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076204);
  }
  else {
    uVar1 = 1;
    if ((pAkm->akmType & 0xfb) != 2) {
      uVar1 = (uint)(pAkm->akmType == AKM_FT_PSK);
    }
  }
  return uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BOOLEAN supplicantAkmUsesKdf(AkmSuite_t *pAkm)

{
  char "supplicantAkmUsesKdf" [21];
  BOOLEAN BVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantAkmUsesKdf");
  BVar1 = supplicantAkmIsWpa2(pAkm);
  if ((BVar1 == 0) || (BVar1 = 1, 3 < (byte)(pAkm->akmType + ~AKM_WPA_MAX))) {
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076220);
    BVar1 = 0;
  }
  return BVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantConstructContext
               (IEEEtypes_MacAddr_t *pAddr1,IEEEtypes_MacAddr_t *pAddr2,UINT8 *pNonce1,
               UINT8 *pNonce2,UINT8 *pContext)

{
  char "supplicantConstructContext" [27];
  int iVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantConstructContext");
  iVar1 = memcmp(pAddr1,pAddr2,6);
  if (iVar1 < 0) {
    memcpy(pContext,pAddr1,6);
    pAddr1 = pAddr2;
  }
  else {
    memcpy(pContext,pAddr2,6);
  }
  memcpy(pContext + 6,pAddr1,6);
  iVar1 = memcmp(pNonce1,pNonce2,0x20);
  if (iVar1 < 0) {
    memcpy(pContext + 0xc,pNonce1,0x20);
    pNonce1 = pNonce2;
  }
  else {
    memcpy(pContext + 0xc,pNonce2,0x20);
  }
  memcpy(pContext + 0x2c,pNonce1,0x20);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076238);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmt_DerivePTK(IEEEtypes_MacAddr_t *pAddr1,IEEEtypes_MacAddr_t *pAddr2,UINT8 *pNonce1,
                      UINT8 *pNonce2,UINT8 *pPTK,UINT8 *pPMK,BOOLEAN use_kdf)

{
  char "KeyMgmt_DerivePTK" [18];
  UINT8 *pContext;
  
  pContext = pPTK + 200;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmt_DerivePTK");
  supplicantConstructContext(pAddr1,pAddr2,pNonce1,pNonce2,pContext);
  if (use_kdf == 0) {
    Bl_PRF(pPMK,0x20,(uchar *)"Pairwise key expansion",0x16,pContext,0x4c,pPTK,0x40);
  }
  else {
    bl_sha256_crypto_kdf(pPMK,' ',"Pairwise key expansion",'\x16',pContext,0x4c,pPTK,0x180);
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076254);
  return;
}



