pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtSta_DeriveKeys
               (UINT8 *pPMK,IEEEtypes_MacAddr_t *da,IEEEtypes_MacAddr_t *sa,UINT8 *ANonce,
               UINT8 *SNonce,UINT8 *EAPOL_MIC_Key,UINT8 *EAPOL_Encr_Key,KeyData_t *newPWKey,
               BOOLEAN use_kdf)

{
  char "KeyMgmtSta_DeriveKeys" [22];
  BOOLEAN in_stack_00000000;
  UINT8 aUStack548 [4];
  UINT8 pBuf [500];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_DeriveKeys");
  if (((pPMK != (UINT8 *)0x0) && (EAPOL_MIC_Key != (UINT8 *)0x0)) && (newPWKey != (KeyData_t *)0x0))
  {
    KeyMgmt_DerivePTK(sa,da,ANonce,SNonce,aUStack548,pPMK,in_stack_00000000);
    memcpy(EAPOL_MIC_Key,aUStack548,0x10);
    memcpy(EAPOL_Encr_Key,pBuf + 0xc,0x10);
    memcpy(newPWKey,pBuf + 0x1c,0x10);
    memcpy(newPWKey->RxMICKey,pBuf + 0x2c,8);
    memcpy(newPWKey->TxMICKey,pBuf + 0x34,8);
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076268);
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void SetEAPOLKeyDescTypeVersion
               (EAPOL_KeyMsg_Tx_t *pTxEapol,BOOLEAN isWPA2,BOOLEAN isKDF,BOOLEAN nonTKIP)

{
  byte bVar1;
  char "SetEAPOLKeyDescTypeVersion" [27];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"SetEAPOLKeyDescTypeVersion");
  bVar1 = *(byte *)&(pTxEapol->keyMsg).key_info.field_0x1;
  (pTxEapol->keyMsg).desc_type = '\x02';
  *(byte *)&(pTxEapol->keyMsg).key_info.field_0x1 = bVar1 & 0xf8 | (isKDF != 0) + 2U;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076280);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

EAPOL_KeyMsg_t *
GetKeyMsgNonceFromEAPOL(BufferDesc_t *pEAPoLBufDesc,keyMgmtInfoSta_t *pKeyMgmtInfoSta)

{
  char "GetKeyMsgNonceFromEAPOL" [24];
  EAPOL_KeyMsg_t *pKeyMsg;
  BOOLEAN BVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"GetKeyMsgNonceFromEAPOL");
  pKeyMsg = (EAPOL_KeyMsg_t *)pEAPoLBufDesc->Buffer;
  BVar1 = KeyMgmtSta_IsRxEAPOLValid(pKeyMgmtInfoSta,pKeyMsg);
  if (BVar1 == 0) {
    pKeyMsg = (EAPOL_KeyMsg_t *)0x0;
  }
  else {
    if ((*(byte *)&pKeyMsg->key_info & 1) == 0) {
      memcpy(pKeyMgmtInfoSta,pKeyMsg->key_nonce,0x20);
      supplicantGenerateRand(pKeyMgmtInfoSta->SNonce,0x20);
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x2307629c);
  }
  return pKeyMsg;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

EAPOL_KeyMsg_t *
ProcessRxEAPOL_PwkMsg3(BufferDesc_t *pEAPoLBufDesc,keyMgmtInfoSta_t *pKeyMgmtInfoSta)

{
  char "ProcessRxEAPOL_PwkMsg3" [23];
  EAPOL_KeyMsg_t *pKeyMsg;
  BOOLEAN BVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"ProcessRxEAPOL_PwkMsg3");
  pKeyMsg = GetKeyMsgNonceFromEAPOL(pEAPoLBufDesc,pKeyMgmtInfoSta);
  if (pKeyMsg == (EAPOL_KeyMsg_t *)0x0) {
LAB_2301145c:
    pKeyMsg = (EAPOL_KeyMsg_t *)0x0;
  }
  else {
    (pKeyMgmtInfoSta->newPWKey).TxIV16 = 1;
    (pKeyMgmtInfoSta->newPWKey).TxIV32 = 0;
    if ((*(byte *)&pKeyMsg->key_info & 0x10) != 0) {
      mm_timer_clear(&pKeyMgmtInfoSta->rsnTimer);
      KeyMgmtSta_ApplyKEK(pKeyMsg,&pKeyMgmtInfoSta->GRKey,pKeyMgmtInfoSta->EAPOL_Encr_Key);
      BVar1 = keyMgmtProcessMsgExt(pKeyMgmtInfoSta,pKeyMsg);
      if (BVar1 == 0) goto LAB_2301145c;
      parseKeyDataGTK(pKeyMsg->key_data,pKeyMsg->key_material_len,&pKeyMgmtInfoSta->GRKey);
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230762b4);
  }
  return pKeyMsg;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

EAPOL_KeyMsg_t *
ProcessRxEAPOL_GrpMsg1(BufferDesc_t *pEAPoLBufDesc,keyMgmtInfoSta_t *pKeyMgmtInfoSta)

{
  char "ProcessRxEAPOL_GrpMsg1" [23];
  EAPOL_KeyMsg_t *pKeyMsg;
  BOOLEAN BVar1;
  KeyData_t *pGRKey;
  UINT8 *__src;
  UINT8 *__src_00;
  undefined auStack40 [4];
  UINT8 buf [8];
  
  pKeyMsg = GetKeyMsgNonceFromEAPOL(pEAPoLBufDesc,pKeyMgmtInfoSta);
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"ProcessRxEAPOL_GrpMsg1");
  if (pKeyMsg == (EAPOL_KeyMsg_t *)0x0) {
LAB_23011518:
    pKeyMsg = (EAPOL_KeyMsg_t *)0x0;
  }
  else {
    pGRKey = &pKeyMgmtInfoSta->GRKey;
    KeyMgmtSta_ApplyKEK(pKeyMsg,pGRKey,pKeyMgmtInfoSta->EAPOL_Encr_Key);
    pKeyMgmtInfoSta->RSNDataTrafficEnabled = 1;
    mm_timer_clear(&pKeyMgmtInfoSta->rsnTimer);
    if (pKeyMsg->desc_type == '\x02') {
      parseKeyDataGTK(pKeyMsg->key_data,pKeyMsg->key_material_len,pGRKey);
      BVar1 = keyMgmtProcessMsgExt(pKeyMgmtInfoSta,pKeyMsg);
      if (BVar1 == 0) goto LAB_23011518;
    }
    else {
      memcpy(pGRKey,pKeyMsg->key_data,(uint)pKeyMsg->key_material_len);
      __src_00 = (pKeyMgmtInfoSta->GRKey).TxMICKey;
      memcpy(auStack40,__src_00,8);
      __src = (pKeyMgmtInfoSta->GRKey).RxMICKey;
      memcpy(__src_00,__src,8);
      memcpy(__src,auStack40,8);
      (pKeyMgmtInfoSta->GRKey).KeyIndex = (ushort)(*(byte *)&(pKeyMsg->key_info).field_0x1 >> 4) & 3
      ;
    }
    dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230762cc);
  }
  return pKeyMsg;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtResetCounter(keyMgmtInfoSta_t *pKeyMgmtInfo)

{
  char "KeyMgmtResetCounter" [20];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtResetCounter");
  if (pKeyMgmtInfo != (keyMgmtInfoSta_t *)0x0) {
    pKeyMgmtInfo->staCounterHi = 0;
    pKeyMgmtInfo->staCounterLo = 0;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230762e4);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void keyMgmtSta_StartSession_internal(keyMgmtInfoSta_t *pKeyMgmtInfoSta,UINT32 expiry)

{
  char "keyMgmtSta_StartSession_internal" [33];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"keyMgmtSta_StartSession_internal");
  if ((pKeyMgmtInfoSta->sta_MIC_Error).disableStaAsso == 0) {
    mm_timer_set(&pKeyMgmtInfoSta->rsnTimer,_DAT_44b00120 + expiry);
  }
  pKeyMgmtInfoSta->apCounterLo = 0;
  pKeyMgmtInfoSta->apCounterHi = 0;
  pKeyMgmtInfoSta->apCounterZeroDone = 0;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x2307631c);
  return;
}



