pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void KeyMgmtSta_InitSession(keyMgmtInfoSta_t *pKeyMgmtInfoSta)

{
  char "KeyMgmtSta_InitSession" [23];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"KeyMgmtSta_InitSession");
  pKeyMgmtInfoSta->RSNDataTrafficEnabled = 0;
  pKeyMgmtInfoSta->RSNSecured = 0;
  pKeyMgmtInfoSta->pRxDecryptKey = (cipher_key_t *)0x0;
  pKeyMgmtInfoSta->pwkHandshakeComplete = 0;
  (pKeyMgmtInfoSta->rsnTimer).cb = keyMgmtStaRsnSecuredTimeoutHandler;
  *(keyMgmtInfoSta_t **)&(pKeyMgmtInfoSta->rsnTimer).env = pKeyMgmtInfoSta;
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076340);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void set_psk(char *pSsid,UINT8 ssidLen,char *phrase)

{
  char "set_psk" [8];
  size_t sVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"set_psk");
  memset(&nohostParams,0xff,0x43);
  sVar1 = strlen(phrase);
  pmkCacheSetPassphrase((UINT8 *)pSsid,ssidLen,(UINT8 *)phrase,(UINT8)sVar1);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x2308ddc4);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void remove_psk(char *pSsid,UINT8 ssidLen)

{
  char "remove_psk" [11];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"remove_psk");
  pmkCacheDeletePSK((UINT8 *)pSsid,ssidLen);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076358);
  return;
}



// WARNING: Could not reconcile some variable overlaps

void bl_sha256_crypto_kdf
               (UINT8 *pKey,UINT8 key_len,char *label,UINT8 label_len,UINT8 *pContext,
               UINT16 context_len,UINT8 *pOutput,UINT16 output_len)

{
  UINT8 *mac;
  undefined3 in_register_0000202d;
  undefined2 in_register_0000203e;
  undefined2 in_register_00002046;
  ushort auStack114 [8];
  ushort uStack98;
  UINT16 i;
  ushort *puStack96;
  UINT8 *vectors [4];
  size_t vectLen [4];
  
  uStack98 = 1;
  mac = pContext + CONCAT22(in_register_0000203e,context_len);
  auStack114[0] = output_len;
  while ((uint)uStack98 <= (CONCAT22(in_register_00002046,output_len) + 0xff >> 8 & 0xffU)) {
    vectors[3] = (UINT8 *)0x2;
    puStack96 = &uStack98;
    vectors[0] = (UINT8 *)label;
    vectors[1] = pContext;
    vectors[2] = (UINT8 *)auStack114;
    hmac_sha256_vector(pKey,CONCAT31(in_register_0000202d,key_len),4,(UINT8 **)&stack0xffffffa0,
                       (size_t *)(vectors + 3),mac);
    mac = mac + 0x20;
    uStack98 = uStack98 + 1;
  }
  memcpy(pOutput,pContext + CONCAT22(in_register_0000203e,context_len),(uint)(auStack114[0] >> 3));
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT8 * pmkCacheFindPSK(UINT8 *pSsid,UINT8 ssidLen)

{
  char "pmkCacheFindPSK" [16];
  pmkElement_t *pPSK;
  size_t sVar1;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheFindPSK");
  pPSK = pmkCacheFindPSKElement(pSsid,ssidLen);
  if (pPSK == (pmkElement_t *)0x0) {
    if (PSKPassPhrase != '\0') {
      pmkCacheAddPSK(pSsid,ssidLen,(UINT8 *)0x0,'\0');
      pPSK = pmkCacheFindPSKElement(pSsid,ssidLen);
      sVar1 = strlen((char *)PSKPassPhrase);
      pPSK = (pmkElement_t *)pPSK->PMK;
      pmkCacheGeneratePSK(pSsid,ssidLen,PSKPassPhrase,(UINT8)sVar1,(UINT8 *)pPSK);
    }
  }
  else {
    pPSK = (pmkElement_t *)pPSK->PMK;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076364);
  return (UINT8 *)pPSK;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheSetPassphrase(UINT8 *pSsid,UINT8 ssidLen,UINT8 *pPassphrase,UINT8 PassphraseLen)

{
  char "pmkCacheSetPassphrase" [22];
  pmkElement_t *pSsid_00;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheSetPassphrase");
  if (pPassphrase != (UINT8 *)0x0) {
    memcpy(PSKPassPhrase,pPassphrase,0x40);
    pmkCacheAddPSK(pSsid,ssidLen,pPassphrase,PassphraseLen);
    pSsid_00 = pmkCacheFindPSKElement(pSsid,ssidLen);
    pmkCacheGeneratePSK((UINT8 *)pSsid_00,pSsid_00->length,PSKPassPhrase,PassphraseLen,pSsid_00->PMK
                       );
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076374);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheInit(void)

{
  char "pmkCacheInit" [13];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheInit");
  memset(pmkCache,0,0x86);
  memset(PSKPassPhrase,0,0x40);
  replacementRankMax = '\0';
  dbg_test_print("%dms : Leave: %s\n",0x2307638c);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheRomInit(void)

{
  char "pmkCacheRomInit" [16];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheRomInit");
  ramHook_MAX_PMK_CACHE_ENTRIES = 2;
  ramHook_pmkCache = pmkCache;
  ramHook_PSKPassPhrase = PSKPassPhrase;
  dbg_test_print("%dms : Leave: %s\n",0x2307639c);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

pmkElement_t * pmkCacheNewElement(void)

{
  char "pmkCacheNewElement" [19];
  uint uVar1;
  pmkElement_t *__s;
  pmkElement_t *ppVar2;
  
  ppVar2 = (pmkElement_t *)0x0;
  uVar1 = 0;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheNewElement");
  while ((int)uVar1 < ramHook_MAX_PMK_CACHE_ENTRIES) {
    if ((int)replacementRankMax == ramHook_MAX_PMK_CACHE_ENTRIES) {
      ramHook_pmkCache[uVar1].replacementRank = ramHook_pmkCache[uVar1].replacementRank + -1;
    }
    if (ppVar2 == (pmkElement_t *)0x0) {
      __s = ramHook_pmkCache + uVar1;
      if (__s->replacementRank == '\0') {
        memset(__s,0,0x43);
        if (replacementRankMax < ramHook_MAX_PMK_CACHE_ENTRIES) {
          replacementRankMax = replacementRankMax + '\x01';
        }
        ramHook_pmkCache[uVar1].replacementRank = replacementRankMax;
        ppVar2 = __s;
      }
    }
    uVar1 = uVar1 + 1 & 0xff;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230763ac);
  return ppVar2;
}



