pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheUpdateReplacementRank(pmkElement_t *pPMKElement)

{
  char cVar1;
  SINT8 SVar2;
  pmkElement_t *ppVar3;
  SINT32 SVar4;
  char "pmkCacheUpdateReplacementRank" [30];
  uint uVar5;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheUpdateReplacementRank");
  SVar4 = ramHook_MAX_PMK_CACHE_ENTRIES;
  ppVar3 = ramHook_pmkCache;
  SVar2 = replacementRankMax;
  if ((pPMKElement != (pmkElement_t *)0x0) && (pPMKElement->replacementRank != replacementRankMax))
  {
    uVar5 = 0;
    while ((int)uVar5 < SVar4) {
      cVar1 = ppVar3[uVar5].replacementRank;
      if (pPMKElement->replacementRank < cVar1) {
        ppVar3[uVar5].replacementRank = cVar1 + -1;
      }
      uVar5 = uVar5 + 1 & 0xff;
    }
    pPMKElement->replacementRank = SVar2;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230763c0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

pmkElement_t * pmkCacheFindPSKElement(UINT8 *pSsid,UINT8 ssidLen)

{
  char "pmkCacheFindPSKElement" [23];
  uint uVar1;
  pmkElement_t *pPMKElement;
  pmkElement_t *__s1;
  int iVar2;
  undefined3 in_register_0000202d;
  
  pPMKElement = (pmkElement_t *)0x0;
  uVar1 = 0;
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheFindPSKElement");
  while ((int)uVar1 < ramHook_MAX_PMK_CACHE_ENTRIES) {
    __s1 = ramHook_pmkCache + uVar1;
    if (((__s1->replacementRank != '\0') &&
        ((uint)__s1->length == CONCAT31(in_register_0000202d,ssidLen))) &&
       (iVar2 = memcmp(__s1,pSsid,CONCAT31(in_register_0000202d,ssidLen)), iVar2 == 0)) {
      pPMKElement = ramHook_pmkCache + uVar1;
    }
    uVar1 = uVar1 + 1 & 0xff;
  }
  pmkCacheUpdateReplacementRank(pPMKElement);
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230763e0);
  return pPMKElement;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheAddPSK(UINT8 *pSsid,UINT8 ssidLen,UINT8 *pPSK,UINT8 pPSKLen)

{
  char "pmkCacheAddPSK" [15];
  pmkElement_t *__dest;
  undefined3 in_register_0000202d;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheAddPSK");
  __dest = pmkCacheFindPSKElement(pSsid,ssidLen);
  if (__dest == (pmkElement_t *)0x0) {
    __dest = pmkCacheNewElement();
    memcpy(__dest,pSsid,CONCAT31(in_register_0000202d,ssidLen));
    __dest->length = ssidLen;
  }
  if (pPSK != (UINT8 *)0x0) {
    memcpy(__dest->PMK,pPSK,0x20);
    __dest->psk_length = pPSKLen;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x230763f8);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheDeletePSK(UINT8 *pSsid,UINT8 ssidLen)

{
  char "pmkCacheDeletePSK" [18];
  pmkElement_t *__s;
  
  __s = pmkCacheFindPSKElement(pSsid,ssidLen);
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheDeletePSK");
  if (__s != (pmkElement_t *)0x0) {
    memset(__s,0,0x43);
    replacementRankMax = replacementRankMax + -1;
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076408);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

UINT8 pmkCacheGetHexNibble(UINT8 nibble)

{
  undefined3 in_register_00002029;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheGetHexNibble");
  if (CONCAT31(in_register_00002029,nibble) < 0x61) {
    if (CONCAT31(in_register_00002029,nibble) < 0x41) {
      nibble = nibble + -0x30;
      dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,"pmkCacheGetHexNibble");
    }
    else {
      nibble = nibble + -0x37;
    }
  }
  else {
    nibble = nibble + -0x57;
  }
  return nibble;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void pmkCacheGeneratePSK(UINT8 *pSsid,UINT8 ssidLen,UINT8 *pPassphrase,UINT8 PassphraseLen,
                        UINT8 *pPSK)

{
  char "pmkCacheGeneratePSK" [20];
  UINT8 UVar1;
  byte bVar2;
  undefined3 in_register_0000202d;
  undefined3 in_register_00002035;
  int iVar3;
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"pmkCacheGeneratePSK");
  if ((pPSK != (UINT8 *)0x0) && (pPassphrase != (UINT8 *)0x0)) {
    if (CONCAT31(in_register_00002035,PassphraseLen) - 8U < 0x38) {
      utils_wifi_psk_cal_fast_bin
                ((char *)pPassphrase,pSsid,CONCAT31(in_register_0000202d,ssidLen),pPSK);
    }
    else {
      if (CONCAT31(in_register_00002035,PassphraseLen) == 0x40) {
        iVar3 = 0;
        do {
          UVar1 = pmkCacheGetHexNibble(*pPassphrase);
          bVar2 = pmkCacheGetHexNibble(pPassphrase[1]);
          pPSK[iVar3 >> 1] = bVar2 | UVar1 << 4;
          iVar3 = iVar3 + 2;
          pPassphrase = pPassphrase + 2;
        } while (iVar3 != 0x40);
      }
    }
  }
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x23076434);
  return;
}



void prepare_key(uchar *key_data_ptr,int key_data_len,rc4_key *key)

{
  byte bVar1;
  uchar *puVar2;
  rc4_key *prVar3;
  uint uVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  
  iVar5 = 0;
  do {
    key->state[iVar5] = (uchar)iVar5;
    iVar5 = iVar5 + 1;
  } while (iVar5 != 0x100);
  key->x = '\0';
  key->y = '\0';
  uVar7 = 0;
  uVar4 = 0;
  prVar3 = key;
  do {
    bVar1 = prVar3->state[0];
    puVar2 = prVar3->state;
    uVar6 = (uint)key_data_ptr[uVar4] + (uint)bVar1 + uVar7;
    uVar7 = uVar6 & 0xff;
    prVar3->state[0] = key->state[uVar6 & 0xff];
    key->state[uVar6 & 0xff] = bVar1;
    uVar4 = (int)(uVar4 + 1) % key_data_len & 0xff;
    prVar3 = (rc4_key *)(puVar2 + 1);
  } while ((rc4_key *)&key->x != (rc4_key *)(puVar2 + 1));
  return;
}



void rc4(uchar *buffer_ptr,int buffer_len,int skip,rc4_key *key)

{
  byte bVar1;
  byte bVar2;
  byte *pbVar3;
  uint uVar4;
  int iVar5;
  uint uVar6;
  byte *pbVar7;
  uint uVar8;
  
  bVar1 = key->x;
  uVar4 = (uint)key->y;
  iVar5 = 0;
  while (uVar8 = (uint)bVar1 + iVar5 & 0xff, iVar5 < skip) {
    bVar2 = key->state[uVar8 + 1 & 0xff];
    uVar4 = uVar4 + bVar2 & 0xff;
    iVar5 = (iVar5 + 1) * 0x10000 >> 0x10;
    key->state[uVar8 + 1 & 0xff] = key->state[uVar4];
    key->state[uVar4] = bVar2;
  }
  iVar5 = 0;
  while (uVar6 = uVar8 + iVar5 & 0xff, iVar5 < buffer_len) {
    pbVar7 = key->state + (uVar6 + 1 & 0xff);
    bVar1 = *pbVar7;
    uVar4 = uVar4 + (uint)bVar1 & 0xff;
    *pbVar7 = key->state[uVar4];
    key->state[uVar4] = bVar1;
    pbVar3 = buffer_ptr + iVar5;
    iVar5 = (iVar5 + 1) * 0x10000 >> 0x10;
    *pbVar3 = key->state[(uint)bVar1 + (uint)*pbVar7 & 0xff] ^ *pbVar3;
  }
  key->x = (uchar)uVar6;
  key->y = (uchar)uVar4;
  return;
}



void RC4_Encrypt(uchar *Encr_Key,uchar *IV,ushort iv_length,uchar *Data,ushort data_length,
                ushort skipBytes)

{
  undefined2 in_register_00002032;
  size_t __n;
  undefined2 in_register_0000203a;
  undefined2 in_register_0000203e;
  uchar auStack64 [4];
  uchar key [32];
  
  __n = CONCAT22(in_register_00002032,iv_length);
  if ((int)(__n + 0x10) < 0x21) {
    memcpy(auStack64,IV,__n);
    memcpy(auStack64 + __n,Encr_Key,0x10);
    prepare_key(auStack64,__n + 0x10,&rc4key);
    rc4(Data,CONCAT22(in_register_0000203a,data_length),CONCAT22(in_register_0000203e,skipBytes),
        &rc4key);
  }
  return;
}



int sha256_compress(sha256_state *md,UINT8 *msgBuf,UINT8 *pScratchMem)

{
  UINT32 *pUVar1;
  UINT32 *pUVar2;
  int iVar3;
  uint uVar4;
  uint *puVar5;
  uint uVar6;
  int *piVar7;
  int *piVar8;
  int iVar9;
  int iVar10;
  uint uVar11;
  int *__dest;
  ushort *puVar12;
  ushort *puVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  
  __dest = (int *)(pScratchMem + 0x100);
  memcpy(__dest,md->state,0x20);
  puVar5 = (uint *)pScratchMem;
  puVar12 = (ushort *)msgBuf;
  do {
    puVar13 = puVar12 + 2;
    *puVar5 = (((uint)(*puVar12 >> 8) | ((uint)*puVar12 & 0xff) << 8) << 8 |
              (uint)*(byte *)(puVar12 + 1)) << 8 | (uint)*(byte *)((int)puVar12 + 3);
    puVar5 = puVar5 + 1;
    puVar12 = puVar13;
  } while (puVar13 != (ushort *)(msgBuf + 0x40));
  piVar7 = (int *)(pScratchMem + 0x40);
  do {
    uVar6 = piVar7[-2];
    uVar4 = piVar7[-0xf];
    piVar8 = piVar7 + 1;
    *piVar7 = ((uVar6 << 0xf | uVar6 >> 0x11) ^ (uVar6 << 0xd | uVar6 >> 0x13) ^ uVar6 >> 10) +
              piVar7[-7] + piVar7[-0x10] +
              ((uVar4 >> 7 | uVar4 << 0x19) ^ (uVar4 << 0xe | uVar4 >> 0x12) ^ uVar4 >> 3);
    piVar7 = piVar8;
  } while (__dest != piVar8);
  iVar3 = 0;
  do {
    uVar4 = *(uint *)(pScratchMem + 0x110);
    uVar14 = *(uint *)(pScratchMem + 0x118);
    uVar15 = *(uint *)(pScratchMem + 0x114);
    uVar6 = *(uint *)(pScratchMem + 0x100);
    iVar9 = *(int *)((int)K + iVar3);
    uVar11 = *(uint *)(pScratchMem + 0x104);
    uVar16 = *(uint *)(pScratchMem + 0x108);
    iVar10 = *(int *)(pScratchMem + iVar3);
    *(uint *)(pScratchMem + 0x114) = uVar4;
    iVar10 = ((uVar4 >> 6 | uVar4 << 0x1a) ^ (uVar4 >> 0xb | uVar4 << 0x15) ^
             (uVar4 << 7 | uVar4 >> 0x19)) + ((uVar14 ^ uVar15) & uVar4 ^ uVar14) +
             *(int *)(pScratchMem + 0x11c) + iVar9 + iVar10;
    *(int *)(pScratchMem + 0x110) = *(int *)(pScratchMem + 0x10c) + iVar10;
    *(uint *)(pScratchMem + 0x104) = uVar6;
    *(uint *)(pScratchMem + 0x11c) = uVar14;
    *(uint *)(pScratchMem + 0x118) = uVar15;
    *(uint *)(pScratchMem + 0x10c) = uVar16;
    *(uint *)(pScratchMem + 0x108) = uVar11;
    *(uint *)(pScratchMem + 0x100) =
         iVar10 + ((uVar6 >> 2 | uVar6 << 0x1e) ^ (uVar6 >> 0xd | uVar6 << 0x13) ^
                  (uVar6 << 10 | uVar6 >> 0x16)) + (uVar6 & uVar11 | (uVar6 | uVar11) & uVar16);
    iVar3 = iVar3 + 4;
  } while (iVar3 != 0x100);
  pUVar1 = md->state;
  do {
    iVar3 = *__dest;
    pUVar2 = pUVar1 + 1;
    __dest = __dest + 1;
    *pUVar1 = *pUVar1 + iVar3;
    pUVar1 = pUVar2;
  } while (&md->curlen != pUVar2);
  return 0;
}



void sha256_init(sha256_state *md)

{
  *(undefined4 *)&md->length = 0;
  md->state[0] = 0x6a09e667;
  md->state[1] = 0xbb67ae85;
  md->state[2] = 0x3c6ef372;
  md->state[3] = 0xa54ff53a;
  md->state[4] = 0x510e527f;
  md->state[5] = 0x9b05688c;
  md->state[6] = 0x1f83d9ab;
  md->curlen = 0;
  *(undefined4 *)((int)&md->length + 4) = 0;
  md->state[7] = 0x5be0cd19;
  return;
}



void sha256_vector(size_t num_elem,UINT8 **addr,size_t *len,UINT8 *mac,UINT8 *pScratchMem)

{
  int iVar1;
  uint uVar2;
  uint __n;
  undefined4 uVar3;
  undefined4 uVar4;
  undefined4 *puVar5;
  uint uVar6;
  UINT8 *msgBuf;
  UINT8 *pScratchMem_00;
  int iVar7;
  
  pScratchMem_00 = pScratchMem + 0x70;
  sha256_init((sha256_state *)pScratchMem);
  iVar7 = 0;
  do {
    __n = *(uint *)(pScratchMem + 0x28);
    if (iVar7 == num_elem << 2) {
      if (__n < 0x40) {
        uVar2 = __n * 8 + *(uint *)pScratchMem;
        *(uint *)(pScratchMem + 4) =
             (uint)(uVar2 < *(uint *)pScratchMem) + *(int *)(pScratchMem + 4);
        *(uint *)pScratchMem = uVar2;
        *(uint *)(pScratchMem + 0x28) = __n + 1;
        pScratchMem[__n + 0x2c] = -0x80;
        if (0x38 < __n + 1) {
          while (__n = *(uint *)(pScratchMem + 0x28), __n < 0x40) {
            *(uint *)(pScratchMem + 0x28) = __n + 1;
            pScratchMem[__n + 0x2c] = '\0';
          }
          sha256_compress((sha256_state *)pScratchMem,pScratchMem + 0x2c,pScratchMem_00);
          *(undefined4 *)(pScratchMem + 0x28) = 0;
        }
        while (__n = *(uint *)(pScratchMem + 0x28), __n < 0x38) {
          *(uint *)(pScratchMem + 0x28) = __n + 1;
          pScratchMem[__n + 0x2c] = '\0';
        }
        uVar3 = *(undefined4 *)pScratchMem;
        pScratchMem[0x68] = (UINT8)((uint)uVar3 >> 0x18);
        pScratchMem[0x69] = (UINT8)((uint)uVar3 >> 0x10);
        pScratchMem[0x6b] = (UINT8)uVar3;
        uVar4 = *(undefined4 *)(pScratchMem + 4);
        pScratchMem[0x6a] = (UINT8)((uint)uVar3 >> 8);
        pScratchMem[100] = (UINT8)((uint)uVar4 >> 0x18);
        pScratchMem[0x65] = (UINT8)((uint)uVar4 >> 0x10);
        pScratchMem[0x67] = (UINT8)uVar4;
        pScratchMem[0x66] = (UINT8)((uint)uVar4 >> 8);
        sha256_compress((sha256_state *)pScratchMem,pScratchMem + 0x2c,pScratchMem_00);
        puVar5 = (undefined4 *)(pScratchMem + 8);
        do {
          puVar5 = puVar5 + 1;
          uVar3 = *puVar5;
          *mac = (UINT8)((uint)uVar3 >> 0x18);
          mac[1] = (UINT8)((uint)uVar3 >> 0x10);
          mac[2] = (UINT8)((uint)uVar3 >> 8);
          mac[3] = (UINT8)uVar3;
          puVar5 = puVar5;
          mac = mac + 4;
        } while (puVar5 != (undefined4 *)(pScratchMem + 0x28));
      }
      return;
    }
    msgBuf = *(UINT8 **)((int)addr + iVar7);
    uVar2 = *(uint *)((int)len + iVar7);
    if (__n < 0x41) {
      while (iVar1 = *(int *)(pScratchMem + 0x28), uVar2 != 0) {
        if ((iVar1 == 0) && (0x3f < uVar2)) {
          iVar1 = sha256_compress((sha256_state *)pScratchMem,msgBuf,pScratchMem_00);
          if (iVar1 < 0) break;
          uVar6 = *(uint *)pScratchMem;
          msgBuf = msgBuf + 0x40;
          __n = uVar6 + 0x200;
          *(uint *)pScratchMem = __n;
          *(uint *)(pScratchMem + 4) = (uint)(__n < uVar6) + *(int *)(pScratchMem + 4);
          uVar2 = uVar2 - 0x40;
        }
        else {
          __n = 0x40U - iVar1;
          if (uVar2 < 0x40U - iVar1) {
            __n = uVar2;
          }
          memcpy(pScratchMem + 0x2c + iVar1,msgBuf,__n);
          iVar1 = *(int *)(pScratchMem + 0x28);
          msgBuf = msgBuf + __n;
          uVar2 = uVar2 - __n;
          *(uint *)(pScratchMem + 0x28) = iVar1 + __n;
          if (iVar1 + __n == 0x40) {
            iVar1 = sha256_compress((sha256_state *)pScratchMem,pScratchMem + 0x2c,pScratchMem_00);
            if (iVar1 < 0) break;
            uVar6 = *(uint *)pScratchMem;
            *(undefined4 *)(pScratchMem + 0x28) = 0;
            __n = uVar6 + 0x200;
            *(uint *)pScratchMem = __n;
            *(uint *)(pScratchMem + 4) = (uint)(__n < uVar6) + *(int *)(pScratchMem + 4);
          }
        }
      }
    }
    iVar7 = iVar7 + 4;
  } while( true );
}



// WARNING: Variable defined which should be unmapped: pScratchMem

void hmac_sha256_vector(UINT8 *key,size_t key_len,size_t num_elem,UINT8 **addr,size_t *len,
                       UINT8 *mac)

{
  size_t *mac_00;
  UINT8 **ppUVar1;
  size_t **ppsVar2;
  UINT8 **len_00;
  UINT8 **ppUVar3;
  size_t *psVar4;
  int iVar5;
  size_t *psVar6;
  size_t sStack600;
  uint *apuStack596 [4];
  size_t *psStack580;
  UINT8 *_addr [6];
  size_t _len [6];
  UINT8 pScratchMem [500];
  
  mac_00 = (size_t *)(pScratchMem + 0x3c);
  sStack600 = key_len;
  apuStack596[0] = (uint *)key;
  if (0x40 < key_len) {
    apuStack596[0] = (uint *)key;
    sha256_vector(1,(UINT8 **)apuStack596,&sStack600,(UINT8 *)mac_00,pScratchMem + 0x5c);
    sStack600 = 0x20;
    apuStack596[0] = mac_00;
  }
  memset(_len + 5,0,0x40);
  memcpy(_len + 5,apuStack596[0],sStack600);
  psVar6 = _len + 5;
  do {
    psVar4 = psVar6 + 1;
    *psVar6 = *psVar6 ^ 0x36363636;
    psVar6 = psVar4;
  } while (psVar4 != mac_00);
  psStack580 = _len + 5;
  len_00 = _addr + 5;
  _addr[5] = (UINT8 *)0x40;
  iVar5 = 0;
  ppsVar2 = &psStack580;
  ppUVar3 = len_00;
  while( true ) {
    ppsVar2 = ppsVar2 + 1;
    ppUVar3 = ppUVar3 + 1;
    if (iVar5 == num_elem << 2) break;
    *ppsVar2 = *(size_t **)((int)addr + iVar5);
    ppUVar1 = (UINT8 **)((int)len + iVar5);
    iVar5 = iVar5 + 4;
    *ppUVar3 = *ppUVar1;
  }
  sha256_vector(num_elem + 1,(UINT8 **)&psStack580,(size_t *)len_00,mac,pScratchMem + 0x5c);
  memset(_len + 5,0,0x40);
  memcpy(_len + 5,apuStack596[0],sStack600);
  psVar6 = _len + 5;
  do {
    psVar4 = psVar6 + 1;
    *psVar6 = *psVar6 ^ 0x5c5c5c5c;
    psVar6 = psVar4;
  } while (psVar4 != mac_00);
  psStack580 = _len + 5;
  _addr[5] = (UINT8 *)0x40;
  _len[0] = 0x20;
  _addr[0] = mac;
  sha256_vector(2,(UINT8 **)&psStack580,(size_t *)len_00,mac,pScratchMem + 0x5c);
  return;
}



void KeyMgmtInit(cm_ConnectionInfo_t *connPtr)

{
  UINT8 ssidLen;
  apInfo_t *paVar1;
  size_t sVar2;
  UINT8 *pPassphrase;
  
