pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  paVar1 = cm_GetApInfo(connPtr);
  ROM_InitGTK(&(paVar1->bssData).grpKeyData,(paVar1->bssData).GNonce,connPtr->localMacAddr);
  if ((paVar1->bssData).updatePassPhrase == 1) {
    ssidLen = (connPtr->comData).SsIdLen;
    pPassphrase = (paVar1->bssConfig).RsnConfig.PSKPassPhrase;
    sVar2 = strlen((char *)pPassphrase);
    pmkCacheGeneratePSK((UINT8 *)&connPtr->comData,ssidLen,pPassphrase,(UINT8)sVar2,
                        (paVar1->bssConfig).RsnConfig.PSKValue);
    (paVar1->bssData).updatePassPhrase = 0;
  }
  return;
}



BufferDesc_t *
PrepDefaultEapolMsg(cm_ConnectionInfo_t *connPtr,EAPOL_KeyMsg_Tx_t **pTxEapolPtr,
                   BufferDesc_t *pBufDesc)

{
  apSpecificData_t *paVar1;
  apInfo_t *paVar2;
  BufferDesc_t *pBVar3;
  uint nonTKIP;
  EAPOL_KeyMsg_Tx_t *pEStack36;
  EAPOL_KeyMsg_Tx_t *tx_eapol_ptr;
  
  paVar1 = cm_GetApData(connPtr);
  paVar2 = cm_GetApInfo(connPtr);
  pBVar3 = GetTxEAPOLBuffer(connPtr,&pEStack36,pBufDesc);
  if (pBVar3 != (BufferDesc_t *)0x0) {
    memset(pEStack36,0,0x72);
    formEAPOLEthHdr(pEStack36,(IEEEtypes_MacAddr_t *)connPtr->peerMacAddr,
                    (IEEEtypes_MacAddr_t *)connPtr->localMacAddr);
    nonTKIP = 1;
    if (((byte)(paVar1->staData).keyMgmtInfo.rom.staUcstCipher & 8) == 0) {
      nonTKIP = (uint)((byte)(paVar2->bssConfig).RsnConfig.mcstCipher >> 3) & 1;
    }
    SetEAPOLKeyDescTypeVersion
              (pEStack36,*(uint *)&(paVar1->staData).keyMgmtInfo.rom >> 0x15 & 1,0,nonTKIP);
    *pTxEapolPtr = pEStack36;
  }
  return pBVar3;
}



// WARNING: Variable defined which should be unmapped: replay_cnt

Status_e GeneratePWKMsg1(cm_ConnectionInfo_t *connPtr,BufferDesc_t *pBufDesc)

{
  Status_e SVar1;
  apSpecificData_t *paVar2;
  BufferDesc_t *pBufDesc_00;
  uint uVar3;
  uint uVar4;
  UINT32 UVar5;
  EAPOL_KeyMsg_Tx_t *pEStack28;
  EAPOL_KeyMsg_Tx_t *tx_eapol_ptr;
  UINT32 replay_cnt [2];
  
  paVar2 = cm_GetApData(connPtr);
  pBufDesc_00 = PrepDefaultEapolMsg(connPtr,&pEStack28,pBufDesc);
  if (pBufDesc_00 == (BufferDesc_t *)0x0) {
    SVar1 = FAIL;
  }
  else {
    UVar5 = (paVar2->staData).keyMgmtInfo.counterLo + 1;
    (paVar2->staData).keyMgmtInfo.counterLo = UVar5;
    if (UVar5 == 0) {
      (paVar2->staData).keyMgmtInfo.counterHi = (paVar2->staData).keyMgmtInfo.counterHi + 1;
    }
    tx_eapol_ptr = (EAPOL_KeyMsg_Tx_t *)(paVar2->staData).keyMgmtInfo.counterHi;
    supplicantGenerateRand((UINT8 *)&connPtr->TxRxCipherKeyBuf,0x20);
    PopulateKeyMsg(pEStack28,&(paVar2->staData).keyMgmtInfo.rom.staUcstCipher,0x800,
                   (UINT32 *)&tx_eapol_ptr,(UINT8 *)&connPtr->TxRxCipherKeyBuf);
    uVar3 = (uint)(pEStack28->keyMsg).key_material_len + 0x5f;
    uVar4 = uVar3 & 0xffff;
    (pEStack28->keyMsg).hdr_8021x.protocol_ver = (paVar2->staData).keyMgmtInfo.EAPOLProtoVersion;
    (pEStack28->keyMsg).hdr_8021x.pckt_type = IEEE_8021X_PACKET_TYPE_EAPOL_KEY;
    *(char *)&(pEStack28->keyMsg).hdr_8021x.pckt_body_len = (char)(uVar4 >> 8);
    *(undefined *)((int)&(pEStack28->keyMsg).hdr_8021x.pckt_body_len + 1) = (char)uVar4;
    UpdateEAPOLWcbLenAndTransmit(pBufDesc_00,(UINT16)(uVar3 * 0x10000 >> 0x10));
    SVar1 = FW_SUCCESS;
  }
  return SVar1;
}



Status_e GeneratePWKMsg3(cm_ConnectionInfo_t *connPtr,BufferDesc_t *pBufDesc)

{
  SecurityMode_t SVar1;
  UINT16 frameLen;
  BufferDesc_t *pBufDesc_00;
  apSpecificData_t *paVar2;
  apInfo_t *paVar3;
  BOOLEAN BVar4;
  uint8_t *pWPA2;
  UINT32 UVar5;
  Cipher_t *Cipher;
  EAPOL_KeyMsg_Tx_t *pEStack44;
  EAPOL_KeyMsg_Tx_t *tx_eapol_ptr;
  UINT32 replay_cnt [2];
  
  pBufDesc_00 = PrepDefaultEapolMsg(connPtr,&pEStack44,pBufDesc);
  if (pBufDesc_00 != (BufferDesc_t *)0x0) {
    paVar2 = cm_GetApData(connPtr);
    paVar3 = cm_GetApInfo(connPtr);
    UVar5 = (paVar2->staData).keyMgmtInfo.counterLo + 1;
    (paVar2->staData).keyMgmtInfo.counterLo = UVar5;
    if (UVar5 == 0) {
      (paVar2->staData).keyMgmtInfo.counterHi = (paVar2->staData).keyMgmtInfo.counterHi + 1;
    }
    tx_eapol_ptr = (EAPOL_KeyMsg_Tx_t *)(paVar2->staData).keyMgmtInfo.counterHi;
    Cipher = &(paVar2->staData).keyMgmtInfo.rom.staUcstCipher;
    PopulateKeyMsg(pEStack44,Cipher,
                   ((ushort)(paVar2->staData).keyMgmtInfo.rom.staSecType & 0x20) << 10 | 0x880,
                   (UINT32 *)&tx_eapol_ptr,(UINT8 *)&connPtr->TxRxCipherKeyBuf);
    SVar1 = (paVar2->staData).keyMgmtInfo.rom.staSecType;
    pWPA2 = (uint8_t *)0x0;
    if ((((ushort)SVar1 & 8) == 0) && (((ushort)SVar1 & 0x20) != 0)) {
      pWPA2 = int_rsn_ie;
    }
    BVar4 = KeyData_UpdateKeyMaterial
                      (pEStack44,&(paVar2->staData).keyMgmtInfo.rom.staSecType,(void *)0x0,pWPA2);
    if (BVar4 != 0) {
      if (((ushort)(paVar2->staData).keyMgmtInfo.rom.staSecType & 0x20) == 0) {
LAB_230128b6:
        frameLen = KeyMgmtSta_PopulateEAPOLLengthMic
                             (pEStack44,(paVar2->staData).keyMgmtInfo.EAPOL_MIC_Key,
                              (paVar2->staData).keyMgmtInfo.EAPOLProtoVersion,
                              *(byte *)&(pEStack44->keyMsg).key_info.field_0x1 & 7);
        UpdateEAPOLWcbLenAndTransmit(pBufDesc_00,frameLen);
        return FW_SUCCESS;
      }
      prepareKDE(pEStack44,&(paVar3->bssData).grpKeyData,(Cipher_t *)&(paVar3->bssConfig).RsnConfig)
      ;
      BVar4 = Encrypt_keyData(pEStack44,(paVar2->staData).keyMgmtInfo.EAPOL_Encr_Key,Cipher);
      if (BVar4 != 0) goto LAB_230128b6;
    }
    vPortFree(pBufDesc_00->Buffer);
    vPortFree(pBufDesc_00);
  }
  return FAIL;
}



Status_e ProcessPWKMsg4(BufferDesc_t *pBufDesc)

{
  SecurityMode_t SVar1;
  cm_ConnectionInfo_t *connPtr;
  Status_e SVar2;
  apSpecificData_t *paVar3;
  BOOLEAN BVar4;
  
  connPtr = (cm_ConnectionInfo_t *)pBufDesc->intf;
  paVar3 = cm_GetApData(connPtr);
  BVar4 = IsEAPOL_MICValid((EAPOL_KeyMsg_t *)pBufDesc->Buffer,
                           (paVar3->staData).keyMgmtInfo.EAPOL_MIC_Key);
  if (BVar4 == 0) {
    SVar2 = FAIL;
  }
  else {
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x44] = 1;
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x45] = 0;
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x40] = 0;
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x41] = 0;
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x42] = 0;
    (connPtr->TxRxCipherKeyBuf).cipher_key.ckd[0x43] = 0;
    add_key_to_mac(connPtr,'\x01');
    apm_sta_add(connPtr->staId);
    SVar1 = (paVar3->staData).keyMgmtInfo.rom.staSecType;
    (paVar3->staData).keyMgmtInfo.numHskTries = '\0';
    SVar2 = FW_SUCCESS;
    if (((ushort)SVar1 & 0x20) != 0) {
      (paVar3->staData).keyMgmtInfo.rom.keyMgmtState = HSK_END;
    }
  }
  return SVar2;
}



