pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
Status_e GenerateApEapolMsg(cm_ConnectionInfo_t *connPtr,keyMgmtState_e msgState,
                           BufferDesc_t *pBufDesc)

{
  IEEEtypes_PwrMgmtMode_e IVar1;
  uint uVar2;
  Status_e SVar3;
  apSpecificData_t *paVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 in_register_0000202d;
  
  uVar2 = CONCAT31(in_register_0000202d,msgState);
  paVar4 = cm_GetApData(connPtr);
  if ((msgState & 1) == 0) {
    uVar2 = uVar2 - 1 & 0xff;
  }
  IVar1 = (paVar4->staData).pwrSaveInfo.mode;
  (paVar4->staData).keyMgmtInfo.rom.keyMgmtState = (keyMgmtState_e)uVar2;
  if (IVar1 != PWR_MODE_PWR_SAVE) {
    if (uVar2 == 1) {
      SVar3 = GeneratePWKMsg1(connPtr,pBufDesc);
      _SVar3 = CONCAT31(extraout_var,SVar3);
    }
    else {
      if (uVar2 != 3) {
        if (pBufDesc == (BufferDesc_t *)0x0) {
          return FAIL;
        }
        vPortFree(pBufDesc->Buffer);
        vPortFree(pBufDesc);
        return FAIL;
      }
      SVar3 = GeneratePWKMsg3(connPtr,pBufDesc);
      _SVar3 = CONCAT31(extraout_var_00,SVar3);
    }
    if (_SVar3 != 0) {
      return (Status_e)_SVar3;
    }
    (paVar4->staData).keyMgmtInfo.rom.keyMgmtState =
         (paVar4->staData).keyMgmtInfo.rom.keyMgmtState + MSG1_PENDING;
  }
  (paVar4->staData).keyMgmtInfo.numHskTries = (paVar4->staData).keyMgmtInfo.numHskTries + '\x01';
  return FW_SUCCESS;
}



Status_e ProcessPWKMsg2(BufferDesc_t *pBufDesc)

{
  cm_ConnectionInfo_t *connPtr;
  EAPOL_KeyMsg_t *pKeyMsg;
  Status_e SVar1;
  apSpecificData_t *paVar2;
  apInfo_t *paVar3;
  BOOLEAN BVar4;
  UINT8 *EAPOL_MIC_Key;
  BOOLEAN in_fa0;
  
  connPtr = (cm_ConnectionInfo_t *)pBufDesc->intf;
  paVar2 = cm_GetApData(connPtr);
  paVar3 = cm_GetApInfo(connPtr);
  pKeyMsg = (EAPOL_KeyMsg_t *)pBufDesc->Buffer;
  EAPOL_MIC_Key = (paVar2->staData).keyMgmtInfo.EAPOL_MIC_Key;
  KeyMgmtAp_DerivePTK((paVar3->bssConfig).RsnConfig.PSKValue,
                      (IEEEtypes_MacAddr_t *)connPtr->peerMacAddr,
                      (IEEEtypes_MacAddr_t *)(connPtr->comData).BssId,
                      (UINT8 *)&connPtr->TxRxCipherKeyBuf,pKeyMsg->key_nonce,EAPOL_MIC_Key,
                      (paVar2->staData).keyMgmtInfo.EAPOL_Encr_Key,
                      (KeyData_t *)((connPtr->TxRxCipherKeyBuf).cipher_key.ckd + 0x20),in_fa0);
  BVar4 = IsEAPOL_MICValid(pKeyMsg,EAPOL_MIC_Key);
  if (BVar4 != 0) {
    (paVar2->staData).keyMgmtInfo.numHskTries = '\0';
    rsn_len = pKeyMsg[1].hdr_8021x.protocol_ver + '\x02';
    SVar1 = GenerateApEapolMsg(connPtr,MSG3_PENDING,(BufferDesc_t *)0x0);
    return SVar1;
  }
  return FAIL;
}



BOOLEAN SendEAPOLMsgUsingBufDesc(cm_ConnectionInfo_t *connPtr,BufferDesc_t *pBufDesc)

{
  keyMgmtState_e msgState;
  bool bVar1;
  apSpecificData_t *paVar2;
  
  paVar2 = cm_GetApData(connPtr);
  msgState = (paVar2->staData).keyMgmtInfo.rom.keyMgmtState;
  bVar1 = (msgState & 1) != 0;
  if (bVar1) {
    GenerateApEapolMsg(connPtr,msgState,pBufDesc);
  }
  return (uint)bVar1;
}



// WARNING: Variable defined which should be unmapped: rxCounterLo

Status_e ProcessKeyMgmtDataAp(BufferDesc_t *pBufDesc)

{
  keyMgmtState_e kVar1;
  Status_e SVar2;
  apSpecificData_t *paVar3;
  void *pvVar4;
  uint uStack24;
  UINT32 rxCounterHi;
  UINT32 rxCounterLo;
  
  paVar3 = cm_GetApData((cm_ConnectionInfo_t *)pBufDesc->intf);
  pvVar4 = pBufDesc->Buffer;
  if ((*(byte *)((int)pvVar4 + 5) & 4) == 0) {
    memcpy(&uStack24,(void *)((int)pvVar4 + 9),4);
    memcpy(&rxCounterHi,(void *)((int)pvVar4 + 0xd),4);
    if (((paVar3->staData).keyMgmtInfo.counterHi ==
         (uStack24 >> 8 & 0xff00) +
         (uStack24 & 0xff00) * 0x100 + uStack24 * 0x1000000 + (uStack24 >> 0x18)) &&
       ((paVar3->staData).keyMgmtInfo.counterLo ==
        (rxCounterHi >> 8 & 0xff00) +
        rxCounterHi * 0x1000000 + (rxCounterHi >> 0x18) + (rxCounterHi & 0xff00) * 0x100)) {
      kVar1 = (paVar3->staData).keyMgmtInfo.rom.keyMgmtState;
      if (kVar1 == WAITING_4_MSG2) {
        SVar2 = ProcessPWKMsg2(pBufDesc);
        return SVar2;
      }
      if (kVar1 == WAITING_4_MSG4) {
        SVar2 = ProcessPWKMsg4(pBufDesc);
        return SVar2;
      }
    }
  }
  return FAIL;
}



void InitStaKeyInfo(void *pConn,SecurityMode_t *secType,Cipher_t *pwCipher,UINT16 staRsnCap,
                   UINT8 akmType)

{
  apKeyMgmtInfoSta_t *__s;
  apSpecificData_t *paVar1;
  
  paVar1 = cm_GetApData((cm_ConnectionInfo_t *)pConn);
  __s = &(paVar1->staData).keyMgmtInfo;
  memset(__s,0,0x48);
  InitKeyMgmtInfo((apKeyMgmtInfoStaRom_t *)__s,secType,pwCipher,staRsnCap,akmType);
  (paVar1->staData).keyMgmtInfo.EAPOLProtoVersion = '\x01';
  return;
}



void RemoveAPKeyInfo(void *pConn)

{
  if (*(uint8_t *)((int)pConn + 3) != -1) {
    mm_sec_machwkey_del(*(uint8_t *)((int)pConn + 3));
    return;
  }
  return;
}



void InitGroupKey(cm_ConnectionInfo_t *connPtr)

{
  uint8_t uVar1;
  apInfo_t *paVar2;
  int iVar3;
  undefined3 extraout_var;
  UINT32 UVar4;
  
  paVar2 = cm_GetApInfo(connPtr);
  (paVar2->bssData).grpRekeyBcnCntConfigured = 0;
  (paVar2->bssData).grpRekeyBcnCntRemaining = 0;
  KeyMgmtInit(connPtr);
  UVar4 = (paVar2->bssConfig).RsnConfig.GrpReKeyTime;
  if (UVar4 != 0) {
    iVar3 = UVar4 * 0x1e848 + -0x7d;
    __udivdi3();
    (paVar2->bssData).grpRekeyBcnCntConfigured = iVar3 + 1U;
    (paVar2->bssData).grpRekeyBcnCntRemaining = iVar3 + 1U;
  }
  uVar1 = add_key_to_mac(connPtr,'\0');
  connPtr->gtkHwKeyId = uVar1;
  printf("gtkHwKeyId is %d\r\n",CONCAT31(extraout_var,uVar1));
  return;
}



// WARNING: Variable defined which should be unmapped: inp_data

void GenerateGTK_internal(KeyData_t *grpKeyData,UINT8 *nonce,IEEEtypes_Addr_t *StaMacAddr)

{
  size_t prefix_len;
  uchar auStack140 [4];
  UINT8 prefix [20];
  UINT8 GTK [32];
  UINT8 grpMasterKey [32];
  UINT8 inp_data [38];
  
  memcpy(auStack140,"Group key expansion",0x14);
  if ((grpKeyData != (KeyData_t *)0x0) && (nonce != (UINT8 *)0x0)) {
    memcpy(grpMasterKey + 0x1c,StaMacAddr,6);
    supplicantGenerateRand(nonce,0x20);
    memcpy(inp_data + 2,nonce,0x20);
    supplicantGenerateRand(GTK + 0x1c,0x20);
    prefix_len = strlen((char *)auStack140);
    Bl_PRF(GTK + 0x1c,0x20,auStack140,prefix_len,grpMasterKey + 0x1c,0x26,prefix + 0x10,0x20);
    memcpy(grpKeyData,prefix + 0x10,0x10);
    memcpy(grpKeyData->TxMICKey,GTK + 0xc,8);
    memcpy(grpKeyData->RxMICKey,GTK + 0x14,8);
  }
  return;
}



void PopulateKeyMsg(EAPOL_KeyMsg_Tx_t *tx_eapol_ptr,Cipher_t *Cipher,UINT16 Type,UINT32 *replay_cnt,
                   UINT8 *Nonce)

{
  byte bVar1;
  undefined2 in_register_00002032;
  int iVar2;
  undefined uVar3;
  byte bVar4;
  uint uVar5;
  
  uVar5 = CONCAT22(in_register_00002032,Type);
  if ((tx_eapol_ptr == (EAPOL_KeyMsg_Tx_t *)0x0) || (Cipher == (Cipher_t *)0x0)) {
    return;
  }
  if (((byte)*Cipher & 4) == 0) {
    if (((byte)*Cipher & 8) != 0) {
      *(undefined *)&(tx_eapol_ptr->keyMsg).key_length = 0;
      uVar3 = 0x10;
      goto LAB_23012cc4;
    }
  }
  else {
    *(undefined *)&(tx_eapol_ptr->keyMsg).key_length = 0;
    uVar3 = 0x20;
LAB_23012cc4:
    *(undefined *)((int)&(tx_eapol_ptr->keyMsg).key_length + 1) = uVar3;
  }
  bVar1 = *(byte *)&(tx_eapol_ptr->keyMsg).key_info.field_0x1;
  *(byte *)&(tx_eapol_ptr->keyMsg).key_info.field_0x1 = bVar1 | 0x80;
  if ((int)(uVar5 << 0x14) < 0) {
    *(byte *)&(tx_eapol_ptr->keyMsg).key_info.field_0x1 = bVar1 | 0x88;
    if ((Type & 0x80) == 0) goto LAB_23012d0e;
    bVar4 = *(byte *)&(tx_eapol_ptr->keyMsg).key_info;
    *(byte *)&(tx_eapol_ptr->keyMsg).key_info.field_0x1 = bVar1 | 200;
    bVar4 = bVar4 & 0xed | 1 | (byte)((uVar5 >> 0xf) << 1);
    bVar1 = (byte)((uVar5 >> 0xf) << 4);
  }
  else {
    bVar1 = (byte)((uVar5 >> 0xf) << 4);
    bVar4 = *(byte *)&(tx_eapol_ptr->keyMsg).key_info & 0xec | 3;
  }
  *(byte *)&(tx_eapol_ptr->keyMsg).key_info = bVar1 | bVar4;
LAB_23012d0e:
  uVar5 = *replay_cnt;
  iVar2 = uVar5 * 0x1000000 + (uVar5 >> 0x18) + (uVar5 & 0xff00) * 0x100 + (uVar5 >> 8 & 0xff00);
  *(char *)(tx_eapol_ptr->keyMsg).replay_cnt = (char)iVar2;
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 1) = (char)((uint)iVar2 >> 8);
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 2) = (char)((uint)iVar2 >> 0x10);
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 3) = (char)((uint)iVar2 >> 0x18);
  uVar5 = replay_cnt[1];
  iVar2 = uVar5 * 0x1000000 + (uVar5 >> 0x18) + (uVar5 & 0xff00) * 0x100 + (uVar5 >> 8 & 0xff00);
  *(char *)((tx_eapol_ptr->keyMsg).replay_cnt + 1) = (char)iVar2;
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 5) = (char)((uint)iVar2 >> 8);
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 6) = (char)((uint)iVar2 >> 0x10);
  *(undefined *)((int)(tx_eapol_ptr->keyMsg).replay_cnt + 7) = (char)((uint)iVar2 >> 0x18);
  memcpy((tx_eapol_ptr->keyMsg).key_nonce,Nonce,0x20);
  return;
}



void prepareKDE(EAPOL_KeyMsg_Tx_t *tx_eapol_ptr,KeyData_t *grKey,Cipher_t *cipher)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  UINT8 *pUVar4;
  UINT8 *__dest;
  
