pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (tx_eapol_ptr != (EAPOL_KeyMsg_Tx_t *)0x0) {
    if ((grKey != (KeyData_t *)0x0) && (cipher != (Cipher_t *)0x0)) {
      pUVar4 = (tx_eapol_ptr->keyMsg).key_data + *(byte *)&(tx_eapol_ptr->keyMsg).key_material_len;
      *pUVar4 = -0x23;
      pUVar4[1] = '\x16';
      pUVar4[2] = '\0';
      pUVar4[3] = '\x0f';
      pUVar4[4] = -0x54;
      pUVar4[5] = '\x01';
      pUVar4[6] = pUVar4[6] & 0xfc | 1;
      memcpy(pUVar4 + 8,grKey,0x10);
      __dest = pUVar4 + 0x18;
      if (((byte)*cipher & 4) != 0) {
        pUVar4[1] = pUVar4[1] + '\x10';
        memcpy(__dest,grKey->TxMICKey,8);
        memcpy(pUVar4 + 0x20,grKey->RxMICKey,8);
        __dest = pUVar4 + 0x28;
      }
      uVar1 = (uint)(tx_eapol_ptr->keyMsg).key_material_len + 2 + (uint)pUVar4[1];
      uVar2 = uVar1 & 0xffff;
      *(char *)&(tx_eapol_ptr->keyMsg).key_material_len = (char)(uVar1 * 0x10000 >> 0x10);
      *(undefined *)((int)&(tx_eapol_ptr->keyMsg).key_material_len + 1) = (char)(uVar2 >> 8);
      uVar1 = -uVar2 & 7;
      if (uVar1 != 0) {
        *__dest = -0x23;
        memset(__dest + 1,0,uVar1 - 1);
        iVar3 = uVar1 + (tx_eapol_ptr->keyMsg).key_material_len;
        *(char *)&(tx_eapol_ptr->keyMsg).key_material_len = (char)((uint)(iVar3 * 0x10000) >> 0x10);
        *(undefined *)((int)&(tx_eapol_ptr->keyMsg).key_material_len + 1) = (char)((uint)iVar3 >> 8)
        ;
      }
    }
    return;
  }
  return;
}



BOOLEAN Encrypt_keyData(EAPOL_KeyMsg_Tx_t *tx_eapol_ptr,UINT8 *EAPOL_Encr_Key,Cipher_t *cipher)

{
  void *pv;
  UINT8 *cipher_00;
  uint uVar1;
  uint __n;
  UINT8 *plain;
  UINT8 aUStack48 [4];
  UINT8 key [16];
  
  if (((tx_eapol_ptr != (EAPOL_KeyMsg_Tx_t *)0x0) && (EAPOL_Encr_Key != (UINT8 *)0x0)) &&
     (cipher != (Cipher_t *)0x0)) {
    if (((byte)*cipher & 8) == 0) {
      return (uint)((byte)*cipher >> 2) & 1;
    }
    pv = pvPortMalloc(0xc);
    if (pv != (void *)0x0) {
      cipher_00 = (UINT8 *)pvPortMalloc(400);
      *(UINT8 **)((int)pv + 8) = cipher_00;
      if (cipher_00 != (UINT8 *)0x0) {
        memcpy(aUStack48,EAPOL_Encr_Key,0x10);
        plain = (tx_eapol_ptr->keyMsg).key_data;
        BL_AesWrap(aUStack48,'\x02',(uint)((tx_eapol_ptr->keyMsg).key_material_len >> 3),plain,
                   (UINT8 *)0x0,cipher_00);
        uVar1 = (uint)(tx_eapol_ptr->keyMsg).key_material_len + 8;
        __n = uVar1 & 0xffff;
        *(char *)&(tx_eapol_ptr->keyMsg).key_material_len = (char)(uVar1 * 0x10000 >> 0x10);
        *(undefined *)((int)&(tx_eapol_ptr->keyMsg).key_material_len + 1) = (char)(__n >> 8);
        memcpy(plain,cipher_00,__n);
        vPortFree(*(void **)((int)pv + 8));
        vPortFree(pv);
        return 1;
      }
    }
    return 0;
  }
  return 0;
}



void KeyMgmtAp_DerivePTK(UINT8 *pPMK,IEEEtypes_MacAddr_t *da,IEEEtypes_MacAddr_t *sa,UINT8 *ANonce,
                        UINT8 *SNonce,UINT8 *EAPOL_MIC_Key,UINT8 *EAPOL_Encr_Key,KeyData_t *newPWKey
                        ,BOOLEAN use_kdf)

{
  undefined auStack24 [4];
  UINT8 tmp [8];
  
  KeyMgmtSta_DeriveKeys(pPMK,da,sa,ANonce,SNonce,EAPOL_MIC_Key,EAPOL_Encr_Key,newPWKey,use_kdf);
  memcpy(auStack24,newPWKey->RxMICKey,8);
  memcpy(newPWKey->RxMICKey,newPWKey->TxMICKey,8);
  memcpy(newPWKey->TxMICKey,auStack24,8);
  return;
}



BOOLEAN KeyData_CopyWPAWP2(EAPOL_KeyMsg_Tx_t *pTxEAPOL,void *pIe)

{
  size_t __n;
  
  if (pIe != (void *)0x0) {
    __n = (uint)*(byte *)((int)pIe + 1) + 2;
    *(char *)&(pTxEAPOL->keyMsg).key_material_len = (char)__n;
    *(undefined *)((int)&(pTxEAPOL->keyMsg).key_material_len + 1) = (char)(__n >> 8);
    memcpy((pTxEAPOL->keyMsg).key_data,pIe,__n);
    return 1;
  }
  return 0;
}



BOOLEAN KeyData_UpdateKeyMaterial
                  (EAPOL_KeyMsg_Tx_t *pTxEAPOL,SecurityMode_t *pSecType,void *pWPA,void *pWPA2)

{
  BOOLEAN BVar1;
  uint uVar2;
  
  if (((*(byte *)pSecType & 0x18) != 0) ||
     (uVar2 = 1, pWPA = pWPA2, (*(byte *)pSecType & 0x20) != 0)) {
    BVar1 = KeyData_CopyWPAWP2(pTxEAPOL,pWPA);
    uVar2 = (uint)(BVar1 != 0);
  }
  return uVar2;
}



void ROM_InitGTK(KeyData_t *grpKeyData,UINT8 *nonce,IEEEtypes_Addr_t *StaMacAddr)

{
  grpKeyData->TxIV32 = 0;
  *(undefined4 *)&grpKeyData->TxIV16 = 0x10001;
  GenerateGTK_internal(grpKeyData,nonce,StaMacAddr);
  return;
}



void InitKeyMgmtInfo(apKeyMgmtInfoStaRom_t *pKeyMgmtInfo,SecurityMode_t *secType,Cipher_t *pwCipher,
                    UINT16 staRsnCap,UINT8 akmType)

{
  pKeyMgmtInfo->keyMgmtState = MSG1_PENDING;
  memcpy(&pKeyMgmtInfo->staSecType,secType,2);
  memcpy(&pKeyMgmtInfo->staUcstCipher,pwCipher,1);
  pKeyMgmtInfo->staAkmType = akmType;
  if ((*(byte *)secType & 0x20) != 0) {
    pKeyMgmtInfo->staRsnCap = staRsnCap;
  }
  return;
}



apInfo_t * cm_GetApInfo(cm_ConnectionInfo_t *connPtr)

{
  if (connPtr != (cm_ConnectionInfo_t *)0x0) {
    if (connPtr->conType == '\x02') {
      return *(apInfo_t **)connPtr->specDat;
    }
    connPtr = (cm_ConnectionInfo_t *)0x0;
  }
  return (apInfo_t *)connPtr;
}



apSpecificData_t * cm_GetApData(cm_ConnectionInfo_t *connPtr)

{
  if (connPtr != (cm_ConnectionInfo_t *)0x0) {
    if (connPtr->conType == '\x02') {
      return (apSpecificData_t *)connPtr->specDat;
    }
    connPtr = (cm_ConnectionInfo_t *)0x0;
  }
  return (apSpecificData_t *)connPtr;
}



Status_e cm_AllocAPResources(cm_ConnectionInfo_t *connPtr)

{
  apSpecificData_t *paVar1;
  BufferDesc_t *pBVar2;
  void *pvVar3;
  
  paVar1 = cm_GetApData(connPtr);
  if (paVar1->apInfoBuffDesc == (BufferDesc_t *)0x0) {
    pBVar2 = (BufferDesc_t *)pvPortMalloc(0xc);
    if (pBVar2 == (BufferDesc_t *)0x0) {
      return FAIL;
    }
    pvVar3 = pvPortMalloc(0x120);
    pBVar2->Buffer = pvVar3;
    paVar1->apInfoBuffDesc = pBVar2;
    paVar1->apInfo = (apInfo_t *)pBVar2->Buffer;
    InitializeAp(connPtr);
  }
  return FW_SUCCESS;
}



Status_e cm_AllocResources(cm_ConnectionInfo_t *connPtr)

{
  Status_e SVar1;
  
