pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (connPtr->conType == '\x02') {
    SVar1 = cm_AllocAPResources(connPtr);
    return SVar1;
  }
  return FW_SUCCESS;
}



cm_ConnectionInfo_t *
cm_InitConnection(UINT8 conType,UINT8 bssType,UINT8 bssNum,IEEEtypes_MacAddr_t *bssId,
                 IEEEtypes_MacAddr_t *peerMacAddr,UINT8 channel,unkbyte0 *hostMdev)

{
  cm_ConnectionInfo_t *connPtr;
  Status_e SVar1;
  undefined3 extraout_var;
  IEEEtypes_Addr_t *__s;
  
  connPtr = (cm_ConnectionInfo_t *)pvPortMalloc(0xec);
  if (connPtr != (cm_ConnectionInfo_t *)0x0) {
    memset(connPtr,0,0xec);
    connPtr->conType = conType;
    SVar1 = cm_AllocResources(connPtr);
    if (CONCAT31(extraout_var,SVar1) == 1) {
      vPortFree(connPtr);
      connPtr = (cm_ConnectionInfo_t *)0x0;
    }
    else {
      if (peerMacAddr != (IEEEtypes_MacAddr_t *)0x0) {
        memcpy(connPtr->peerMacAddr,peerMacAddr,6);
      }
      __s = (connPtr->comData).BssId;
      memset(__s,0,6);
      memset(&connPtr->comData,0,0x20);
      (connPtr->comData).SsIdLen = '\0';
      if (bssId != (IEEEtypes_MacAddr_t *)0x0) {
        memcpy(__s,bssId,6);
        memcpy(connPtr->localMacAddr,bssId,6);
      }
    }
  }
  return connPtr;
}



void cm_DeleteConnection(cm_ConnectionInfo_t *connPtr)

{
  apSpecificData_t *paVar1;
  
  if (connPtr->conType == '\x02') {
    paVar1 = cm_GetApData(connPtr);
    if (paVar1->apInfoBuffDesc != (BufferDesc_t *)0x0) {
      vPortFree(paVar1->apInfoBuffDesc->Buffer);
      vPortFree(paVar1->apInfoBuffDesc);
      paVar1->apInfoBuffDesc = (BufferDesc_t *)0x0;
      paVar1->apInfo = (apInfo_t *)0x0;
    }
  }
  vPortFree(connPtr);
  return;
}



void cm_SetPeerAddr(cm_ConnectionInfo_t *connPtr,IEEEtypes_MacAddr_t *bssId,
                   IEEEtypes_MacAddr_t *peerMacAddr)

{
  if (bssId != (IEEEtypes_MacAddr_t *)0x0) {
    memcpy((connPtr->comData).BssId,bssId,6);
  }
  if (peerMacAddr != (IEEEtypes_MacAddr_t *)0x0) {
    memcpy(connPtr->peerMacAddr,peerMacAddr,6);
    return;
  }
  return;
}



void cm_SetComData(cm_ConnectionInfo_t *connPtr,char *ssid)

{
  byte bVar1;
  size_t sVar2;
  
  if (ssid != (char *)0x0) {
    sVar2 = strlen(ssid);
    (connPtr->comData).SsIdLen = (IEEEtypes_Len_t)sVar2;
    memcpy(&connPtr->comData,ssid,0x20);
    bVar1 = (connPtr->comData).SsIdLen;
    if (bVar1 < 0x20) {
      (connPtr->comData).SsId[bVar1] = '\0';
    }
    return;
  }
  return;
}


/*
Unable to decompile 'assert_rec'
Cause: Exception while decompiling 2301323e: Decompiler process died

*/


void assert_err(char *condition,char *file,int line)

{
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void assert_warn(char *condition,char *file,int line)

{
  return;
}



void coex_dump_pta(void)

{
  return;
}



void coex_dump_wifi(void)

{
  return;
}



void coex_wifi_rf_forece_enable(int enable)

{
  if (enable != 0) {
    enable = 1;
  }
  rfc_coex_force_to(enable,0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void coex_wifi_pti_forece_enable(int enable)

{
  if (enable == 0) {
    _DAT_44b00400 = _DAT_44b00400 & 0xffffffef;
  }
  else {
    _DAT_44b00400 = _DAT_44b00400 | 0xf0000010;
  }
  if ((int)(_DAT_44b00400 << 4) < 0) {
    _DAT_44b00400 = _DAT_44b00400 & 0xfbffffff;
  }
  else {
    _DAT_44b00400 = _DAT_44b00400 & 0xfbffffff | 0x4000000;
  }
  return;
}


/*
Unable to decompile 'coex_wifi_pta_forece_enable'
Cause: Exception while decompiling 230132f8: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void wifi_main(void)

{
  int iVar1;
  uint uVar2;
  
  rfc_init(40000000);
  _DAT_44b00400 = _DAT_44b00400 | 1;
  mpif_clk_init();
  sysctrl_init();
  intc_init();
  ipc_emb_init();
  bl_init();
  _DAT_44b00404 = 0x24f037;
  _DAT_44b00400 = 0x49;
  _DAT_44920004 = 0x5010001f;
  do {
    if (_DAT_44b00120 << 0xc < 0) {
      _DAT_44900084 = _DAT_44900084 | 1;
    }
    else {
      _DAT_44900084 = _DAT_44900084 & 0xfffffffe;
    }
    if (ke_env.evt_field == 0) {
      ipc_emb_wait();
    }
    if ((packets_num_12624 & 0xf) == 0) {
      uVar2 = _DAT_40007018 >> 0x18 & 7;
      if (uVar2 != 0) {
        if (uVar2 != 3) {
          _DAT_40000014 = _DAT_40000014 | 0x40000;
        }
        if ((uVar2 != 0) && (uVar2 != 3)) {
          _DAT_40002040 = _DAT_40002040 & 0xfffffffc;
          _DAT_40002044 = _DAT_40002044 & 0xfffffffe;
        }
      }
      if ((_DAT_40007018 >> 0x18 & 4) != 0) {
        _DAT_40000014 = _DAT_40000014 | 0x5c2000;
        _DAT_4000f90c = _DAT_4000f90c & 0xfffffffe | 4;
      }
    }
    packets_num_12624 = packets_num_12624 + 1;
    ke_evt_schedule();
    iVar1 = bl_sleep();
    coex_wifi_pta_forece_enable((uint)(iVar1 == 0));
  } while( true );
}



void ipc_emb_notify(void)

{
  BaseType_t BStack20;
  BaseType_t xHigherPriorityTaskWoken;
  
  if (xTaskToNotify == (TaskHandle_t)0x0) {
    assert_err("NULL != xTaskToNotify","module",0x93);
  }
  if (TrapNetCounter == 0) {
    xTaskGenericNotify(xTaskToNotify,0,eIncrement,(uint32_t *)0x0);
  }
  else {
    vTaskNotifyGiveFromISR(xTaskToNotify,&BStack20);
    if (BStack20 != 0) {
      vTaskSwitchContext();
    }
  }
  return;
}



void ipc_emb_wait(void)

{
  ulTaskNotifyTake(1,0xffffffff);
  ipc_emb_counter = ipc_emb_counter + 1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_init(void)

{
  xTaskToNotify = xTaskGetCurrentTaskHandle();
  memset(&ipc_emb_env,0,0x20);
  ipc_emb_env.txdesc = ipc_shared_env.txdesc0;
  if (_DAT_44800140 != 0x49504332) {
    assert_err("ipc_emb_signature_get() == IPC_EMB_SIGNATURE_RESET","module",0xbb);
  }
  _DAT_4480010c = 0x1f03;
  _DAT_44800114 = 0x3ff2a04;
  _DAT_44800118 = 0;
  return;
}



