pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_tx_irq(void)

{
  uint uVar1;
  
  uVar1 = _DAT_4480011c & 0x1f00;
  if (uVar1 != 0) {
    ke_evt_set(uVar1 >> 1);
    _DAT_44800108 = uVar1;
    _DAT_44800110 = uVar1;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_tx_evt(int queue_idx)

{
  txdesc_host *ptVar1;
  txdesc_host *ptVar2;
  hostdesc *phVar3;
  hostdesc *phVar4;
  uint event;
  hostdesc *__s;
  
  event = ipc_emb_evt_bit[queue_idx];
  ke_evt_clear(event);
  ptVar1 = ipc_emb_env.txdesc;
  while( true ) {
    ptVar2 = ptVar1 + (ipc_emb_env.txdesc_idx & 3);
    if (ptVar2->ready != 0xffffffff) {
      _DAT_4480010c = 0x100;
      return;
    }
    if (((event & 0x800) == 0) && ((ke_env.evt_field & 0x440800) != 0)) break;
    __s = (hostdesc *)ptVar2->pad_txdesc;
    _DAT_44800108 = 0x100;
    memset(__s,0,0x2cc);
    *(uint32_t **)(ptVar2->pad_txdesc + 0x1c) = ptVar2->pad_txdesc + 0x2e;
    *(uint32_t **)(ptVar2->pad_txdesc + 0x1b) = ptVar2->pad_txdesc + 0x1c;
    phVar3 = &ptVar2->host;
    do {
      phVar4 = (hostdesc *)&phVar3->packet_addr;
      phVar3[1].packet_addr = phVar3->pbuf_addr;
      phVar3 = phVar4;
    } while (__s != phVar4);
    ptVar2->pad_txdesc[0x19] = 0;
    *(undefined4 *)(*(int *)ptVar2->pad_txdesc[0x1b] + 0x10) = 0;
    ptVar2->pad_txdesc[0x27] = 0;
    ptVar2->pad_txdesc[0x28] = 0;
    ptVar2->pad_txdesc[0x29] = 0;
    ptVar2->pad_txdesc[0x15] = 0;
    txu_cntrl_push(__s,0);
    ptVar2->ready = 1;
    ipc_emb_env.txdesc_idx = ipc_emb_env.txdesc_idx + 1;
  }
  ke_evt_set(event);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_cfmback_irq(void)

{
  uint uVar1;
  
  uVar1 = _DAT_4480011c;
  if ((_DAT_4480011c & 0x20) != 0) {
    _DAT_44800110 = 0x20;
    _DAT_44800108 = 0x20;
    ke_evt_set(0x40000);
  }
  if ((uVar1 & 0x10) != 0) {
    _DAT_44800110 = 0x10;
    _DAT_44800108 = 0x10;
    ke_evt_set(0x80000);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_txcfm_ind(uint32_t queue_bits)

{
  _DAT_44800100 = queue_bits << 7;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_msg_irq(void)

{
  if ((_DAT_4480011c & 2) != 0) {
    ke_evt_set(0x2000000);
    _DAT_44800110 = 2;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_msg_evt(void)

{
  undefined4 *puVar1;
  uint8_t uVar2;
  undefined4 *puVar3;
  undefined4 *puVar4;
  int iVar5;
  
  do {
    if ((_DAT_44800104 & 2) == 0) {
      ke_evt_clear(0x2000000);
      _DAT_4480010c = 2;
      return;
    }
    _DAT_44800108 = 2;
    puVar1 = (undefined4 *)ke_malloc((uint)ipc_shared_env.msg_a2e_buf.msg[1]._2_2_ + 0xc);
    if (puVar1 == (undefined4 *)0x0) {
      assert_err("kmsg_dst != NULL","module",0x1d9);
    }
    *puVar1 = 0;
    *(undefined2 *)(puVar1 + 1) = (undefined2)ipc_shared_env.msg_a2e_buf.msg[0];
    *(undefined2 *)((int)puVar1 + 6) = ipc_shared_env.msg_a2e_buf.msg[0]._2_2_;
    *(undefined2 *)(puVar1 + 2) = 0xd;
    *(ushort *)((int)puVar1 + 10) = ipc_shared_env.msg_a2e_buf.msg[1]._2_2_;
    iVar5 = 0xc;
    while (iVar5 + -0xc < (int)(uint)*(ushort *)((int)puVar1 + 10)) {
      puVar3 = (undefined4 *)((int)&ipc_shared_env.msg_a2e_buf.dummy_word + iVar5);
      puVar4 = (undefined4 *)((int)puVar1 + iVar5);
      iVar5 = iVar5 + 4;
      *puVar4 = *puVar3;
    }
    uVar2 = ipc_emb_env.ipc_msgacke2a_cnt + '\x01';
    ipc_shared_env.msg_a2e_buf.msg[1]._0_2_ = (ushort)ipc_emb_env.ipc_msgacke2a_cnt;
    ipc_emb_env.ipc_msgacke2a_cnt = uVar2;
    if (*(ushort *)((int)puVar1 + 6) < 0xf) {
      if (0xc < *(ushort *)((int)puVar1 + 6)) goto LAB_2301395c;
    }
    else {
      assert_err("id <= TASK_MAX","module",0xb6);
LAB_2301395c:
      assert_err("ke_task_local(kmsg_dst->dest_id)","module",0x1ed);
    }
    _DAT_44800100 = 4;
    ke_msg_send(puVar1 + 3);
  } while( true );
}



void ipc_emb_msg_dma_int_handler(void)

{
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_emb_dbg_dma_int_handler(void)

{
  _DAT_44800100 = 1;
  _DAT_44a00020 = 0x80;
  return;
}



void ipc_emb_dump(void)

{
  return;
}



void rf_set_channel(uint8_t bandwidth,uint16_t channel_freq)

{
  undefined2 in_register_0000202e;
  
  rfc_config_channel(CONCAT22(in_register_0000202e,channel_freq));
  return;
}



void rf_dump_status(void)

{
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mdm_txcbwmax_setf(uint8_t txcbwmax)

{
  if ((txcbwmax & 0xfc) != 0) {
    assert_err("(((uint32_t)txcbwmax << 24) & ~((uint32_t)0x03000000)) == 0","module",0xb58);
  }
  _DAT_44c00824 = _DAT_44c00824 & 0xfcffffff | (uint)txcbwmax << 0x18;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void phy_config_rxgain(int offset)

{
  if ((int)rxgain_offset_vs_temperature != offset) {
    rxgain_offset_vs_temperature = (int8_t)offset;
    _DAT_44c0c080 =
         ((int)rxgain_offset_vs_temperature + 0x19) * 0x1000000 |
         ((int)rxgain_offset_vs_temperature + 0x12) * 0x10000 & 0xff0000U |
         ((int)rxgain_offset_vs_temperature + 0xb) * 0x100 & 0xffffU |
         (int)rxgain_offset_vs_temperature + 3U & 0xff;
    _DAT_44c0c084 =
         ((int)rxgain_offset_vs_temperature + 0x35) * 0x1000000 |
         ((int)rxgain_offset_vs_temperature + 0x2d) * 0x10000 & 0xff0000U |
         ((int)rxgain_offset_vs_temperature + 0x27) * 0x100 & 0xffffU |
         (int)rxgain_offset_vs_temperature + 0x20U & 0xff;
    _DAT_44c0c088 = (int)rxgain_offset_vs_temperature + 0x3bU & 0xff | _DAT_44c0c088 & 0xffffff00;
  }
  return;
}



