pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void agc_config(void)

{
  _ACG_RWNXAGCCNTL = _ACG_RWNXAGCCNTL & 0xfffefbff;
  _DAT_44c0b3a4 = _DAT_44c0b3a4 & 0xffff0000;
  _DAT_44c0b394 = _DAT_44c0b394 & 0xff00ffff | 0xf80000;
  _DAT_44c0b398 = _DAT_44c0b398 & 0xffff00ff | 0x9e00;
  _DAT_44c0b3c4 = _DAT_44c0b3c4 & 0xffffff00 | 0xce;
  _DAT_44c0b364 = _DAT_44c0b364 & 0xe0c0c0c0 | 0x83c3839;
  _DAT_44c0b368 = _DAT_44c0b368 & 0xffc00c00 | 0x70070;
  _DAT_44c0b36c = _DAT_44c0b36c & 0xf800f800 | 0x7280512;
  _DAT_44c0b370 = _DAT_44c0b370 & 0xff80ffff | 0x580000;
  _DAT_44c0b3c0 = _DAT_44c0b3c0 & 0xffffff | 0x18000000;
  _DAT_44c0b380 = _DAT_44c0b380 & 0x3ff | 0x77f8400;
  _DAT_44c0b384 = _DAT_44c0b384 & 0x3ff | 0xe7750800;
  _DAT_44c0b388 = _DAT_44c0b388 & 0x3ff | 0x3d7a9400;
  _DAT_44c0b38c = _DAT_44c0b38c & 0x23ff | 0x64038800;
  _DAT_44c0c830 = _DAT_44c0c830 & 0x23ff | 0xfc1d9400;
  _DAT_44c0c814 = _DAT_44c0c814 & 0xffffffc0 | 8;
  _DAT_44c0c040 = _DAT_44c0c040 & 0xfe007fff | 0xc18000;
  _DAT_44c0c044 = _DAT_44c0c044 & 0xffff0000 | 0x800;
  phy_config_rxgain(0);
  _DAT_44c0b3a0 = _DAT_44c0b3a0 & 0xffffff00 | 0x9e;
  _DAT_44c0b3c0 = _DAT_44c0b3c0 & 0xffff0000 | 0xa3a4;
  _DAT_44c0c82c = _DAT_44c0c82c & 0xff007700 | 0x2009b5;
  _DAT_44c0c838 = _DAT_44c0c838 & 0x7ff80000 | 0x80000100;
  _DAT_44c0c83c = _DAT_44c0c83c & 0x7ff00000 | 0x8000017c;
  _DAT_44c0c840 = _DAT_44c0c840 & 0x7fc00000 | 0x80000100;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mdm_reset(void)

{
  _DAT_44c00888 = 0;
  return;
}



void phy_powroffset_set(int8_t *power_offset)

{
  int8_t *piVar1;
  int8_t *piVar2;
  int iVar3;
  
  iVar3 = 0;
  do {
    piVar1 = power_offset + iVar3;
    piVar2 = poweroffset + iVar3;
    iVar3 = iVar3 + 1;
    *piVar2 = *piVar1;
  } while (iVar3 != 0xe);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void phy_hw_set_channel(uint8_t band,uint16_t freq,uint16_t freq1,uint8_t chantype)

{
  uint8_t channel;
  undefined3 in_register_00002029;
  int iVar1;
  undefined2 in_register_0000202e;
  int iVar2;
  undefined3 in_register_00002035;
  
  iVar2 = CONCAT22(in_register_0000202e,freq);
  iVar1 = CONCAT31(in_register_00002029,band);
  if (CONCAT31(in_register_00002035,chantype) != 0) {
    assert_err("chantype == PHY_CHNL_BW_20","module",0x144);
  }
  if (iVar1 != 0) {
    assert_err("band == PHY_BAND_2G4","module",0x145);
  }
  _ACG_RWNXAGCCNTL = _ACG_RWNXAGCCNTL & 0xfffffeff;
  __DATA_44c00820 = __DATA_44c00820 | 1;
  __DATA_44c00800 = 0;
  mdm_reset();
  _DAT_44c00838 = 0xb4;
  _DAT_44c0088c = 0x1c13;
  _DAT_44c00898 = 0x2d00438;
  _DAT_44c00858 = _DAT_44c00858 & 0xffffff00;
  _DAT_44c0081c = 0xf07;
  _DAT_44c00834 = _DAT_44c00834 & 0xffffff | 0x6000000;
  _DAT_44c00818 = 0x1880c06;
  _DAT_44c00860 = 0x7f03;
  _DAT_44c0b340 = 0;
  _DAT_44c0b344 = 0;
  _DAT_44c0b348 = 0;
  mdm_txcbwmax_setf(chantype);
  if (_DAT_44c0b000 << 10 < 0) {
    _DAT_44c0b118 = 1;
  }
  rf_set_channel(chantype,freq1);
  if (iVar1 == 0) {
    channel = '\0';
    if ((0x48 < (iVar2 - 0x96cU & 0xffff)) || (channel = '\x0e', iVar2 == 0x9b4)) goto LAB_230140e2;
    iVar1 = -0x967;
  }
  else {
    channel = '\0';
    if ((iVar1 != 1) || (channel = '\0', 0x334 < (iVar2 - 0x138dU & 0xffff))) goto LAB_230140e2;
    iVar1 = -5000;
  }
  channel = (uint8_t)((iVar2 + iVar1) / 5);
LAB_230140e2:
  rfc_apply_tx_power_offset(channel,poweroffset);
  trpc_update_vs_channel((int8_t)freq1);
  return;
}



void phy_get_channel(phy_channel_info *info,uint8_t index)

{
  info->info1 = (uint)phy_env[0].chnl_type << 8 | (uint)phy_env[0].chnl_prim20_freq << 0x10 |
                (uint)phy_env[0].band;
  info->info2 = phy_env[0]._6_4_;
  return;
}



void phy_set_channel(uint8_t band,uint8_t type,uint16_t prim20_freq,uint16_t center1_freq,
                    uint16_t center2_freq,uint8_t index)

{
  undefined3 in_register_00002029;
  
  if ((((ushort)(center1_freq - 0x96c) < 0x49) || (CONCAT31(in_register_00002029,band) != 0)) &&
     (CONCAT31(in_register_00002029,band) < 2)) {
    phy_hw_set_channel(band,prim20_freq,center1_freq,type);
    phy_env[0].chnl_prim20_freq = prim20_freq;
    phy_env[0].chnl_center1_freq = center1_freq;
    phy_env[0].band = band;
    phy_env[0].chnl_type = type;
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void phy_get_version(uint32_t *version_1,uint32_t *version_2)

{
  *version_1 = __DATA_44c00000;
  *version_2 = 0;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

_Bool phy_vht_supported(void)

{
  byte bVar1;
  
  bVar1 = 1;
  if (-1 < __DATA_44c00000 << 9) {
    bVar1 = (byte)((uint)__DATA_44c00000 >> 0x19) & 1;
  }
  return (_Bool)bVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void phy_init(phy_cfg_tag *config)

{
  uint uVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint32_t uVar3;
  uint32_t *puVar4;
  uint32_t *puVar5;
  uint32_t *puVar6;
  
  __DATA_44c00800 = 0;
  mdm_reset();
  __DATA_44c00820 = 0x20d;
  uVar1 = ((__DATA_44c00000 >> 8 & 0xf) - 1 & 0xff) << 4;
  if ((uVar1 & 0xffffff8f) != 0) {
    assert_err("(((uint32_t)rxnssmax << 4) & ~((uint32_t)0x00000070)) == 0","module",0xa09);
  }
  __DATA_44c00820 = uVar1 | __DATA_44c00820 & 0xffffff8f;
  uVar1 = ((__DATA_44c00000 >> 0xc & 0xf) - 1 & 0xff) << 0xc;
  if ((uVar1 & 0xf8000) != 0) {
    assert_err("(((uint32_t)rxndpnstsmax << 12) & ~((uint32_t)0x00007000)) == 0","module",0x987);
  }
  __DATA_44c00820 = __DATA_44c00000 >> 0x13 & 0x100 | uVar1 | __DATA_44c00820 & 0xffff8eff;
  _Var2 = phy_vht_supported();
  __DATA_44c00820 =
       (__DATA_44c00000 >> 0x1e & 1) << 0x14 |
       (__DATA_44c00000 >> 0x1e & 1) << 0x10 |
       (CONCAT31(extraout_var,_Var2) << 1 | __DATA_44c00820 & 0xfffffffd) & 0xffeeffff;
  _DAT_44c03024 = _DAT_44c03024 & 0xffc0ffff | 0x2d0000;
  _DAT_44c0089c = 0xffffffff;
  _DAT_44c00824 = 0x20d;
  uVar1 = ((__DATA_44c00000 >> 8 & 0xf) - 1 & 0xff) << 4;
  if ((uVar1 & 0xffffff8f) != 0) {
    assert_err("(((uint32_t)txnssmax << 4) & ~((uint32_t)0x00000070)) == 0","module",0xc0e);
  }
  _DAT_44c00824 = uVar1 | _DAT_44c00824 & 0xffffff8f;
  uVar1 = ((__DATA_44c00000 >> 4 & 0xf) - 1 & 0xff) << 0x14;
  if ((uVar1 & 0xf800000) != 0) {
    assert_err("(((uint32_t)ntxmax << 20) & ~((uint32_t)0x00700000)) == 0","module",0xb72);
  }
  _DAT_44c00824 = uVar1 | _DAT_44c00824 & 0xff8fffff;
  mdm_txcbwmax_setf((byte)(__DATA_44c00000 >> 0x18) & 3);
  _DAT_44c00824 = __DATA_44c00000 >> 0x12 & 0x100 | _DAT_44c00824 & 0xfffffeff;
  _Var2 = phy_vht_supported();
  _DAT_44c00824 =
       (__DATA_44c00000 >> 0x1f) << 0x10 |
       (CONCAT31(extraout_var_00,_Var2) << 1 | _DAT_44c00824 & 0xfffffffd) & 0xfffeffff;
  _DAT_44c00834 = _DAT_44c00834 | 1;
  _DAT_44c00818 = _DAT_44c00818 & 0xfffbffff;
  _DAT_44c00830 = _DAT_44c00830 & 0xffff0000 | 0x1b0f;
  _DAT_44c0083c = 0x4920492;
  _DAT_44c00874 = _DAT_44c00874 & 0xf7ffffff | 0x8000000;
  _DAT_44c0b500 = _DAT_44c0b500 & 0xffffcfff | 0x2000;
  if (_DAT_44c0b000 << 10 < 0) {
    _DAT_44c0b110 = _DAT_44c0b110 & 0xfffffff0;
    _DAT_44c0b118 = 0;
  }
  _DAT_44c0b004 = 1;
  _ACG_RWNXAGCCNTL = _ACG_RWNXAGCCNTL & 0xfffffffc | 1;
  _DAT_44c0b3bc = 4000000;
  _DAT_44c0b414 = _DAT_44c0b414 | 0x100;
  agc_config();
  _ACG_RWNXAGCCNTL = _ACG_RWNXAGCCNTL & 0xffffefff | 0x1000;
  _DAT_44c00874 = _DAT_44c00874 & 0xdfffffff | 0x20000000;
  puVar6 = agcmem;
  puVar4 = (uint32_t *)&DAT_54c0a000;
  do {
    uVar3 = *puVar6;
    puVar5 = puVar4 + 1;
    puVar6 = puVar6 + 1;
    *puVar4 = uVar3;
    puVar4 = puVar5;
  } while (puVar5 != (uint32_t *)0x54c0a800);
  _DAT_44c00874 = _DAT_44c00874 & 0xdfffffff;
  _ACG_RWNXAGCCNTL = _ACG_RWNXAGCCNTL & 0xffffefff;
  _DAT_44c0c020 = _DAT_44c0c020 & 0xfc00ffff | 0x140000;
  phy_env[0].cfg = config->parameters;
  phy_env[0]._4_4_ = 0xff00ff;
  phy_env[0]._8_4_ = 0x50000ff;
  trpc_init();
  pa_init();
  phy_tcal_reset();
  phy_tcal_start();
  return;
}



