pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t phy_get_nss(void)

{
  return (uint8_t)(((byte)((uint)__DATA_44c00000 >> 8) & 0xf) - 1);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t phy_get_ntx(void)

{
  return (uint8_t)(((byte)(__DATA_44c00000 >> 4) & 0xf) - 1);
}



void phy_stop(void)

{
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

_Bool phy_ldpc_tx_supported(void)

{
  return (_Bool)((byte)((uint)__DATA_44c00000 >> 0x1a) & 1);
}



uint8_t phy_get_mac_freq(void)

{
  return '(';
}



void phy_get_rf_gain_idx(int8_t *power,uint8_t *idx)

{
  uint32_t uVar1;
  
  uVar1 = rfc_get_power_level(2,(int)*power * 10);
  *idx = (uint8_t)uVar1;
  return;
}



void phy_get_rf_gain_capab(int8_t *max,int8_t *min)

{
  int8_t iVar1;
  
  iVar1 = trpc_get_rf_max_power();
  *max = iVar1;
  iVar1 = trpc_get_rf_min_power();
  *min = iVar1;
  return;
}



void mpif_clk_init(void)

{
  return;
}



void phy_mdm_isr(void)

{
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void phy_rc_isr(void)

{
  _DAT_44c0b420 = _DAT_44c0b41c;
  if ((_DAT_44c0b41c & 0x100) != 0) {
    mdm_reset();
    return;
  }
  _DAT_44c0b420 = _DAT_44c0b41c;
  return;
}



void pa_init(void)

{
  int iVar1;
  pa_state_t *ppVar2;
  pa_state_t *ppVar3;
  
  ppVar3 = pa_env;
  do {
    ppVar3->rss_state = '\0';
    ppVar3->rss_count = 0;
    ppVar3->last_update = 0;
    ppVar3->input_buffer_ptr = '\0';
    ppVar3->ce_state = '\0';
    ppVar3->ce = 0.00000000;
    ppVar3->ce_num_up_cmds = '\0';
    ppVar3->ce_num_dn_cmds = '\0';
    iVar1 = 8;
    ppVar2 = ppVar3;
    do {
      ppVar2->input_buffer[0].new = '\0';
      ppVar2->input_buffer[0].rssi = '\0';
      ppVar2->input_buffer[0].lna = '\0';
      ppVar2->input_buffer[0].ppm = 0.00000000;
      iVar1 = iVar1 + -1;
      ppVar2 = (pa_state_t *)&ppVar2->input_buffer[0].ppm;
    } while (iVar1 != 0);
    ppVar3 = ppVar3 + 1;
  } while (ppVar3 != (pa_state_t *)&tcal_env);
  return;
}



// WARNING: Control flow encountered bad instruction data

void pa_input(uint8_t id,rx_hd *rhd)

{
  undefined3 in_register_00002029;
  uint uVar1;
  int iVar2;
  
  uVar1 = CONCAT31(in_register_00002029,id);
  if (uVar1 < 4) {
    iVar2 = (int)pa_env[uVar1].input_buffer_ptr;
    pa_env[uVar1].last_update = rhd->tsflo;
    pa_env[uVar1].input_buffer[iVar2].new = '\x01';
    pa_env[uVar1].input_buffer[iVar2].rssi = *(int8_t *)((int)&rhd->recvec1c + 3);
    pa_env[uVar1].input_buffer[iVar2].lna = (char)((int)(rhd->recvec1d << 0x14) >> 0x1c);
    if (((rhd->recvec1b & 0x70000) == 0) && ((rhd->recvec1a >> 0xc & 0xf) < 4)) {
      __floatsidf((int)*(char *)((int)&rhd->recvec2a + 3));
      __muldf3();
    }
    else {
      __floatsidf(-(int)*(short *)((int)&rhd->recvec2a + 3));
      __muldf3();
      __divdf3();
    }
    __truncdfsf2();
                    // WARNING: Bad instruction - Truncating control flow here
    halt_baddata();
  }
  return;
}


/*
Unable to decompile 'pa_adapt'
Cause: Exception while decompiling 23014776: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t hal_get_capcode(void)

{
  return (uint8_t)((byte)(_DAT_4000f884 >> 0x16) & 0x3f);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_set_capcode(uint32_t capcode)

{
  _DAT_4000f884 = capcode << 0x10 | capcode << 0x16 | _DAT_4000f884 & 0xf000ffff;
  return;
}



_Bool hal_get_temperature(int16_t *temperature)

{
  *temperature = hal_env.temperature;
  return true;
}



void hal_set_temperature(int16_t temperature)

{
  hal_env.temperature = temperature;
  return;
}



void trpc_update_power(int8_t (*power_rate_table) [8])

{
  int iVar1;
  int iVar2;
  int iVar3;
  int8_t *piVar4;
  int8_t *piVar5;
  
  piVar4 = txpwr_vs_rate_table;
  iVar2 = 0;
  do {
    iVar3 = 0;
    do {
      iVar1 = iVar3 + iVar2;
      piVar5 = piVar4 + iVar3;
      iVar3 = iVar3 + 1;
      *piVar5 = (*power_rate_table)[iVar1];
    } while (iVar3 != 8);
    iVar2 = iVar2 + 8;
    piVar4 = piVar4 + 8;
  } while (iVar2 != 0x18);
  return;
}



void trpc_power_get(int8_t *power_rate_table)

{
  memcpy(power_rate_table,txpwr_vs_rate_table,0x18);
  return;
}



void trpc_update_power_11b(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int8_t *piVar2;
  int iVar3;
  
  iVar3 = 0;
  do {
    piVar1 = power_rate_table + iVar3;
    piVar2 = txpwr_vs_rate_table + iVar3;
    iVar3 = iVar3 + 1;
    *piVar2 = *piVar1;
  } while (iVar3 != 4);
  return;
}



void trpc_update_power_11g(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int iVar2;
  int8_t *piVar3;
  
  iVar2 = 0;
  piVar3 = txpwr_vs_rate_table;
  do {
    piVar1 = power_rate_table + iVar2;
    iVar2 = iVar2 + 1;
    piVar3[8] = *piVar1;
    piVar3 = piVar3 + 1;
  } while (iVar2 != 8);
  return;
}



void trpc_update_power_11n(int8_t *power_rate_table)

{
  int8_t *piVar1;
  int iVar2;
  int8_t *piVar3;
  
  iVar2 = 0;
  piVar3 = txpwr_vs_rate_table;
  do {
    piVar1 = power_rate_table + iVar2;
    iVar2 = iVar2 + 1;
    piVar3[0x10] = *piVar1;
    piVar3 = piVar3 + 1;
  } while (iVar2 != 8);
  return;
}



void trpc_init(void)

{
  int32_t iVar1;
  
  DAT_4201d148 = 0x98a;
  iVar1 = rf_pri_get_txgain_max();
  trpc_env = (undefined)iVar1;
  iVar1 = rf_pri_get_txgain_min();
  pwr_dbm_bottom = (int8_t)iVar1;
  DAT_4201d146 = 0x1e;
  DAT_4201d14a = 0x19;
  return;
}



int8_t trpc_get_rf_max_power(void)

{
  return trpc_env;
}



int8_t trpc_get_rf_min_power(void)

{
  return pwr_dbm_bottom;
}



uint8_t trpc_get_power_idx(uint8_t formatmod,uint8_t mcs,int8_t pwr_dbm)

{
  int8_t pwr_dbm_bottom;
  undefined3 in_register_00002029;
  uint uVar1;
  undefined3 in_register_0000202d;
  int iVar2;
  undefined3 in_register_00002031;
  char cVar3;
  uint uVar4;
  char cVar5;
  int iVar6;
  
  uVar1 = CONCAT31(in_register_00002029,formatmod);
  uVar4 = 2;
  if (uVar1 < 3) {
    uVar4 = (uint)formatmod;
  }
  iVar6 = 3;
  if (uVar1 != 0) {
    iVar6 = 7;
  }
  cVar5 = DAT_4201d146;
  if ((int)trpc_env < (int)DAT_4201d146) {
    cVar5 = trpc_env;
  }
  if (CONCAT31(in_register_00002031,pwr_dbm) < (int)cVar5) {
    cVar5 = pwr_dbm;
  }
  iVar2 = CONCAT31(in_register_0000202d,mcs);
  if (iVar6 < CONCAT31(in_register_0000202d,mcs)) {
    iVar2 = iVar6;
  }
  cVar3 = txpwr_vs_rate_table[iVar2 + uVar4 * 8];
  if (cVar5 < txpwr_vs_rate_table[iVar2 + uVar4 * 8]) {
    cVar3 = cVar5;
  }
  if (pwr_dbm_bottom < cVar3) {
    pwr_dbm_bottom = cVar3;
  }
  __floatsidf(((int)pwr_dbm_bottom * -0x1fe + (int)trpc_env) / 0x200);
  __adddf3();
  uVar4 = __fixdfsi();
  iVar6 = 3;
  if (uVar1 != 0) {
    iVar6 = 0;
  }
  uVar4 = iVar6 + (uVar4 & 0xff) & 0xff;
  if (0xf < uVar4) {
    uVar4 = 0xf;
  }
  return (uint8_t)(uVar4 << 2);
}



uint8_t trpc_get_default_power_idx(uint8_t formatmod,uint8_t mcs)

{
  uint8_t uVar1;
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  int iVar2;
  uint uVar3;
  int iVar4;
  
