pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar3 = (uint)formatmod;
  if (2 < CONCAT31(in_register_00002029,formatmod)) {
    uVar3 = 2;
  }
  iVar4 = 3;
  if (CONCAT31(in_register_00002029,formatmod) != 0) {
    iVar4 = 7;
  }
  iVar2 = CONCAT31(in_register_0000202d,mcs);
  if (iVar4 < CONCAT31(in_register_0000202d,mcs)) {
    iVar2 = iVar4;
  }
  uVar1 = trpc_get_power_idx((uint8_t)uVar3,(uint8_t)iVar2,txpwr_vs_rate_table[iVar2 + uVar3 * 8]);
  return uVar1;
}



void trpc_update_vs_channel(int8_t channel_MHz)

{
  undefined3 in_register_00002029;
  int32_t iVar1;
  
  DAT_4201d148 = (undefined2)CONCAT31(in_register_00002029,channel_MHz);
  iVar1 = rf_pri_get_txgain_max();
  trpc_env = (undefined)iVar1;
  iVar1 = rf_pri_get_txgain_min();
  pwr_dbm_bottom = (int8_t)iVar1;
  return;
}



void trpc_update_vs_temperature(int8_t temperature)

{
  int32_t iVar1;
  
  DAT_4201d14a._0_1_ = temperature;
  iVar1 = rf_pri_get_txgain_max();
  trpc_env = (undefined)iVar1;
  iVar1 = rf_pri_get_txgain_min();
  pwr_dbm_bottom = (int8_t)iVar1;
  return;
}



void phy_tcal_reset(void)

{
  memset(&tcal_env,0,0x38);
  tcal_env.prev_temperature = 0x19;
  tcal_env.last_action_temperature[0] = 0x19;
  tcal_env.last_action_temperature[1] = 0x19;
  tcal_env.last_action_temperature[2] = 0x19;
  tcal_env.last_action_temperature[3] = 0x19;
  tcal_env.enabled = true;
  return;
}



void phy_tcal_start(void)

{
  tcal_env.enabled = true;
  return;
}



void phy_tcal_txpwr(int16_t curr_temperature)

{
  undefined2 in_register_0000202a;
  
  rf_pri_tx_gain_comp(CONCAT22(in_register_0000202a,curr_temperature));
  trpc_update_vs_temperature((int8_t)curr_temperature);
  return;
}


/*
Unable to decompile 'phy_tcal_handle'
Cause: Exception while decompiling 23014d24: Decompiler process died

*/


void phy_tcal_callback(int16_t temperature)

{
  hal_set_temperature(temperature);
  if (tcal_env.enabled != false) {
    phy_tcal_handle();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_fsm_ctrl_en_setf(uint32_t x)

{
  _DAT_40001004 = x << 1 | _DAT_40001004 & 0xfffffffd;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_fsm_st_dbg_en_setf(uint32_t x)

{
  _DAT_4000126c = x << 3 | _DAT_4000126c & 0xfffffff7;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc3_setf(uint32_t x)

{
  _DAT_40001630 = (x & 0x7f) << 0x18 | _DAT_40001630 & 0x80ffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc2_setf(uint32_t x)

{
  _DAT_40001630 = (x & 0x7f) << 0x10 | _DAT_40001630 & 0xff80ffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc1_setf(uint32_t x)

{
  _DAT_40001630 = (x & 0x7f) << 8 | _DAT_40001630 & 0xffff80ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc0_setf(uint32_t x)

{
  _DAT_40001630 = x & 0x7f | _DAT_40001630 & 0xffffff80;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc7_setf(uint32_t x)

{
  _DAT_40001634 = (x & 0x7f) << 0x18 | _DAT_40001634 & 0x80ffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc6_setf(uint32_t x)

{
  _DAT_40001634 = (x & 0x7f) << 0x10 | _DAT_40001634 & 0xff80ffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc5_setf(uint32_t x)

{
  _DAT_40001634 = (x & 0x7f) << 8 | _DAT_40001634 & 0xffff80ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc4_setf(uint32_t x)

{
  _DAT_40001634 = x & 0x7f | _DAT_40001634 & 0xffffff80;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc11_setf(uint32_t x)

{
  _DAT_40001638 = (x & 0x7f) << 0x18 | _DAT_40001638 & 0x80ffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc10_setf(uint32_t x)

{
  _DAT_40001638 = (x & 0x7f) << 0x10 | _DAT_40001638 & 0xff80ffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc9_setf(uint32_t x)

{
  _DAT_40001638 = (x & 0x7f) << 8 | _DAT_40001638 & 0xffff80ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc8_setf(uint32_t x)

{
  _DAT_40001638 = x & 0x7f | _DAT_40001638 & 0xffffff80;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc15_setf(uint32_t x)

{
  _DAT_4000163c = (x & 0x7f) << 0x18 | _DAT_4000163c & 0x80ffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc14_setf(uint32_t x)

{
  _DAT_4000163c = (x & 0x7f) << 0x10 | _DAT_4000163c & 0xff80ffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc13_setf(uint32_t x)

{
  _DAT_4000163c = (x & 0x7f) << 8 | _DAT_4000163c & 0xffff80ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_tx_dvga_gain_qdb_gc12_setf(uint32_t x)

{
  _DAT_4000163c = x & 0x7f | _DAT_4000163c & 0xffffff80;
  return;
}



void wait_us(uint32_t us)

{
  bool bVar1;
  uint32_t n;
  int iStack4;
  
  iStack4 = us << 4;
  do {
    bVar1 = iStack4 != 0;
    iStack4 = iStack4 + -1;
  } while (bVar1);
  return;
}



