pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void _print_channel_info(void)

{
  int iVar1;
  
  iVar1 = 8;
  do {
    iVar1 = iVar1 + -1;
    wait_us(1000);
  } while (iVar1 != 0);
  iVar1 = 8;
  do {
    iVar1 = iVar1 + -1;
    wait_us(1000);
  } while (iVar1 != 0);
  return;
}



// WARNING: Control flow encountered bad instruction data

void rfc_init(uint32_t xtalfreq_hz)

{
  uint32_t rfg_index;
  uint32_t dg;
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rfc_rxdfe_set_notch0(uint8_t en,uint8_t alpha,int8_t nrmfc)

{
  _DAT_40001700 =
       ((uint)en & 1) << 6 | (uint)(byte)nrmfc << 8 | (uint)alpha & 7 | _DAT_40001700 & 0xffff00b8;
  return;
}



// WARNING: Variable defined which should be unmapped: ncf_freq_hz
// WARNING: Could not reconcile some variable overlaps
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rfc_config_channel(uint32_t channel_freq)

{
  SItype SVar1;
  uint8_t uStack21;
  uint8_t ncf_on;
  SItype SStack20;
  int32_t ncf_freq_hz;
  
  _DAT_40001228 = _DAT_40001228 | 8;
  _DAT_4000100c = _DAT_4000100c | 0x241;
  _DAT_40001264 = channel_freq & 0xfff | _DAT_40001264 & 0xfffff000;
  _DAT_40001268 = _DAT_40001268 & 0xfffdffff | 0x20000;
  wait_us(10);
  _DAT_40001268 = _DAT_40001268 & 0xfffdffff;
  wait_us(10);
  rf_fsm_ctrl_en_setf(0);
  wait_us(10);
  rf_fsm_ctrl_en_setf(1);
  wait_us(10);
  _DAT_4000126c = _DAT_4000126c & 0xfffffff8 | 1;
  wait_us(10);
  rf_fsm_st_dbg_en_setf(1);
  wait_us(10);
  _DAT_4000126c = _DAT_4000126c & 0xfffffff8 | 2;
  wait_us(100);
  rf_fsm_st_dbg_en_setf(0);
  wait_us(10);
  _print_channel_info();
  rf_pri_update_param(channel_freq);
  rf_pri_get_notch_param(channel_freq,&uStack21,(int32_t *)&stack0xffffffec);
  __floatsidf(SStack20);
  __divdf3();
  __muldf3();
  __adddf3();
  SVar1 = __fixdfsi();
  rfc_rxdfe_set_notch0(uStack21,'\x01',(int8_t)SVar1);
  _DAT_40001228 = _DAT_40001228 & 0xfffffff7;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rfc_coex_force_to(uint32_t force_enable,uint32_t bbmode)

{
  rf_fsm_ctrl_en_setf(0);
  wait_us(10);
  _DAT_40001220 =
       (uint)(force_enable != 0) << 0x1b | (bbmode & 1) << 0x1a | _DAT_40001220 & 0xf3ffffff;
  wait_us(10);
  rf_fsm_ctrl_en_setf(1);
  return;
}



uint32_t rfc_get_power_level(uint32_t formatmod,int32_t power)

{
  uint32_t mode;
  
  mode = 0;
  if ((formatmod != 0) && (mode = 1, formatmod != 1)) {
    mode = 2;
  }
  mode = rf_pri_get_txgain_index(power,mode);
  return mode << 2;
}



void rfc_apply_tx_dvga(int8_t *dvga_qdb)

{
  rf_tx_dvga_gain_qdb_gc0_setf((int)*dvga_qdb);
  rf_tx_dvga_gain_qdb_gc1_setf((int)dvga_qdb[1]);
  rf_tx_dvga_gain_qdb_gc2_setf((int)dvga_qdb[2]);
  rf_tx_dvga_gain_qdb_gc3_setf((int)dvga_qdb[3]);
  rf_tx_dvga_gain_qdb_gc4_setf((int)dvga_qdb[4]);
  rf_tx_dvga_gain_qdb_gc5_setf((int)dvga_qdb[5]);
  rf_tx_dvga_gain_qdb_gc6_setf((int)dvga_qdb[6]);
  rf_tx_dvga_gain_qdb_gc7_setf((int)dvga_qdb[7]);
  rf_tx_dvga_gain_qdb_gc8_setf((int)dvga_qdb[8]);
  rf_tx_dvga_gain_qdb_gc9_setf((int)dvga_qdb[9]);
  rf_tx_dvga_gain_qdb_gc10_setf((int)dvga_qdb[10]);
  rf_tx_dvga_gain_qdb_gc11_setf((int)dvga_qdb[0xb]);
  rf_tx_dvga_gain_qdb_gc12_setf((int)dvga_qdb[0xc]);
  rf_tx_dvga_gain_qdb_gc13_setf((int)dvga_qdb[0xd]);
  rf_tx_dvga_gain_qdb_gc14_setf((int)dvga_qdb[0xe]);
  rf_tx_dvga_gain_qdb_gc15_setf((int)dvga_qdb[0xf]);
  return;
}



// WARNING: Variable defined which should be unmapped: dg
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rfc_apply_tx_power_offset(uint8_t channel,int8_t *power_offset)

{
  uint32_t uStack56;
  uint32_t rfg_index;
  uint32_t dg;
  
  rf_pri_update_tx_power_offset(channel,power_offset);
  rf_pri_query_txgain_table(0,&uStack56,&rfg_index);
  _DAT_40001640 = uStack56 & 7 | _DAT_40001640 & 0xfffffff8;
  rf_tx_dvga_gain_qdb_gc0_setf(rfg_index);
  rf_pri_query_txgain_table(1,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 4 | _DAT_40001640 & 0xffffff8f;
  rf_tx_dvga_gain_qdb_gc1_setf(rfg_index);
  rf_pri_query_txgain_table(2,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 8 | _DAT_40001640 & 0xfffff8ff;
  rf_tx_dvga_gain_qdb_gc2_setf(rfg_index);
  rf_pri_query_txgain_table(3,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 0xc | _DAT_40001640 & 0xffff8fff;
  rf_tx_dvga_gain_qdb_gc3_setf(rfg_index);
  rf_pri_query_txgain_table(4,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 0x10 | _DAT_40001640 & 0xfff8ffff;
  rf_tx_dvga_gain_qdb_gc4_setf(rfg_index);
  rf_pri_query_txgain_table(5,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 0x14 | _DAT_40001640 & 0xff8fffff;
  rf_tx_dvga_gain_qdb_gc5_setf(rfg_index);
  rf_pri_query_txgain_table(6,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 0x18 | _DAT_40001640 & 0xf8ffffff;
  rf_tx_dvga_gain_qdb_gc6_setf(rfg_index);
  rf_pri_query_txgain_table(7,&uStack56,&rfg_index);
  _DAT_40001640 = (uStack56 & 7) << 0x1c | _DAT_40001640 & 0x8fffffff;
  rf_tx_dvga_gain_qdb_gc7_setf(rfg_index);
  rf_pri_query_txgain_table(8,&uStack56,&rfg_index);
  _DAT_40001644 = uStack56 & 7 | _DAT_40001644 & 0xfffffff8;
  rf_tx_dvga_gain_qdb_gc8_setf(rfg_index);
  rf_pri_query_txgain_table(9,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 4 | _DAT_40001644 & 0xffffff8f;
  rf_tx_dvga_gain_qdb_gc9_setf(rfg_index);
  rf_pri_query_txgain_table(10,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 8 | _DAT_40001644 & 0xfffff8ff;
  rf_tx_dvga_gain_qdb_gc10_setf(rfg_index);
  rf_pri_query_txgain_table(0xb,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 0xc | _DAT_40001644 & 0xffff8fff;
  rf_tx_dvga_gain_qdb_gc11_setf(rfg_index);
  rf_pri_query_txgain_table(0xc,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 0x10 | _DAT_40001644 & 0xfff8ffff;
  rf_tx_dvga_gain_qdb_gc12_setf(rfg_index);
  rf_pri_query_txgain_table(0xd,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 0x14 | _DAT_40001644 & 0xff8fffff;
  rf_tx_dvga_gain_qdb_gc13_setf(rfg_index);
  rf_pri_query_txgain_table(0xe,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 0x18 | _DAT_40001644 & 0xf8ffffff;
  rf_tx_dvga_gain_qdb_gc14_setf(rfg_index);
  rf_pri_query_txgain_table(0xf,&uStack56,&rfg_index);
  _DAT_40001644 = (uStack56 & 7) << 0x1c | _DAT_40001644 & 0x8fffffff;
  rf_tx_dvga_gain_qdb_gc15_setf(rfg_index);
  return;
}



