pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_set_gain_table_regs(void)

{
  _DAT_40001118 =
       ((tx_pwr_table[12][2] << 0x18 |
        (tx_pwr_table[12][3] << 0x10 |
        (tx_pwr_table[14][0] << 0xe |
        (tx_pwr_table[14][1] << 0xc |
        (tx_pwr_table[14][2] << 8 | (_DAT_40001118 & 0xffffffe0 | tx_pwr_table[14][3]) & 0xfffff8ff)
        & 0xffffcfff) & 0xffff3fff) & 0xffe0ffff) & 0xf8ffffff) & 0xcfffffff |
       tx_pwr_table[12][1] << 0x1c) & 0x3fffffff | tx_pwr_table[12][0] << 0x1e;
  _DAT_4000111c =
       (tx_pwr_table[8][1] << 0x1c |
       (tx_pwr_table[8][2] << 0x18 |
       (tx_pwr_table[8][3] << 0x10 |
       (tx_pwr_table[10][0] << 0xe |
       (tx_pwr_table[10][1] << 0xc |
       (tx_pwr_table[10][2] << 8 | (_DAT_4000111c & 0xffffffe0 | tx_pwr_table[10][3]) & 0xfffff8ff)
       & 0xffffcfff) & 0xffff3fff) & 0xffe0ffff) & 0xf8ffffff) & 0xcfffffff) & 0x3fffffff |
       tx_pwr_table[8][0] << 0x1e;
  _DAT_40001120 =
       tx_pwr_table[4][0] << 0x1e |
       (tx_pwr_table[4][1] << 0x1c |
       (tx_pwr_table[4][2] << 0x18 |
       (tx_pwr_table[4][3] << 0x10 |
       (tx_pwr_table[6][0] << 0xe |
       (tx_pwr_table[6][1] << 0xc |
       (tx_pwr_table[6][2] << 8 | (_DAT_40001120 & 0xffffffe0 | tx_pwr_table[6][3]) & 0xfffff8ff) &
       0xffffcfff) & 0xffff3fff) & 0xffe0ffff) & 0xf8ffffff) & 0xcfffffff) & 0x3fffffff;
  _DAT_40001124 =
       (tx_pwr_table[0][1] << 0x1c |
       ((tx_pwr_table[0][3] << 0x10 |
        (tx_pwr_table[2][0] << 0xe |
        ((tx_pwr_table[2][2] << 8 | (_DAT_40001124 & 0xffffffe0 | tx_pwr_table[2][3]) & 0xfffff8ff)
         & 0xffffcfff | tx_pwr_table[2][1] << 0xc) & 0xffff3fff) & 0xffe0ffff) & 0xf8ffffff |
       tx_pwr_table[0][2] << 0x18) & 0xcfffffff) & 0x3fffffff | tx_pwr_table[0][0] << 0x1e;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_manu_pu(uint32_t mode)

{
  int iVar1;
  uint uVar2;
  
  if (mode == 5) {
    _DAT_40001030 = _DAT_40001030 & 0xcefff8ff;
    iVar1 = -0x39009000;
  }
  else {
    if (5 < mode) {
      if (7 < mode) goto LAB_23015d76;
      _DAT_40001030 = _DAT_40001030 & 0x8f090ff;
      uVar2 = 0xf00000;
      goto LAB_23015daa;
    }
    if (mode != 4) {
LAB_23015d76:
      _DAT_40001004 = _DAT_40001004 & 0xfffffffd;
      _DAT_4000100c = 0;
      _DAT_40001030 = _DAT_40001030 & 0x2df0feff | 0x25f06e00;
      return;
    }
    _DAT_40001030 = _DAT_40001030 & 0x2cf8f8ff;
    iVar1 = 0x24f87000;
  }
  uVar2 = iVar1 - 0x800;
LAB_23015daa:
  _DAT_40001004 = _DAT_40001004 & 0xfffffffd;
  _DAT_4000100c = 0;
  _DAT_40001030 = _DAT_40001030 | uVar2;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_save_state_for_cal(void)

{
  state_adda1 = _DAT_4000108c;
  state_dfe_ctrl_0 = _DAT_40001600;
  state_dfe_ctrl_3 = _DAT_4000160c;
  state_dfe_ctrl_6 = _DAT_40001618;
  state_dfe_ctrl_7 = _DAT_4000161c;
  state_fbdv = _DAT_400010b8;
  state_pa1 = _DAT_40001064;
  state_pucr1 = _DAT_40001030;
  state_rbb3 = _DAT_40001084;
  state_rf_fsm_ctrl_hw = _DAT_40001004;
  state_rf_resv_reg_1 = _DAT_400010f0;
  state_rfcal_ctrlen = _DAT_4000101c;
  state_rfctrl_hw_en = _DAT_4000100c;
  state_rfif_dfe_ctrl0 = _DAT_40001220;
  state_sdm1 = _DAT_400010c0;
  state_sdm2 = _DAT_400010c4;
  state_singen_ctrl0 = _DAT_4000120c;
  state_singen_ctrl2 = _DAT_40001214;
  state_singen_ctrl3 = _DAT_40001218;
  state_sram_ctrl0 = _DAT_4000123c;
  state_sram_ctrl1 = _DAT_40001240;
  state_sram_ctrl2 = _DAT_40001244;
  state_tbb = _DAT_40001070;
  state_ten_ac = _DAT_40001058;
  state_trx_gain1 = _DAT_40001048;
  state_vco2 = _DAT_400010a4;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_restore_state_for_cal(void)

{
  _DAT_40001004 = state_rf_fsm_ctrl_hw;
  _DAT_4000100c = state_rfctrl_hw_en;
  _DAT_4000101c = state_rfcal_ctrlen;
  _DAT_40001030 = state_pucr1;
  _DAT_40001048 = state_trx_gain1;
  _DAT_40001058 = state_ten_ac;
  _DAT_40001064 = state_pa1;
  _DAT_40001070 = state_tbb;
  _DAT_40001084 = state_rbb3;
  _DAT_4000108c = state_adda1;
  _DAT_400010a4 = state_vco2;
  _DAT_400010b8 = state_fbdv;
  _DAT_400010c0 = state_sdm1;
  _DAT_400010c4 = state_sdm2;
  _DAT_400010f0 = state_rf_resv_reg_1;
  _DAT_4000120c = state_singen_ctrl0;
  _DAT_40001214 = state_singen_ctrl2;
  _DAT_40001218 = state_singen_ctrl3;
  _DAT_40001220 = state_rfif_dfe_ctrl0;
  _DAT_4000123c = state_sram_ctrl0;
  _DAT_40001240 = state_sram_ctrl1;
  _DAT_40001244 = state_sram_ctrl2;
  _DAT_40001600 = state_dfe_ctrl_0;
  _DAT_4000160c = state_dfe_ctrl_3;
  _DAT_40001618 = state_dfe_ctrl_6;
  _DAT_4000161c = state_dfe_ctrl_7;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_singen_start(void)

{
  _DAT_4000120c = _DAT_4000120c & 0x7fffffff | 0x80000000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t rf_pri_pm_pwr(void)

{
  int iVar1;
  int iVar2;
  
  do {
  } while (-1 < (int)((_DAT_40001618 & 0xdfefffff | 0x20100000) << 3));
  iVar1 = (_DAT_40001620 << 7) >> 0x10;
  iVar2 = (_DAT_40001624 << 7) >> 0x10;
  _DAT_40001618 = _DAT_40001618 & 0xdfefffff;
  return iVar1 * iVar1 + iVar2 * iVar2;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_start_txdfe(void)

{
  _DAT_40001220 = _DAT_40001220 & 0xffffe67f | 0x1182;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int32_t rf_pri_pm_pwr_avg(uint32_t iq,uint32_t acc_len)

{
  int iVar1;
  
  do {
  } while (-1 < (int)((_DAT_40001618 & 0xdfefffff) << 3));
  iVar1 = _DAT_40001624;
  if (iq != 0) {
    iVar1 = _DAT_40001620;
  }
  _DAT_40001618 = _DAT_40001618 & 0xdfefffff;
  _DAT_4000161c = acc_len << 0x10 | _DAT_4000161c & 0xffff;
  return (iVar1 << 7) >> 7;
}



