pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_txcal_config_hw(void)

{
  _DAT_40001180 =
       (*(uint *)(rf_calib_data->txcal + 1) >> 6 & 0x3f) << 0x18 |
       (*(uint *)rf_calib_data->txcal >> 6 & 0x3f) << 8 |
       *(uint *)rf_calib_data->txcal & 0x3f | _DAT_40001180 & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->txcal + 1) & 0x3f) << 0x10;
  _DAT_40001184 =
       (*(uint *)(rf_calib_data->txcal + 3) >> 6 & 0x3f) << 0x18 |
       (*(uint *)(rf_calib_data->txcal + 2) >> 6 & 0x3f) << 8 |
       *(uint *)(rf_calib_data->txcal + 2) & 0x3f | _DAT_40001184 & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->txcal + 3) & 0x3f) << 0x10;
  _DAT_40001188 =
       (*(uint *)(rf_calib_data->txcal + 5) >> 6 & 0x3f) << 0x18 |
       (*(uint *)(rf_calib_data->txcal + 4) >> 6 & 0x3f) << 8 |
       *(uint *)(rf_calib_data->txcal + 4) & 0x3f | _DAT_40001188 & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->txcal + 5) & 0x3f) << 0x10;
  _DAT_4000118c =
       (*(uint *)(rf_calib_data->txcal + 7) >> 6 & 0x3f) << 0x18 |
       (*(uint *)(rf_calib_data->txcal + 6) >> 6 & 0x3f) << 8 |
       *(uint *)(rf_calib_data->txcal + 6) & 0x3f | _DAT_4000118c & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->txcal + 7) & 0x3f) << 0x10;
  _DAT_40001190 =
       (*(uint *)rf_calib_data->txcal >> 0xc & 0x7ff) << 0x10 | _DAT_40001190 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[0].field_0x4 & 0x3ff;
  _DAT_40001194 =
       (*(uint *)(rf_calib_data->txcal + 1) >> 0xc & 0x7ff) << 0x10 | _DAT_40001194 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[1].field_0x4 & 0x3ff;
  _DAT_40001198 =
       (*(uint *)(rf_calib_data->txcal + 2) >> 0xc & 0x7ff) << 0x10 | _DAT_40001198 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[2].field_0x4 & 0x3ff;
  _DAT_4000119c =
       (*(uint *)(rf_calib_data->txcal + 3) >> 0xc & 0x7ff) << 0x10 | _DAT_4000119c & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[3].field_0x4 & 0x3ff;
  _DAT_400011a0 =
       (*(uint *)(rf_calib_data->txcal + 4) >> 0xc & 0x7ff) << 0x10 | _DAT_400011a0 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[4].field_0x4 & 0x3ff;
  _DAT_400011a4 =
       (*(uint *)(rf_calib_data->txcal + 5) >> 0xc & 0x7ff) << 0x10 | _DAT_400011a4 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[5].field_0x4 & 0x3ff;
  _DAT_400011a8 =
       (*(uint *)(rf_calib_data->txcal + 6) >> 0xc & 0x7ff) << 0x10 | _DAT_400011a8 & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[6].field_0x4 & 0x3ff;
  _DAT_400011ac =
       (*(uint *)(rf_calib_data->txcal + 7) >> 0xc & 0x7ff) << 0x10 | _DAT_400011ac & 0xf800fc00 |
       *(uint *)&rf_calib_data->txcal[7].field_0x4 & 0x3ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint16_t rf_pri_fcal_meas(uint32_t cw)

{
  _DAT_400010a0 = cw | _DAT_400010a0 & 0xffffff00;
  BL602_Delay_US(100);
  do {
  } while (-1 < (int)((_DAT_400010ac | 0x10) << 0xb));
  _DAT_400010ac = _DAT_400010ac & 0xffffffef;
  return (uint16_t)((uint)_DAT_400010a8 >> 0x10);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_rccal_config(uint32_t rbb_fc)

{
  _DAT_40001080 = rbb_fc << 8 | rbb_fc << 0x18 | _DAT_40001080 & 0xc0ffc0ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_rccal_config(uint32_t iq,uint32_t rbb_fc)

{
  if (iq != 0) {
    rf_pri_rccal_config(rbb_fc);
    return;
  }
  _DAT_40001080 = rbb_fc << 0x10 | _DAT_40001080 & 0xffc0ffc0 | rbb_fc;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_txcal_config(uint32_t param_ind,int32_t val)

{
  uint uVar1;
  
  if (param_ind == 2) {
    _DAT_40001600 = val << 0xc | _DAT_40001600 & 0xff800fff | 0x800000;
    return;
  }
  if (param_ind != 3) {
    if (param_ind == 0) {
      _DAT_40001070 = _DAT_40001070 & 0xc0ffffff;
      uVar1 = val << 0x18;
    }
    else {
      if (param_ind != 1) {
        return;
      }
      _DAT_40001070 = _DAT_40001070 & 0xffc0ffff;
      uVar1 = val << 0x10;
    }
    _DAT_40001070 = uVar1 | _DAT_40001070;
    return;
  }
  if (val < 0) {
    val = val + 0x400;
  }
  _DAT_40001600 = val | _DAT_40001600 & 0xfffffc00 | 0x400;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int32_t rf_pri_txcal_search_core
                  (uint32_t param_ind,uint32_t center,uint32_t delta,uint32_t meas_freq)

{
  uint32_t val;
  uint32_t val_00;
  uint32_t uVar1;
  uint uVar2;
  uint32_t uVar3;
  
  rf_pri_txcal_config(param_ind,center);
  BL602_Delay_US(10);
  _DAT_40001618 = meas_freq << 10 | _DAT_40001618 & 0xfff00000;
  uVar1 = rf_pri_pm_pwr();
  do {
    val = center - delta;
    val_00 = center + delta;
    if (param_ind < 2) {
      if ((int)val < 0) {
        val = 0;
      }
      if (0x3f < (int)val_00) {
        val_00 = 0x3f;
      }
    }
    else {
      if (param_ind == 2) {
        if ((int)val < 0) {
          val = 0;
        }
        if (0x7ff < (int)val_00) {
          val_00 = 0x7ff;
        }
      }
      else {
        if ((int)val < -0x200) {
          val = 0xfffffe00;
        }
        if (0x1ff < (int)val_00) {
          val_00 = 0x1ff;
        }
      }
    }
    rf_pri_txcal_config(param_ind,val);
    delta = (int)delta >> 1;
    BL602_Delay_US(10);
    uVar2 = rf_pri_pm_pwr();
    if (uVar1 <= uVar2) {
      rf_pri_txcal_config(param_ind,val_00);
      BL602_Delay_US(10);
      uVar3 = rf_pri_pm_pwr();
      val = center;
      uVar2 = uVar1;
      if (uVar3 < uVar1) {
        val = val_00;
        uVar2 = uVar3;
      }
    }
    center = val;
    uVar1 = uVar2;
  } while (delta != 0);
  return val;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_singen_config(uint32_t fcw)

{
  _DAT_4000120c = fcw << 0x10 | _DAT_4000120c & 0xfc00ffff;
  _DAT_40001214 = _DAT_40001214 & 0x3fffff;
  _DAT_40001218 = _DAT_40001218 & 0x3fffff | 0xc0000000;
  return;
}



