pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t rf_pri_rccal_iq(uint32_t iq)

{
  uint uVar1;
  uint32_t i;
  USItype UVar2;
  uint32_t uVar3;
  uint uVar4;
  int iVar5;
  undefined4 uVar6;
  
  if (iq == 0) {
    _DAT_4000160c = _DAT_4000160c & 0xfbffffff | 0x400;
  }
  else {
    _DAT_4000160c = _DAT_4000160c & 0xfffffbff | 0x4000000;
  }
  _DAT_40001048 = _DAT_40001048 & 0xffff8cff | 0x3100;
  rf_pri_singen_config(3);
  _DAT_40001214 = _DAT_40001214 & 0xfffff800 | 0x3ff;
  _DAT_40001218 = _DAT_40001218 & 0xfffff800 | 0x3ff;
  uVar6 = rf_pri_singen_start();
  rf_pri_start_txdfe(uVar6);
  _DAT_40001618 = _DAT_40001618 & 0xfff00000 | 0xc00;
  rf_pri_pm_pwr_avg(iq,0x400);
  i = rf_pri_pm_pwr();
  __floatunsidf(i);
  __muldf3();
  UVar2 = __fixunsdfsi();
  _DAT_40001048 = _DAT_40001048 & 0xffff8cff | 0x6200;
  rf_pri_singen_config(0xb5);
  uVar6 = rf_pri_singen_start();
  rf_pri_start_txdfe(uVar6);
  _DAT_40001618 = _DAT_40001618 & 0xfff00000 | 0x2d400;
  i = 0;
  uVar1 = 6;
  uVar4 = 0x20;
  do {
    rf_pri_rccal_config(iq,uVar4 + i);
    uVar3 = rf_pri_pm_pwr();
    if (UVar2 < uVar3) {
      i = uVar4 + i;
    }
    uVar1 = uVar1 - 1;
    uVar4 = uVar4 >> 1;
  } while (uVar1 != 0);
  iVar5 = 0x3f;
  do {
    rf_pri_rccal_config(iq,i);
    uVar3 = rf_pri_pm_pwr();
    if (UVar2 < uVar3) {
      uVar1 = uVar1 * 2 + 1 & 0xf;
      i = i + 1;
      if (uVar1 == 5) {
        return 3;
      }
    }
    else {
      uVar1 = uVar1 * 2 & 0xf;
      i = i - 1;
      if (uVar1 == 10) {
        return 3;
      }
    }
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  return 2;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_config_channel(void)

{
  _DAT_400010a0 =
       ((uint)((ushort)rf_calib_data->lo[9] >> 8) & 0x1f) << 0x10 |
       (uint)(ushort)rf_calib_data->lo[9] & 0xff | _DAT_400010a0 & 0xffe0ff00;
  _DAT_400010bc =
       (((uint)(ushort)rf_calib_data->lo[9] & 0xff) >> 4) << 0x14 | _DAT_400010bc & 0xff0fffff;
  _DAT_400010c4 = _DAT_400010c4 & 0xc0000000 | channel_div_table[9];
  _DAT_400010c0 = _DAT_400010c0 & 0xffffefff;
  while( true ) {
    _DAT_400010b8 = _DAT_400010b8 | 0x10000;
    BL602_Delay_US(10);
    _DAT_400010b8 = _DAT_400010b8 & 0xfffeffff;
    BL602_Delay_US(0x32);
    _DAT_400010b0 = _DAT_400010b0 | 0x10000000;
    BL602_Delay_US(10);
    _DAT_400010b0 = _DAT_400010b0 & 0xefffffff;
    BL602_Delay_US(0x32);
    if ((_DAT_400010b4 & 0x1100000) == 0) break;
    printf(".");
  }
  printf("LO locked %ld %ld\r\n",(uint)(ushort)rf_calib_data->lo[9] & 0xff);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t rf_pri_roscal_iq(uint32_t iq)

{
  uint uVar1;
  int32_t iVar2;
  uint uVar3;
  uint uVar4;
  int iVar5;
  uint uVar6;
  
  uVar1 = 6;
  uVar3 = 0;
  uVar4 = 0x20;
  do {
    uVar6 = uVar4 + uVar3;
    if (iq == 0) {
      _DAT_4000107c = uVar6 | _DAT_4000107c & 0xffffffc0;
    }
    else {
      _DAT_4000107c = uVar6 * 0x100 | _DAT_4000107c & 0xffffc0ff;
    }
    iVar2 = rf_pri_pm_pwr_avg(iq,0x400);
    if (iVar2 < 1) {
      uVar3 = uVar6;
    }
    uVar1 = uVar1 - 1;
    uVar4 = uVar4 >> 1;
  } while (uVar1 != 0);
  iVar5 = 0x3f;
  do {
    if (iq == 0) {
      _DAT_4000107c = _DAT_4000107c & 0xffffffc0 | uVar3;
    }
    else {
      _DAT_4000107c = uVar3 << 8 | _DAT_4000107c & 0xffffc0ff;
    }
    iVar2 = rf_pri_pm_pwr_avg(iq,0x400);
    if (iVar2 < 1) {
      uVar1 = uVar1 * 2 & 0xf;
      uVar3 = uVar3 + 1;
      if (uVar1 == 10) {
        return uVar3;
      }
    }
    else {
      uVar1 = uVar1 * 2 + 1 & 0xf;
      uVar3 = uVar3 - 1;
      if (uVar1 == 5) {
        return uVar3;
      }
    }
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  return uVar3;
}



void rf_pri_chipv(uint8_t chipv)

{
  regs_to_opti *prVar1;
  undefined3 in_register_00002029;
  undefined4 *puVar2;
  undefined4 *puVar3;
  int iVar4;
  uint32_t *puVar5;
  void_fn **ppvVar6;
  int iVar7;
  uint32_t *puVar8;
  uint32_t *puVar9;
  int iVar10;
  void_fn **ppvVar11;
  void_fn **ppvVar12;
  
  if (CONCAT31(in_register_00002029,chipv) == 0) {
    tmxcss._0_4_ = 0x60003;
    tmxcss[2] = 6;
    iVar4 = 0x1c;
    do {
      iVar7 = iVar4 + -0x1c;
      do {
        *(undefined4 *)((int)tx_pwr_table + iVar7) = *(undefined4 *)((int)tx_pwr_table_a0 + iVar7);
        *(undefined4 *)((int)tx_pwr_table_origin + iVar7) =
             *(undefined4 *)((int)tx_pwr_table_a0 + iVar7);
        iVar7 = iVar7 + 4;
      } while (iVar4 != iVar7);
      iVar4 = iVar4 + 0x1c;
    } while (iVar4 != 0x1dc);
    iVar4 = 0;
    do {
      puVar2 = (undefined4 *)((int)tx_pwr_ch_os_a0 + iVar4);
      puVar3 = (undefined4 *)((int)tx_pwr_ch_os + iVar4);
      iVar4 = iVar4 + 4;
      *puVar3 = *puVar2;
    } while (iVar4 != 0x38);
    puVar5 = txcal_para;
    puVar8 = txcal_para_a0;
    do {
      puVar9 = puVar8 + 4;
      *puVar5 = *puVar8;
      puVar5[1] = puVar8[1];
      puVar5[2] = puVar8[2];
      puVar5[3] = puVar8[3];
      puVar5 = puVar5 + 4;
      puVar8 = puVar9;
    } while (puVar9 != txcal_para_a1);
    opti_regs->vbcore = 10;
    prVar1 = opti_regs;
    opti_regs->iet = 3;
    prVar1->vbcore_11n = 10;
    prVar1->iet_11n = 3;
    prVar1->vbcore_11g = 10;
    prVar1->iet_11g = 3;
    prVar1->vbcore_11b = 10;
    prVar1->iet_11b = 3;
    prVar1->lo_fbdv_halfstep_en = 0;
    prVar1->lo_fbdv_halfstep_en_tx = 0;
    prVar1->lo_fbdv_halfstep_en_tx = 0;
    prVar1->clkpll_reset_postdiv = 0;
    prVar1->clkpll_dither_sel = 0;
    return;
  }
  if (CONCAT31(in_register_00002029,chipv) == 1) {
    tmxcss._0_4_ = 0x50005;
    tmxcss[2] = 5;
    iVar4 = 0x1c;
    do {
      iVar7 = iVar4 + -0x1c;
      do {
        iVar10 = iVar7;
        *(undefined4 *)((int)tx_pwr_table + iVar10) = *(undefined4 *)((int)tx_pwr_table_a1 + iVar10)
        ;
        *(undefined4 *)((int)tx_pwr_table_origin + iVar10) =
             *(undefined4 *)((int)tx_pwr_table_a1 + iVar10);
        iVar7 = iVar10 + 4;
      } while (iVar10 + 4 != iVar4);
      iVar4 = iVar10 + 0x20;
    } while (iVar4 != 0x1dc);
    iVar4 = 0;
    do {
      puVar2 = (undefined4 *)((int)tx_pwr_ch_os_a1 + iVar4);
      puVar3 = (undefined4 *)((int)tx_pwr_ch_os + iVar4);
      iVar4 = iVar4 + 4;
      *puVar3 = *puVar2;
    } while (iVar4 != 0x38);
    ppvVar6 = (void_fn **)txcal_para;
    ppvVar11 = (void_fn **)txcal_para_a1;
    do {
      ppvVar12 = ppvVar11 + 4;
      *ppvVar6 = *ppvVar11;
      ppvVar6[1] = ppvVar11[1];
      ppvVar6[2] = ppvVar11[2];
      ppvVar6[3] = ppvVar11[3];
      ppvVar6 = ppvVar6 + 4;
      ppvVar11 = ppvVar12;
    } while (ppvVar12 != intc_irq_handlers);
    opti_regs->vbcore = 0xc;
    prVar1 = opti_regs;
    opti_regs->iet = 5;
    prVar1->vbcore_11n = 0xc;
    prVar1->iet_11n = 5;
    prVar1->vbcore_11g = 0xc;
    prVar1->iet_11g = 5;
    prVar1->vbcore_11b = 0xc;
    prVar1->iet_11b = 5;
    prVar1->lo_fbdv_halfstep_en = 1;
    prVar1->lo_fbdv_halfstep_en_tx = 1;
    prVar1->lo_fbdv_halfstep_en_tx = 1;
    prVar1->clkpll_reset_postdiv = 1;
    prVar1->clkpll_dither_sel = 2;
  }
  return;
}



void rf_pri_update_tx_power_offset(uint8_t channel,int8_t *power_offset)

{
  char cVar1;
  undefined3 in_register_00002029;
  int32_t *piVar2;
  int32_t *piVar3;
  
  cVar1 = power_offset[CONCAT31(in_register_00002029,channel)];
  memcpy(tx_pwr_table,tx_pwr_table_origin,0x1c0);
  piVar2 = tx_pwr_table;
  do {
    piVar3 = piVar2 + 7;
    piVar2[5] = piVar2[5] + (int)cVar1 % 4;
    piVar2[6] = piVar2[6] + ((int)cVar1 / 4) * -10;
    piVar2 = piVar3;
  } while (piVar3 != tx_pwr_table_origin);
  rf_pri_set_gain_table_regs();
  return;
}



void rf_pri_get_notch_param(uint32_t chanfreq_MHz,uint8_t *ncf_on,int32_t *ncf_freq_Hz)

{
  uint uVar1;
  int32_t iVar2;
  
  uVar1 = 0xd;
  if (chanfreq_MHz < 0x9a9) {
    uVar1 = (chanfreq_MHz - 0x96c) / 5;
  }
  iVar2 = rx_notch_para_40M[uVar1 * 2 + 1];
  *ncf_on = (uint8_t)rx_notch_para_40M[uVar1 * 2];
  *ncf_freq_Hz = iVar2;
  return;
}



