pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_update_param(uint32_t chanfreq_MHz)

{
  ushort uVar1;
  int iVar2;
  int32_t *piVar3;
  int iVar4;
  int iVar5;
  int iVar6;
  int32_t iVar7;
  int iVar8;
  uint32_t uVar9;
  int32_t *piVar10;
  
  index_os_pre = 0;
  index_os_pre_mdb = 0;
  dvga_os_pre = 0;
  up_dn = 0;
  if ((chanfreq_MHz < 0x96c) || (chanfreq_MHz < 0x971)) {
    iVar5 = 0;
  }
  else {
    if (chanfreq_MHz < 0x97b) {
      iVar5 = 1;
    }
    else {
      if (chanfreq_MHz < 0x98a) {
        iVar5 = 2;
      }
      else {
        if (chanfreq_MHz < 0x999) {
          iVar5 = 3;
        }
        else {
          iVar4 = 8;
          iVar5 = 7;
          if (0x9a7 < chanfreq_MHz) goto LAB_23016d38;
          iVar5 = 4;
        }
      }
    }
  }
  uVar9 = Tchannels[iVar5];
  iVar8 = 0;
  if (uVar9 != chanfreq_MHz) {
    iVar8 = chanfreq_MHz - uVar9;
  }
  iVar6 = iVar5 + 1;
  iVar4 = (uint)((Tchannel_os[iVar6] - Tchannel_os[iVar5]) * iVar8) / (Tchannels[iVar6] - uVar9) +
          Tchannel_os[iVar5];
  iVar5 = (uint)((Tchannel_os_low[iVar6] - Tchannel_os_low[iVar5]) * iVar8) /
          (Tchannels[iVar6] - uVar9) + Tchannel_os_low[iVar5];
LAB_23016d38:
  piVar3 = temps;
  piVar10 = temps;
  iVar8 = 0;
  iVar6 = 10;
  do {
    iVar2 = (piVar10[4] + iVar8) - (0x14 - iVar5);
    iVar8 = 0;
    if (iVar6 < iVar2) {
      iVar8 = iVar2 - iVar6;
      iVar2 = iVar6;
    }
    piVar10[3] = iVar2;
    iVar6 = iVar6 + -5;
    piVar10 = piVar10 + -1;
  } while (iVar6 != -10);
  iVar8 = 0x38;
  iVar5 = 0;
  do {
    iVar7 = (piVar3[5] - iVar5) + (0x14 - iVar4);
    if (0x5f < iVar7) {
      iVar7 = iVar7 + (5 - iVar4 / 4);
    }
    piVar3[6] = iVar7;
    iVar6 = piVar3[6];
    iVar5 = 0;
    if (iVar6 < iVar8) {
      iVar5 = iVar8 - iVar6;
      iVar6 = iVar8;
    }
    piVar3[6] = iVar6;
    iVar8 = iVar8 + 5;
    piVar3 = piVar3 + 1;
  } while (iVar8 != 0x5b);
  uVar1 = tmxcss[2];
  if (chanfreq_MHz < 0x986) {
    uVar1 = tmxcss[1];
  }
  _DAT_4000106c = (uint)uVar1 | _DAT_4000106c & 0xfffffff8;
  tx_pwr_os = tx_pwr_ch_os[6];
  if (chanfreq_MHz != 0x98a) {
    if (chanfreq_MHz < 0x98b) {
      tx_pwr_os = tx_pwr_ch_os[2];
      if (chanfreq_MHz != 0x976) {
        if (chanfreq_MHz < 0x977) {
          tx_pwr_os = tx_pwr_ch_os[0];
          if ((chanfreq_MHz != 0x96c) && (tx_pwr_os = tx_pwr_ch_os[1], chanfreq_MHz != 0x971)) {
            temps[4] = 0xf;
            temps[5] = 0x33;
            tx_pwr_os = 0;
            return;
          }
        }
        else {
          tx_pwr_os = tx_pwr_ch_os[4];
          if (((chanfreq_MHz != 0x980) && (tx_pwr_os = tx_pwr_ch_os[5], chanfreq_MHz != 0x985)) &&
             (tx_pwr_os = tx_pwr_ch_os[3], chanfreq_MHz != 0x97b)) {
            temps[4] = 0xf;
            temps[5] = 0x33;
            tx_pwr_os = 0;
            return;
          }
        }
      }
    }
    else {
      tx_pwr_os = tx_pwr_ch_os[10];
      if (chanfreq_MHz != 0x99e) {
        if (chanfreq_MHz < 0x99f) {
          tx_pwr_os = tx_pwr_ch_os[8];
          if (((chanfreq_MHz != 0x994) && (tx_pwr_os = tx_pwr_ch_os[9], chanfreq_MHz != 0x999)) &&
             (tx_pwr_os = tx_pwr_ch_os[7], chanfreq_MHz != 0x98f)) {
            temps[4] = 0xf;
            temps[5] = 0x33;
            tx_pwr_os = 0;
            return;
          }
        }
        else {
          tx_pwr_os = tx_pwr_ch_os[12];
          if (((chanfreq_MHz != 0x9a8) && (tx_pwr_os = tx_pwr_ch_os[13], chanfreq_MHz != 0x9b4)) &&
             (tx_pwr_os = tx_pwr_ch_os[11], chanfreq_MHz != 0x9a3)) {
            temps[4] = 0xf;
            temps[5] = 0x33;
            tx_pwr_os = 0;
            return;
          }
        }
      }
    }
  }
  temps[4] = 0xf;
  temps[5] = 0x33;
  return;
}



void rf_pri_xtalfreq(uint32_t xtalfreq)

{
  if (xtalfreq == 0) {
    channel_div_table[0] = 0x21638e39;
    channel_div_table[1] = 0x2171c71c;
    channel_div_table[2] = 0x21800000;
    channel_div_table[3] = 0x218e38e4;
    channel_div_table[4] = 0x219c71c7;
    channel_div_table[5] = 0x21aaaaab;
    channel_div_table[6] = 0x21b8e38e;
    channel_div_table[7] = 0x21c71c72;
    channel_div_table[8] = 0x21d55555;
    channel_div_table[9] = 0x21e38e39;
    channel_div_table[10] = 0x21f1c71c;
    channel_div_table[11] = 0x22000000;
    channel_div_table[12] = 0x220e38e4;
    channel_div_table[13] = 0x221c71c7;
    channel_div_table[14] = 0x222aaaab;
    channel_div_table[15] = 0x2238e38e;
    channel_div_table[16] = 0x22471c72;
    channel_div_table[17] = 0x22555555;
    channel_div_table[18] = 0x22638e39;
    channel_div_table[19] = 0x2271c71c;
    channel_div_table[20] = 0x22800000;
    fcal_div = 0x500;
    rx_notch_para_40M[4][0] = 1;
    rx_notch_para_40M[6][0] = 1;
    rx_notch_para_40M[7][0] = 1;
    rx_notch_para_40M[12][0] = 1;
    rx_notch_para_40M[1][1] = 7000000;
    rx_notch_para_40M[2][1] = (int32_t)&DAT_001e8480;
    rx_notch_para_40M[3][1] = -3000000;
    rx_notch_para_40M[4][1] = -8000000;
    rx_notch_para_40M[6][1] = 6000000;
    rx_notch_para_40M[7][1] = 1000000;
    rx_notch_para_40M[8][1] = -4000000;
    rx_notch_para_40M[9][1] = -9000000;
    rx_notch_para_40M[0][0] = 0;
    rx_notch_para_40M[10][0] = 0;
    rx_notch_para_40M[0][1] = 0;
    rx_notch_para_40M[10][1] = 0;
    rx_notch_para_40M[11][1] = 5000000;
LAB_2301713a:
    channel_cnt_range[2] = 0xace7;
    channel_cnt_range._0_4_ = 0xa6e7a6a7;
    rx_notch_para_40M[11][0] = 1;
    rx_notch_para_40M[9][0] = 1;
    rx_notch_para_40M[5][1] = 0;
    rx_notch_para_40M[5][0] = 0;
    rx_notch_para_40M[3][0] = 1;
    rx_notch_para_40M[2][0] = 1;
    rx_notch_para_40M[1][0] = 1;
    channel_cnt_table[20] = 0xac80;
    channel_cnt_table._36_4_ = 0xac39abf2;
    channel_cnt_table._32_4_ = 0xababab64;
    channel_cnt_table._28_4_ = 0xab1caad5;
    channel_cnt_table._24_4_ = 0xaa8eaa47;
    channel_cnt_table._20_4_ = 0xaa00a9b9;
    channel_cnt_table._16_4_ = 0xa972a92b;
    channel_cnt_table._12_4_ = 0xa8e4a89c;
    channel_cnt_table._8_4_ = 0xa855a80e;
    channel_cnt_table._4_4_ = 0xa7c7a780;
    channel_cnt_table._0_4_ = 0xa739a6f2;
LAB_2301713c:
    rx_notch_para_40M[8][0] = 1;
    rx_notch_para_40M[12][1] = 0;
  }
  else {
    if (xtalfreq == 1) {
      channel_div_table[0] = 0x1ed20d21;
      channel_div_table[1] = 0x1edf2df3;
      channel_div_table[2] = 0x1eec4ec5;
      channel_div_table[3] = 0x1ef96f97;
      channel_div_table[4] = 0x1f069069;
      channel_div_table[5] = 0x1f13b13b;
      channel_div_table[6] = 0x1f20d20d;
      channel_div_table[7] = 0x1f2df2df;
      channel_div_table[8] = 0x1f3b13b1;
      channel_div_table[9] = 0x1f483483;
      channel_div_table[10] = 0x1f555555;
      channel_div_table[11] = 0x1f627627;
      channel_div_table[12] = 0x1f6f96f9;
      channel_div_table[13] = 0x1f7cb7cb;
      channel_div_table[14] = 0x1f89d89e;
      channel_div_table[15] = 0x1f96f970;
      channel_div_table[16] = 0x1fa41a42;
      channel_div_table[17] = 0x1fb13b14;
      channel_div_table[18] = 0x1fbe5be6;
      channel_div_table[19] = 0x1fcb7cb8;
      channel_div_table[20] = 0x1fd89d8a;
      channel_cnt_table._0_4_ = 0xa743a6fc;
      channel_cnt_table._4_4_ = 0xa7d1a78a;
      channel_cnt_table._8_4_ = 0xa860a819;
      channel_cnt_table._12_4_ = 0xa8eea8a7;
      channel_cnt_table._16_4_ = 0xa97ca935;
      channel_cnt_table._20_4_ = 0xaa0aa9c3;
      channel_cnt_table._24_4_ = 0xaa99aa52;
      channel_cnt_table._28_4_ = 0xab27aae0;
      channel_cnt_table._32_4_ = 0xabb5ab6e;
      channel_cnt_table._36_4_ = 0xac43abfc;
      channel_cnt_table[20] = 0xac8b;
      channel_cnt_range._0_4_ = 0xa6f1a6b1;
      channel_cnt_range[2] = 0xacf2;
      fcal_div = 0x56b;
      rx_notch_para_40M[0][1] = 6000000;
      rx_notch_para_40M[1][1] = 1000000;
      rx_notch_para_40M[2][1] = -4000000;
      rx_notch_para_40M[3][1] = -9000000;
      rx_notch_para_40M[5][1] = 7000000;
      rx_notch_para_40M[6][1] = (int32_t)&DAT_001e8480;
      rx_notch_para_40M[7][1] = -3000000;
      rx_notch_para_40M[8][1] = -8000000;
      rx_notch_para_40M[10][1] = 8000000;
      rx_notch_para_40M[11][1] = 3000000;
      rx_notch_para_40M[4][0] = 0;
      rx_notch_para_40M[9][0] = 0;
      rx_notch_para_40M[9][1] = 0;
      rx_notch_para_40M[12][1] = -2000000;
      rx_notch_para_40M[8][0] = xtalfreq;
      rx_notch_para_40M[12][0] = xtalfreq;
    }
    else {
      if (xtalfreq != 2) {
        if (xtalfreq == 3) {
          channel_div_table[0] = 0x14de38e4;
          channel_div_table[1] = 0x14e71c72;
          channel_div_table[2] = 0x14f00000;
          channel_div_table[3] = 0x14f8e38e;
          channel_div_table[4] = 0x1501c71c;
          channel_div_table[5] = 0x150aaaab;
          channel_div_table[6] = 0x15138e39;
          channel_div_table[7] = 0x151c71c7;
          channel_div_table[8] = 0x15255555;
          channel_div_table[9] = 0x152e38e4;
          channel_div_table[10] = 0x15371c72;
          channel_div_table[11] = 0x15400000;
          channel_div_table[12] = 0x1548e38e;
          channel_div_table[13] = 0x1551c71c;
          channel_div_table[14] = 0x155aaaab;
          channel_div_table[15] = 0x15638e39;
          channel_div_table[16] = 0x156c71c7;
          channel_div_table[17] = 0x15755555;
          channel_div_table[18] = 0x157e38e4;
          channel_div_table[19] = 0x15871c72;
          channel_div_table[20] = 0x15900000;
          fcal_div = 0x800;
          rx_notch_para_40M[0][0] = 1;
          rx_notch_para_40M[10][0] = 1;
          rx_notch_para_40M[0][1] = 7200000;
          rx_notch_para_40M[1][1] = 2200000;
          rx_notch_para_40M[2][1] = -2800000;
          rx_notch_para_40M[3][1] = -7800000;
          rx_notch_para_40M[8][1] = 5600000;
          rx_notch_para_40M[9][1] = 600000;
          rx_notch_para_40M[10][1] = -4400000;
          rx_notch_para_40M[4][0] = 0;
          rx_notch_para_40M[6][0] = 0;
          rx_notch_para_40M[7][0] = 0;
          rx_notch_para_40M[12][0] = 0;
          rx_notch_para_40M[4][1] = 0;
          rx_notch_para_40M[6][1] = 0;
          rx_notch_para_40M[7][1] = 0;
          rx_notch_para_40M[11][1] = -9400000;
          goto LAB_2301713a;
        }
        if (xtalfreq == 4) {
          channel_cnt_table._0_4_ = 0xa732a6eb;
          channel_cnt_table._4_4_ = 0xa7c0a779;
          channel_cnt_table._8_4_ = 0xa84fa808;
          channel_cnt_table._12_4_ = 0xa8dda896;
          channel_cnt_table._16_4_ = 0xa96ba924;
          channel_cnt_table._20_4_ = 0xa9f9a9b2;
          channel_cnt_table._24_4_ = 0xaa87aa40;
          channel_cnt_table._28_4_ = 0xab16aacf;
          channel_cnt_table._32_4_ = 0xaba4ab5d;
          channel_cnt_table._36_4_ = 0xac32abeb;
          channel_cnt_table[20] = 0xac79;
          channel_div_table[0] = 0x14088889;
          channel_div_table[1] = 0x14111111;
          channel_div_table[2] = 0x1419999a;
          channel_div_table[3] = 0x14222222;
          channel_div_table[4] = 0x142aaaab;
          channel_div_table[5] = 0x14333333;
          channel_div_table[6] = 0x143bbbbc;
          channel_div_table[7] = 0x14444444;
          channel_div_table[8] = 0x144ccccd;
          channel_div_table[9] = 0x14555555;
          channel_div_table[10] = 0x145dddde;
          channel_div_table[11] = 0x14666666;
          channel_div_table[12] = 0x146eeeef;
          channel_div_table[13] = 0x14777777;
          channel_div_table[14] = 0x14800000;
          channel_div_table[15] = 0x14888889;
          channel_div_table[16] = 0x14911111;
          channel_div_table[17] = 0x1499999a;
          channel_div_table[18] = 0x14a22222;
          channel_div_table[19] = 0x14aaaaab;
          channel_div_table[20] = 0x14b33333;
          rx_notch_para_40M[0][0] = 0;
          rx_notch_para_40M[0][1] = 0;
          rx_notch_para_40M[1][0] = 0;
          rx_notch_para_40M[1][1] = 0;
          rx_notch_para_40M[2][0] = 0;
          rx_notch_para_40M[2][1] = 0;
          rx_notch_para_40M[3][0] = 0;
          rx_notch_para_40M[3][1] = 0;
          rx_notch_para_40M[4][0] = 1;
          rx_notch_para_40M[4][1] = 8000000;
          rx_notch_para_40M[5][0] = 1;
          rx_notch_para_40M[5][1] = 3000000;
          rx_notch_para_40M[6][0] = 1;
          rx_notch_para_40M[6][1] = -2000000;
          rx_notch_para_40M[7][0] = 1;
          rx_notch_para_40M[7][1] = -7000000;
          rx_notch_para_40M[8][0] = 0;
          rx_notch_para_40M[8][1] = 0;
          rx_notch_para_40M[9][0] = 0;
          rx_notch_para_40M[9][1] = 0;
          rx_notch_para_40M[10][0] = 0;
          rx_notch_para_40M[10][1] = 0;
          rx_notch_para_40M[11][0] = 0;
          rx_notch_para_40M[11][1] = 0;
          rx_notch_para_40M[12][0] = 1;
          rx_notch_para_40M[12][1] = 8000000;
          rx_notch_para_40M[13][0] = 1;
          rx_notch_para_40M[13][1] = -4000000;
          channel_cnt_range._0_4_ = 0xa6e0a6a0;
          channel_cnt_range[2] = 0xace0;
          fcal_div = 0x855;
          return;
        }
        if (xtalfreq != 5) {
          return;
        }
        channel_div_table[0] = 0xf690690;
        channel_div_table[1] = 0xf6f96f9;
        channel_div_table[2] = 0xf762762;
        channel_div_table[3] = 0xf7cb7cb;
        channel_div_table[4] = 0xf834835;
        channel_div_table[5] = 0xf89d89e;
        channel_div_table[6] = 0xf906907;
        channel_div_table[7] = 0xf96f970;
        channel_div_table[8] = 0xf9d89d9;
        channel_div_table[9] = 0xfa41a42;
        channel_div_table[10] = 0xfaaaaab;
        channel_div_table[11] = 0xfb13b14;
        channel_div_table[12] = 0xfb7cb7d;
        channel_div_table[13] = 0xfbe5be6;
        channel_div_table[14] = 0xfc4ec4f;
        channel_div_table[15] = 0xfcb7cb8;
        channel_div_table[16] = 0xfd20d21;
        channel_div_table[17] = 0xfd89d8a;
        channel_div_table[18] = 0xfdf2df3;
        channel_div_table[19] = 0xfe5be5c;
        channel_div_table[20] = 0xfec4ec5;
        channel_cnt_table._0_4_ = 0xa734a6ed;
        channel_cnt_table._4_4_ = 0xa7c2a77b;
        channel_cnt_table._8_4_ = 0xa850a809;
        channel_cnt_table._12_4_ = 0xa8dea897;
        channel_cnt_table._16_4_ = 0xa96da925;
        channel_cnt_table._20_4_ = 0xa9fba9b4;
        channel_cnt_table._24_4_ = 0xaa89aa42;
        channel_cnt_table._28_4_ = 0xab17aad0;
        channel_cnt_table._32_4_ = 0xaba5ab5e;
        channel_cnt_table._36_4_ = 0xac34abec;
        channel_cnt_table[20] = 0xac7b;
        channel_cnt_range._0_4_ = 0xa6e2a6a2;
        channel_cnt_range[2] = 0xace2;
        fcal_div = 0xad5;
        rx_notch_para_40M[5][0] = 1;
        rx_notch_para_40M[6][0] = 1;
        rx_notch_para_40M[7][0] = 1;
        rx_notch_para_40M[5][1] = 7000000;
        rx_notch_para_40M[6][1] = (int32_t)&DAT_001e8480;
        rx_notch_para_40M[7][1] = -3000000;
        rx_notch_para_40M[0][0] = 0;
        rx_notch_para_40M[1][0] = 0;
        rx_notch_para_40M[2][0] = 0;
        rx_notch_para_40M[3][0] = 0;
        rx_notch_para_40M[4][0] = 0;
        rx_notch_para_40M[9][0] = 0;
        rx_notch_para_40M[10][0] = 0;
        rx_notch_para_40M[11][0] = 0;
        rx_notch_para_40M[12][0] = 0;
        rx_notch_para_40M[0][1] = 0;
        rx_notch_para_40M[1][1] = 0;
        rx_notch_para_40M[2][1] = 0;
        rx_notch_para_40M[3][1] = 0;
        rx_notch_para_40M[4][1] = 0;
        rx_notch_para_40M[8][1] = -8000000;
        rx_notch_para_40M[9][1] = 0;
        rx_notch_para_40M[10][1] = 0;
        rx_notch_para_40M[11][1] = 0;
        goto LAB_2301713c;
      }
      channel_div_table[0] = 0x190aaaab;
      channel_div_table[1] = 0x19155555;
      channel_div_table[2] = 0x19200000;
      channel_div_table[3] = 0x192aaaab;
      channel_div_table[4] = 0x19355555;
      channel_div_table[5] = 0x19400000;
      channel_div_table[6] = 0x194aaaab;
      channel_div_table[7] = 0x19555555;
      channel_div_table[8] = 0x19600000;
      channel_div_table[9] = 0x196aaaab;
      channel_div_table[10] = 0x19755555;
      channel_div_table[11] = 0x19800000;
      channel_div_table[12] = 0x198aaaab;
      channel_div_table[13] = 0x19955555;
      channel_div_table[14] = 0x19a00000;
      channel_div_table[15] = 0x19aaaaab;
      channel_div_table[16] = 0x19b55555;
      channel_div_table[17] = 0x19c00000;
      channel_div_table[18] = 0x19caaaab;
      channel_div_table[19] = 0x19d55555;
      channel_div_table[20] = 0x19e00000;
      channel_cnt_table._0_4_ = 0xa741a6fa;
      channel_cnt_table._4_4_ = 0xa7d0a788;
      channel_cnt_table._8_4_ = 0xa85ea817;
      channel_cnt_table._12_4_ = 0xa8eca8a5;
      channel_cnt_table._16_4_ = 0xa97aa933;
      channel_cnt_table._20_4_ = 0xaa09a9c1;
      channel_cnt_table._24_4_ = 0xaa97aa50;
      channel_cnt_table._28_4_ = 0xab25aade;
      channel_cnt_table._32_4_ = 0xabb3ab6c;
      channel_cnt_table._36_4_ = 0xac42abfa;
      channel_cnt_table[20] = 0xac89;
      channel_cnt_range._0_4_ = 0xa6efa6af;
      channel_cnt_range[2] = 0xacf0;
      fcal_div = 0x6ab;
      rx_notch_para_40M[4][0] = 1;
      rx_notch_para_40M[9][0] = 1;
      rx_notch_para_40M[12][0] = 1;
      rx_notch_para_40M[2][1] = 10000000;
      rx_notch_para_40M[3][1] = 5000000;
      rx_notch_para_40M[5][1] = -5000000;
      rx_notch_para_40M[6][1] = -10000000;
      rx_notch_para_40M[9][1] = 7000000;
      rx_notch_para_40M[10][1] = (int32_t)&DAT_001e8480;
      rx_notch_para_40M[11][1] = -3000000;
      rx_notch_para_40M[8][0] = 0;
      rx_notch_para_40M[0][1] = 0;
      rx_notch_para_40M[1][1] = 0;
      rx_notch_para_40M[7][1] = 0;
      rx_notch_para_40M[8][1] = 0;
      rx_notch_para_40M[12][1] = -8000000;
    }
    rx_notch_para_40M[4][1] = 0;
    rx_notch_para_40M[0][0] = rx_notch_para_40M[8][0];
    rx_notch_para_40M[1][0] = rx_notch_para_40M[8][0];
    rx_notch_para_40M[2][0] = rx_notch_para_40M[12][0];
    rx_notch_para_40M[3][0] = rx_notch_para_40M[12][0];
    rx_notch_para_40M[5][0] = rx_notch_para_40M[12][0];
    rx_notch_para_40M[6][0] = rx_notch_para_40M[12][0];
    rx_notch_para_40M[7][0] = rx_notch_para_40M[8][0];
    rx_notch_para_40M[10][0] = rx_notch_para_40M[12][0];
    rx_notch_para_40M[11][0] = rx_notch_para_40M[12][0];
  }
  rx_notch_para_40M[13][0] = 0;
  rx_notch_para_40M[13][1] = 0;
  return;
}



