pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint32_t rf_pri_get_vco_freq_cw(uint32_t chanfreq_MHz)

{
  int iVar1;
  
  __floatunsidf(chanfreq_MHz - 0x964 >> 2);
  __adddf3();
  iVar1 = __fixdfsi();
  if (0x14 < iVar1) {
    iVar1 = 0x14;
  }
  return (uint)*(ushort *)(&(rf_calib_data->cal).field_0x8 + (iVar1 + 8) * 2) & 0xff;
}



uint32_t rf_pri_get_vco_idac_cw(uint32_t chanfreq_MHz)

{
  int iVar1;
  
  __floatunsidf(chanfreq_MHz - 0x964 >> 2);
  __adddf3();
  iVar1 = __fixdfsi();
  if (0x14 < iVar1) {
    iVar1 = 0x14;
  }
  return (uint)(*(ushort *)(&(rf_calib_data->cal).field_0x8 + (iVar1 + 8) * 2) >> 8) & 0x1f;
}



int32_t rf_pri_get_txgain_max(void)

{
  return tx_pwr_os_temperature + tx_pwr_table[0][6] + tx_pwr_os;
}



int32_t rf_pri_get_txgain_min(void)

{
  return tx_pwr_os_temperature + tx_pwr_table[15][6] + tx_pwr_os;
}



uint32_t rf_pri_get_txgain_index(int32_t pwr,uint32_t mode)

{
  int32_t *piVar1;
  uint32_t uVar2;
  
  if (mode == 0) {
    pwr = pwr + -0x1e;
  }
  piVar1 = tx_pwr_table;
  uVar2 = 0;
  do {
    if (piVar1[6] + tx_pwr_os + tx_pwr_os_temperature <= pwr) {
      return uVar2;
    }
    uVar2 = uVar2 + 1;
    piVar1 = piVar1 + 7;
  } while (uVar2 != 0x10);
  return 0xf;
}



void rf_pri_query_txgain_table(uint32_t index,uint32_t *rfg_index,uint32_t *dg)

{
  if (0xf < index) {
    index = 0xf;
  }
  *rfg_index = 7 - (index >> 1);
  *dg = tx_pwr_table[index * 7 + 5];
  return;
}



void rf_pri_update_dvga_os(int8_t dvga_os)

{
  int iVar1;
  int32_t *piVar2;
  int8_t *piVar3;
  
  piVar2 = tx_pwr_table;
  iVar1 = 0;
  do {
    piVar3 = temps_dvga + iVar1;
    iVar1 = iVar1 + 1;
    *piVar3 = (char)piVar2[5] + dvga_os;
    piVar2 = piVar2 + 7;
  } while (iVar1 != 0x10);
  return;
}



void rf_pri_tx_gain_comp(int32_t Tsens)

{
  int iVar1;
  int iVar2;
  int32_t *piVar3;
  uint uVar4;
  
  if (up_dn == 1) {
    if ((Tthr <= Tsens) || (Tsens <= Tthr + -5)) {
LAB_23017d2a:
      piVar3 = temps;
      iVar2 = 0xc;
      do {
        if (piVar3[0xc] <= Tsens) break;
        iVar2 = iVar2 + -1;
        piVar3 = piVar3 + -1;
      } while (iVar2 != -1);
      if (iVar2 < 0) {
        iVar2 = 0;
      }
      uVar4 = iVar2 - 4;
      iVar1 = temps[iVar2];
      Tthr = iVar1;
      if (Tsens < 0x23) {
        if (iVar1 < Tsens) {
          Tthr = temps[iVar2 + 1];
          if (0x22 < temps[iVar2 + 1]) {
            Tthr = iVar1;
          }
        }
        else {
          uVar4 = iVar2 - 5;
        }
      }
      else {
        if (iVar1 < 0x24) {
          Tthr = temps[iVar2 + 1];
        }
      }
      if (index_os_pre_mdb < (int)uVar4) {
        up_dn = 1;
      }
      else {
        if ((int)uVar4 < index_os_pre_mdb) {
          up_dn = -1;
        }
      }
      if ((int)uVar4 < 1) {
        dvga_os_pre = 0;
        index_os_pre = uVar4;
        if (uVar4 != 0) {
          dvga_os_pre = 0xffffffff;
          if ((uVar4 & 1) != 0) {
            dvga_os_pre = 1;
          }
          index_os_pre = (int)(uVar4 - 1) / 2;
        }
      }
      else {
        dvga_os_pre = uVar4 + 1 & 1;
        if (dvga_os_pre == 0) {
          dvga_os_pre = 0xffffffff;
        }
        index_os_pre = (int)(uVar4 + 1) >> 1;
      }
      tx_pwr_os_temperature = index_os_pre * -10;
      index_os_pre_mdb = uVar4;
      goto LAB_23017cfe;
    }
  }
  else {
    if (((up_dn != -1) || (Tsens <= Tthr)) || (Tthr + 5 <= Tsens)) goto LAB_23017d2a;
  }
  tx_pwr_os_temperature = index_os_pre * -10;
LAB_23017cfe:
  rf_pri_update_dvga_os((int8_t)dvga_os_pre);
  rfc_apply_tx_dvga(temps_dvga);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_txcal(void)

{
  int32_t val;
  uint32_t center;
  uint val_00;
  uint val_01;
  uint32_t *puVar1;
  int iVar2;
  uint32_t *puVar3;
  int32_t *piVar4;
  uint val_02;
  uint uVar5;
  int iVar6;
  
  _DAT_40001014 = _DAT_40001014 & 0xff0fffff | 0x500000;
  rf_pri_save_state_for_cal();
  rf_pri_manu_pu(5);
  rf_pri_config_channel();
  _DAT_4000101c = _DAT_4000101c | 0x3000;
  _DAT_40001084 = _DAT_40001084 | 0x80000000;
  _DAT_40001064 = _DAT_40001064 | 0x400000;
  iVar2 = 7;
  _DAT_4000106c = (uint)tmxcss[0] | _DAT_4000106c & 0xfffffff8;
  rf_pri_singen_config(0x3d);
  puVar3 = txcal_para;
  piVar4 = tx_pwr_table;
  do {
    _DAT_40001064 = *puVar3 << 0x1c | _DAT_40001064 & 0xfc3ffff | puVar3[2] << 0x12;
    _DAT_40001058 = puVar3[1] << 0x10 | _DAT_40001058 & 0xfff8ffff;
    _DAT_40001048 = *piVar4 << 0x1c | _DAT_40001048 & 0xce08ffff | piVar4[3] << 0x14 | 0x70000;
    BL602_Delay_US(10);
    val_02 = puVar3[3];
    uVar5 = val_02;
    do {
      uVar5 = uVar5 >> 1;
      _DAT_40001214 = val_02 | _DAT_40001214 & 0xfffff800;
      _DAT_40001218 = val_02 | _DAT_40001218 & 0xfffff800;
      rf_pri_singen_start();
      rf_pri_start_txdfe();
      BL602_Delay_US(10);
      val = rf_pri_pm_pwr_avg(1,0x400);
      iVar6 = val >> 10;
      printf("amp=%ld,step=%ld,adc_mean_i=%ld\r\n",val_02,uVar5,iVar6);
      if (iVar6 < 0x141) {
        val_00 = uVar5;
        if (0xbf < iVar6) break;
      }
      else {
        val_00 = -uVar5;
      }
      val_02 = val_02 + val_00;
    } while (uVar5 != 0);
    rf_pri_pm_pwr_avg(1,0x1000);
    center = rf_pri_txcal_search_core(0,0x20,0x10,0x3d);
    rf_pri_txcal_config(0,center);
    uVar5 = rf_pri_txcal_search_core(1,0x20,0x10,0x3d);
    _DAT_40001070 = uVar5 << 0x10 | _DAT_40001070 & 0xffc0ffff;
    val_02 = rf_pri_txcal_search_core(0,center,2,0x3d);
    rf_pri_txcal_config(0,val_02);
    center = rf_pri_txcal_search_core(2,0x400,0x80,0x7a);
    rf_pri_txcal_config(2,center);
    val = rf_pri_txcal_search_core(3,0,0x40,0x7a);
    rf_pri_txcal_config(3,val);
    val_00 = rf_pri_txcal_search_core(2,center,0x40,0x7a);
    rf_pri_txcal_config(2,val_00);
    val_01 = rf_pri_txcal_search_core(3,0,0x20,0x7a);
    rf_pri_txcal_config(3,val_01);
    puVar1 = &rf_calib_data->inited + (iVar2 + 0xc) * 2;
    puVar1[2] = puVar1[2] & 0xffffffc0 | val_02 & 0x3f;
    puVar1[2] = puVar1[2] & 0xfffff03f | (uVar5 & 0x3f) << 6;
    puVar1[2] = puVar1[2] & 0xff800fff | (val_00 & 0x7ff) << 0xc;
    puVar1[3] = puVar1[3] & 0xfffffc00 | val_01 & 0x3ff;
    printf("tosdac_i=%ld,tosdac_q=%ld,tx_iq_gain_comp=%ld,tx_iq_phase_comp=%ld\r\n",val_02,uVar5,
           val_00);
    iVar2 = iVar2 + -1;
    puVar3 = puVar3 + 4;
    piVar4 = piVar4 + 0xe;
    if (iVar2 == -1) {
      rf_pri_txcal_config_hw();
      _DAT_4000101c = _DAT_4000101c & 0xffffcfff;
      rf_pri_restore_state_for_cal();
      _DAT_40001014 = _DAT_40001014 | 0xf00000;
      _DAT_40001070 =
           (*(uint *)(rf_calib_data->txcal + 3) >> 6 & 0x3f) << 0x10 |
           (*(uint *)(rf_calib_data->txcal + 3) & 0x3f) << 0x18 | _DAT_40001070 & 0xc0c0ffff;
      _DAT_40001600 =
           *(uint *)&rf_calib_data->txcal[3].field_0x4 & 0x3ff |
           *(uint *)(rf_calib_data->txcal + 3) & 0x7ff000 | _DAT_40001600 & 0xff800c00;
      return;
    }
  } while( true );
}



