pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_roscal(void)

{
  uint32_t uVar1;
  uint uVar2;
  
  _DAT_40001014 = _DAT_40001014 & 0xffff3fff;
  if ((_DAT_40001020 & 0x100) != 0) {
    _DAT_40001014 = _DAT_40001014 | 0x4000;
    rf_pri_save_state_for_cal();
    rf_pri_manu_pu(3);
    _DAT_4000101c = _DAT_4000101c | 0x200;
    rf_pri_config_channel();
    _DAT_40001048 = _DAT_40001048 & 0xffff8fff | 0x6300;
    uVar1 = rf_pri_roscal_iq(1);
    uVar2 = uVar1 & 0x3f;
    *(uint *)(rf_calib_data->rxcal + 3) = *(uint *)(rf_calib_data->rxcal + 3) & 0xffffffc0 | uVar2;
    _DAT_4000116c = _DAT_4000116c & 0xffc0ffff | uVar1 << 0x10;
    printf("rosdac_i_gc3=%ld\r\n",uVar1);
    *(uint *)(rf_calib_data->rxcal + 2) = *(uint *)(rf_calib_data->rxcal + 2) & 0xffffffc0 | uVar2;
    _DAT_4000116c = uVar1 | _DAT_4000116c & 0xffffffc0;
    printf("rosdac_i_gc2=%ld\r\n",uVar1);
    *(uint *)(rf_calib_data->rxcal + 1) = *(uint *)(rf_calib_data->rxcal + 1) & 0xffffffc0 | uVar2;
    _DAT_40001168 = uVar1 << 0x10 | _DAT_40001168 & 0xffc0ffff;
    printf("rosdac_i_gc1=%ld\r\n",uVar1);
    *(uint *)rf_calib_data->rxcal = *(uint *)rf_calib_data->rxcal & 0xffffffc0 | uVar2;
    _DAT_40001168 = uVar1 | _DAT_40001168 & 0xffffffc0;
    printf("rosdac_i_gc0=%ld\r\n",uVar1);
    uVar1 = rf_pri_roscal_iq(0);
    uVar2 = (uVar1 & 0x3f) << 6;
    *(uint *)(rf_calib_data->rxcal + 3) = *(uint *)(rf_calib_data->rxcal + 3) & 0xfffff03f | uVar2;
    _DAT_4000116c = _DAT_4000116c & 0xc0ffffff | uVar1 << 0x18;
    printf("rosdac_q_gc3=%ld\r\n",uVar1);
    *(uint *)(rf_calib_data->rxcal + 2) = *(uint *)(rf_calib_data->rxcal + 2) & 0xfffff03f | uVar2;
    _DAT_4000116c = _DAT_4000116c & 0xffffc0ff | uVar1 << 8;
    printf("rosdac_q_gc2=%ld\r\n",uVar1);
    *(uint *)(rf_calib_data->rxcal + 1) = *(uint *)(rf_calib_data->rxcal + 1) & 0xfffff03f | uVar2;
    _DAT_40001168 = uVar1 << 0x18 | _DAT_40001168 & 0xc0ffffff;
    printf("rosdac_q_gc1=%ld\r\n",uVar1);
    *(uint *)rf_calib_data->rxcal = *(uint *)rf_calib_data->rxcal & 0xfffff03f | uVar2;
    _DAT_40001168 = uVar1 << 8 | _DAT_40001168 & 0xffffc0ff;
    printf("rosdac_q_gc0=%ld\r\n",uVar1);
    rf_pri_restore_state_for_cal();
    _DAT_40001014 = _DAT_40001014 | 0xc000;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_rccal(void)

{
  rf_calib_data_tag *prVar1;
  uint32_t uVar2;
  uint32_t uVar3;
  uint uVar4;
  uint uVar5;
  
  _DAT_40001014 = _DAT_40001014 & 0xfff3ffff;
  if ((_DAT_40001020 & 0x400) != 0) {
    _DAT_40001014 = _DAT_40001014 | 0x40000;
    rf_pri_save_state_for_cal();
    rf_pri_manu_pu(4);
    _DAT_40001084 = _DAT_40001084 & 0xfcffffff | 0x2000000;
    _DAT_4000108c = _DAT_4000108c | 0x1000;
    _DAT_4000101c = _DAT_4000101c | 0x800;
    uVar2 = rf_pri_rccal_iq(1);
    uVar3 = rf_pri_rccal_iq(0);
    prVar1 = rf_calib_data;
    uVar5 = _DAT_40001080;
    *(uint *)&(rf_calib_data->cal).field_0x4 =
         *(uint *)&(rf_calib_data->cal).field_0x4 & 0xffffffc0 | _DAT_40001080 >> 0x18 & 0x3f;
    *(uint *)&(prVar1->cal).field_0x4 =
         *(uint *)&(prVar1->cal).field_0x4 & 0xfffff03f | (uVar5 >> 0x10 & 0x3f) << 6;
    *(uint *)&(prVar1->cal).field_0x4 =
         *(uint *)&(prVar1->cal).field_0x4 & 0xfffc0fff | (uVar5 >> 8 & 0x3f) << 0xc;
    *(uint *)&(prVar1->cal).field_0x4 =
         (uVar5 & 0x3f) << 0x12 | *(uint *)&(prVar1->cal).field_0x4 & 0xff03ffff;
    printf("rbb_cap1_fc_i=%ld,rbb_cap2_fc_i=%ld,rbb_cap1_fc_q=%ld,rbb_cap2_fc_q=%ld\r\n",
           *(uint *)&(prVar1->cal).field_0x4 & 0x3f,*(uint *)&(prVar1->cal).field_0x4 >> 0xc & 0x3f,
           *(uint *)&(prVar1->cal).field_0x4 >> 6 & 0x3f,
           *(uint *)&(prVar1->cal).field_0x4 >> 0x12 & 0x3f);
    prVar1 = rf_calib_data;
    uVar5 = *(uint *)&(rf_calib_data->cal).field_0x4 & 0x3f;
    if (uVar5 < (*(uint *)&(rf_calib_data->cal).field_0x4 >> 6 & 0x3f)) {
      uVar5 = *(uint *)&(rf_calib_data->cal).field_0x4 >> 6 & 0x3f;
    }
    if (uVar5 < (*(uint *)&(rf_calib_data->cal).field_0x4 >> 0xc & 0x3f)) {
      uVar5 = *(uint *)&(rf_calib_data->cal).field_0x4 >> 0xc & 0x3f;
    }
    if (uVar5 < (*(uint *)&(rf_calib_data->cal).field_0x4 >> 0x12 & 0x3f)) {
      uVar5 = *(uint *)&(rf_calib_data->cal).field_0x4 >> 0x12 & 0x3f;
    }
    uVar4 = 0x18;
    if (0x27 < uVar5) {
      uVar4 = 0x3f - uVar5;
    }
    uVar4 = uVar4 & 0xff;
    *(uint *)&(rf_calib_data->cal).field_0x4 =
         *(uint *)&(rf_calib_data->cal).field_0x4 & 0xffffffc0 |
         *(int *)&(rf_calib_data->cal).field_0x4 + uVar4 & 0x3f;
    *(uint *)&(prVar1->cal).field_0x4 =
         ((*(uint *)&(prVar1->cal).field_0x4 >> 6) + uVar4 & 0x3f) << 6 |
         *(uint *)&(prVar1->cal).field_0x4 & 0xfffff03f;
    *(uint *)&(prVar1->cal).field_0x4 =
         ((*(uint *)&(prVar1->cal).field_0x4 >> 0xc) + uVar4 & 0x3f) << 0xc |
         *(uint *)&(prVar1->cal).field_0x4 & 0xfffc0fff;
    *(uint *)&(prVar1->cal).field_0x4 =
         ((*(uint *)&(prVar1->cal).field_0x4 >> 0x12) + uVar4 & 0x3f) << 0x12 |
         *(uint *)&(prVar1->cal).field_0x4 & 0xff03ffff;
    rf_pri_rccal_config(*(uint *)&(prVar1->cal).field_0x4 & 0x3f);
    rf_pri_rccal_config(0,*(uint *)&(rf_calib_data->cal).field_0x4 >> 6 & 0x3f);
    printf("new rbb_cap1_fc_i=%ld,rbb_cap2_fc_i=%ld,rbb_cap1_fc_q=%ld,rbb_cap2_fc_q=%ld\r\n",
           *(uint *)&(rf_calib_data->cal).field_0x4 & 0x3f,
           *(uint *)&(rf_calib_data->cal).field_0x4 >> 0xc & 0x3f,
           *(uint *)&(rf_calib_data->cal).field_0x4 >> 6 & 0x3f,
           *(uint *)&(rf_calib_data->cal).field_0x4 >> 0x12 & 0x3f);
    rf_pri_restore_state_for_cal();
    if ((uVar2 == 2) || (uVar3 == 2)) {
      _DAT_40001014 = _DAT_40001014 & 0xfff3ffff | 0x80000;
    }
    else {
      _DAT_40001014 = _DAT_40001014 | 0xc0000;
    }
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_lo_acal(void)

{
  uint uVar1;
  int iVar2;
  int iVar3;
  uint32_t *puVar4;
  uint32_t *puVar5;
  uint uVar6;
  
  _DAT_40001014 = _DAT_40001014 & 0xffffff3f | 0x40;
  rf_pri_save_state_for_cal();
  rf_pri_manu_pu(6);
  puVar4 = channel_div_table;
  iVar3 = 0;
  do {
    _DAT_4000101c = _DAT_4000101c | 0x10;
    _DAT_400010a4 = _DAT_400010a4 & 0xfffff8ff | 0x400;
    uVar6 = 3;
    uVar1 = 0x10;
    _DAT_400010a0 =
         (uint)*(ushort *)(&(rf_calib_data->cal).field_0x8 + (iVar3 + 8) * 2) & 0xff |
         _DAT_400010a0 & 0xffe0ff00 | 0x100000;
    _DAT_400010c4 = *puVar4;
    BL602_Delay_US(1);
    while (_DAT_400010a0 = _DAT_400010a0 & 0xffe0ffff | uVar1 << 0x10, uVar6 != 0xffffffff) {
      BL602_Delay_US(1);
      iVar2 = 1 << (uVar6 & 0x1f);
      if ((int)(_DAT_400010a4 << 0x13) < 0) {
        iVar2 = -iVar2;
      }
      uVar1 = uVar1 + iVar2;
      uVar6 = uVar6 - 1;
    }
    BL602_Delay_US(1);
    if ((-1 < (int)(_DAT_400010a4 << 0x13)) && (uVar1 < 0x1f)) {
      uVar1 = uVar1 + 1;
    }
    puVar5 = (uint32_t *)((int)&rf_calib_data->inited + (iVar3 + 8) * 2);
    *(ushort *)(puVar5 + 3) = *(ushort *)(puVar5 + 3) & 0xe0ff | (ushort)((uVar1 & 0x1f) << 8);
    printf("%ldth channel,vco_idac_cw=%ld\r\n",iVar3,uVar1);
    iVar3 = iVar3 + 1;
    puVar4 = puVar4 + 1;
  } while (iVar3 != 0x15);
  rf_pri_restore_state_for_cal();
  _DAT_40001014 = _DAT_40001014 | 0xc0;
  return;
}



