pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_fcal(void)

{
  uint cw;
  uint16_t uVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  int iVar2;
  uint32_t *puVar3;
  uint uVar4;
  uint uVar5;
  uint cw_00;
  uint16_t *puVar6;
  uint uVar7;
  
  cw_00 = (uint)channel_cnt_range[0];
  uVar7 = (uint)channel_cnt_range[1];
  uVar5 = (uint)channel_cnt_range[2];
  _DAT_40001014 = _DAT_40001014 & 0xffffffcf | 0x10;
  rf_pri_save_state_for_cal();
  rf_pri_manu_pu(7);
  _DAT_4000101c = _DAT_4000101c | 8;
  _DAT_400010a0 = _DAT_400010a0 & 0xffffff00 | 0x80;
  _DAT_400010a8 = (uint)fcal_div | _DAT_400010a8 & 0xffff0000;
  _DAT_400010c4 = 0x1000000;
  _DAT_400010c0 = _DAT_400010c0 & 0xfffeffff | 0x1000;
  _DAT_400010b8 = _DAT_400010b8 & 0xffffcfff | 0x10000;
  BL602_Delay_US(10);
  _DAT_400010c0 = _DAT_400010c0 | 0x10000;
  _DAT_400010b8 = _DAT_400010b8 & 0xfffeffff;
  BL602_Delay_US(0x32);
  _DAT_400010a4 = _DAT_400010a4 & 0xfffffffc | 2;
  BL602_Delay_US(0x32);
  do {
    uVar4 = 6;
    cw = 0x80;
    while (uVar4 != 0xffffffff) {
      uVar1 = rf_pri_fcal_meas(cw);
      if (CONCAT22(extraout_var,uVar1) < cw_00) {
        iVar2 = -(1 << (uVar4 & 0x1f));
      }
      else {
        if (CONCAT22(extraout_var,uVar1) <= uVar7) break;
        iVar2 = 1 << (uVar4 & 0x1f);
      }
      cw = cw + iVar2 & 0xffff;
      uVar4 = uVar4 - 1;
    }
    if (0xe < cw) break;
    printf("Unexpected cw %ld\r\n",cw);
    _DAT_400010c0 = _DAT_400010c0 & 0xfffeffff;
    _DAT_400010b8 = _DAT_400010b8 | 0x10000;
    BL602_Delay_US(0x32);
    _DAT_400010c0 = _DAT_400010c0 | 0x10000;
    _DAT_400010b8 = _DAT_400010b8 & 0xfffeffff;
    BL602_Delay_US(0x32);
  } while( true );
  cw_00 = cw + 1 & 0xffff;
  channel_cnt_opt_table[0] = rf_pri_fcal_meas(cw_00);
  puVar6 = channel_cnt_opt_table;
  do {
    cw_00 = cw_00 - 1 & 0xffff;
    uVar1 = rf_pri_fcal_meas(cw_00);
    puVar6[1] = uVar1;
    if (uVar5 < CONCAT22(extraout_var_00,uVar1)) break;
    puVar6 = puVar6 + 1;
  } while (cw_00 != (cw - 0x26 & 0xffff));
  iVar2 = 0;
  uVar5 = 0;
  puVar6 = channel_cw_table;
  do {
    while (cw_00 = uVar5 & 0xffff,
          channel_cnt_opt_table[uVar5] < *(ushort *)((int)channel_cnt_table + iVar2)) {
      uVar5 = (int)((cw_00 + 1) * 0x10000) >> 0x10;
    }
    *(short *)((int)channel_cw_table + iVar2) = ((short)cw + 2) - (short)cw_00;
    if ((int)uVar5 < 1) {
      uVar5 = 0;
    }
    else {
      uVar5 = (int)((cw_00 - 1) * 0x10000) >> 0x10;
    }
    iVar2 = iVar2 + 2;
  } while (iVar2 != 0x2a);
  rf_pri_restore_state_for_cal();
  iVar2 = 0;
  do {
    puVar3 = (uint32_t *)((int)&rf_calib_data->inited + (iVar2 + 8) * 2);
    iVar2 = iVar2 + 1;
    *(ushort *)(puVar3 + 3) = *(ushort *)(puVar3 + 3) & 0xff00 | *puVar6 & 0xff;
    printf("%ldth channel,lo_vco_freq_cw=%ld\r\n");
    puVar6 = puVar6 + 1;
  } while (iVar2 != 0x15);
  _DAT_40001014 = _DAT_40001014 | 0x30;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_full_cal(void)

{
  _DAT_40001220 = _DAT_40001220 & 0xffffff9f | 0x61;
  rf_pri_start_txdfe();
  rf_pri_fcal();
  rf_pri_lo_acal();
  rf_pri_roscal();
  rf_pri_rccal();
  rf_pri_txcal();
  _DAT_4000100c = _DAT_4000100c | 6;
  _DAT_40001220 = _DAT_40001220 & 0xffffe61c;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_restore_cal_reg(void)

{
  _DAT_40001168 =
       (*(uint *)(rf_calib_data->rxcal + 1) >> 6 & 0x3f) << 0x18 |
       (*(uint *)rf_calib_data->rxcal >> 6 & 0x3f) << 8 |
       *(uint *)rf_calib_data->rxcal & 0x3f | _DAT_40001168 & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->rxcal + 1) & 0x3f) << 0x10;
  _DAT_4000116c =
       (*(uint *)(rf_calib_data->rxcal + 3) >> 6 & 0x3f) << 0x18 |
       (*(uint *)(rf_calib_data->rxcal + 2) >> 6 & 0x3f) << 8 |
       *(uint *)(rf_calib_data->rxcal + 2) & 0x3f | _DAT_4000116c & 0xc0c0c0c0 |
       (*(uint *)(rf_calib_data->rxcal + 3) & 0x3f) << 0x10;
  _DAT_40001080 =
       (*(uint *)&(rf_calib_data->cal).field_0x4 >> 6 & 0x3f) << 0x10 |
       (*(uint *)&(rf_calib_data->cal).field_0x4 >> 0xc & 0x3f) << 8 |
       (*(uint *)&(rf_calib_data->cal).field_0x4 & 0x3f) << 0x18 | _DAT_40001080 & 0xc0c0c0c0 |
       *(uint *)&(rf_calib_data->cal).field_0x4 >> 0x12 & 0x3f;
  rf_pri_txcal_config_hw();
  _DAT_40001070 =
       (*(uint *)(rf_calib_data->txcal + 3) >> 6 & 0x3f) << 0x10 |
       (*(uint *)(rf_calib_data->txcal + 3) & 0x3f) << 0x18 | _DAT_40001070 & 0xc0c0ffff;
  _DAT_40001600 =
       *(uint *)(rf_calib_data->txcal + 3) & 0x7ff000 | _DAT_40001600 & 0xff800c00 |
       *(uint *)&rf_calib_data->txcal[3].field_0x4 & 0x3ff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void rf_pri_init(uint8_t reset,uint8_t chipv)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,reset);
  rf_pri_chipv(chipv);
  init_fast = (uint32_t)(iVar1 == 0);
  _DAT_4000f814 = _DAT_4000f814 & 0xfffff0ff | 0x300;
  _DAT_4000f030 = _DAT_4000f030 & 0xf0ffffff | 0x8000000;
  _DAT_40001030 = _DAT_40001030 | 0x1001;
  _DAT_4000f884 = _DAT_4000f884 | 4;
  if (iVar1 != 0) {
    BL602_Delay_MS(10);
  }
  _DAT_40001064 = _DAT_40001064 & 0xffff8008 | opti_regs->vbcore << 8 | opti_regs->iet << 4 | 0x4002
  ;
  _DAT_40001128 =
       _DAT_40001128 & 0xff800fff | opti_regs->vbcore_11n << 0x10 | opti_regs->iet_11n << 0xc |
       0x400000;
  _DAT_4000112c =
       (_DAT_4000112c & 0xfffff800 | opti_regs->vbcore_11g << 4 | opti_regs->iet_11g) & 0xff800fff |
       0x400 | opti_regs->vbcore_11b << 0x10 | opti_regs->iet_11b << 0xc | 0x400000;
  _DAT_40001090 = _DAT_40001090 | 0x10000;
  _DAT_400010b8 = opti_regs->lo_fbdv_halfstep_en << 4 | _DAT_400010b8 & 0xffffffef;
  _DAT_40001138 =
       (_DAT_40001138 & 0xfffffffc | opti_regs->lo_fbdv_halfstep_en_tx << 1 |
       opti_regs->lo_fbdv_halfstep_en_tx) & 0xfffcfff7 | 0x300;
  _DAT_40001130 = _DAT_40001130 & 0xfffefffe;
  _DAT_4000e400 = opti_regs->clkpll_reset_postdiv << 1 | _DAT_4000e400 & 0xfffffffd;
  _DAT_4000e418 = opti_regs->clkpll_dither_sel << 0x18 | _DAT_4000e418 & 0xfcffffff;
  _DAT_4000108c = _DAT_4000108c & 0xfffffffc | 2;
  _DAT_4000f030 = _DAT_4000f030 & 0xfff0ffff | 0xc0000;
  rf_pri_set_gain_table_regs();
  _DAT_4000e404 = _DAT_4000e404 | 0x10000;
  _DAT_4000e41c = _DAT_4000e41c | 0xff;
  if (iVar1 == 0) {
    rf_pri_restore_cal_reg();
    return;
  }
  rf_pri_full_cal();
  return;
}



void rf_pri_update_power_offset(int32_t *power_offset)

{
  undefined4 uVar1;
  int iVar2;
  
  iVar2 = 0;
  do {
    uVar1 = *(undefined4 *)((int)power_offset + iVar2);
    *(undefined4 *)((int)tx_pwr_ch_os_a1 + iVar2) = uVar1;
    *(undefined4 *)((int)tx_pwr_ch_os + iVar2) = uVar1;
    iVar2 = iVar2 + 4;
  } while (iVar2 != 0x38);
  return;
}



int phyif_utils_decode(phyif_utils_recvtable_t *vec,int8_t *ppm)

{
  char cVar1;
  int8_t iVar2;
  SItype SVar3;
  
  cVar1 = *(char *)((int)&vec->recvtable5 + 3);
  if (((*(ushort *)((int)&vec->recvtable2 + 2) & 7) < 2) && ((vec->recvtable1 >> 0xc & 0xf) < 4)) {
    __floatsidf(-(int)cVar1);
    __muldf3();
    SVar3 = __fixdfsi();
    iVar2 = (int8_t)SVar3;
  }
  else {
    iVar2 = (int8_t)((int)CONCAT11(*(undefined *)&vec->recvtable6,cVar1) / 0x7a);
  }
  *ppm = iVar2;
  return 0;
}



