pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void sysctrl_init(void)

{
  _DAT_44900068 = 0x8000000c;
  _DAT_449000e0 = _DAT_449000e0 | 0x1ff00;
  return;
}



void intc_spurious(void)

{
  assert_err("0","module",0x36);
  return;
}



void intc_enable_irq(int index)

{
  *(int *)(((index >> 5) + 0x11244004) * 4) = 1 << (index & 0x1fU);
  return;
}



void intc_init(void)

{
  intc_enable_irq(0x3f);
  intc_enable_irq(0x3e);
  intc_enable_irq(0x3d);
  intc_enable_irq(0x18);
  intc_enable_irq(0x19);
  intc_enable_irq(0x1a);
  intc_enable_irq(0x1b);
  intc_enable_irq(0x1c);
  intc_enable_irq(0x1d);
  intc_enable_irq(0x1e);
  intc_enable_irq(0x1f);
  intc_enable_irq(0x20);
  intc_enable_irq(0x21);
  intc_enable_irq(0x23);
  intc_enable_irq(0x37);
  intc_enable_irq(0x35);
  intc_enable_irq(0x32);
  intc_enable_irq(0x34);
  intc_enable_irq(0x36);
  intc_enable_irq(10);
  intc_enable_irq(0xb);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void mac_irq(void)

{
  void_fn *pvVar1;
  
  if ((_DAT_44910000 == 0) && (_DAT_44910004 == 0)) {
    return;
  }
  pvVar1 = intc_irq_handlers[_DAT_44910040];
  if (pvVar1 == (void_fn *)0x0) {
    assert_err("intc_irq_handlers[irq_idx] != NULL","module",0x9d);
  }
  (*pvVar1)();
  ipc_emb_notify();
  return;
}



void bl_irq_handler(void)

{
  ipc_host_disable_irq_e2a();
  ke_evt_set(0x40000000);
  ipc_emb_notify();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_pwr_mgt_setf(uint8_t pwrmgt)

{
  uint uVar1;
  undefined3 in_register_00002029;
  
  uVar1 = CONCAT31(in_register_00002029,pwrmgt) << 2;
  if ((uVar1 & 0xfffffffb) != 0) {
    assert_err("(((uint32_t)pwrmgt << 2) & ~((uint32_t)0x00000004)) == 0","module",0x952);
  }
  _DAT_44b0004c = _DAT_44b0004c & 0xfffffffb | uVar1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

chan_ctxt_tag * chan_get_next_chan(void)

{
  int iVar1;
  int iVar2;
  chan_ctxt_tag *pcVar3;
  uint uVar4;
  ushort uVar5;
  
  iVar2 = _DAT_44b00120;
  iVar1 = DAT_4201d1e8;
  if (DAT_4201d1f8 != (chan_ctxt_tag *)0x0) {
    if ((DAT_4201d1e8 != 0) && (*(char *)(DAT_4201d1e8 + 10) == '\x02')) {
      return DAT_4201d1f8;
    }
    if (-1 < (_DAT_44b00120 + 0x1400) - DAT_4201d21c) {
      return DAT_4201d1f8;
    }
    if (DAT_4201d1f8->status == '\x04') {
      return DAT_4201d1f8;
    }
  }
  pcVar3 = DAT_4201d1f8;
  if ((DAT_4201d1e8 != 0) && (*(int *)(DAT_4201d1e8 + 4) - DAT_4201d21c < 0)) {
    pcVar3 = vif_info_tab[*(byte *)(DAT_4201d1e8 + 8)].chan_ctxt;
    if (pcVar3 == (chan_ctxt_tag *)0x0) {
      assert_err("p_next_chan_entry","module",0x129);
    }
    if (-1 < (iVar2 + 0x1400) - *(int *)(iVar1 + 4)) goto LAB_230190f4;
    uVar4 = 0;
    if (pcVar3->nb_res_slots < pcVar3->nb_rem_slots) {
      uVar4 = (uint)(ushort)(pcVar3->nb_rem_slots - pcVar3->nb_res_slots);
    }
    if (((uint)(*(int *)(iVar1 + 4) - iVar2) >> 10 & 0xffff) <= uVar4) {
      return pcVar3;
    }
  }
  uVar5 = 0;
  if (chan_ctxt_pool[0].status != '\0') {
    pcVar3 = chan_ctxt_pool;
    uVar5 = chan_ctxt_pool[0].nb_rem_slots;
  }
  if ((chan_ctxt_pool[1].status != '\0') && (uVar5 <= chan_ctxt_pool[1].nb_rem_slots)) {
    pcVar3 = chan_ctxt_pool + 1;
    uVar5 = chan_ctxt_pool[1].nb_rem_slots;
  }
  if ((chan_ctxt_pool[2].status != '\0') && (uVar5 <= chan_ctxt_pool[2].nb_rem_slots)) {
    return chan_ctxt_pool + 2;
  }
LAB_230190f4:
  if (pcVar3 == (chan_ctxt_tag *)0x0) {
    assert_err("p_next_chan_entry","module",0x175);
  }
  return pcVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_conn_less_delay_prog(void)

{
  DAT_4201d248 = DAT_4201d248 | 0x10;
  mm_timer_set((mm_timer_tag *)&DAT_4201d230,_DAT_44b00120 + 30000);
  return;
}



void chan_upd_nb_rem_slots(uint32_t current_time)

{
  ushort uVar1;
  ushort uVar2;
  int in_a1;
  uint uVar3;
  
  uVar1 = *(ushort *)current_time;
  uVar3 = (uint)(in_a1 - DAT_4201d244) >> 10 & 0xffff;
  uVar2 = (ushort)uVar3;
  if (uVar1 < uVar3) {
    uVar2 = uVar1;
  }
  *(ushort *)current_time = uVar1 - uVar2;
  return;
}



_Bool chan_tbtt_detect_conflict(void)

{
  byte bVar1;
  int in_a0;
  int in_a1;
  
  if (((in_a0 - in_a1 < 0) || (bVar1 = 1, (in_a1 + 0x2800) - in_a0 < 0)) &&
     (bVar1 = 0, -1 < in_a1 - in_a0)) {
    bVar1 = ~(byte)((uint)((in_a0 - in_a1) + 0x2800) >> 0x18) >> 7;
  }
  return (_Bool)bVar1;
}



void chan_tbtt_insert(chan_tbtt_tag *p_tbtt_entry)

{
  bool bVar1;
  co_list_hdr list_hdr;
  char cVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  co_list_hdr cVar4;
  uint uVar5;
  uint uVar6;
  co_list_hdr prev_element;
  co_list_hdr cVar7;
  
  list_hdr = (co_list_hdr)0x0;
  cVar2 = '\0';
  cVar4 = DAT_4201d1e8;
  prev_element = (co_list_hdr)0x0;
  while (cVar4 != (co_list_hdr)0x0) {
    if (cVar4 == (co_list_hdr)p_tbtt_entry) {
      assert_err("p_elem != p_tbtt_entry","module",0x668);
    }
    uVar5 = p_tbtt_entry->time;
    uVar6 = *(uint *)((int)cVar4 + 4);
    cVar7 = cVar4;
    if (*(char *)((int)cVar4 + 10) == '\x02') {
      if ((uVar5 < uVar6) ||
         (_Var3 = chan_tbtt_detect_conflict(), CONCAT31(extraout_var_00,_Var3) != 0)) {
LAB_23019264:
        cVar2 = '\x01';
        bVar1 = false;
        list_hdr = (co_list_hdr)p_tbtt_entry;
        goto LAB_230192ac;
      }
    }
    else {
      _Var3 = chan_tbtt_detect_conflict();
      if (CONCAT31(extraout_var,_Var3) == 0) {
        if (uVar5 < uVar6) break;
      }
      else {
        if (p_tbtt_entry->priority <= *(byte *)((int)cVar4 + 9)) goto LAB_23019264;
        if (list_hdr == (co_list_hdr)0x0) {
          list_hdr = cVar4;
        }
        cVar2 = cVar2 + '\x01';
        cVar7 = prev_element;
      }
    }
    cVar4 = *(co_list_hdr *)cVar4;
    prev_element = cVar7;
  }
  bVar1 = true;
LAB_230192ac:
  while (cVar2 = cVar2 + -1, cVar2 != -1) {
    if (list_hdr == (co_list_hdr)0x0) {
      assert_err("p_delay_elem","module",0x6b1);
    }
    if (list_hdr != (co_list_hdr)p_tbtt_entry) {
      if (*(char *)((int)list_hdr + 10) == '\x01') {
        mm_timer_clear((mm_timer_tag *)&DAT_4201d200);
        *(undefined *)((int)list_hdr + 10) = 0;
      }
      co_list_extract((co_list *)&DAT_4201d1e8,(co_list_hdr *)list_hdr);
    }
    co_list_push_back((co_list *)&DAT_4201d1f0,(co_list_hdr *)list_hdr);
    list_hdr = *(co_list_hdr *)list_hdr;
  }
  if (!bVar1) {
    return;
  }
  co_list_insert_after
            ((co_list *)&DAT_4201d1e8,(co_list_hdr *)prev_element,(co_list_hdr *)p_tbtt_entry);
  return;
}



