pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_upd_ctxt_status(chan_ctxt_tag *p_chan_entry,uint8_t next_status)

{
  undefined3 in_register_0000202d;
  int iVar1;
  ushort uVar2;
  int iVar3;
  uint32_t value;
  
  iVar1 = CONCAT31(in_register_0000202d,next_status);
  if (iVar1 == 2) {
    value = 0;
    if (2 < p_chan_entry->idx) goto LAB_23019324;
    iVar3 = 4000;
  }
  else {
    value = 0;
    if (iVar1 != 4) goto LAB_23019324;
    if (p_chan_entry->idx < 3) {
      if (1 < DAT_4201d24a) {
        if ((p_chan_entry->nb_res_slots < p_chan_entry->nb_rem_slots) &&
           (uVar2 = p_chan_entry->nb_rem_slots - p_chan_entry->nb_res_slots, 4 < uVar2)) {
          iVar3 = (uint)uVar2 << 10;
          DAT_4201d244 = _DAT_44b00120;
          goto LAB_23019322;
        }
      }
      iVar1 = 5;
      value = 0;
      goto LAB_23019324;
    }
    iVar3 = (uint)p_chan_entry->nb_rem_slots << 10;
  }
LAB_23019322:
  value = iVar3 + _DAT_44b00120;
LAB_23019324:
  p_chan_entry->status = (uint8_t)iVar1;
  if (value != 0) {
    DAT_4201d228 = p_chan_entry;
    mm_timer_set((mm_timer_tag *)&DAT_4201d220,value);
    return;
  }
  if (iVar1 != 3) {
    mm_timer_clear((mm_timer_tag *)&DAT_4201d220);
    return;
  }
  return;
}



void chan_switch_start(chan_ctxt_tag *p_chan_entry)

{
  undefined4 *puVar1;
  
  if (DAT_4201d1f8 == p_chan_entry) {
    if ((1 < DAT_4201d24a) && (DAT_4201d1f8->idx < 3)) {
      chan_upd_ctxt_status(p_chan_entry,'\x04');
      return;
    }
  }
  else {
    if (DAT_4201d1fc == (chan_ctxt_tag *)0x0) {
      DAT_4201d1fc = p_chan_entry;
      chan_upd_ctxt_status(p_chan_entry,'\x02');
      puVar1 = (undefined4 *)ke_msg_alloc(0x60,0,0xff,4);
      *puVar1 = 0x230199ec;
      ke_msg_send();
      return;
    }
  }
  return;
}



void chan_conn_less_delay_evt(void *env)

{
  chan_ctxt_tag *p_chan_entry;
  
  if ((DAT_4201d248 & 1) == 0) {
    if ((DAT_4201d248 & 2) == 0) {
      return;
    }
    if ((DAT_4201d248 & 8) != 0) {
      assert_err("(chan_env.status & CO_BIT(CHAN_ENV_SCAN_BIT)) == 0","module",0x2ce);
    }
    p_chan_entry = chan_ctxt_pool + 3;
    DAT_4201d248 = DAT_4201d248 & 0xfd | 8;
  }
  else {
    if ((DAT_4201d248 & 4) != 0) {
      assert_err("(chan_env.status & CO_BIT(CHAN_ENV_ROC_BIT)) == 0","module",0x2c0);
    }
    p_chan_entry = chan_ctxt_pool + 4;
    DAT_4201d248 = DAT_4201d248 & 0xfe | 4;
  }
  if (DAT_4201d1fc != 0) {
    return;
  }
  chan_switch_start(p_chan_entry);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_tbtt_switch_evt(void *env)

{
  ushort uVar1;
  undefined4 uVar2;
  ushort uVar3;
  chan_ctxt_tag *p_chan_entry;
  
  uVar2 = _DAT_44b00120;
  if ((1 < DAT_4201d24a) && ((DAT_4201d248 & 0xc) == 0)) {
    p_chan_entry = vif_info_tab[*(byte *)((int)env + 8)].chan_ctxt;
    if ((DAT_4201d1fc == (chan_ctxt_tag *)0x0) || (DAT_4201d1fc == p_chan_entry)) {
      *(undefined *)((int)env + 9) = 0;
      chan_upd_nb_rem_slots(DAT_4201d1f8 + 0x12);
      uVar1 = p_chan_entry->nb_res_slots;
      uVar3 = uVar1;
      if (10 < uVar1) {
        uVar3 = 10;
      }
      p_chan_entry->nb_res_slots = uVar1 - uVar3;
      DAT_4201d244 = uVar2;
      *(undefined *)((int)env + 10) = 2;
      if (DAT_4201d1fc == (chan_ctxt_tag *)0x0) {
        chan_switch_start(p_chan_entry);
        return;
      }
    }
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_tbtt_schedule(chan_tbtt_tag *p_tbtt_entry)

{
  void *pvVar1;
  chan_tbtt_tag *p_tbtt_entry_00;
  uint uVar2;
  uint32_t uVar3;
  
  if (p_tbtt_entry != (chan_tbtt_tag *)0x0) {
    chan_tbtt_insert(p_tbtt_entry);
    while (DAT_4201d1f0 != 0) {
      p_tbtt_entry_00 = (chan_tbtt_tag *)co_list_pop_front((co_list *)&DAT_4201d1f0);
      uVar2 = (uint)p_tbtt_entry_00->vif_index;
      if (vif_info_tab[uVar2].type == '\0') {
        uVar3 = sta_info_tab[vif_info_tab[uVar2].u[4]].bcn_int;
      }
      else {
        uVar3 = (uint)*(ushort *)(vif_info_tab[uVar2].u + 0x2e2) << 10;
      }
      p_tbtt_entry_00->time = uVar3 + p_tbtt_entry_00->time;
      if (p_tbtt_entry_00->priority < 5) {
        p_tbtt_entry_00->priority = p_tbtt_entry_00->priority + 1;
      }
      chan_tbtt_insert(p_tbtt_entry_00);
    }
  }
  pvVar1 = DAT_4201d1e8;
  if ((DAT_4201d1e8 != (void *)0x0) && (*(char *)((int)DAT_4201d1e8 + 10) == '\0')) {
    if ((*(int *)((int)DAT_4201d1e8 + 4) - _DAT_44b00120) + -2000 < 0) {
      chan_tbtt_switch_evt(DAT_4201d1e8);
      return;
    }
    DAT_4201d208 = DAT_4201d1e8;
    *(undefined *)((int)DAT_4201d1e8 + 10) = 1;
    mm_timer_set((mm_timer_tag *)&DAT_4201d200,*(uint32_t *)((int)pvVar1 + 4));
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_cde_evt(void *env)

{
  int iVar1;
  uint uVar2;
  int iVar3;
  chan_ctxt_tag *p_chan_entry;
  int iVar4;
  co_list_hdr *pcVar5;
  co_list_hdr cVar6;
  undefined2 uVar7;
  ushort uVar8;
  uint uVar9;
  
  iVar4 = _DAT_44b00120;
  p_chan_entry = DAT_4201d1fc;
  if ((1 < DAT_4201d24a) && (uVar2 = (uint)DAT_4201d248 & 0x2c, (DAT_4201d248 & 0x2c) == 0)) {
    mm_timer_set((mm_timer_tag *)&DAT_4201d210,DAT_4201d240 + _DAT_44b00120);
    DAT_4201d244 = iVar4;
    uVar9 = 0;
    cVar6 = (co_list_hdr)vif_mgmt_env.used_list.first;
    while (cVar6 != (co_list_hdr)0x0) {
      pcVar5 = ((co_list_hdr *)((int)cVar6 + 0x40))->next;
      if (pcVar5 != (co_list_hdr *)0x0) {
        uVar2 = uVar2 + 1 & 0xff;
        if (((td_env[*(byte *)((int)cVar6 + 0x57)].status & 3) != 0) ||
           (*(char *)&((co_list_hdr *)((int)cVar6 + 0x58))->next == '\0')) {
          uVar9 = uVar9 + 1 & 0xff;
        }
        *(undefined2 *)&pcVar5[4].next = 0;
        *(undefined2 *)&pcVar5[5].next = 0;
      }
      cVar6 = *(co_list_hdr *)cVar6;
    }
    if (uVar2 != DAT_4201d240 / 0xc800) {
      assert_warn("nb_vifs == (chan_env.cde_dur_us / (CHAN_VIF_NB_SLOTS * CHAN_SLOT_DURATION_US))",
                  "module",0x268);
    }
    if ((uVar9 == 0) || (uVar2 == uVar9)) {
      iVar3 = 0;
      iVar4 = 0x32;
    }
    else {
      iVar4 = 10;
      iVar3 = (int)((uVar2 - uVar9) * 0x280000 >> 0x10) / (int)uVar9;
    }
    cVar6 = (co_list_hdr)vif_mgmt_env.used_list.first;
    while (cVar6 != (co_list_hdr)0x0) {
      pcVar5 = ((co_list_hdr *)((int)cVar6 + 0x40))->next;
      if (pcVar5 != (co_list_hdr *)0x0) {
        if (((td_env[*(byte *)((int)cVar6 + 0x57)].status & 3) != 0) ||
           (iVar1 = iVar4, *(char *)&((co_list_hdr *)((int)cVar6 + 0x58))->next == '\0')) {
          iVar1 = iVar3 + 0x32;
        }
        uVar7 = (undefined2)(((uint)*(ushort *)&pcVar5[4].next + iVar1) * 0x10000 >> 0x10);
        *(undefined2 *)&pcVar5[4].next = uVar7;
        *(undefined2 *)((int)&pcVar5[4].next + 2) = uVar7;
        if (*(char *)((int)cVar6 + 0x56) == '\0') {
          uVar2 = sta_info_tab[*(byte *)&((co_list_hdr *)((int)cVar6 + 0x60))->next].bcn_int;
        }
        else {
          uVar2 = (uint)*(ushort *)((int)cVar6 + 0x33e) << 10;
        }
        uVar8 = (ushort)(DAT_4201d240 / uVar2);
        if (DAT_4201d240 / uVar2 == 0) {
          uVar8 = 1;
        }
        *(ushort *)&pcVar5[5].next = (uVar8 & 0xff) * 10 + *(short *)&pcVar5[5].next;
      }
      cVar6 = *(co_list_hdr *)cVar6;
    }
    if (DAT_4201d1f8 != (chan_ctxt_tag *)0x0) {
      chan_upd_ctxt_status(DAT_4201d1f8,'\x01');
    }
    p_chan_entry = chan_get_next_chan();
    if (env == (void *)0x0) {
      chan_switch_start(p_chan_entry);
      return;
    }
  }
  DAT_4201d1fc = p_chan_entry;
  return;
}


