pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'chan_pre_switch_channel'
Cause: Exception while decompiling 230197f8: Decompiler process died

*/


void chan_goto_idle_cb(void)

{
  undefined uVar1;
  co_list_hdr *pcVar2;
  co_list_hdr cVar3;
  uint8_t uVar4;
  undefined3 extraout_var;
  int iVar5;
  
  mm_force_idle_req();
  pcVar2 = DAT_4201d1f8;
  cVar3 = (co_list_hdr)vif_mgmt_env.used_list.first;
  if (((DAT_4201d1f8 != (co_list_hdr *)0x0) && ((DAT_4201d248 & 0x20) == 0)) &&
     ((ps_env.ps_on == false || ((ps_env.prevent_sleep & 8) != 0)))) {
    iVar5 = 0;
    blmac_pwr_mgt_setf('\x01');
    while (cVar3 != (co_list_hdr)0x0) {
      if ((((pcVar2 == ((co_list_hdr *)((int)cVar3 + 0x40))->next) &&
           (*(char *)((int)cVar3 + 0x56) == '\0')) &&
          (*(char *)&((co_list_hdr *)((int)cVar3 + 0x58))->next != '\0')) &&
         (*(char *)&((co_list_hdr *)((int)cVar3 + 0x60))->next != -1)) {
        uVar1 = *(undefined *)((int)&pcVar2[5].next + 2);
        *(undefined *)((int)&pcVar2[5].next + 2) = 6;
        uVar4 = txl_frame_send_null_frame
                          (*(uint8_t *)&((co_list_hdr *)((int)cVar3 + 0x60))->next,chan_tx_cfm,
                           (void *)0x0);
        if (CONCAT31(extraout_var,uVar4) == 0) {
          iVar5 = iVar5 + 1;
        }
        *(undefined *)((int)&pcVar2[5].next + 2) = uVar1;
      }
      cVar3 = *(co_list_hdr *)cVar3;
    }
    DAT_4201d249 = (undefined)iVar5;
    if (iVar5 != 0) {
      chan_upd_ctxt_status(DAT_4201d1fc,'\x03');
      mm_active();
      return;
    }
  }
  chan_pre_switch_channel();
  return;
}



void chan_tx_cfm(void *dummy,uint32_t status)

{
  if (DAT_4201d249 == '\0') {
    assert_err("chan_env.cfm_cnt","module",0x48f);
  }
  DAT_4201d249 = DAT_4201d249 + -1;
  if (DAT_4201d249 == '\0') {
    mm_force_idle_req();
    chan_pre_switch_channel();
    return;
  }
  return;
}


/*
Unable to decompile 'chan_ctxt_op_evt'
Cause: Exception while decompiling 23019b24: Decompiler process died

*/


void chan_init(void)

{
  chan_ctxt_tag *__s;
  int iVar1;
  
  __s = chan_ctxt_pool;
  memset(&chan_env,0,0x74);
  iVar1 = 0;
  do {
    memset(__s,0,0x1c);
    *(undefined2 *)(&__s->channel + 1) = 0xff;
    *(undefined *)((int)&__s->nb_res_slots + 3) = 0xff;
    if (iVar1 < 3) {
      co_list_push_back((co_list *)&chan_env,(co_list_hdr *)__s);
    }
    else {
      if (iVar1 == 3) {
        chan_ctxt_pool[3].channel.center2_freq = 0;
        chan_ctxt_pool[3].channel.type = '\0';
      }
    }
    iVar1 = iVar1 + 1;
    __s = __s + 1;
  } while (iVar1 != 5);
  DAT_4201d204 = chan_tbtt_switch_evt;
  DAT_4201d214 = chan_cde_evt;
  DAT_4201d218 = 0;
  DAT_4201d224 = chan_ctxt_op_evt;
  DAT_4201d234 = chan_conn_less_delay_evt;
  return;
}



void chan_scan_req(uint8_t band,uint16_t freq,int8_t pwr,uint32_t duration_us,uint8_t vif_index)

{
  if (chan_ctxt_pool[3].idx != -1) {
    assert_err("p_scan_chan->idx == CHAN_CTXT_UNUSED","module",0x8a1);
  }
  chan_ctxt_pool[3].taskid = 0xff;
  chan_ctxt_pool[3]._22_2_ = 0x301;
  chan_ctxt_pool[3].nb_rem_slots = (uint16_t)(duration_us >> 10);
  if ((DAT_4201d248 & 0x10) == 0) {
    chan_ctxt_pool[3].channel.band = band;
    chan_ctxt_pool[3].channel.prim20_freq = freq;
    chan_ctxt_pool[3].channel.center1_freq = freq;
    chan_ctxt_pool[3].channel.tx_power = pwr;
    chan_ctxt_pool[3].vif_index = vif_index;
    DAT_4201d248 = DAT_4201d248 | 2;
    chan_conn_less_delay_prog();
    return;
  }
  chan_ctxt_pool[3].channel.band = band;
  chan_ctxt_pool[3].channel.prim20_freq = freq;
  chan_ctxt_pool[3].channel.center1_freq = freq;
  chan_ctxt_pool[3].channel.tx_power = pwr;
  chan_ctxt_pool[3].taskid = 0xff;
  chan_ctxt_pool[3]._22_2_ = 0x301;
  chan_ctxt_pool[3].vif_index = vif_index;
  DAT_4201d248 = DAT_4201d248 | 2;
  return;
}



uint8_t chan_roc_req(mm_remain_on_channel_req *req,ke_task_id_t taskid)

{
  byte bVar1;
  undefined2 in_register_0000202e;
  
  if (req->op_code == '\0') {
    if (chan_ctxt_pool[4].idx == -1) {
      chan_ctxt_pool[4].idx = '\x04';
      chan_ctxt_pool[4].channel.band = req->band;
      chan_ctxt_pool[4].channel.type = req->type;
      chan_ctxt_pool[4].channel.prim20_freq = req->prim20_freq;
      chan_ctxt_pool[4].channel.center1_freq = req->center1_freq;
      chan_ctxt_pool[4].channel.center2_freq = req->center2_freq;
      chan_ctxt_pool[4].status = '\x01';
      chan_ctxt_pool[4].nb_rem_slots = (uint16_t)(req->duration_ms * 1000 >> 10);
      chan_ctxt_pool[4].vif_index = req->vif_index;
      chan_ctxt_pool[4].channel.tx_power = req->tx_power;
      chan_ctxt_pool[4].taskid = taskid;
      if (CONCAT22(in_register_0000202e,taskid) != 0) {
        bVar1 = DAT_4201d248 & 0x10;
        if ((DAT_4201d248 & 0x10) != 0) {
          chan_ctxt_pool[4].status = '\x01';
          chan_ctxt_pool[4].idx = '\x04';
          DAT_4201d248 = DAT_4201d248 | 1;
          return '\0';
        }
        DAT_4201d248 = DAT_4201d248 | 1;
        chan_conn_less_delay_prog();
        return bVar1;
      }
      DAT_4201d248 = DAT_4201d248 | 4;
      if (DAT_4201d1fc != 0) {
        chan_ctxt_pool[4].status = '\x01';
        chan_ctxt_pool[4].idx = '\x04';
        return '\0';
      }
      chan_switch_start(chan_ctxt_pool + 4);
      return '\0';
    }
  }
  else {
    if (req->op_code == '\x01') {
      if (chan_ctxt_pool[4].idx != -1) {
        if (chan_ctxt_pool[4].status < 4) {
          if (chan_ctxt_pool[4].status < 2) {
            if (chan_ctxt_pool[4].status == '\x01') {
              DAT_4201d248 = DAT_4201d248 & 0xfe;
            }
          }
          else {
            DAT_4201d1fc = 0;
            DAT_4201d248 = DAT_4201d248 & 0xfb;
          }
        }
        else {
          if (chan_ctxt_pool[4].status == '\x04') {
            mm_timer_clear((mm_timer_tag *)&DAT_4201d220);
            chan_ctxt_op_evt(chan_ctxt_pool + 4);
          }
        }
        chan_ctxt_pool[4].idx = -1;
        if ((DAT_4201d248 & 0x12) == 0x10) {
          DAT_4201d248 = DAT_4201d248 & 0xef;
          mm_timer_clear((mm_timer_tag *)&DAT_4201d230);
          DAT_4201d248 = DAT_4201d248 & 0xef;
        }
      }
      return '\0';
    }
  }
  return '\x01';
}



