pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint8_t chan_ctxt_add(mm_chan_ctxt_add_req *p_add_req,uint8_t *idx)

{
  uint8_t uVar1;
  int iVar2;
  co_list_hdr *pcVar3;
  int iVar4;
  chan_ctxt_tag *pcVar5;
  
  pcVar5 = chan_ctxt_pool;
  iVar4 = 0;
  do {
    if (pcVar5->idx != -1) {
      iVar2 = memcmp(p_add_req,&pcVar5->channel,8);
      if (iVar2 == 0) {
        *idx = (uint8_t)iVar4;
        return (uint8_t)iVar2;
      }
    }
    iVar4 = iVar4 + 1;
    pcVar5 = pcVar5 + 1;
  } while (iVar4 != 3);
  pcVar3 = co_list_pop_front((co_list *)&chan_env);
  if (pcVar3 != (co_list_hdr *)0x0) {
    uVar1 = (char)((int)(pcVar3 + -0x10807453) >> 2) * -0x49;
    *(uint8_t *)((int)&pcVar3[5].next + 3) = uVar1;
    *idx = uVar1;
    *(uint8_t *)&pcVar3[1].next = p_add_req->band;
    *(uint8_t *)((int)&pcVar3[1].next + 1) = p_add_req->type;
    *(uint16_t *)&pcVar3[2].next = p_add_req->center1_freq;
    *(uint16_t *)((int)&pcVar3[2].next + 2) = p_add_req->center2_freq;
    *(uint16_t *)((int)&pcVar3[1].next + 2) = p_add_req->prim20_freq;
    *(int8_t *)&pcVar3[3].next = p_add_req->tx_power;
  }
  return (uint8_t)(pcVar3 == (co_list_hdr *)0x0);
}



void chan_ctxt_del(uint8_t chan_idx)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,chan_idx);
  if (chan_ctxt_pool[iVar1].idx == -1) {
    assert_err("p_chan_entry->idx != CHAN_CTXT_UNUSED","module",0x989);
  }
  if (chan_ctxt_pool[iVar1].nb_linked_vif != '\0') {
    assert_err("p_chan_entry->nb_linked_vif == 0","module",0x98b);
  }
  co_list_push_back((co_list *)&chan_env,(co_list_hdr *)(chan_ctxt_pool + iVar1));
  memset(chan_ctxt_pool + iVar1,0,0x1c);
  chan_ctxt_pool[iVar1].taskid = 0xff;
  chan_ctxt_pool[iVar1].idx = -1;
  return;
}


/*
Unable to decompile 'chan_ctxt_update'
Cause: Exception while decompiling 2301a0c2: Decompiler process died

*/


void chan_tbtt_switch_update(vif_info_tag *p_vif_entry,uint32_t tbtt_time)

{
  if ((((p_vif_entry->chan_ctxt != (chan_ctxt_tag *)0x0) && (p_vif_entry->chan_ctxt->status != '\0')
       ) && ((p_vif_entry->tbtt_switch).time != tbtt_time - 0x9c4)) &&
     (((p_vif_entry->tbtt_switch).time = tbtt_time - 0x9c4, 1 < DAT_4201d24a &&
      ((p_vif_entry->tbtt_switch).status != '\x02')))) {
    (p_vif_entry->tbtt_switch).status = '\0';
    co_list_extract((co_list *)&DAT_4201d1e8,(co_list_hdr *)&p_vif_entry->tbtt_switch);
    chan_tbtt_schedule(&p_vif_entry->tbtt_switch);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void chan_bcn_to_evt(vif_info_tag *p_vif_entry)

{
  ushort uVar1;
  int iVar2;
  chan_ctxt_tag *p_chan_entry;
  ushort uVar3;
  uint uVar4;
  
  iVar2 = _DAT_44b00120;
  if ((p_vif_entry->tbtt_switch).status == '\x02') {
    (p_vif_entry->tbtt_switch).status = '\0';
    p_chan_entry = DAT_4201d1f8;
    co_list_extract((co_list *)&DAT_4201d1e8,(co_list_hdr *)&p_vif_entry->tbtt_switch);
    if (((1 < DAT_4201d24a) &&
        (chan_tbtt_schedule(&p_vif_entry->tbtt_switch), (DAT_4201d248 & 0xc) == 0)) &&
       (DAT_4201d1fc == 0)) {
      chan_upd_nb_rem_slots((uint32_t)&p_chan_entry->nb_rem_slots);
      uVar1 = p_chan_entry->nb_res_slots;
      if (uVar1 != 0) {
        uVar4 = (uint)(iVar2 - DAT_4201d244) >> 10 & 0xffff;
        uVar3 = (ushort)uVar4;
        if (uVar1 < uVar4) {
          uVar3 = uVar1;
        }
        p_chan_entry->nb_res_slots = uVar1 - uVar3;
      }
      DAT_4201d244 = iVar2;
      p_chan_entry = chan_get_next_chan();
      if (DAT_4201d1f8 != p_chan_entry) {
        chan_switch_start(p_chan_entry);
        return;
      }
    }
  }
  return;
}



void chan_bcn_detect_start(vif_info_tag *p_vif_entry)

{
  byte bVar1;
  chan_ctxt_tag *pcVar2;
  undefined *puVar3;
  
  pcVar2 = p_vif_entry->chan_ctxt;
  if (pcVar2 == (chan_ctxt_tag *)0x0) {
    assert_err("p_chan_entry","module",0xb19);
  }
  if (((DAT_4201d248 & 0x40) == 0) && (1 < DAT_4201d24a)) {
    bVar1 = p_vif_entry->u[4];
    puVar3 = (undefined *)ke_msg_alloc(0x46,0,0,0x14);
    *puVar3 = 0;
    puVar3[1] = p_vif_entry->index;
    puVar3[2] = (pcVar2->channel).band;
    puVar3[3] = (pcVar2->channel).type;
    *(uint16_t *)(puVar3 + 4) = (pcVar2->channel).prim20_freq;
    *(uint16_t *)(puVar3 + 6) = (pcVar2->channel).center1_freq;
    *(uint16_t *)(puVar3 + 8) = (pcVar2->channel).center2_freq;
    *(uint *)(puVar3 + 0xc) = (sta_info_tab[bVar1].bcn_int - 5000) / 1000;
    puVar3[0x10] = (pcVar2->channel).tx_power;
    ke_msg_send();
    DAT_4201d248 = DAT_4201d248 | 0x40;
  }
  return;
}



_Bool chan_is_on_channel(vif_info_tag *p_vif_entry)

{
  chan_ctxt_tag *pcVar1;
  
  if (DAT_4201d1f8 != 0) {
    if (*(byte *)(DAT_4201d1f8 + 0x17) < 3) {
      pcVar1 = (chan_ctxt_tag *)((int)p_vif_entry->chan_ctxt - DAT_4201d1f8);
    }
    else {
      pcVar1 = (chan_ctxt_tag *)((uint)*(byte *)(DAT_4201d1f8 + 0x19) - (uint)p_vif_entry->index);
    }
    return (_Bool)(pcVar1 == (chan_ctxt_tag *)0x0);
  }
  return false;
}



_Bool chan_is_tx_allowed(vif_info_tag *p_vif_entry)

{
  bool bVar1;
  undefined3 extraout_var;
  
  bVar1 = (bool)chan_is_on_channel(p_vif_entry);
  if ((CONCAT31(extraout_var,bVar1) != 0) && (DAT_4201d1fc != 0)) {
    bVar1 = *(char *)(DAT_4201d1f8 + 0x16) == '\x06';
  }
  return (_Bool)bVar1;
}



_Bool chan_is_on_operational_channel(vif_info_tag *p_vif_entry)

{
  bool bVar1;
  
  bVar1 = false;
  if ((DAT_4201d1f8 != (chan_ctxt_tag *)0x0) && (bVar1 = false, DAT_4201d1f8->idx < 3)) {
    bVar1 = p_vif_entry->chan_ctxt == DAT_4201d1f8;
  }
  return (_Bool)bVar1;
}



void chan_update_tx_power(chan_ctxt_tag *p_chan_entry)

{
  int8_t iVar1;
  int8_t iVar2;
  char cVar3;
  
  if (p_chan_entry->nb_linked_vif == '\0') {
    return;
  }
  iVar2 = '\x7f';
  if ((p_chan_entry == vif_info_tab[0].chan_ctxt) &&
     (iVar2 = vif_info_tab[0].user_tx_power,
     vif_info_tab[0].tx_power < vif_info_tab[0].user_tx_power)) {
    iVar2 = vif_info_tab[0].tx_power;
  }
  iVar1 = iVar2;
  if (p_chan_entry == vif_info_tab[1].chan_ctxt) {
    iVar1 = vif_info_tab[1].user_tx_power;
    if (iVar2 < vif_info_tab[1].user_tx_power) {
      iVar1 = iVar2;
    }
    cVar3 = vif_info_tab[1].tx_power;
    if (vif_info_tab[1].tx_power < iVar1) goto LAB_2301a43a;
  }
  cVar3 = iVar1;
  if (iVar1 == '\x7f') {
    return;
  }
LAB_2301a43a:
  (p_chan_entry->channel).tx_power = cVar3;
  return;
}



void chan_ctxt_link(uint8_t vif_idx,uint8_t chan_idx)

{
  uint8_t uVar1;
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  int iVar2;
  chan_ctxt_tag *p_chan_entry;
  
