pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  iVar2 = CONCAT31(in_register_0000202d,chan_idx);
  p_chan_entry = chan_ctxt_pool + iVar2;
  if (vif_info_tab[CONCAT31(in_register_00002029,vif_idx)].chan_ctxt != (chan_ctxt_tag *)0x0) {
    assert_err("p_vif_entry->chan_ctxt == NULL","module",0x99c);
  }
  if (chan_ctxt_pool[iVar2].idx == -1) {
    assert_err("p_chan_entry->idx != CHAN_CTXT_UNUSED","module",0x99d);
  }
  uVar1 = chan_ctxt_pool[iVar2].nb_linked_vif + '\x01';
  DAT_4201d240 = DAT_4201d240 + 0xc800;
  vif_info_tab[CONCAT31(in_register_00002029,vif_idx)].chan_ctxt = p_chan_entry;
  chan_ctxt_pool[iVar2].nb_linked_vif = uVar1;
  if (uVar1 == '\x01') {
    chan_ctxt_pool[iVar2].status = '\x01';
    DAT_4201d24a = DAT_4201d24a + '\x01';
    co_list_push_back((co_list *)&p_chan_entry,(co_list_hdr *)p_chan_entry);
    if (DAT_4201d1fc == 0) {
      if ((DAT_4201d248 & 0xc) == 0) {
        if (DAT_4201d24a == '\x01') {
          chan_switch_start(p_chan_entry);
        }
        else {
          chan_cde_evt((void *)0x0);
        }
      }
    }
    else {
      *(undefined *)(DAT_4201d1fc + 0x16) = 1;
      DAT_4201d1fc = 0;
    }
  }
  chan_update_tx_power(p_chan_entry);
  return;
}



void chan_ctxt_unlink(uint8_t vif_idx)

{
  chan_ctxt_tag *pcVar1;
  chan_ctxt_tag *p_chan_entry;
  undefined3 in_register_00002029;
  int iVar2;
  
  iVar2 = CONCAT31(in_register_00002029,vif_idx);
  p_chan_entry = vif_info_tab[iVar2].chan_ctxt;
  if (p_chan_entry == (chan_ctxt_tag *)0x0) {
    assert_err("p_chan_entry != NULL","module",0x9e4);
  }
  co_list_extract((co_list *)&DAT_4201d1e8,(co_list_hdr *)&vif_info_tab[iVar2].tbtt_switch);
  vif_info_tab[iVar2].tbtt_switch.status = '\0';
  vif_info_tab[iVar2].chan_ctxt = (chan_ctxt_tag *)0x0;
  p_chan_entry->nb_linked_vif = p_chan_entry->nb_linked_vif + -1;
  pcVar1 = DAT_4201d1fc;
  if (p_chan_entry->status != '\0') {
    DAT_4201d240 = DAT_4201d240 + -0xc800;
    if (p_chan_entry->nb_linked_vif != '\0') goto LAB_2301a656;
    co_list_extract((co_list *)&p_chan_entry,(co_list_hdr *)p_chan_entry);
    p_chan_entry->status = '\0';
    DAT_4201d24a = DAT_4201d24a - 1;
    if (DAT_4201d1f8 == p_chan_entry) {
      DAT_4201d1f8 = (chan_ctxt_tag *)0x0;
LAB_2301a622:
      if (pcVar1 == (chan_ctxt_tag *)0x0) {
        if (DAT_4201d24a < 2) {
          if (DAT_4201d24a == 1) {
            chan_switch_start(p_chan_entry);
          }
        }
        else {
          chan_cde_evt((void *)0x0);
        }
        goto LAB_2301a648;
      }
    }
    else {
      if (pcVar1 != p_chan_entry) goto LAB_2301a622;
      DAT_4201d1fc = (chan_ctxt_tag *)0x0;
    }
    DAT_4201d248 = DAT_4201d248 | 0x20;
  }
LAB_2301a648:
  if (p_chan_entry->nb_linked_vif == '\0') {
    chan_ctxt_del(p_chan_entry->idx);
  }
LAB_2301a656:
  chan_tbtt_schedule((chan_tbtt_tag *)0x0);
  chan_update_tx_power(p_chan_entry);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_dma_init(void)

{
  co_list_init((co_list *)&hal_dma_env);
  hal_dma_env.lli_cnt[0] = (uint16_t)_DAT_44a000a4;
  co_list_init(hal_dma_env.prog + 1);
  hal_dma_env.lli_cnt[1] = (uint16_t)_DAT_44a000ac;
  return;
}


/*
Unable to decompile 'hal_dma_push'
Cause: Exception while decompiling 2301a6ba: Decompiler process died

*/

/*
Unable to decompile 'hal_dma_evt'
Cause: Exception while decompiling 2301a74a: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t blmac_soft_reset_getf(void)

{
  uint uVar1;
  
  uVar1 = _DAT_44b08050;
  if ((_DAT_44b08050 & 0xfffffffe) != 0) {
    assert_err("(localVal & ~((uint32_t)0x00000001)) == 0","module",0x11d);
  }
  return (uint8_t)uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_wt_2_crypt_clk_ratio_setf(uint8_t wt2cryptclkratio)

{
  undefined3 in_register_00002029;
  
  _DAT_44b000f0 = CONCAT31(in_register_00002029,wt2cryptclkratio) | _DAT_44b000f0 & 0xfffffffc;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_rx_flow_cntrl_en_setf(void)

{
  _DAT_44b00054 = _DAT_44b00054 & 0xfffeffff | 0x10000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void blmac_key_sto_ram_reset_setf(void)

{
  _DAT_44b0004c = _DAT_44b0004c & 0xffffdfff | 0x2000;
  return;
}


/*
Unable to decompile 'hal_machw_idle_req'
Cause: Exception while decompiling 2301a80c: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_stop(void)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  
  _DAT_44b08050 = 1;
  do {
    uVar1 = blmac_soft_reset_getf();
  } while (CONCAT31(extraout_var,uVar1) != 0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_init(void)

{
  uint uVar1;
  uint8_t wt2cryptclkratio;
  undefined3 extraout_var;
  uint uVar2;
  undefined3 extraout_var_00;
  uint uVar3;
  uint uVar4;
  
  _DAT_44b08050 = 1;
  do {
    wt2cryptclkratio = blmac_soft_reset_getf();
  } while (CONCAT31(extraout_var,wt2cryptclkratio) != 0);
  _DAT_44b00404 = 0x24f637;
  _DAT_44b00400 = 0x49;
  _DAT_44920004 = 0x5010001f;
  wt2cryptclkratio = phy_get_mac_freq();
  uVar2 = CONCAT31(uVar2._1_3_,wt2cryptclkratio);
  uVar1 = _DAT_44b000e4 & 0xff;
  uVar3 = _DAT_44b000e4 & 0xffffff00 | 0x28;
  uVar4 = (((_DAT_44b000e4 & 0x3ff00) >> 8) * uVar2) / uVar1 << 8;
  _DAT_44b000e4 = uVar3;
  if ((uVar4 & 0xfc0000) != 0) {
    assert_err("(((uint32_t)txrfdelayinmacclk << 8) & ~((uint32_t)0x0003FF00)) == 0","module",0x1d59
              );
  }
  _DAT_44b000e4 = (_DAT_44b000e4 & 0xfffc00ff | uVar4 & 0xffff00) & 0xf003ffff | 0x2200000;
  _DAT_44b000e8 =
       (((_DAT_44b000e8 >> 8 & 0xffff) * uVar2) / uVar1 & 0xffff) << 8 | _DAT_44b000e8 & 0xff0000ff;
  uVar3 = _DAT_44b000ec & 0xc00fffff | 0x2700000;
  uVar4 = (((_DAT_44b000ec & 0xffc00) >> 10) * uVar2) / uVar1 << 10;
  _DAT_44b000ec = uVar3;
  if ((uVar4 & 0x3f00000) != 0) {
    assert_err("(((uint32_t)txdelayrfoninmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0","module",
               0x1ea2);
  }
  wt2cryptclkratio = '\x03';
  _DAT_44b000ec = _DAT_44b000ec & 0xfff00000 | uVar4 & 0x3fffc00 | 0xb4;
  if ((0x1d < uVar2) && (wt2cryptclkratio = '\x02', 0x3b < uVar2)) {
    wt2cryptclkratio = '\x01';
  }
  blmac_wt_2_crypt_clk_ratio_setf(wt2cryptclkratio);
  _DAT_44b000f4 =
       (((_DAT_44b000f4 >> 8 & 0xffff) * uVar2) / uVar1 & 0xffff) << 8 | _DAT_44b000f4 & 0xff0000ff;
  _DAT_44b000f8 =
       (((_DAT_44b000f8 >> 8 & 0xffff) * uVar2) / uVar1 & 0xffff) << 8 | _DAT_44b000f8 & 0xff0000ff;
  uVar3 = ((_DAT_44b00104 >> 0x14 & 0x3ff) * uVar2) / uVar1 << 0x14;
  if ((uVar3 & 0xc0000000) != 0) {
    assert_err("(((uint32_t)rifstoinmacclk << 20) & ~((uint32_t)0x3FF00000)) == 0","module",0x228a);
  }
  uVar3 = _DAT_44b00104 & 0xc00fffff | uVar3;
  uVar4 = (((_DAT_44b00104 & 0xffc00) >> 10) * uVar2) / uVar1 << 10;
  _DAT_44b00104 = uVar3;
  if ((uVar4 & 0x3f00000) != 0) {
    assert_err("(((uint32_t)rifsinmacclk << 10) & ~((uint32_t)0x000FFC00)) == 0","module",0x22a4);
  }
  uVar3 = _DAT_44b00104 & 0xfff003ff | uVar4 & 0x3fffc00;
  uVar1 = ((_DAT_44b00104 & 0x3ff) * uVar2) / uVar1;
  _DAT_44b00104 = uVar3;
  if ((uVar1 & 0xfc00) != 0) {
    assert_err("(((uint32_t)txdmaprocdlyinmacclk << 0) & ~((uint32_t)0x000003FF)) == 0","module",
               0x22be);
  }
  _DAT_44b00104 = _DAT_44b00104 & 0xfffffc00 | uVar1 & 0xffff;
  _DAT_44b08074 = 0x8373f14c;
  _DAT_44b0004c = _DAT_44b0004c & 0xfffff7ff;
  if (_DAT_44b000d8 >> 0x18 < 0x11) {
    assert_err("MM_STA_TO_KEY(NX_REMOTE_STA_MAX - 1) <= blmac_sta_key_max_index_getf()","module",
               0x124);
  }
  printf("[WF] [KEY] [CFG] nVAP is %d, endidx %d, startidx %d\r\n",2,0x11,8);
  _DAT_44b000d8 = 0x21108;
  _DAT_44b08080 = 0x800a07c0;
  _DAT_44b0004c = _DAT_44b0004c | 0x4000780;
  blmac_rx_flow_cntrl_en_setf();
  _DAT_44b00060 = 0x7fffffde;
  _DAT_44b00114 = 0x3010a;
  _DAT_44b00064 = 0xff900064;
  _DAT_44b00150 = 0x1000;
  _DAT_44b00224 = 0;
  _DAT_44b000a0 = 0x2020;
  _DAT_44b0004c = _DAT_44b0004c & 0xffffefff | 0x1000;
  blmac_key_sto_ram_reset_setf();
  _DAT_44b00510 = 0x1c25;
  _DAT_44b00310 = _DAT_44b00310 | 0x80;
  wt2cryptclkratio = phy_get_ntx();
  uVar1 = (CONCAT31(extraout_var_00,wt2cryptclkratio) + 1) * 0x4000000;
  if ((uVar1 & 0xe0000000) != 0) {
    assert_err("(((uint32_t)maxphyntx << 26) & ~((uint32_t)0x1C000000)) == 0","module",0x1539);
  }
  _DAT_44b0004c = _DAT_44b0004c & 0xfdffffff | 0x2000000;
  _DAT_44b0009c = _DAT_44b0009c & 0xe3ffffff | uVar1;
  return;
}



