pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_disable_int(void)

{
  _DAT_44b08074 = _DAT_44b08074 & 0x7fffffff;
  _DAT_44b08080 = _DAT_44b08080 & 0x7fffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_reset(void)

{
  char "hal_machw_reset" [16];
  
  if ((_DAT_44b00038 & 0xf) != 0) {
    helper_record_all_states("hal_machw_reset");
  }
  _DAT_44b0004c = _DAT_44b0004c & 0xffffff7f;
  _DAT_44b00038 = 0;
  _DAT_44b00054 = 0x7c;
  ps_env.prevent_sleep = ps_env.prevent_sleep & 0xfffffffb;
  blmac_rx_flow_cntrl_en_setf();
  _DAT_44b0004c = _DAT_44b0004c | 0x80;
  _DAT_44b08070 = 0x37ff187;
  _DAT_44b08074 = _DAT_44b08074 & 0x7fffffff | 0x80000000;
  _DAT_44b0807c = 0xffffffff;
  _DAT_44b08080 = _DAT_44b08080 & 0x7fffffff | 0x80000000;
  _DAT_44b0808c = _DAT_44b0808c & 0xffffffc0;
  return;
}



// WARNING: Removing unreachable block (ram,0x2301adcc)
// WARNING: Removing unreachable block (ram,0x2301add8)
// WARNING: Removing unreachable block (ram,0x2301ade2)

uint8_t hal_machw_search_addr(mac_addr *addr)

{
                    // WARNING: Do nothing block with infinite loop
  do {
  } while( true );
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_monitor_mode(void)

{
  _DAT_44b08074 = _DAT_44b08074 & 0xfffffffc;
  mm_env.rx_filter_umac = 0x7fffffde;
  _DAT_44b00060 = mm_env.rx_filter_lmac_enable | 0x7fffffde;
  _DAT_44b0004c = _DAT_44b0004c & 0xfffe3fff | 0xc700;
  blmac_key_sto_ram_reset_setf();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

_Bool hal_machw_sleep_check(void)

{
  uint uVar1;
  
  uVar1 = 0;
  while (((1 << (uVar1 & 0x1f) & _DAT_44b0808c) == 0 ||
         (-1 < (-2000 - _DAT_44b00120) + *(int *)(&DAT_44b00128 + uVar1 * 4)))) {
    uVar1 = uVar1 + 1;
    if (uVar1 == 9) {
      return true;
    }
  }
  if (-1 < (5000 - _DAT_44b00120) + *(int *)(&DAT_44b00128 + uVar1 * 4)) {
    return false;
  }
  assert_err("!hal_machw_time_past(blmac_abs_timer_get(i) + 5000)","module",0x208);
  return false;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_machw_gen_handler(void)

{
  uint uVar1;
  uint uVar2;
  char *condition;
  int line;
  
  uVar2 = _DAT_44b08074 & _DAT_44b0806c;
  _DAT_44b08070 = uVar2;
  if ((uVar2 & 0x40001) != 0) {
    ke_evt_set(0x400000);
  }
  if ((uVar2 & 0x80002) != 0) {
    ke_evt_set(0x200000);
  }
  if ((uVar2 & 4) != 0) {
    if ((_DAT_44b00038 & 0xf) == 0) {
      _DAT_44b0808c = _DAT_44b0808c & 0xffffffdf;
      ps_env.prevent_sleep = ps_env.prevent_sleep & 0xfffffffb;
      ke_evt_set(0x800000);
    }
    else {
      assert_rec("blmac_current_state_getf() == HW_IDLE","module",0x8c);
    }
  }
  uVar1 = _DAT_44b08084;
  if ((uVar2 & 8) != 0) {
    _DAT_44b08088 = _DAT_44b08084;
    if ((_DAT_44b08084 & 0x100) != 0) {
      ke_evt_set(0x4000000);
    }
    if ((uVar1 & 0x40) != 0) {
      rxl_timeout_int_handler();
    }
    if ((uVar1 & 0x80) != 0) {
      ke_evt_set(0x8000000);
    }
    if ((uVar1 & 1) != 0) {
      assert_rec("HAL_AC0_TIMER_BIT timeout ","module",0x22f);
    }
    if ((uVar1 & 2) == 0) {
      if ((uVar1 & 4) == 0) {
        if ((uVar1 & 8) == 0) {
          if ((uVar1 & 0x10) == 0) {
            if ((uVar1 & 0x20) == 0) goto LAB_2301af80;
            line = 0x236;
            condition = "!(timer_pending & HAL_IDLE_TIMER_BIT)";
          }
          else {
            line = 0x235;
            condition = "!(timer_pending & HAL_BCN_TIMER_BIT)";
          }
        }
        else {
          line = 0x234;
          condition = "!(timer_pending & HAL_AC3_TIMER_BIT)";
        }
      }
      else {
        line = 0x233;
        condition = "!(timer_pending & HAL_AC2_TIMER_BIT)";
      }
    }
    else {
      line = 0x232;
      condition = "!(timer_pending & HAL_AC1_TIMER_BIT)";
    }
    assert_rec(condition,"module",line);
  }
LAB_2301af80:
  if ((uVar2 & 0x80) == 0) {
    if ((uVar2 & 0x100) == 0) {
      if ((int)(uVar2 << 0x13) < 0) {
        line = 0x27a;
        condition = "!(genirq_pending & NXMAC_PT_ERROR_BIT)";
      }
      else {
        if ((int)(uVar2 << 0x12) < 0) {
          line = 0x27b;
          condition = "!(genirq_pending & NXMAC_AC_0_TX_DMA_DEAD_BIT)";
        }
        else {
          if ((int)(uVar2 << 0x11) < 0) {
            line = 0x27c;
            condition = "!(genirq_pending & NXMAC_AC_1_TX_DMA_DEAD_BIT)";
          }
          else {
            if ((int)(uVar2 << 0x10) < 0) {
              line = 0x27d;
              condition = "!(genirq_pending & NXMAC_AC_2_TX_DMA_DEAD_BIT)";
            }
            else {
              if ((int)(uVar2 << 0xf) < 0) {
                line = 0x27e;
                condition = "!(genirq_pending & NXMAC_AC_3_TX_DMA_DEAD_BIT)";
              }
              else {
                if ((int)(uVar2 << 0xe) < 0) {
                  line = 0x27f;
                  condition = "!(genirq_pending & NXMAC_BCN_TX_DMA_DEAD_BIT)";
                }
                else {
                  if ((int)(uVar2 << 10) < 0) {
                    line = 0x280;
                    condition = "!(genirq_pending & NXMAC_MAC_PHYIF_UNDER_RUN_BIT)";
                  }
                  else {
                    if ((int)(uVar2 << 9) < 0) {
                      line = 0x281;
                      condition = "!(genirq_pending & NXMAC_PHY_ERR_BIT)";
                    }
                    else {
                      if ((int)(uVar2 << 7) < 0) {
                        line = 0x282;
                        condition = "!(genirq_pending & NXMAC_RX_HEADER_DMA_DEAD_BIT)";
                      }
                      else {
                        if ((int)(uVar2 << 6) < 0) {
                          line = 0x283;
                          condition = "!(genirq_pending & NXMAC_RX_PAYLOAD_DMA_DEAD_BIT)";
                        }
                        else {
                          if (-1 < (int)(uVar2 << 0xb)) {
                            return;
                          }
                          line = 0x284;
                          condition = "!(genirq_pending & NXMAC_HW_ERR_BIT)";
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
    else {
      line = 0x279;
      condition = "!(genirq_pending & NXMAC_RX_FIFO_OVER_FLOW_BIT)";
    }
  }
  else {
    line = 0x278;
    condition = "!(genirq_pending & NXMAC_RX_DMA_EMPTY_BIT)";
  }
  assert_rec(condition,"module",line);
  return;
}



void hal_mib_dump(void)

{
  puts("---------- hal_mib_dump ----------\r\n");
  printf("machw_mib nx_rd_fifo_overflow_count is %u\r\n");
  puts("\r\n");
  return;
}



int mm_monitor_channel_req_handler
              (ke_msg_id_t msgid,mm_monitor_channel_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  uint16_t prim20_freq;
  undefined4 *puVar1;
  uint32_t uVar2;
  uint16_t center1_freq;
  
  puVar1 = (undefined4 *)ke_msg_alloc(0x5f,src_id,dest_id,0x28);
  center1_freq = (uint16_t)param->freq;
  *puVar1 = 1;
  puVar1[3] = 0x11111111;
  puVar1[4] = 0x22222222;
  puVar1[5] = 0x33333333;
  puVar1[6] = 0x44444444;
  puVar1[7] = 0x55555555;
  puVar1[8] = 0x66666666;
  puVar1[2] = 0;
  puVar1[9] = 0x77777777;
  uVar2 = param->freq;
  puVar1[1] = uVar2;
  prim20_freq = (uint16_t)uVar2;
  if ((param->use_40Mhz != 0) && (center1_freq = prim20_freq + 10, param->higher_band == 0)) {
    center1_freq = prim20_freq - 10;
  }
  phy_set_channel('\0',param->use_40Mhz != 0,prim20_freq,center1_freq,0,'\0');
  *puVar1 = 0;
  ke_msg_send(puVar1);
  return 0;
}



int mm_monitor_enable_req_handler
              (ke_msg_id_t msgid,mm_monitor_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined4 *puVar1;
  uint32_t local_50;
  phy_cfg_tag config;
  
  puVar1 = (undefined4 *)ke_msg_alloc(0x5d,src_id,dest_id,0x28);
  *puVar1 = 1;
  puVar1[3] = 0x11111111;
  puVar1[4] = 0x22222222;
  puVar1[5] = 0x33333333;
  puVar1[6] = 0x44444444;
  puVar1[7] = 0x55555555;
  puVar1[8] = 0x66666666;
  puVar1[2] = 0;
  puVar1[9] = 0x77777777;
  puVar1[1] = param->enable;
  memset(&local_50,0,0x40);
  local_50 = 0;
  phy_init((phy_cfg_tag *)&local_50);
  phy_set_channel('\0','\0',0x985,0x985,0,'\0');
  mm_active();
  *puVar1 = 0;
  ke_msg_send(puVar1);
  return 0;
}



int mm_cfg_rssi_req_handler
              (ke_msg_id_t msgid,mm_cfg_rssi_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  byte bVar1;
  uint uVar2;
  
  uVar2 = (uint)param->vif_index;
  if (vif_info_tab[uVar2].type != '\0') {
    assert_err("vif_entry->type == VIF_STA","module",0x8fe);
  }
  vif_info_tab[uVar2].u[0x1a] = param->rssi_thold;
  bVar1 = param->rssi_hyst;
  vif_info_tab[uVar2].u[0x1c] = 0;
  vif_info_tab[uVar2].u[0x1b] = bVar1;
  return 0;
}



