pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mm_set_ps_options_req_handler
              (ke_msg_id_t msgid,mm_set_ps_options_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  uint uVar1;
  
  uVar1 = (uint)param->vif_index;
  if (vif_info_tab[uVar1].type != '\0') {
    assert_err("vif_entry->type == VIF_STA","module",0x815);
  }
  *(uint16_t *)vif_info_tab[uVar1].u = param->listen_interval;
  *(_Bool *)(vif_info_tab[uVar1].u + 2) = param->dont_listen_bc_mc;
  ke_msg_send_basic(0x4c,src_id,dest_id);
  return 0;
}



int mm_tim_update_req_handler
              (ke_msg_id_t msgid,mm_tim_update_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  mm_tim_update(param);
  return 1;
}



int mm_bcn_change_req_handler
              (ke_msg_id_t msgid,mm_bcn_change_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  mm_bcn_change(param);
  return 1;
}



int mm_remain_on_channel_req_handler
              (ke_msg_id_t msgid,mm_remain_on_channel_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  uint8_t uVar1;
  uint8_t uVar2;
  uint8_t *puVar3;
  undefined2 in_register_00002036;
  
  uVar2 = chan_roc_req(param,src_id);
  if (CONCAT22(in_register_00002036,src_id) != 0) {
    puVar3 = (uint8_t *)ke_msg_alloc(0x47,src_id,dest_id,3);
    uVar1 = param->op_code;
    puVar3[1] = uVar2;
    *puVar3 = uVar1;
    puVar3[2] = '\x04';
    ke_msg_send();
  }
  return 0;
}



int mm_sta_del_req_handler
              (ke_msg_id_t msgid,mm_sta_del_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  mm_sta_del(param->sta_idx);
  ke_msg_send_basic(0xd,src_id,dest_id);
  return 0;
}



int mm_sta_add_req_handler
              (ke_msg_id_t msgid,mm_sta_add_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint8_t uVar1;
  uint8_t *puVar2;
  
  puVar2 = (uint8_t *)ke_msg_alloc(0xb,src_id,dest_id,3);
  uVar1 = mm_sta_add(param,puVar2 + 1,puVar2 + 2);
  *puVar2 = uVar1;
  ke_msg_send(puVar2);
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_key_del_req_handler
              (ke_msg_id_t msgid,mm_key_del_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  if ((_DAT_44b000d8 >> 0x18) + 1 < (uint)param->hw_key_idx) {
    assert_err("param->hw_key_idx <= MM_SEC_MAX_KEY_NBR","module",0x56e);
  }
  mm_sec_machwkey_del(param->hw_key_idx);
  ke_msg_send_basic(0x27,src_id,dest_id);
  return 0;
}



int mm_key_add_req_handler
              (ke_msg_id_t msgid,mm_key_add_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint8_t uVar1;
  undefined *puVar2;
  
  puVar2 = (undefined *)ke_msg_alloc(0x25,src_id,dest_id,2);
  if (3 < param->key_idx) {
    assert_err("param->key_idx < MAC_DEFAULT_KEY_COUNT","module",0x53d);
  }
  if (0x20 < (param->key).length) {
    assert_err("param->key.length <= MAC_SEC_KEY_LEN","module",0x541);
  }
  if (5 < param->cipher_suite) {
    assert_err("param->cipher_suite <= MAC_RSNIE_CIPHER_AES_CMAC","module",0x544);
  }
  uVar1 = mm_sec_machwkey_wr(param);
  puVar2[1] = uVar1;
  *puVar2 = 0;
  ke_msg_send(puVar2);
  return 0;
}



int mm_set_power_req_handler
              (ke_msg_id_t msgid,mm_set_power_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint uVar1;
  uint8_t *idx;
  
  uVar1 = (uint)param->inst_nbr;
  idx = (uint8_t *)ke_msg_alloc(0x2f,src_id,dest_id,2);
  vif_info_tab[uVar1].user_tx_power = param->power;
  idx[1] = vif_info_tab[uVar1].tx_power;
  vif_info_tab[uVar1].tx_power = '\x7f';
  tpc_update_vif_tx_power(vif_info_tab + uVar1,(int8_t *)(idx + 1),idx);
  ke_msg_send(idx);
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_set_idle_req_handler
              (ke_msg_id_t msgid,mm_set_idle_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  int iVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  
  kVar2 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar2) == 3) {
LAB_2301b686:
    iVar1 = 2;
  }
  else {
    mm_env.host_idle = param->hw_idle;
    if (mm_env.host_idle == '\0') {
      kVar2 = ke_state_get(dest_id);
      if (CONCAT22(extraout_var_01,kVar2) == 2) goto LAB_2301b686;
      mm_active();
    }
    else {
      kVar2 = ke_state_get(dest_id);
      if (CONCAT22(extraout_var_00,kVar2) != 0) {
        if (CONCAT22(extraout_var_00,kVar2) == 2) {
          return 2;
        }
        hal_machw_idle_req();
        ke_state_set(dest_id,2);
        return 2;
      }
      if ((_DAT_44b00038 & 0xf) != 0) {
        assert_err("blmac_current_state_getf() == HW_IDLE","module",0x47d);
      }
      mm_env._18_2_ = 0;
    }
    ke_msg_send_basic(0x23,src_id,dest_id);
    iVar1 = 0;
  }
  return iVar1;
}


/*
Unable to decompile 'mm_reset_req_handler'
Cause: Exception while decompiling 2301b70e: Decompiler process died

*/


// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_version_req_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined4 *puVar1;
  
  puVar1 = (undefined4 *)ke_msg_alloc(5,src_id,dest_id,0x18);
  *puVar1 = 0x5040000;
  puVar1[1] = _DAT_44b00004;
  puVar1[2] = _DAT_44b00008;
  phy_get_version(puVar1 + 3,puVar1 + 4);
  puVar1[5] = 0x89df;
  ke_msg_send(puVar1);
  return 0;
}



int mm_start_req_handler
              (ke_msg_id_t msgid,mm_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar1) != 0) {
    assert_err("ke_state_get(dest_id) == MM_IDLE","module",0x135);
  }
  phy_init((phy_cfg_tag *)param);
  phy_set_channel('\0','\0',0x96c,0x96c,0,'\0');
  tpc_update_tx_power('\x10');
  ps_env.uapsd_timeout = param->uapsd_timeout * 1000;
  mm_env.lp_clk_accuracy = param->lp_clk_accuracy;
  ke_msg_send_basic(3,src_id,dest_id);
  mm_active();
  hal_machw_idle_req();
  ke_state_set(dest_id,2);
  return 0;
}



// WARNING: Type propagation algorithm not settling

int mm_set_ps_mode_req_handler
              (ke_msg_id_t msgid,mm_set_ps_mode_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  vif_info_tag *vif_entry;
  
  vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first;
  if (param->new_state == '\x03') {
    while (vif_entry != (vif_info_tag *)0x0) {
      if ((vif_entry->type == '\0') && (vif_entry->active != false)) {
        ps_polling_frame(vif_entry);
      }
      vif_entry = *(vif_info_tag **)&vif_entry->list_hdr;
    }
    ke_msg_send_basic(0x32,ps_env.taskid,0);
  }
  else {
    ps_set_mode(param->new_state,src_id);
  }
  return 0;
}



