pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_force_idle_req_handler
              (ke_msg_id_t msgid,mm_force_idle_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  int iVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  
  kVar2 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar2) == 0) {
    if ((_DAT_44b00038 & 0xf) != 0) {
      assert_err("blmac_current_state_getf() == HW_IDLE","module",0x4c0);
    }
    ke_state_set(dest_id,3);
    iVar1 = 0;
    (*param->cb)(param->cb);
  }
  else {
    iVar1 = 2;
    if (CONCAT22(extraout_var,kVar2) != 2) {
      hal_machw_idle_req();
      ke_state_set(dest_id,2);
    }
  }
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_hw_config_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  char cVar1;
  byte bVar2;
  _Bool _Var3;
  uint8_t uVar4;
  uint16_t uVar5;
  uint32_t uVar6;
  uint32_t uVar7;
  int iVar8;
  uint8_t uVar9;
  ke_state_t kVar10;
  ke_msg_id_t id;
  undefined2 in_register_0000202a;
  undefined2 extraout_var;
  uint8_t *puVar11;
  uint32_t uVar12;
  uint32_t uVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  
  uVar16 = CONCAT22(in_register_0000202a,msgid);
  kVar10 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar10) != 0) {
    if (1 < (CONCAT22(extraout_var,kVar10) - 2U & 0xffff)) {
      mm_env.prev_hw_state = (byte)_DAT_44b00038 & 0xf;
      kVar10 = ke_state_get(dest_id);
      mm_env.prev_mm_state = (uint8_t)kVar10;
      hal_machw_idle_req();
      ke_state_set(dest_id,2);
    }
    return 2;
  }
  if ((_DAT_44b00038 & 0xf) != 0) {
    assert_err("blmac_current_state_getf() == HW_IDLE","module",0x77b);
  }
  iVar8 = DAT_4201d1f8;
  if (uVar16 == 0x16) {
    (&mm_env.rx_filter_lmac_enable)[(uint)*(byte *)((int)param + 5) + 4] = *(uint32_t *)param;
    if ((iVar8 != 0) && (*(char *)(iVar8 + 4) == *(char *)((int)param + 5))) {
      _DAT_44b000dc = 0x10;
    }
    id = 0x17;
LAB_2301baa6:
    ke_msg_send_basic(id,src_id,dest_id);
  }
  else {
    if (0x16 < uVar16) {
      if (uVar16 == 0x1e) {
        uVar16 = (uint)*(byte *)((int)param + 3);
        if (vif_info_tab[uVar16].type == '\0') {
          if (*(char *)((int)param + 2) == '\0') {
            mm_timer_clear(&vif_info_tab[uVar16].tbtt_timer);
          }
          else {
            uVar14 = (uint)vif_info_tab[uVar16].u[4];
            mm_timer_set(&vif_info_tab[uVar16].tbtt_timer,
                         _DAT_44b00120 + sta_info_tab[uVar14].bcn_int);
            uVar5 = *(uint16_t *)param;
            uVar12 = sta_info_tab[uVar14].bcn_int;
            *(undefined2 *)vif_info_tab[uVar16].u = 0;
            sta_info_tab[uVar14].aid = uVar5;
            uVar15 = (uint)mm_env.lp_clk_accuracy;
            vif_info_tab[uVar16].u[2] = 0;
            sta_info_tab[uVar14].drift = (uint16_t)(((uVar15 + 0x14) * uVar12) / 1000000);
            iVar8 = _DAT_44b00120;
            vif_info_tab[uVar16].u[0x18] = 0;
            *(undefined4 *)(vif_info_tab[uVar16].u + 0x14) = 0;
            *(int *)(vif_info_tab[uVar16].u + 8) = iVar8;
            vif_info_tab[uVar16].prevent_sleep = vif_info_tab[uVar16].prevent_sleep | 1;
            *(int *)(vif_info_tab[uVar16].u + 0x10) = _DAT_44b00120;
            chan_bcn_detect_start(vif_info_tab + uVar16);
          }
        }
        _Var3 = *(_Bool *)((int)param + 2);
        vif_info_tab[uVar16].active = _Var3;
        if (_Var3 != false) {
          _DAT_44b00200 = vif_info_tab[uVar16].txq_params[3];
          _DAT_44b00204 = vif_info_tab[uVar16].txq_params[3];
          _DAT_44b00208 = vif_info_tab[uVar16].txq_params[3];
          _DAT_44b0020c = vif_info_tab[uVar16].txq_params[3];
          mm_env_max_ampdu_duration_set();
        }
        id = 0x1f;
      }
      else {
        if (uVar16 < 0x1f) {
          if (uVar16 == 0x1a) {
            uVar16 = (uint)*(byte *)((int)param + 6);
            vif_info_tab[0].txq_params[uVar16 * 0x176 + (uint)*(byte *)((int)param + 5)] =
                 *(uint32_t *)param;
            if (vif_info_tab[uVar16].active != false) {
              cVar1 = *(char *)((int)param + 5);
              uVar13 = *(uint32_t *)param;
              uVar12 = _DAT_44b00200;
              uVar6 = uVar13;
              uVar7 = _DAT_44b00208;
              if (((cVar1 != '\x01') && (uVar12 = uVar13, uVar6 = _DAT_44b00204, cVar1 != '\0')) &&
                 (uVar12 = _DAT_44b00200, uVar7 = uVar13, cVar1 != '\x02')) {
                uVar7 = _DAT_44b00208;
                _DAT_44b0020c = uVar13;
              }
              _DAT_44b00208 = uVar7;
              _DAT_44b00204 = uVar6;
              _DAT_44b00200 = uVar12;
              mm_env_max_ampdu_duration_set();
            }
            if (vif_info_tab[uVar16].type == '\0') {
              ps_uapsd_set(vif_info_tab + uVar16,*(uint8_t *)((int)param + 5),
                           *(_Bool *)((int)param + 4));
            }
            id = 0x1b;
          }
          else {
            if (uVar16 == 0x1c) {
              bVar2 = *(byte *)param;
              if (((uint)bVar2 << 0xe & 0x3e0000) != 0) {
                assert_err("(((uint32_t)abgnmode << 14) & ~((uint32_t)0x0001C000)) == 0","module",
                           0x834);
              }
              _DAT_44b0004c = _DAT_44b0004c & 0xfffe3fff | (uint)bVar2 << 0xe;
              id = 0x1d;
            }
            else {
              if (uVar16 != 0x18) goto LAB_2301b960;
              memcpy(&vif_info_tab[*(byte *)((int)param + 6)].bssid,param,6);
              if ((uint)vif_mgmt_env.vif_sta_cnt + (uint)vif_mgmt_env.vif_ap_cnt == 1) {
                _DAT_44b00020 = *(undefined4 *)param;
                _DAT_44b00024 = (uint)*(ushort *)((int)param + 4);
              }
              id = 0x19;
            }
          }
        }
        else {
          if (uVar16 == 0x28) {
            uVar9 = '\x05';
            if (*(char *)param != '\0') {
              uVar9 = '\0';
              _DAT_44b00054 = _DAT_44b00054 | 0x80;
            }
            puVar11 = (uint8_t *)ke_msg_alloc(0x29,src_id,dest_id,3);
            *puVar11 = *(uint8_t *)((int)param + 1);
            uVar4 = *(uint8_t *)((int)param + 2);
            puVar11[2] = uVar9;
            puVar11[1] = uVar4;
            goto LAB_2301b9bc;
          }
          if (uVar16 == 0x3b) {
            chan_ctxt_update((mm_chan_ctxt_update_req *)param);
            id = 0x3c;
          }
          else {
            if (uVar16 != 0x20) goto LAB_2301b960;
            id = 0x21;
            _DAT_44b000e8 =
                 (uint)*(byte *)param * (_DAT_44b000e4 & 0xff) * 0x100 | (uint)*(byte *)param;
          }
        }
      }
      goto LAB_2301baa6;
    }
    if (uVar16 == 0xe) {
      mm_env.rx_filter_umac = *(uint32_t *)param;
      _DAT_44b00060 = mm_env.rx_filter_umac | mm_env.rx_filter_lmac_enable;
      id = 0xf;
      goto LAB_2301baa6;
    }
    if (0xe < uVar16) {
      if (uVar16 == 0x12) {
        _DAT_44b00090 = (uint)*(byte *)param | _DAT_44b00090 & 0xffffff00 | 0x80000000;
        id = 0x13;
      }
      else {
        if (uVar16 != 0x14) {
          if (uVar16 != 0x10) goto LAB_2301b960;
          puVar11 = (uint8_t *)ke_msg_alloc(0x11,src_id,dest_id,2);
          if (*(uint8_t *)((int)param + 8) != '\0') {
            phy_set_channel(*(uint8_t *)param,*(uint8_t *)((int)param + 1),
                            *(uint16_t *)((int)param + 2),*(uint16_t *)((int)param + 4),
                            *(uint16_t *)((int)param + 6),*(uint8_t *)((int)param + 8));
          }
          goto LAB_2301b9bc;
        }
        uVar16 = (uint)*(byte *)((int)param + 2);
        if (vif_info_tab[uVar16].type == '\0') {
          sta_info_tab[vif_info_tab[uVar16].u[4]].bcn_int = (uint)*(ushort *)param << 10;
        }
        else {
          vif_mgmt_set_ap_bcn_int(vif_info_tab + uVar16,*(ushort *)param);
        }
        id = 0x15;
      }
      goto LAB_2301baa6;
    }
    if (uVar16 != 6) {
      if (uVar16 != 8) {
LAB_2301b960:
        assert_err("0","module",0x7ae);
        iVar8 = 2;
        goto LAB_2301baac;
      }
      if (*(byte *)param < 2) {
        vif_mgmt_unregister(*(byte *)param);
      }
      if (vif_mgmt_env.used_list.first == (co_list_hdr *)0x0) {
        hal_machw_monitor_mode();
      }
      id = 9;
      goto LAB_2301baa6;
    }
    puVar11 = (uint8_t *)ke_msg_alloc(7,src_id,dest_id,2);
    uVar9 = vif_mgmt_register((mac_addr *)((int)param + 1),*(uint8_t *)param,
                              *(_Bool *)((int)param + 7),puVar11 + 1);
    *puVar11 = uVar9;
LAB_2301b9bc:
    ke_msg_send(puVar11);
  }
  iVar8 = 0;
LAB_2301baac:
  uVar16 = (uint)mm_env.prev_hw_state;
  if ((uVar16 << 4 & 0xffffff0f) != 0) {
    assert_err("(((uint32_t)nextstate << 4) & ~((uint32_t)0x000000F0)) == 0","module",0x5b9);
  }
  _DAT_44b00038 = uVar16 << 4;
  ke_state_set(dest_id,(ushort)mm_env.prev_mm_state);
  return iVar8;
}



