pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl60x_edca_get(int ac,uint8_t *aifs,uint8_t *cwmin,uint8_t *cwmax,uint16_t *txop)

{
  uint uVar1;
  uint uVar2;
  
  uVar1 = _DAT_44b00200;
  uVar2 = _DAT_44b00204;
  if (ac != 1) {
    if (ac < 2) {
      if (ac == 0) {
        *txop = (uint16_t)(_DAT_44b00200 >> 0xc);
        *cwmax = (byte)(uVar1 >> 8) & 0xf;
        *cwmin = (byte)(uVar1 >> 4) & 0xf;
        *aifs = (byte)uVar1 & 0xf;
        return 0;
      }
    }
    else {
      uVar2 = _DAT_44b00208;
      if ((ac == 2) || (uVar2 = _DAT_44b0020c, ac == 3)) goto LAB_2301be88;
    }
    return -1;
  }
LAB_2301be88:
  *txop = (uint16_t)(uVar2 >> 0xc);
  *cwmax = (byte)(uVar2 >> 8) & 0xf;
  *cwmin = (byte)(uVar2 >> 4) & 0xf;
  *aifs = (byte)uVar2 & 0xf;
  return 0;
}



void bl_init(void)

{
  fw_nap_chain_ptr = &fw_nap_chain;
  bl_env.hw_in_doze = 0;
  dbg_init();
  me_init();
  mm_init();
  ke_init();
  memset(&sta_conn_info,0,0xec);
  sta_conn_info._4_2_ = 0xffff;
  sta_conn_info.conType = '\0';
  sta_conn_info.gtkHwKeyId = -1;
  supplicantFuncInit();
  allocSupplicantData(&sta_conn_info);
  return;
}


/*
Unable to decompile 'bl_reset_evt'
Cause: Exception while decompiling 2301bf1c: Decompiler process died

*/


// WARNING: Type propagation algorithm not settling

int bl_sleep(void)

{
  vif_info_tag *p_vif_entry;
  _Bool _Var1;
  ke_state_t kVar2;
  undefined2 extraout_var_01;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  
  if (ke_env.evt_field != 0) {
    return 0;
  }
  kVar2 = ke_state_get(4);
  if (((CONCAT22(extraout_var_01,kVar2) == 0) && (ps_env.ps_on != false)) &&
     (p_vif_entry = (vif_info_tag *)vif_mgmt_env.used_list.first, ps_env.prevent_sleep == 0)) {
    while (p_vif_entry != (vif_info_tag *)0x0) {
      _Var1 = chan_is_on_channel(p_vif_entry);
      if ((CONCAT31(extraout_var_00,_Var1) != 0) && (p_vif_entry->prevent_sleep != 0)) {
        return 0;
      }
      p_vif_entry = *(vif_info_tag **)&p_vif_entry->list_hdr;
    }
    if (txl_cntrl_env.pck_cnt == 0) {
      _Var1 = hal_machw_sleep_check();
      return CONCAT31(extraout_var,_Var1);
    }
  }
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t bl_nap_calculate(void)

{
  uint uVar1;
  uint uVar2;
  uint uVar3;
  
  uVar2 = 0;
  uVar1 = 0xffffffff;
  do {
    if ((1 << (uVar2 & 0x1f) & _DAT_44b0808c) != 0) {
      uVar3 = *(uint *)(&DAT_44b00128 + uVar2 * 4);
      if (_DAT_44b00120 < uVar3) {
        uVar3 = uVar3 - _DAT_44b00120;
      }
      else {
        uVar3 = (_DAT_44b00120 - 1) - uVar3;
      }
      if (uVar3 < uVar1) {
        uVar1 = uVar3;
      }
    }
    uVar2 = uVar2 + 1;
  } while (uVar2 != 9);
  return uVar1;
}



void rx_swdesc_init(void)

{
  rx_swdesc_tab[0].dma_hdrdesc = rx_dma_hdrdesc;
  rx_swdesc_tab[1].dma_hdrdesc = &DAT_42043064;
  rx_swdesc_tab[2].dma_hdrdesc = &DAT_420430c8;
  rx_swdesc_tab[3].dma_hdrdesc = &DAT_4204312c;
  rx_swdesc_tab[4].dma_hdrdesc = &DAT_42043190;
  rx_swdesc_tab[5].dma_hdrdesc = &DAT_420431f4;
  rx_swdesc_tab[6].dma_hdrdesc = &DAT_42043258;
  rx_swdesc_tab[7].dma_hdrdesc = &DAT_420432bc;
  rx_swdesc_tab[8].dma_hdrdesc = &DAT_42043320;
  rx_swdesc_tab[9].dma_hdrdesc = &DAT_42043384;
  rx_swdesc_tab[10].dma_hdrdesc = &DAT_420433e8;
  rx_swdesc_tab[11].dma_hdrdesc = &DAT_4204344c;
  rx_swdesc_tab[12].dma_hdrdesc = &DAT_420434b0;
  return;
}



int scan_cancel_req_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(2);
  if (CONCAT22(extraout_var,kVar1) == 0) {
    scan_send_cancel_cfm('\x01',src_id);
  }
  else {
    DAT_42018f13 = 1;
  }
  return 0;
}



int scan_start_req_handler
              (ke_msg_id_t msgid,scan_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  int iVar1;
  ke_state_t kVar2;
  undefined *puVar3;
  undefined2 extraout_var;
  
  puVar3 = (undefined *)ke_msg_alloc(0x801,src_id,dest_id,1);
  kVar2 = ke_state_get(2);
  if (CONCAT22(extraout_var,kVar2) == 0) {
    if (param->chan_cnt == '\0') {
      assert_err("param->chan_cnt > 0","module",0x46);
    }
    *puVar3 = 0;
    DAT_42018f12 = 0;
    iVar1 = 1;
    param = param;
    DAT_42018f10 = src_id;
    scan_ie_download(param);
  }
  else {
    *puVar3 = 8;
    iVar1 = 0;
  }
  ke_msg_send(puVar3);
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

undefined4 mm_scan_channel_end_ind_handler(void)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(2);
  if (CONCAT22(extraout_var,kVar1) != 3) {
    assert_err("ke_state_get(TASK_SCAN) == SCAN_WAIT_BEACON_PROBE_RSP","module",0xc4);
  }
  mm_env.rx_filter_lmac_enable = mm_env.rx_filter_lmac_enable & 0xffffddff;
  _DAT_44b00060 = mm_env.rx_filter_lmac_enable | mm_env.rx_filter_umac;
  DAT_42018f12 = DAT_42018f12 + 1;
  if ((DAT_42018f12 < param->chan_cnt) && (DAT_42018f13 == '\0')) {
    scan_set_channel_request();
  }
  else {
    ke_msg_free(&param[-1].add_ies);
    if (DAT_42018f13 == '\0') {
      ke_msg_send_basic(0x802,DAT_42018f10,2);
    }
    else {
      scan_send_cancel_cfm('\0',DAT_42018f10);
      DAT_42018f13 = '\0';
    }
    ke_state_set(2,0);
  }
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mm_scan_channel_start_ind_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  scan_start_req *psVar1;
  uint uVar2;
  ke_state_t kVar3;
  undefined2 extraout_var;
  
  psVar1 = param;
  uVar2 = (uint)DAT_42018f12;
  kVar3 = ke_state_get(2);
  if (CONCAT22(extraout_var,kVar3) != 2) {
    assert_err("ke_state_get(TASK_SCAN) == SCAN_WAIT_CHANNEL","module",0x9d);
  }
  mm_env.rx_filter_lmac_enable = mm_env.rx_filter_lmac_enable | 0x2200;
  _DAT_44b00060 = mm_env.rx_filter_lmac_enable | mm_env.rx_filter_umac;
  if ((psVar1->chan[uVar2].flags & 1) == 0) {
    scan_probe_req_tx();
  }
  ke_state_set(2,3);
  return 0;
}



void txl_buffer_reinit(void)

{
  txl_buffer_env.list[0].first = (txl_buffer_tag *)0x0;
  txl_buffer_env.list[0].last = (txl_buffer_tag *)0x0;
  return;
}



