pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_buffer_init(void)

{
  uint uVar1;
  txl_buffer_control *ptVar2;
  txl_buffer_control *ptVar3;
  uint8_t uVar4;
  byte bVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  
  txl_buffer_reinit();
  ptVar3 = txl_buffer_control_desc;
  do {
    *(undefined4 *)ptVar3->field_0 = 0xbadcab1e;
    uVar4 = phy_get_ntx();
    *(int *)(ptVar3->field_0 + 4) = CONCAT31(extraout_var,uVar4) << 0xe;
    bVar5 = phy_get_ntx();
    *(int *)(ptVar3->field_0 + 8) = (1 << ((uint)bVar5 + 1 & 0x1f)) + -1;
    *(undefined4 *)(ptVar3->field_0 + 0xc) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x10) = 0xffff0704;
    *(undefined4 *)(ptVar3->field_0 + 0x14) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x18) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x1c) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x20) = 0;
    ptVar2 = ptVar3 + 1;
    *(uint *)(ptVar3->field_0 + 0x24) = _DAT_44b000a0 & 0xff;
    *(uint *)(ptVar3->field_0 + 0x28) = _DAT_44b000a0 & 0xff;
    *(uint *)(ptVar3->field_0 + 0x2c) = _DAT_44b000a0 & 0xff;
    uVar1 = _DAT_44b000a0;
    ptVar3->mac_control_info = 0x2200;
    ptVar3->phy_control_info = 0x3f0000;
    *(uint *)(ptVar3->field_0 + 0x30) = uVar1 & 0xff;
    ptVar3 = ptVar2;
  } while (ptVar2 != txl_frame_buf_ctrl);
  ptVar3 = txl_buffer_control_desc_bcmc;
  do {
    *(undefined4 *)ptVar3->field_0 = 0xbadcab1e;
    uVar4 = phy_get_ntx();
    *(int *)(ptVar3->field_0 + 4) = CONCAT31(extraout_var_00,uVar4) << 0xe;
    bVar5 = phy_get_ntx();
    *(int *)(ptVar3->field_0 + 8) = (1 << ((uint)bVar5 + 1 & 0x1f)) + -1;
    *(undefined4 *)(ptVar3->field_0 + 0xc) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x10) = 0xffff0704;
    *(undefined4 *)(ptVar3->field_0 + 0x14) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x18) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x1c) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x20) = 0;
    uVar1 = _DAT_44b000a0;
    ptVar2 = ptVar3 + 1;
    *(undefined4 *)(ptVar3->field_0 + 0x28) = 0;
    *(uint *)(ptVar3->field_0 + 0x24) = uVar1 & 0xff;
    *(undefined4 *)(ptVar3->field_0 + 0x2c) = 0;
    *(undefined4 *)(ptVar3->field_0 + 0x30) = 0;
    ptVar3->mac_control_info = 0;
    ptVar3->phy_control_info = 0x3f0000;
    ptVar3 = ptVar2;
  } while (ptVar2 != txl_buffer_control_desc);
  return;
}



void txl_buffer_reset(void)

{
  txl_buffer_env.list[0].first = (txl_buffer_tag *)0x0;
  txl_buffer_env.list[0].last = (txl_buffer_tag *)0x0;
  return;
}



txl_buffer_tag * txl_buffer_alloc(txdesc *txdesc,uint8_t access_category,uint8_t user_idx)

{
  ushort uVar1;
  txl_buffer_tag *ptVar2;
  txl_buffer_tag *ptVar3;
  txl_buffer_control *ptVar4;
  uint uVar5;
  int iVar6;
  int iVar7;
  
  uVar5 = (uint)(txdesc->umac).head_len;
  *(uint8_t *)(txdesc->buf + 0x3b) = user_idx;
  txdesc->buf[2] = (uVar5 + 0xf & 0xfffffff0) - uVar5;
  txdesc->buf[0xe] = 0xcafefade;
  uVar1 = (txdesc->host).flags;
  txdesc->buf[1] = uVar5;
  ptVar3 = (txl_buffer_tag *)txdesc->buf;
  if ((uVar1 & 8) == 0) {
    txu_cntrl_frame_build(txdesc,(int)txdesc->buf + uVar5 + 0x14c);
  }
  ptVar4 = (txdesc->umac).buf_control;
  iVar6 = 0;
  do {
    iVar7 = iVar6 + 4;
    *(undefined4 *)((int)txdesc->buf + iVar6 + 0xf0) = *(undefined4 *)(ptVar4->field_0 + iVar6);
    iVar6 = iVar7;
  } while (iVar7 != 0x3c);
  ptVar2 = ptVar3;
  if (txl_buffer_env.list[0].first != (txl_buffer_tag *)0x0) {
    (txl_buffer_env.list[0].last)->next = ptVar3;
    ptVar2 = txl_buffer_env.list[0].first;
  }
  txl_buffer_env.list[0].first = ptVar2;
  txl_buffer_env.list[0].last = ptVar3;
  txdesc->buf[4] = 0;
  return ptVar3;
}



void txl_buffer_update_thd(txdesc *txdesc)

{
  char "txl_buffer_update_thd" [22];
  uint32_t *puVar1;
  int iVar2;
  tx_pbd *in_a2;
  tx_pbd *ptVar3;
  uint32_t uVar4;
  txl_buffer_tag *ptVar5;
  tx_hw_desc *ptVar6;
  uint32_t uVar7;
  
  ptVar5 = (txdesc->lmac).buffer;
  ptVar6 = (txdesc->lmac).hw_desc;
  puVar1 = (txdesc->host).pbuf_chained_ptr;
  iVar2 = 0;
  ptVar3 = ptVar5->tbd_body;
  while (*puVar1 != 0) {
    ptVar3->upatterntx = 0xcafefade;
    uVar4 = *puVar1;
    ptVar3->datastartptr = uVar4;
    uVar7 = puVar1[4];
    ptVar3->bufctrlinfo = 0;
    iVar2 = iVar2 + 1;
    ptVar3->dataendptr = (uVar4 + uVar7) - 1;
    *(tx_pbd **)&ptVar3->next = ptVar3 + 1;
    puVar1 = puVar1 + 1;
    in_a2 = ptVar3;
    ptVar3 = ptVar3 + 1;
  }
  if (iVar2 == 0) {
    printf("%s: assert when set add_pbd chain\r\n","txl_buffer_update_thd");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  uVar4 = ptVar5->lenheader;
  (ptVar5->tbd).upatterntx = 0xcafefade;
  *(txl_buffer_tag **)&(ptVar5->tbd).datastartptr = ptVar5 + 1;
  *(uint8_t **)&(ptVar5->tbd).dataendptr = ptVar5->tkip_mic_icv + uVar4 + 0xb;
  *(tx_pbd **)&(ptVar5->tbd).next = ptVar5->tbd_body;
  (ptVar5->tbd).bufctrlinfo = 0;
  *(tx_pbd **)&(ptVar6->thd).field_3 = &ptVar5->tbd;
  in_a2->bufctrlinfo = 0;
  (ptVar6->thd).macctrlinfo2 = 0x100;
  in_a2->next = 0;
  return;
}



void txl_cfm_init(void)

{
  memset(&txl_cfm_env,0,0x28);
  co_list_init((co_list *)&txl_cfm_env);
  co_list_init(txl_cfm_env.cfmlist + 1);
  co_list_init(txl_cfm_env.cfmlist + 2);
  co_list_init(txl_cfm_env.cfmlist + 3);
  co_list_init(txl_cfm_env.cfmlist + 4);
  return;
}



void txl_cfm_push(txdesc *txdesc,uint32_t status,uint8_t access_category)

{
  undefined3 in_register_00002031;
  
  ((txdesc->lmac).hw_desc)->cfm_ptr->status = status;
  co_list_push_back(txl_cfm_env.cfmlist + CONCAT31(in_register_00002031,access_category),
                    (co_list_hdr *)txdesc);
  ke_evt_set(txl_cfm_evt_bit[CONCAT31(in_register_00002031,access_category)]);
  return;
}


/*
Unable to decompile 'txl_cfm_evt'
Cause: Exception while decompiling 2301c59a: Decompiler process died

*/


