pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void txl_cfm_flush(uint8_t access_category,co_list *list,uint32_t status)

{
  txdesc *txdesc;
  tx_cfm_tag *ptVar1;
  
  while (txdesc = (txdesc *)co_list_pop_front(list), txdesc != (txdesc *)0x0) {
    ptVar1 = ((txdesc->lmac).hw_desc)->cfm_ptr;
    if ((txdesc->lmac).agg_desc == (tx_agg_desc *)0x0) {
      if (-1 < (int)ptVar1->status) {
        ptVar1->status = status;
      }
    }
    else {
      ptVar1->status = status | 0x3c000000;
    }
    if ((txdesc->host).packet_addr == 0) {
      txl_frame_cfm(txdesc);
    }
    else {
      txu_cntrl_cfm(txdesc);
      txl_cntrl_env.pck_cnt = txl_cntrl_env.pck_cnt - 1;
      if ((txdesc->lmac).buffer != (txl_buffer_tag *)0x0) {
        (txdesc->lmac).buffer = (txl_buffer_tag *)0x0;
      }
    }
  }
  txl_frame_evt(0);
  ipc_emb_txcfm_ind(1 << ((uint)access_category & 0x1f));
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void txl_cfm_dma_int_handler(void)

{
  ps_env.prevent_sleep = ps_env.prevent_sleep & 0xfffffffe;
  _DAT_44a00020 = _DAT_44a00024 & 0x100;
  return;
}



void txl_cfm_dump(void)

{
  txl_cfm_env_tag *list;
  uint32_t uVar1;
  uint32_t **ppuVar2;
  
  list = &txl_cfm_env;
  do {
    uVar1 = co_list_cnt((co_list *)list);
    if (uVar1 != 0) {
      ppuVar2 = (uint32_t **)((bam_env_tag *)list)->pkt_cnt;
      while (ppuVar2 != (uint32_t **)0x0) {
        ppuVar2 = (uint32_t **)*ppuVar2;
      }
    }
    list = (txl_cfm_env_tag *)&((bam_env_tag *)list)->ssn;
  } while ((bam_env_tag *)list != bam_env);
  return;
}



void bam_init(void)

{
  bam_env[0].sta_idx = -1;
  ke_state_set(8,0);
  return;
}



void bam_send_air_action_frame
               (int param_1,bam_env_tag *param_2,int param_3,uint8_t param_4,int param_5,
               uint16_t param_6,cfm_func_ptr *param_7)

{
  byte bVar1;
  uint8_t ac;
  uint16_t uVar2;
  txl_frame_desc_tag *frame;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  txl_buffer_tag *ptVar3;
  tx_hw_desc *ptVar4;
  int iVar5;
  uint uVar6;
  char acStack72 [20];
  
  bVar1 = sta_info_tab[param_1].inst_nbr;
  uVar6 = (uint)bVar1;
  phy_get_channel((phy_channel_info *)acStack72,'\0');
  frame = txl_frame_get((uint)(acStack72[0] != '\0'),0x100);
  if (frame == (txl_frame_desc_tag *)0x0) {
    return;
  }
  tpc_update_frame_tx_power(vif_info_tab + uVar6,frame);
  ptVar3 = (frame->txdesc).lmac.buffer;
  *(undefined *)&ptVar3[1].length = 0xd0;
  *(undefined *)((int)&ptVar3[1].length + 1) = 0;
  *(undefined *)((int)&ptVar3[1].length + 2) = 0;
  *(undefined *)((int)&ptVar3[1].length + 3) = 0;
  *(uint16_t *)&ptVar3[1].lenheader = sta_info_tab[param_1].mac_addr.array[0];
  *(uint16_t *)((int)&ptVar3[1].lenheader + 2) = sta_info_tab[param_1].mac_addr.array[1];
  *(uint16_t *)&ptVar3[1].lenpad = sta_info_tab[param_1].mac_addr.array[2];
  *(uint16_t *)((int)&ptVar3[1].lenpad + 2) = vif_info_tab[uVar6].mac_addr.array[0];
  *(uint16_t *)&ptVar3[1].flags = vif_info_tab[uVar6].mac_addr.array[1];
  *(uint16_t *)((int)&ptVar3[1].flags + 2) = vif_info_tab[uVar6].mac_addr.array[2];
  if (vif_info_tab[uVar6].type == '\x02') {
    *(uint16_t *)&ptVar3[1].next = vif_info_tab[uVar6].mac_addr.array[0];
    *(uint16_t *)((int)&ptVar3[1].next + 2) = vif_info_tab[uVar6].mac_addr.array[1];
    uVar2 = vif_info_tab[uVar6].mac_addr.array[2];
  }
  else {
    *(uint16_t *)&ptVar3[1].next = sta_info_tab[param_1].mac_addr.array[0];
    *(uint16_t *)((int)&ptVar3[1].next + 2) = sta_info_tab[param_1].mac_addr.array[1];
    uVar2 = sta_info_tab[param_1].mac_addr.array[2];
  }
  *(uint16_t *)&ptVar3[1].txdesc = uVar2;
  uVar6 = (uint)txl_cntrl_env.seqnbr;
  txl_cntrl_env.seqnbr = (uint16_t)((uVar6 + 1) * 0x10000 >> 0x10);
  iVar5 = (uVar6 + 1) * 0x100000;
  *(undefined *)((int)&ptVar3[1].txdesc + 2) = (char)((uint)iVar5 >> 0x10);
  *(undefined *)((int)&ptVar3[1].txdesc + 3) = (char)((uint)iVar5 >> 0x18);
  (frame->txdesc).host.vif_idx = bVar1;
  (frame->txdesc).host.staid = (uint8_t)param_1;
  if (param_3 == 1) {
    uVar2 = me_build_add_ba_rsp((uint32_t)ptVar3[1].dma_desc,param_2,(uint16_t)param_5,param_4,
                                param_6);
    iVar5 = CONCAT22(extraout_var_00,uVar2);
LAB_2301c8fc:
    iVar5 = iVar5 + 0x18;
  }
  else {
    if (param_3 == 0) {
      ac = "\x01"[param_5 >> 2 & 0xf];
      uVar2 = me_build_add_ba_req((uint32_t)ptVar3[1].dma_desc,param_2);
      iVar5 = CONCAT22(extraout_var,uVar2) + 0x18;
      goto LAB_2301c8ae;
    }
    if (param_3 == 2) {
      uVar2 = me_build_del_ba((uint32_t)ptVar3[1].dma_desc,param_2,param_6);
      iVar5 = CONCAT22(extraout_var_01,uVar2);
      goto LAB_2301c8fc;
    }
    assert_warn("0","module",0x25d);
    iVar5 = 0x18;
  }
  ac = '\x03';
LAB_2301c8ae:
  ptVar4 = (frame->txdesc).lmac.hw_desc;
  (ptVar4->thd).field_5 = (ptVar4->thd).field_4 + -1 + iVar5;
  (ptVar4->thd).frmlen = iVar5 + 4;
  if (param_7 != (cfm_func_ptr *)0x0) {
    (frame->cfm).cfm_func = param_7;
    *(bam_env_tag **)&(frame->cfm).env = param_2;
  }
  txl_frame_push(frame,ac);
  return;
}



undefined4 rxu_mgt_ind_handler(int param_1)

{
  int iVar1;
  int iVar2;
  byte bVar3;
  byte bVar4;
  ushort uVar5;
  uint uVar6;
  uint uVar7;
  
  if (*(char *)(param_1 + 0x1d) == '\0') {
    uVar5 = *(ushort *)(param_1 + 0x1f);
    bVar3 = *(byte *)(param_1 + 7);
    bVar4 = *(byte *)(param_1 + 0x1e);
    iVar1 = 0x408;
    if ((uVar5 & 1) != 0) {
      iVar1 = 0x40c;
    }
    iVar2 = 0x418;
    if ((uVar5 & 2) == 0) {
      iVar2 = 0x42c;
    }
    uVar7 = (uint)(uVar5 >> 6);
    printf(
           "-----------------> AABA Request:\r\n    A-MSDU: %s\r\n    Block Ack Policy: %s\r\n    TID: %u\r\n    Number of Buffers: %u\r\n"
           ,iVar1 + 0x23078000,iVar2 + 0x23078000,(int)(uint)uVar5 >> 2 & 0xf,uVar7);
    if (8 < uVar5 >> 6) {
      uVar7 = 8;
    }
    uVar6 = SEXT24((short)((ushort)(uVar7 << 6) | uVar5 & 0x3e | 2));
    uVar7 = uVar6 & 0xffff;
    printf(
           "-----------------> AABA Response:\r\n    A-MSDU: %s\r\n    Block Ack Policy: %s\r\n    TID: %u\r\n    Number of Buffers: %u\r\n"
           ,"Not Permitted","Immediate Block Ack",(int)uVar6 >> 2 & 0xf,uVar7 >> 6);
    bam_send_air_action_frame((uint)bVar3,0,1,(uint)bVar4,uVar7,0,0);
    return 0;
  }
  return 0;
}



