pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint32_t me_add_ie_tim(uint32_t *frame_addr,uint8_t dtim_period)

{
  *(undefined *)*frame_addr = 5;
  *(undefined *)(*frame_addr + 1) = 4;
  *(uint8_t *)(*frame_addr + 3) = dtim_period;
  *frame_addr = *frame_addr + 6;
  return 6;
}



uint32_t me_add_ie_ht_capa(uint32_t *frame_addr)

{
  uint16_t uVar1;
  uint32_t uVar2;
  uint uVar3;
  
  uVar3 = (uint)me_env.ht_cap.ht_capa_info;
  *(undefined *)*frame_addr = 0x2d;
  *(undefined *)(*frame_addr + 1) = 0x1a;
  uVar2 = *frame_addr;
  *(byte *)(uVar2 + 2) = (byte)(uVar3 & 0xfffffff3) | 0xc;
  *(undefined *)(uVar2 + 3) = (char)((uVar3 & 0xfffffff3) >> 8);
  *(uint8_t *)(*frame_addr + 4) = me_env.ht_cap.a_mpdu_param;
  co_pack8p(*frame_addr + 5,me_env.ht_cap.mcs_rate,0x10);
  uVar1 = me_env.ht_cap.ht_extended_capa;
  uVar2 = *frame_addr;
  *(undefined *)(uVar2 + 0x15) = (char)me_env.ht_cap.ht_extended_capa;
  *(undefined *)(uVar2 + 0x16) = (char)(uVar1 >> 8);
  co_pack8p(*frame_addr + 0x17,(uint8_t *)&me_env.ht_cap.tx_beamforming_capa,4);
  *(uint8_t *)(*frame_addr + 0x1b) = me_env.ht_cap.asel_capa;
  *frame_addr = *frame_addr + 0x1c;
  return 0x1c;
}



uint32_t me_add_ie_ht_oper(uint32_t *frame_addr,vif_info_tag *p_vif_entry)

{
  chan_ctxt_tag *pcVar1;
  int iVar2;
  uint8_t uVar3;
  uint32_t uVar4;
  
  pcVar1 = p_vif_entry->chan_ctxt;
  *(undefined *)*frame_addr = 0x3d;
  *(undefined *)(*frame_addr + 1) = 0x16;
  iVar2 = phy_freq_to_channel((pcVar1->channel).band,(pcVar1->channel).prim20_freq);
  *(undefined *)(*frame_addr + 2) = (char)iVar2;
  uVar3 = (pcVar1->channel).type;
  if ((uVar3 != '\0') &&
     (uVar3 = '\a', (pcVar1->channel).prim20_freq <= (pcVar1->channel).center1_freq)) {
    uVar3 = '\x05';
  }
  *(uint8_t *)(*frame_addr + 3) = uVar3;
  uVar4 = *frame_addr;
  *(undefined *)(uVar4 + 4) = 3;
  *(undefined *)(uVar4 + 5) = 0;
  uVar4 = *frame_addr;
  *(undefined *)(uVar4 + 6) = 0;
  *(undefined *)(uVar4 + 7) = 0;
  *(undefined *)(*frame_addr + 8) = 0xff;
  *frame_addr = *frame_addr + 0x18;
  return 0x18;
}



uint16_t me_build_authenticate
                   (uint32_t frame,uint16_t algo_type,uint16_t seq_nbr,uint16_t status_code,
                   uint32_t *challenge_array_ptr)

{
  undefined *puVar1;
  undefined *puVar2;
  int iVar3;
  
  *(char *)frame = (char)algo_type;
  *(undefined *)(frame + 2) = (char)seq_nbr;
  *(undefined *)(frame + 4) = (char)status_code;
  *(undefined *)(frame + 1) = (char)(algo_type >> 8);
  *(undefined *)(frame + 3) = (char)(seq_nbr >> 8);
  *(undefined *)(frame + 5) = (char)(status_code >> 8);
  if (challenge_array_ptr != (uint32_t *)0x0) {
    *(undefined *)(frame + 6) = 0x10;
    *(undefined *)(frame + 7) = 0x80;
    iVar3 = 0;
    do {
      puVar1 = (undefined *)((int)challenge_array_ptr + iVar3);
      puVar2 = (undefined *)(frame + 8 + iVar3);
      iVar3 = iVar3 + 1;
      *puVar2 = *puVar1;
    } while (iVar3 != 0x80);
    return 0x88;
  }
  return 6;
}



uint16_t me_build_deauthenticate(uint32_t frame,uint16_t reason_code)

{
  *(char *)frame = (char)reason_code;
  *(undefined *)(frame + 1) = (char)(reason_code >> 8);
  return 2;
}



// WARNING: Could not reconcile some variable overlaps

uint16_t me_build_associate_req
                   (uint32_t frame,mac_bss_info *bss,mac_addr *old_ap_addr_ptr,uint8_t vif_idx,
                   uint32_t *ie_addr,uint16_t *ie_len,sm_connect_req *con_par)

{
  byte bVar1;
  uint32_t *puVar2;
  uint8_t uVar3;
  ushort uVar4;
  mac_ssid *pmVar5;
  int8_t *piVar6;
  uint uVar7;
  uint16_t uVar8;
  short sVar9;
  int iVar10;
  uint16_t uVar11;
  uint32_t uVar12;
  uint32_t uVar13;
  uint uVar14;
  char *pcVar15;
  int8_t *dst;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  me_chan_config_req *pmVar20;
  char cVar21;
  char cVar22;
  uint uVar23;
  uint8_t uVar24;
  int8_t *apiStack100 [4];
  int8_t iStack81;
  undefined2 uStack80;
  undefined uStack78;
  int8_t min;
  int8_t max;
  
  uVar8 = con_par->listen_interval;
  uVar4 = con_par->ie_len;
  if (uVar8 == 0) {
    uVar8 = 5;
  }
  apiStack100[0] = (int8_t *)frame;
  uVar11 = me_build_capability(vif_idx);
  *apiStack100[0] = (int8_t)uVar11;
  apiStack100[0][1] = (int8_t)(uVar11 >> 8);
  apiStack100[0][2] = (int8_t)uVar8;
  apiStack100[0][3] = (int8_t)(uVar8 >> 8);
  iVar10 = 4;
  if (old_ap_addr_ptr != (mac_addr *)0x0) {
    iVar10 = 10;
    *(uint16_t *)(apiStack100[0] + 4) = old_ap_addr_ptr->array[0];
    *(uint16_t *)(apiStack100[0] + 6) = old_ap_addr_ptr->array[1];
    *(uint16_t *)(apiStack100[0] + 8) = old_ap_addr_ptr->array[2];
  }
  apiStack100[0] = apiStack100[0] + iVar10;
  *(int8_t **)ie_addr = apiStack100[0];
  uVar12 = me_add_ie_ssid((uint32_t *)apiStack100,(bss->ssid).length,(bss->ssid).array);
  uVar13 = me_add_ie_supp_rates((uint32_t *)apiStack100,&bss->rate_set);
  sVar9 = (short)iVar10 + (short)uVar13 + (short)uVar12;
  if (8 < (bss->rate_set).length) {
    uVar12 = me_add_ie_ext_supp_rates((uint32_t *)apiStack100,&bss->rate_set);
    sVar9 = sVar9 + (short)uVar12;
  }
  if ((uVar11 & 0x100) != 0) {
    dst = apiStack100[0] + 1;
    *apiStack100[0] = '!';
    apiStack100[0] = apiStack100[0] + 2;
    *dst = '\x02';
    phy_get_rf_gain_capab((int8_t *)&uStack80,&iStack81);
    bVar1 = bss->chan->tx_power;
    if ((char)bVar1 < (char)uStack80) {
      uStack80 = uStack80 & 0xff00 | (ushort)bVar1;
    }
    *apiStack100[0] = iStack81;
    apiStack100[0][1] = (char)uStack80;
    dst = apiStack100[0] + 3;
    apiStack100[0][2] = '$';
    apiStack100[0] = apiStack100[0] + 4;
    if (bss->chan->band == '\0') {
      pmVar20 = &me_env.chan;
      iVar10 = 1;
      uVar3 = me_env.chan.chan2G4_cnt;
    }
    else {
      pmVar20 = (me_chan_config_req *)me_env.chan.chan5G;
      iVar10 = 4;
      uVar3 = me_env.chan.chan5G_cnt;
    }
    uVar19 = 0;
    cVar21 = '\0';
    uVar24 = '\0';
    uVar7 = 0;
    uVar17 = 0;
    while( true ) {
      piVar6 = apiStack100[0];
      uVar23 = uVar19 + 2 & 0xff;
      pcVar15 = apiStack100[0] + 1;
      if (uVar24 == uVar3) break;
      uVar16 = uVar7;
      uVar18 = uVar17;
      if ((pmVar20->chan2G4[0].flags & 2) == 0) {
        uVar14 = phy_freq_to_channel(pmVar20->chan2G4[0].band,pmVar20->chan2G4[0].freq);
        uVar16 = uVar14 & 0xff;
        uVar18 = uVar16;
        cVar22 = cVar21;
        if ((cVar21 != '\0') && (uVar18 = uVar17, (uVar14 & 0xff) - uVar7 != iVar10)) {
          cVar22 = cVar21 + '\x01';
          *piVar6 = (int8_t)uVar17;
          apiStack100[0] = piVar6 + 2;
          *pcVar15 = cVar21;
          uVar19 = uVar23;
        }
        cVar21 = cVar22 + '\x01';
        pmVar20 = (me_chan_config_req *)(pmVar20->chan2G4 + 1);
      }
      uVar24 = uVar24 + '\x01';
      uVar7 = uVar16;
      uVar17 = uVar18;
    }
    *apiStack100[0] = (int8_t)uVar17;
    sVar9 = sVar9 + 6 + (short)uVar23;
    apiStack100[0] = apiStack100[0] + 2;
    *pcVar15 = cVar21;
    *dst = (int8_t)uVar23;
  }
  pmVar5 = &con_par->ssid;
  iVar10 = -(int)con_par;
  while ((sm_connect_req *)(&pmVar5->length + uVar4) != con_par) {
    puVar2 = con_par->ie_buf;
    dst = apiStack100[0] + iVar10 + (int)con_par;
    con_par = (sm_connect_req *)(con_par->ssid).array;
    *dst = *(int8_t *)puVar2;
  }
  uVar8 = sVar9 + uVar4;
  dst = apiStack100[0] + uVar4;
  apiStack100[0] = dst;
  if ((bss->valid_flags & 1) != 0) {
    memset(&uStack78,0,0xe);
    uStack80 = 0x7dd;
    min = 'P';
    co_pack8p((uint32_t)dst,(uint8_t *)&uStack80,9);
    uVar8 = uVar8 + (ushort)uStack80._1_1_ + 2;
    apiStack100[0] = apiStack100[0] + (uint)uStack80._1_1_ + 2;
  }
  if (((bss->valid_flags & 2) != 0) && (me_env.ht_supported != false)) {
    uVar12 = me_add_ie_ht_capa((uint32_t *)apiStack100);
    uVar8 = uVar8 + (short)uVar12;
  }
  *ie_len = (short)apiStack100[0] - (short)*ie_addr;
  return uVar8;
}



uint16_t me_build_add_ba_req(uint32_t frame,bam_env_tag *bam_env)

{
  uint16_t uVar1;
  uint uVar2;
  int iVar3;
  
