pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  *(undefined *)frame = 3;
  *(undefined *)(frame + 1) = 0;
  *(uint8_t *)(frame + 2) = bam_env->dialog_token;
  uVar2 = (uint)bam_env->ba_policy << 1 | (uint)bam_env->tid << 2 | (uint)bam_env->buffer_size << 6;
  *(undefined *)(frame + 3) = (char)uVar2;
  *(undefined *)(frame + 4) = (char)(uVar2 >> 8);
  uVar1 = bam_env->ba_timeout;
  *(undefined *)(frame + 5) = (char)uVar1;
  *(undefined *)(frame + 6) = (char)(uVar1 >> 8);
  iVar3 = (uint)bam_env->ssn << 0x14;
  *(undefined *)(frame + 7) = (char)((uint)iVar3 >> 0x10);
  *(undefined *)(frame + 8) = (char)((uint)iVar3 >> 0x18);
  return 9;
}



uint16_t me_build_add_ba_rsp(uint32_t frame,bam_env_tag *bam_env,uint16_t param,uint8_t dialog_token
                            ,uint16_t status_code)

{
  undefined2 in_register_0000203a;
  
  *(undefined *)frame = 3;
  *(undefined *)(frame + 1) = 1;
  *(undefined *)(frame + 5) = (char)param;
  *(undefined *)(frame + 4) = (char)(status_code >> 8);
  *(uint8_t *)(frame + 2) = dialog_token;
  *(undefined *)(frame + 3) = (char)status_code;
  *(undefined *)(frame + 6) = (char)(param >> 8);
  if (CONCAT22(in_register_0000203a,status_code) == 0) {
    *(undefined *)(frame + 7) = 0xd0;
    *(undefined *)(frame + 8) = 7;
  }
  else {
    *(undefined *)(frame + 7) = 0;
    *(undefined *)(frame + 8) = 0;
  }
  return 9;
}



uint16_t me_build_del_ba(uint32_t frame,bam_env_tag *bam_env,uint16_t reason_code)

{
  byte bVar1;
  
  *(undefined *)frame = 3;
  *(undefined *)(frame + 1) = 2;
  bVar1 = (byte)(((uint)bam_env->tid << 0x1c) >> 0x18);
  if (bam_env->dev_type == '\x01') {
    bVar1 = bVar1 | 8;
  }
  *(undefined *)(frame + 2) = 0;
  *(byte *)(frame + 3) = bVar1;
  *(undefined *)(frame + 4) = (char)reason_code;
  *(undefined *)(frame + 5) = (char)(reason_code >> 8);
  return 6;
}



void me_extract_rate_set(uint32_t buffer,uint16_t buflen,mac_rateset *mac_rate_set_ptr)

{
  byte bVar1;
  byte bVar2;
  int iVar3;
  undefined2 in_register_0000202e;
  uint uVar4;
  uint8_t *puVar5;
  uint uVar6;
  
  mac_rate_set_ptr->length = '\0';
  iVar3 = mac_ie_find(CONCAT22(in_register_0000202e,buflen),1);
  if (iVar3 != 0) {
    bVar1 = *(byte *)(iVar3 + 1);
    uVar4 = (uint)bVar1;
    if (bVar1 < 0xd) {
      puVar5 = mac_rate_set_ptr->array;
      while (uVar4 = uVar4 - 1, uVar4 != 0xffffffff) {
        *puVar5 = (puVar5 + 1)[iVar3 - (int)mac_rate_set_ptr];
        puVar5 = puVar5 + 1;
      }
      mac_rate_set_ptr->length = bVar1;
      iVar3 = mac_ie_find(buffer,CONCAT22(in_register_0000202e,buflen),0x32);
      if (iVar3 != 0) {
        bVar1 = *(byte *)(iVar3 + 1);
        uVar4 = (uint)bVar1;
        if (0xc < mac_rate_set_ptr->length + uVar4) {
          assert_err("mac_rate_set_ptr->length + elmt_length <= MAC_RATESET_LEN","module",0x396);
        }
        bVar2 = mac_rate_set_ptr->length;
        if (bVar2 + uVar4 < 0xd) {
          uVar6 = 0;
          while (uVar4 != uVar6) {
            mac_rate_set_ptr->array[bVar2 + uVar6] = *(uint8_t *)(iVar3 + 2 + uVar6);
            uVar6 = uVar6 + 1;
          }
          mac_rate_set_ptr->length = bVar1 + mac_rate_set_ptr->length;
        }
      }
    }
  }
  return;
}



void me_extract_power_constraint(uint32_t buffer,uint16_t buflen,mac_bss_info *bss)

{
  int iVar1;
  uint8_t uVar2;
  
  iVar1 = mac_ie_find(0x20);
  uVar2 = '\0';
  if (iVar1 != 0) {
    uVar2 = *(uint8_t *)(iVar1 + 2);
  }
  bss->power_constraint = uVar2;
  return;
}



void me_extract_country_reg(int param_1)

{
  uint16_t *puVar1;
  int iVar2;
  uint uVar3;
  byte *pbVar4;
  uint uVar5;
  byte bVar6;
  uint uVar7;
  int iVar8;
  
  iVar2 = mac_ie_find(7);
  if (iVar2 != 0) {
    puVar1 = *(uint16_t **)(param_1 + 0x4c);
    iVar8 = 1;
    if (*(uint8_t *)(puVar1 + 1) != '\0') {
      iVar8 = 4;
    }
    uVar3 = phy_freq_to_channel(*(uint8_t *)(puVar1 + 1),*puVar1);
    uVar7 = 5;
    while (uVar7 <= (uint)*(byte *)(iVar2 + 1) + 1) {
      pbVar4 = (byte *)(uVar7 + iVar2);
      uVar5 = (uint)*pbVar4;
      bVar6 = 0;
      while (bVar6 != pbVar4[1]) {
        if (uVar5 == (uVar3 & 0xff)) {
          *(byte *)(puVar1 + 2) = pbVar4[2];
          return;
        }
        bVar6 = bVar6 + 1;
        uVar5 = uVar5 + iVar8 & 0xff;
      }
      uVar7 = uVar7 + 3 & 0xff;
    }
  }
  return;
}



void me_extract_mobility_domain(uint32_t buffer,uint16_t buflen,mac_bss_info *bss)

{
  int iVar1;
  
  iVar1 = mac_ie_find(0x36);
  if (iVar1 == 0) {
    (bss->mde).mdid = 0;
    (bss->mde).ft_capability_policy = '\0';
  }
  else {
    (bss->mde).mdid = *(uint16_t *)(iVar1 + 2);
    (bss->mde).ft_capability_policy = *(uint8_t *)(iVar1 + 4);
  }
  return;
}



uint me_extract_csa(undefined4 param_1,undefined4 param_2,undefined *param_3,int param_4)

{
  byte bVar1;
  byte bVar2;
  bool band;
  short sVar3;
  uint16_t uVar4;
  uint16_t uVar5;
  uint16_t uVar6;
  uint uVar7;
  uint uVar8;
  int iVar9;
  int iVar10;
  undefined uVar11;
  
  uVar7 = mac_ie_find(0x25);
  uVar8 = mac_ie_find(param_1,param_2,0x3c);
  if ((uVar7 | uVar8) == 0) {
    return 0;
  }
  iVar9 = mac_ie_find(param_1,param_2,0x3e);
  iVar10 = mac_ie_find(param_1,param_2,0xc4);
  if (iVar10 != 0) {
    iVar10 = mac_ie_find(iVar10 + 2,(uint)*(byte *)(iVar10 + 1),0xc2);
  }
  if (uVar7 == 0) {
    bVar1 = *(byte *)(uVar8 + 5);
    *param_3 = *(undefined *)(uVar8 + 2);
    bVar2 = *(byte *)(uVar8 + 4);
  }
  else {
    bVar1 = *(byte *)(uVar7 + 4);
    *param_3 = *(undefined *)(uVar7 + 2);
    bVar2 = *(byte *)(uVar7 + 3);
  }
  uVar7 = (uint)bVar1;
  if (bVar1 == 0) {
    uVar7 = 2;
  }
  band = 0xe < bVar2;
  uVar4 = phy_channel_to_freq(band,(uint)bVar2);
  if (iVar10 != 0) {
    uVar8 = (uint)*(byte *)(iVar10 + 2) - 1 & 0xff;
    bVar1 = *(byte *)(iVar10 + 4);
    uVar11 = 1;
    if (uVar8 < 3) {
      uVar11 = *(undefined *)((int)&CSWTCH_115 + uVar8);
    }
    uVar5 = phy_channel_to_freq(band,(uint)*(byte *)(iVar10 + 3));
    uVar6 = 0;
    if (bVar1 != 0) {
      uVar6 = phy_channel_to_freq(band,(uint)bVar1);
    }
    goto LAB_2301d564;
  }
  if (iVar9 == 0) {
LAB_2301d5c6:
    uVar6 = 0;
    uVar11 = 0;
    uVar5 = uVar4;
  }
  else {
    sVar3 = 10;
    if (*(char *)(iVar9 + 2) != '\x01') {
      if (*(char *)(iVar9 + 2) != '\x03') goto LAB_2301d5c6;
      sVar3 = -10;
    }
    uVar6 = 0;
    uVar11 = 1;
    uVar5 = uVar4 + sVar3;
  }
LAB_2301d564:
  *(uint16_t *)(param_4 + 6) = uVar6;
  *(bool *)param_4 = band;
  *(undefined *)(param_4 + 1) = uVar11;
  *(uint16_t *)(param_4 + 2) = uVar4;
  *(uint16_t *)(param_4 + 4) = uVar5;
  return uVar7;
}



