pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

uint16_t me_build_beacon(uint32_t frame,uint8_t vif_idx,uint16_t *tim_oft,uint8_t *tim_len,
                        uint8_t hidden_ssid)

{
  uint8_t enc_type;
  short sVar1;
  uint16_t uVar2;
  uint32_t uVar3;
  uint32_t uVar4;
  uint32_t uVar5;
  uint32_t uVar6;
  uint8_t ssid_len;
  undefined3 in_register_0000202d;
  int iVar7;
  uint8_t *p_ssid;
  undefined3 in_register_00002039;
  uint uVar8;
  int iVar9;
  undefined *puVar10;
  mac_rateset *p_rateset;
  uint32_t uStack68;
  undefined2 uStack64;
  undefined uStack62;
  undefined uStack61;
  uint8_t wme_ie [16];
  
  iVar7 = CONCAT31(in_register_0000202d,vif_idx);
  enc_type = vif_info_tab[iVar7].bss_info.sec_type;
  *(undefined *)frame = 0x80;
  *(undefined *)(frame + 1) = 0;
  *(undefined *)(frame + 2) = 0;
  *(undefined *)(frame + 3) = 0;
  uStack68 = frame;
  memcpy((void *)(frame + 4),&mac_addr_bcst,6);
  memcpy((void *)(frame + 10),&vif_info_tab[iVar7].mac_addr,6);
  memcpy((void *)(frame + 0x10),&vif_info_tab[iVar7].mac_addr,6);
  uVar8 = (uint)txl_cntrl_env.seqnbr;
  txl_cntrl_env.seqnbr = (uint16_t)((uVar8 + 1) * 0x10000 >> 0x10);
  iVar9 = (uVar8 + 1) * 0x100000;
  *(undefined *)(frame + 0x16) = (char)((uint)iVar9 >> 0x10);
  *(undefined *)(frame + 0x17) = (char)((uint)iVar9 >> 0x18);
  uVar2 = vif_info_tab[iVar7].bss_info.beacon_interval;
  *(undefined *)(uStack68 + 0x20) = (char)uVar2;
  *(undefined *)(uStack68 + 0x21) = (char)(uVar2 >> 8);
  uVar2 = me_build_capability(vif_idx);
  if (enc_type != '\0') {
    uVar2 = uVar2 | 0x10;
  }
  p_ssid = vif_info_tab[iVar7].bss_info.ssid.array;
  *(undefined *)(uStack68 + 0x22) = (char)uVar2;
  *(undefined *)(uStack68 + 0x23) = (char)(uVar2 >> 8);
  uStack68 = uStack68 + 0x24;
  if (CONCAT31(in_register_00002039,hidden_ssid) == 0) {
    ssid_len = vif_info_tab[iVar7].bss_info.ssid.length;
  }
  else {
    printf("Using Hidden SSID [%s]\r\n",p_ssid);
    p_ssid = (uint8_t *)0x0;
    ssid_len = '\0';
  }
  uVar3 = me_add_ie_ssid(&uStack68,ssid_len,p_ssid);
  p_rateset = &vif_info_tab[iVar7].bss_info.rate_set;
  uVar4 = me_add_ie_supp_rates(&uStack68,p_rateset);
  uVar8 = (uVar3 + 0x24 & 0xffff) + uVar4 & 0xffff;
  if (8 < vif_info_tab[iVar7].bss_info.rate_set.length) {
    uVar3 = me_add_ie_ext_supp_rates(&uStack68,p_rateset);
    uVar8 = uVar8 + uVar3 & 0xffff;
  }
  uVar3 = me_add_ie_ds(&uStack68,
                       (char)((int)((uint)(vif_info_tab[iVar7].bss_info.chan)->freq - 0x96c) / 5) +
                       '\x01');
  *tim_oft = (uint16_t)((uVar8 + uVar3) * 0x10000 >> 0x10);
  uVar4 = me_add_ie_tim(&uStack68,*(uint8_t *)&vif_info_tab[iVar7].bss_info.beacon_period);
  *tim_len = (uint8_t)(uVar4 & 0xff);
  uVar5 = me_add_ie_rsn(&uStack68,enc_type);
  memcpy(int_rsn_ie,(void *)(uStack68 - (uVar5 & 0xff)),uVar5 & 0xff);
  uVar6 = me_add_ie_erp(&uStack68,'\0');
  sVar1 = (short)(uVar8 + uVar3) + (short)(uVar4 & 0xff) + (short)uVar6 + ((ushort)uVar5 & 0xff);
  if ((vif_info_tab[iVar7].bss_info.valid_flags & 2) != 0) {
    uVar3 = me_add_ie_ht_capa(&uStack68);
    uVar4 = me_add_ie_ht_oper(&uStack68,vif_info_tab + iVar7);
    sVar1 = sVar1 + (short)uVar4 + (short)uVar3;
  }
  uVar3 = me_add_ie_wpa(&uStack68,enc_type);
  uVar2 = sVar1 + (short)uVar3;
  if ((vif_info_tab[iVar7].bss_info.valid_flags & 1) != 0) {
    memset(&uStack62,0,0xe);
    uStack64 = 0x7dd;
    uStack61 = 0x50;
    wme_ie._0_2_ = 0x2f2;
    wme_ie[3] = '\x01';
    wme_ie[4] = vif_info_tab[iVar7].bss_info.edca_param.qos_info;
    co_pack8p(uStack68,(uint8_t *)&uStack64,9);
    *(char *)(uStack68 + 1) = *(char *)(uStack68 + 1) + '\x11';
    puVar10 = (undefined *)(uStack68 + 2 + (uint)uStack64._1_1_);
    *puVar10 = 0;
    uVar3 = vif_info_tab[iVar7].txq_params[1];
    puVar10[1] = (char)uVar3;
    puVar10[2] = (char)(uVar3 >> 8);
    puVar10[3] = (char)(uVar3 >> 0x10);
    puVar10[4] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[0];
    puVar10[5] = (char)uVar3;
    puVar10[6] = (char)(uVar3 >> 8);
    puVar10[7] = (char)(uVar3 >> 0x10);
    puVar10[8] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[2];
    puVar10[9] = (char)uVar3;
    puVar10[10] = (char)(uVar3 >> 8);
    puVar10[0xb] = (char)(uVar3 >> 0x10);
    puVar10[0xc] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[3];
    puVar10[0xd] = (char)uVar3;
    puVar10[0xe] = (char)(uVar3 >> 8);
    puVar10[0xf] = (char)(uVar3 >> 0x10);
    puVar10[0x10] = (char)(uVar3 >> 0x18);
    uVar2 = uVar2 + (ushort)uStack64._1_1_ + 0x13;
  }
  return uVar2;
}



// WARNING: Variable defined which should be unmapped: wme_ie
// WARNING: Could not reconcile some variable overlaps

uint16_t me_build_probe_rsp(uint32_t frame,uint8_t vif_idx)

{
  uint8_t enc_type;
  short sVar1;
  uint16_t uVar2;
  uint32_t uVar3;
  uint32_t uVar4;
  int iVar5;
  uint32_t uVar6;
  undefined3 in_register_0000202d;
  int iVar7;
  scan_chan_tag *psVar8;
  undefined *puVar9;
  mac_rateset *p_rateset;
  uint32_t uStack52;
  undefined2 uStack48;
  undefined uStack46;
  undefined uStack45;
  uint8_t wme_ie [16];
  
  iVar7 = CONCAT31(in_register_0000202d,vif_idx);
  enc_type = vif_info_tab[iVar7].bss_info.sec_type;
  uVar2 = vif_info_tab[iVar7].bss_info.beacon_interval;
  *(undefined *)(frame + 8) = (char)uVar2;
  *(undefined *)(frame + 9) = (char)(uVar2 >> 8);
  uStack52 = frame;
  uVar2 = me_build_capability(vif_idx);
  if (enc_type != '\0') {
    uVar2 = uVar2 | 0x10;
  }
  *(undefined *)(uStack52 + 10) = (char)uVar2;
  *(undefined *)(uStack52 + 0xb) = (char)(uVar2 >> 8);
  uStack52 = uStack52 + 0xc;
  p_rateset = &vif_info_tab[iVar7].bss_info.rate_set;
  uVar3 = me_add_ie_ssid(&uStack52,vif_info_tab[iVar7].bss_info.ssid.length,
                         vif_info_tab[iVar7].bss_info.ssid.array);
  uVar4 = me_add_ie_supp_rates(&uStack52,p_rateset);
  sVar1 = (short)uVar3 + (short)uVar4 + 0xc;
  if (8 < vif_info_tab[iVar7].bss_info.rate_set.length) {
    uVar3 = me_add_ie_ext_supp_rates(&uStack52,p_rateset);
    sVar1 = sVar1 + (short)uVar3;
  }
  psVar8 = vif_info_tab[iVar7].bss_info.chan;
  iVar5 = phy_freq_to_channel(psVar8->band,psVar8->freq);
  uVar3 = me_add_ie_ds(&uStack52,(uint8_t)iVar5);
  uVar4 = me_add_ie_rsn(&uStack52,enc_type);
  uVar6 = me_add_ie_erp(&uStack52,'\0');
  sVar1 = sVar1 + (short)uVar4 + (short)uVar3 + (short)uVar6;
  if ((vif_info_tab[iVar7].bss_info.valid_flags & 2) != 0) {
    uVar3 = me_add_ie_ht_capa(&uStack52);
    uVar4 = me_add_ie_ht_oper(&uStack52,vif_info_tab + iVar7);
    sVar1 = sVar1 + (short)uVar4 + (short)uVar3;
  }
  uVar3 = me_add_ie_wpa(&uStack52,enc_type);
  uVar2 = sVar1 + (short)uVar3;
  if ((vif_info_tab[iVar7].bss_info.valid_flags & 1) != 0) {
    memset(&uStack46,0,0xe);
    uStack48 = 0x7dd;
    uStack45 = 0x50;
    wme_ie._0_2_ = 0x2f2;
    wme_ie[3] = '\x01';
    wme_ie[4] = vif_info_tab[iVar7].bss_info.edca_param.qos_info;
    co_pack8p(uStack52,(uint8_t *)&uStack48,9);
    *(char *)(uStack52 + 1) = *(char *)(uStack52 + 1) + '\x11';
    puVar9 = (undefined *)(uStack52 + 2 + (uint)uStack48._1_1_);
    *puVar9 = 0;
    uVar3 = vif_info_tab[iVar7].txq_params[1];
    puVar9[1] = (char)uVar3;
    puVar9[2] = (char)(uVar3 >> 8);
    puVar9[3] = (char)(uVar3 >> 0x10);
    puVar9[4] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[0];
    puVar9[5] = (char)uVar3;
    puVar9[6] = (char)(uVar3 >> 8);
    puVar9[7] = (char)(uVar3 >> 0x10);
    puVar9[8] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[2];
    puVar9[9] = (char)uVar3;
    puVar9[10] = (char)(uVar3 >> 8);
    puVar9[0xb] = (char)(uVar3 >> 0x10);
    puVar9[0xc] = (char)(uVar3 >> 0x18);
    uVar3 = vif_info_tab[iVar7].txq_params[3];
    puVar9[0xd] = (char)uVar3;
    puVar9[0xe] = (char)(uVar3 >> 8);
    puVar9[0xf] = (char)(uVar3 >> 0x10);
    puVar9[0x10] = (char)(uVar3 >> 0x18);
    uVar2 = uVar2 + (ushort)uStack48._1_1_ + 0x13;
  }
  return uVar2;
}



