pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

uint16_t me_build_associate_rsp
                   (uint32_t frame,uint8_t vif_idx,uint16_t status_code,me_sta_add_req *req)

{
  uint8_t uVar1;
  ushort uVar2;
  uint16_t uVar3;
  uint32_t uVar4;
  uint32_t uVar5;
  undefined3 in_register_0000202d;
  int iVar6;
  undefined2 in_register_00002032;
  undefined *puStack52;
  undefined2 uStack48;
  undefined uStack46;
  undefined uStack45;
  uint8_t wme_ie [16];
  
  iVar6 = CONCAT31(in_register_0000202d,vif_idx);
  uVar1 = vif_info_tab[iVar6].bss_info.sec_type;
  puStack52 = (undefined *)frame;
  uVar3 = me_build_capability(vif_idx);
  if (uVar1 != '\0') {
    uVar3 = uVar3 | 0x10;
  }
  *puStack52 = (char)uVar3;
  puStack52[1] = (char)(uVar3 >> 8);
  uVar3 = 6;
  puStack52[2] = (char)status_code;
  puStack52[3] = (char)(status_code >> 8);
  uVar2 = req->aid;
  puStack52[4] = (char)uVar2;
  puStack52[5] = (byte)((uint)uVar2 >> 8) | 0xc0;
  puStack52 = puStack52 + 6;
  if (CONCAT22(in_register_00002032,status_code) == 0) {
    uVar4 = me_add_ie_supp_rates((uint32_t *)&puStack52,&req->rate_set);
    uVar3 = (short)uVar4 + 6;
    if (8 < (req->rate_set).length) {
      uVar4 = me_add_ie_ext_supp_rates((uint32_t *)&puStack52,&req->rate_set);
      uVar3 = uVar3 + (short)uVar4;
    }
    if ((req->flags & 2) != 0) {
      uVar4 = me_add_ie_ht_capa((uint32_t *)&puStack52);
      uVar5 = me_add_ie_ht_oper((uint32_t *)&puStack52,vif_info_tab + iVar6);
      uVar3 = uVar3 + (short)uVar5 + (short)uVar4;
    }
    if ((req->flags & 1) != 0) {
      memset(&uStack46,0,0xe);
      uStack48 = 0x7dd;
      uStack45 = 0x50;
      wme_ie._0_2_ = 0x2f2;
      wme_ie[3] = '\x01';
      wme_ie[4] = vif_info_tab[iVar6].bss_info.edca_param.qos_info;
      co_pack8p((uint32_t)puStack52,(uint8_t *)&uStack48,9);
      puStack52[1] = puStack52[1] + '\x11';
      puStack52 = puStack52 + (uint)uStack48._1_1_ + 2;
      *puStack52 = 0;
      uVar4 = vif_info_tab[iVar6].txq_params[1];
      puStack52[1] = (char)uVar4;
      puStack52[2] = (char)(uVar4 >> 8);
      puStack52[3] = (char)(uVar4 >> 0x10);
      puStack52[4] = (char)(uVar4 >> 0x18);
      uVar4 = vif_info_tab[iVar6].txq_params[0];
      puStack52[5] = (char)uVar4;
      puStack52[6] = (char)(uVar4 >> 8);
      puStack52[7] = (char)(uVar4 >> 0x10);
      puStack52[8] = (char)(uVar4 >> 0x18);
      uVar4 = vif_info_tab[iVar6].txq_params[2];
      puStack52[9] = (char)uVar4;
      puStack52[10] = (char)(uVar4 >> 8);
      puStack52[0xb] = (char)(uVar4 >> 0x10);
      puStack52[0xc] = (char)(uVar4 >> 0x18);
      uVar4 = vif_info_tab[iVar6].txq_params[3];
      puStack52[0xd] = (char)uVar4;
      puStack52[0xe] = (char)(uVar4 >> 8);
      puStack52[0xf] = (char)(uVar4 >> 0x10);
      puStack52[0x10] = (char)(uVar4 >> 0x18);
      uVar3 = uVar3 + (ushort)uStack48._1_1_ + 0x13;
    }
  }
  return uVar3;
}



int me_rc_set_rate_req_handler
              (ke_msg_id_t msgid,me_rc_set_rate_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  byte bVar1;
  uint16_t fixed_rate_config;
  rc_sta_stats *rc_ss;
  _Bool _Var2;
  undefined3 extraout_var;
  
  bVar1 = param->sta_idx;
  rc_ss = sta_info_tab[bVar1].pol_tbl.sta_stats;
  if (rc_ss == (rc_sta_stats *)0x0) {
    assert_err("rc_ss != NULL","module",0x31d);
  }
  fixed_rate_config = param->fixed_rate_cfg;
  if (fixed_rate_config == 0xffff) {
    rc_ss->fixed_rate_cfg = 0xffff;
    rc_ss->info = rc_ss->info & 0x9f;
    rc_update_bw_nss_max(sta_info_tab[bVar1].staid,rc_ss->bw_max,rc_ss->no_ss);
  }
  else {
    _Var2 = rc_check_fixed_rate_config(rc_ss,fixed_rate_config);
    if (CONCAT31(extraout_var,_Var2) != 0) {
      rc_ss->fixed_rate_cfg = fixed_rate_config;
      rc_ss->info = rc_ss->info & 0x9f | 0x20;
    }
  }
  return 0;
}



int me_rc_stats_req_handler
              (ke_msg_id_t msgid,me_rc_stats_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  rc_sta_stats *rc_ss;
  byte *pbVar1;
  uint32_t uVar2;
  uint uVar3;
  
  pbVar1 = (byte *)ke_msg_alloc(0x140f,src_id,dest_id,0xd0);
  rc_ss = sta_info_tab[param->sta_idx].pol_tbl.sta_stats;
  *pbVar1 = param->sta_idx;
  if (rc_ss == (rc_sta_stats *)0x0) {
    *(undefined2 *)(pbVar1 + 2) = 0;
  }
  else {
    *(uint16_t *)(pbVar1 + 2) = rc_ss->no_samples;
    uVar3 = 0;
    *(uint16_t *)(pbVar1 + 4) = rc_ss->ampdu_len;
    *(uint16_t *)(pbVar1 + 6) = rc_ss->ampdu_packets;
    *(uint32_t *)(pbVar1 + 8) = rc_ss->avg_ampdu_len;
    pbVar1[0xc] = rc_ss->sw_retry_step;
    pbVar1[0xd] = rc_ss->sample_wait;
    memcpy(pbVar1 + 0x10,rc_ss->retry,0x20);
    memcpy(pbVar1 + 0x30,rc_ss->rate_stats,0x78);
    while (uVar3 < rc_ss->no_samples) {
      uVar2 = rc_calc_tp(rc_ss,(uint8_t)uVar3);
      *(uint32_t *)(pbVar1 + (uVar3 + 0x28) * 4 + 8) = uVar2;
      uVar3 = uVar3 + 1 & 0xffff;
    }
  }
  ke_msg_send(pbVar1);
  return 0;
}



int me_traffic_ind_req_handler
              (ke_msg_id_t msgid,me_traffic_ind_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint uVar1;
  uint16_t *puVar2;
  sta_ps_traffic sVar3;
  sta_ps_traffic sVar4;
  
  uVar1 = (uint)param->sta_idx;
  sVar4 = sta_info_tab[uVar1].traffic_avail;
  if (param->uapsd == false) {
    if (param->tx_avail == '\0') {
      sVar4 = sVar4 & ~PS_TRAFFIC_HOST;
    }
    else {
      sVar4 = sVar4 | PS_TRAFFIC_HOST;
    }
    sta_info_tab[uVar1].traffic_avail = sVar4;
  }
  else {
    sVar3 = sVar4 & ~UAPSD_TRAFFIC_HOST;
    if (param->tx_avail != '\0') {
      sVar3 = sVar4 | UAPSD_TRAFFIC_HOST;
    }
    sta_info_tab[uVar1].traffic_avail = sVar3;
    if (sta_info_tab[uVar1].info.uapsd_queues != '\x0f') goto LAB_2301df24;
  }
  puVar2 = (uint16_t *)ke_msg_alloc(0x41,0,5,4);
  *puVar2 = sta_info_tab[uVar1].aid;
  *(uint8_t *)((int)puVar2 + 3) = sta_info_tab[uVar1].inst_nbr;
  *(uint8_t *)(puVar2 + 1) = param->tx_avail;
  ke_msg_send();
LAB_2301df24:
  ke_msg_send_basic(0x140d,src_id,dest_id);
  return 0;
}



int me_sta_del_req_handler
              (ke_msg_id_t msgid,me_sta_del_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint8_t *puVar1;
  undefined *puVar2;
  
  puVar1 = (uint8_t *)ke_msg_alloc(0xc,0,5,1);
  *puVar1 = param->sta_idx;
  ke_msg_send();
  if (param->tdls_sta != false) {
    puVar2 = (undefined *)ke_msg_alloc(0x1413,5,6,2);
    *puVar2 = 0;
    puVar2[1] = sta_info_tab[param->sta_idx].inst_nbr;
    ke_msg_send();
  }
  ke_msg_send_basic(0x140a,src_id,dest_id);
  return 0;
}



int me_set_control_port_req_handler
              (ke_msg_id_t msgid,me_set_control_port_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  byte bVar1;
  undefined *puVar2;
  uint8_t uVar3;
  uint uVar4;
  
  uVar4 = (uint)param->sta_idx;
  bVar1 = sta_info_tab[uVar4].inst_nbr;
  uVar3 = (param->control_port_open != false) + '\x01';
  sta_info_tab[uVar4].ctrl_port_state = uVar3;
  if ((vif_info_tab[bVar1].type == '\0') && (uVar3 == '\x02')) {
    puVar2 = (undefined *)ke_msg_alloc(0x1413,5,6,2);
    *puVar2 = 0;
    puVar2[1] = sta_info_tab[uVar4].inst_nbr;
    ke_msg_send();
  }
  ke_msg_send_basic(0x1405,src_id,dest_id);
  return 0;
}



int me_chan_config_req_handler
              (ke_msg_id_t msgid,me_chan_config_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  memcpy(&me_env.chan,param,0xfe);
  ke_msg_send_basic(0x1403,src_id,dest_id);
  return 0;
}



int mm_set_ps_mode_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar1) != 1) {
    assert_err("ke_state_get(dest_id) == ME_BUSY","module",699);
  }
  if (me_env.requester_id != 0xff) {
    ke_msg_send_basic(0x1414,me_env.requester_id,dest_id);
  }
  ke_state_set(dest_id,0);
  return 0;
}



int mm_set_idle_cfm_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(dest_id);
  if (CONCAT22(extraout_var,kVar1) != 1) {
    assert_err("ke_state_get(dest_id) == ME_BUSY","module",0x252);
  }
  if (me_env.requester_id != 0xff) {
    ke_msg_send_basic(0x1412,me_env.requester_id,dest_id);
  }
  ke_state_set(dest_id,0);
  return 0;
}



int me_config_req_handler
              (ke_msg_id_t msgid,me_config_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint8_t uVar1;
  undefined *puVar2;
  undefined3 extraout_var;
  
  puVar2 = (undefined *)ke_msg_alloc(0x31,0,5,1);
  me_env.ht_supported = param->ht_supp;
  memcpy(&me_env.ht_cap,param,0x20);
  ke_msg_send_basic(0x1401,src_id,dest_id);
  if (me_env.ht_supported == false) {
    me_env._302_2_ = 0;
  }
  else {
    uVar1 = phy_get_nss();
    me_env._302_2_ =
         CONCAT11((char)(me_env.ht_cap.ht_capa_info >> 1),
                  (char)(CONCAT31(extraout_var,uVar1) + 1 >> 1)) & 0x1ff;
  }
  me_env.tx_lft = param->tx_lft;
  me_env.ps_on = param->ps_on;
  if (me_env.ps_on != false) {
    me_env.requester_id = 0xff;
    *puVar2 = 2;
    ke_msg_send(puVar2);
    ke_state_set(5,1);
  }
  return 0;
}



int me_set_ps_disable_req_handler
              (ke_msg_id_t msgid,me_set_ps_disable_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  char *pcVar2;
  
  if (me_env.ps_on != false) {
    kVar1 = ke_state_get(5);
    if (CONCAT22(extraout_var,kVar1) == 1) {
      return 2;
    }
    if (me_env.ps_disable_vifs == 0) {
      if (param->ps_disable != false) goto LAB_2301e26a;
    }
    else {
      if (param->ps_disable == false) {
LAB_2301e26a:
        pcVar2 = (char *)ke_msg_alloc(0x31,0,dest_id,1);
        if (param->ps_disable == false) {
          me_env.ps_disable_vifs = ~(1 << ((uint)param->vif_idx & 0x1f)) & me_env.ps_disable_vifs;
        }
        else {
          me_env.ps_disable_vifs = 1 << ((uint)param->vif_idx & 0x1f) | me_env.ps_disable_vifs;
        }
        me_env.requester_id = src_id;
        *pcVar2 = (me_env.ps_disable_vifs == 0) << 1;
        ke_msg_send();
        ke_state_set(dest_id,1);
        return 0;
      }
      me_env.ps_disable_vifs = 1 << ((uint)param->vif_idx & 0x1f) | me_env.ps_disable_vifs;
    }
  }
  ke_msg_send_basic(0x1414,src_id,dest_id);
  return 0;
}



int me_set_active_req_handler
              (ke_msg_id_t msgid,me_set_active_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  void *pvVar2;
  
  kVar1 = ke_state_get(5);
  if (CONCAT22(extraout_var,kVar1) == 1) {
    return 2;
  }
  if (me_env.active_vifs == 0) {
    if (param->active != false) goto LAB_2301e304;
  }
  else {
    if (param->active == false) {
LAB_2301e304:
      pvVar2 = ke_msg_alloc(0x22,0,dest_id,1);
      if (param->active == false) {
        me_env.active_vifs = ~(1 << ((uint)param->vif_idx & 0x1f)) & me_env.active_vifs;
      }
      else {
        me_env.active_vifs = 1 << ((uint)param->vif_idx & 0x1f) | me_env.active_vifs;
      }
      me_env.requester_id = src_id;
      *(bool *)pvVar2 = me_env.active_vifs == 0;
      ke_msg_send();
      ke_state_set(dest_id,1);
      return 0;
    }
    me_env.active_vifs = 1 << ((uint)param->vif_idx & 0x1f) | me_env.active_vifs;
  }
  ke_msg_send_basic(0x1412,src_id,dest_id);
  return 0;
}



