pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

int me_sta_add_req_handler
              (ke_msg_id_t msgid,me_sta_add_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  byte bVar1;
  byte bVar2;
  _Bool _Var3;
  byte *sta_idx;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined *puVar4;
  undefined3 extraout_var_01;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  int iVar8;
  uint8_t uStack81;
  uint8_t hw_sta_idx;
  uint32_t uStack80;
  mm_sta_add_req sta_add_req;
  
  sta_idx = (byte *)ke_msg_alloc(0x1408,src_id,dest_id,3);
  bVar1 = rxu_cntrl_get_pm();
  sta_add_req.mac_addr.array[1]._1_1_ = param->vif_idx;
  uVar7 = (uint)sta_add_req.mac_addr.array[1]._1_1_;
  if ((param->flags & 2) == 0) {
    sta_add_req.mac_addr.array[1]._0_1_ = '\0';
    sta_add_req.paid_gid._0_2_ = 0;
  }
  else {
    uVar5 = (uint)(param->ht_cap).a_mpdu_param;
    sta_add_req.mac_addr.array[1]._0_1_ = '\x01';
    uVar6 = (int)uVar5 >> 2 & 7;
    if (2 < uVar6) {
      sta_add_req.mac_addr.array[1]._0_1_ = (uint8_t)(1 << (uVar6 - 3 & 0x1f));
    }
    sta_add_req.paid_gid._0_2_ = (short)(1 << (uVar5 & 3) + 0xd) - 1;
  }
  sta_add_req.ampdu_size_max_vht = 0;
  memcpy((void *)((int)&sta_add_req.paid_gid + 2),param,6);
  sta_add_req.mac_addr.array[2]._1_1_ = param->rssi;
  sta_add_req._16_4_ = param->tsflo;
  sta_add_req.tsflo = param->tsfhi;
  uStack80 = 0;
  sta_add_req.tsfhi._0_1_ = param->data_rate;
  bVar2 = mm_sta_add((mm_sta_add_req *)&stack0xffffffb0,sta_idx,&uStack81);
  sta_idx[1] = bVar2;
  if (CONCAT31(extraout_var_00,bVar2) != 0) goto LAB_2301e56a;
  uVar5 = (uint)*sta_idx;
  memcpy(&sta_info_tab[uVar5].info,&param->rate_set,0xd);
  if ((param->flags & 1) == 0) {
LAB_2301e46c:
    iVar8 = 0;
  }
  else {
    uVar6 = sta_info_tab[uVar5].info.capa_flags;
    sta_info_tab[uVar5].info.capa_flags = uVar6 | 1;
    if (((param->flags & 2) == 0) || (me_env.ht_supported == false)) goto LAB_2301e46c;
    sta_info_tab[uVar5].info.capa_flags = uVar6 | 3;
    memcpy(&sta_info_tab[uVar5].info.ht_cap,&param->ht_cap,0x20);
    _Var3 = me_set_sta_ht_vht_param(sta_info_tab + uVar5,&vif_info_tab[uVar7].bss_info);
    iVar8 = CONCAT31(extraout_var_01,_Var3);
  }
  sta_info_tab[uVar5].info.uapsd_queues = param->uapsd_queues;
  sta_info_tab[uVar5].info.max_sp_len = param->max_sp_len;
  sta_info_tab[uVar5].aid = param->aid;
  me_init_rate(sta_info_tab + uVar5);
  if (((param->flags & 0x10) != 0) && (bVar2 = param->opmode, -1 < (char)bVar2)) {
    me_sta_bw_nss_max_upd(sta_info_tab[uVar5].staid,bVar2 & 3,bVar2 >> 4);
  }
  if (iVar8 != 0) {
    me_sta_bw_nss_max_upd(sta_info_tab[uVar5].staid,-1,'\0');
  }
  sta_info_tab[uVar5].pol_tbl.upd_field = sta_info_tab[uVar5].pol_tbl.upd_field | 0x10;
  sta_info_tab[uVar5].ctrl_port_state = ((vif_info_tab[uVar7].flags & 1) == 0) + '\x01';
  sta_info_tab[uVar5].ctrl_port_ethertype =
       *(ushort *)(vif_info_tab[uVar7].u + 0x2f0) >> 8 |
       *(ushort *)(vif_info_tab[uVar7].u + 0x2f0) << 8;
  sta_idx[2] = bVar1;
  if (CONCAT31(extraout_var,bVar1) != 0) {
    sta_info_tab[uVar5].ps_state = bVar1;
    if (vif_info_tab[uVar7].u[0x2ee] == 0) {
      uVar5 = (uint)vif_info_tab[uVar7].index + 10 & 0xff;
      puVar4 = (undefined *)ke_msg_alloc(0x49,0xd,0,2);
      sta_info_tab[uVar5].ps_state = '\x01';
      *puVar4 = (char)uVar5;
      puVar4[1] = 1;
      ke_msg_send();
    }
    vif_info_tab[uVar7].u[0x2ee] = vif_info_tab[uVar7].u[0x2ee] + 1;
  }
LAB_2301e56a:
  ke_msg_send(sta_idx);
  return 0;
}



void cfm_raw_send(void *env,uint32_t status)

{
  printf("send complete, status is %08lX\r\n");
  return;
}



int scanu_raw_send_req_handler
              (ke_msg_id_t msgid,scanu_raw_send_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  size_t __n;
  txl_frame_desc_tag *frame;
  tx_hw_desc *ptVar1;
  void *__src;
  
  printf("[FW] pkt address is %p, len is %lu\r\n",param->pkt,param->len);
  scanu_raw_send_cfm('\0',src_id);
  __src = param->pkt;
  __n = param->len;
  frame = txl_frame_get(0,0x100);
  if (frame != (txl_frame_desc_tag *)0x0) {
    memcpy((frame->txdesc).lmac.buffer + 1,__src,__n);
    (frame->txdesc).host.staid = -1;
    (frame->cfm).cfm_func = cfm_raw_send;
    ptVar1 = (frame->txdesc).lmac.hw_desc;
    (frame->txdesc).host.vif_idx = '\0';
    (frame->txdesc).umac.head_len = '\0';
    (frame->txdesc).umac.tail_len = '\0';
    *(txl_frame_desc_tag **)&(frame->cfm).env = frame;
    (ptVar1->thd).field_5 = (ptVar1->thd).field_4 + (__n - 1);
    (ptVar1->thd).frmlen = __n + 4;
    txl_frame_push_force(frame,'\x03');
  }
  return 0;
}



int scanu_join_req_handler
              (ke_msg_id_t msgid,scanu_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  vif_info_tab[param->vif_idx].bss_info.valid_flags = 0;
  scanu_env._362_2_ = 1;
  scanu_env.bssid.array._0_4_ = *(undefined4 *)(param->bssid).array;
  scanu_env.bssid.array[2] = (param->bssid).array[2];
  scanu_env.param = param;
  scanu_env.src_id = src_id;
  if ((*(byte *)(param->bssid).array & 1) != 0) {
    assert_err("!MAC_ADDR_GROUP(&param->bssid)","module",0xb6);
  }
  scanu_start();
  return 1;
}



int scanu_start_req_handler
              (ke_msg_id_t msgid,scanu_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined2 in_register_0000202a;
  
  scanu_env._362_2_ = 0;
  scanu_env.bssid.array._0_4_ = *(undefined4 *)(param->bssid).array;
  scanu_env.bssid.array[2] = (param->bssid).array[2];
  scanu_env.param = param;
  scanu_env.src_id = src_id;
  scanu_start(CONCAT22(in_register_0000202a,msgid));
  return 1;
}



int rxu_mgt_ind_handler(ke_msg_id_t msgid,rxu_mgt_ind *param,ke_task_id_t dest_id,
                       ke_task_id_t src_id)

{
  int iVar1;
  
  iVar1 = scanu_frame_handler(param);
  return iVar1;
}



int scan_done_ind_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined2 in_register_0000202a;
  
  scanu_env.band = scanu_env.band + '\x01';
  scanu_scan_next(CONCAT22(in_register_0000202a,msgid));
  return 0;
}



int scan_start_cfm_handler
              (ke_msg_id_t msgid,scan_start_cfm *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  if (param->status != '\0') {
    scanu_confirm(param->status);
    return 0;
  }
  return 0;
}



int me_set_ps_disable_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  
