pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  kVar1 = ke_state_get(6);
  if (((CONCAT22(extraout_var,kVar1) != 4) &&
      (kVar1 = ke_state_get(6), CONCAT22(extraout_var_00,kVar1) != 0)) &&
     (kVar1 = ke_state_get(6), CONCAT22(extraout_var_01,kVar1) != 8)) {
    assert_err(
               "(ke_state_get(TASK_SM) == SM_BSS_PARAM_SETTING) || (ke_state_get(TASK_SM) == SM_IDLE) || (ke_state_get(TASK_SM) == SM_DISCONNECTING)"
               ,"module",0x1db);
  }
  kVar1 = ke_state_get(6);
  if (CONCAT22(extraout_var_02,kVar1) == 4) {
    sm_send_next_bss_param();
  }
  return 0;
}



int mm_bss_param_setting_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(6);
  if (CONCAT22(extraout_var,kVar1) != 4) {
    assert_err("ke_state_get(TASK_SM) == SM_BSS_PARAM_SETTING","module",0x1fa);
  }
  sm_send_next_bss_param();
  return 0;
}



int sm_rsp_timeout_ind_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  
  kVar1 = ke_state_get(6);
  if ((CONCAT22(extraout_var,kVar1) == 5) ||
     (kVar1 = ke_state_get(6), CONCAT22(extraout_var_00,kVar1) == 6)) {
    sm_connect_ind(0xb);
  }
  return 0;
}



int scanu_start_cfm_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  mac_addr *pmStack24;
  mac_addr *bssid;
  scan_chan_tag *chan;
  
  pmStack24 = (mac_addr *)0x0;
  bssid = (mac_addr *)0x0;
  kVar1 = ke_state_get(6);
  if (CONCAT22(extraout_var,kVar1) != 1) {
    assert_err("ke_state_get(TASK_SM) == SM_SCANNING","module",0x10a);
  }
  sm_get_bss_params(&pmStack24,(scan_chan_tag **)&bssid);
  if ((pmStack24 == (mac_addr *)0x0) || ((scan_chan_tag *)bssid == (scan_chan_tag *)0x0)) {
    sm_connect_ind(0xc);
  }
  else {
    sm_join_bss(pmStack24,(scan_chan_tag *)bssid,false);
  }
  return 0;
}



int mm_connection_loss_ind_handler
              (ke_msg_id_t msgid,mm_connection_loss_ind *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  int iVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  uint uVar3;
  
  uVar3 = (uint)param->inst_nbr;
  kVar2 = ke_state_get(6);
  iVar1 = 2;
  if (CONCAT22(extraout_var,kVar2) == 0) {
    iVar1 = 0;
    if ((vif_info_tab[uVar3].type == '\0') && (vif_info_tab[uVar3].active != false)) {
      ke_state_set(6,8);
      sm_disconnect_process(vif_info_tab + uVar3,0x10);
    }
  }
  return iVar1;
}



int scanu_join_cfm_handler(ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  sm_connect_req *psVar1;
  uint8_t uVar2;
  ke_state_t kVar3;
  undefined2 extraout_var_00;
  undefined3 extraout_var;
  void *pvVar4;
  undefined uVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint8_t auStack33 [4];
  uint8_t chan_idx;
  
  psVar1 = sm_env.connect_param;
  kVar3 = ke_state_get(6);
  if (CONCAT22(extraout_var_00,kVar3) != 2) {
    assert_err("ke_state_get(TASK_SM) == SM_JOINING","module",0x134);
  }
  uVar8 = (uint)psVar1->vif_idx;
  if ((int)vif_info_tab[uVar8].bss_info.valid_flags < 0) {
    uVar2 = sm_add_chan_ctx(auStack33);
    if (CONCAT31(extraout_var,uVar2) == 0) {
      pvVar4 = ke_msg_alloc(10,0,6,0x20);
      chan_ctxt_link(psVar1->vif_idx,auStack33[0]);
      *(uint8_t *)((int)pvVar4 + 0x11) = psVar1->vif_idx;
      memcpy((void *)((int)pvVar4 + 10),&vif_info_tab[uVar8].bss_info.bssid,6);
      *(undefined *)((int)pvVar4 + 0x12) = 0;
      if ((vif_info_tab[uVar8].bss_info.valid_flags & 2) != 0) {
        uVar6 = (uint)vif_info_tab[uVar8].bss_info.ht_cap.a_mpdu_param;
        uVar5 = 1;
        uVar7 = (int)uVar6 >> 2 & 7;
        if (2 < uVar7) {
          uVar5 = (undefined)(1 << (uVar7 - 3 & 0x1f));
        }
        *(undefined *)((int)pvVar4 + 0x10) = uVar5;
        *(short *)((int)pvVar4 + 8) = (short)(1 << (uVar6 & 3) + 0xd) + -1;
      }
      *(undefined4 *)((int)pvVar4 + 4) = 0;
      ke_msg_send(pvVar4);
      ke_state_set(6,3);
    }
    else {
      sm_connect_ind(0xd);
    }
    vif_info_tab[uVar8].flags = psVar1->flags;
    if ((psVar1->flags & 4) != 0) {
      vif_info_tab[uVar8].bss_info.valid_flags =
           vif_info_tab[uVar8].bss_info.valid_flags & 0xfffffff9;
    }
  }
  else {
    if (sm_env.join_passive == false) {
      sm_connect_ind(0xe);
    }
    else {
      sm_join_bss(&vif_info_tab[uVar8].bss_info.bssid,vif_info_tab[uVar8].bss_info.chan,true);
    }
  }
  return 0;
}



// WARNING: Variable defined which should be unmapped: chan

int sm_connect_req_handler
              (ke_msg_id_t msgid,sm_connect_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  int iVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  undefined *puVar3;
  undefined2 extraout_var_00;
  undefined uVar4;
  uint uVar5;
  mac_addr *pmStack40;
  mac_addr *bssid;
  scan_chan_tag *chan;
  
  pmStack40 = (mac_addr *)0x0;
  bssid = (mac_addr *)0x0;
  uVar5 = (uint)param->vif_idx;
  kVar2 = ke_state_get(6);
  if (CONCAT22(extraout_var,kVar2) == 8) {
    return 2;
  }
  puVar3 = (undefined *)ke_msg_alloc(0x1801,src_id,dest_id,1);
  kVar2 = ke_state_get(6);
  if (CONCAT22(extraout_var_00,kVar2) == 0) {
    if ((vif_info_tab[uVar5].type == '\0') && (vif_info_tab[uVar5].active == false)) {
      if (param->auth_type != '\x02') {
        if (vif_info_tab[uVar5].u[4] != 0xff) {
          assert_err("vif->u.sta.ap_id == INVALID_STA_IDX","module",0x59);
        }
        if (vif_info_tab[uVar5].chan_ctxt != (chan_ctxt_tag *)0x0) {
          assert_err("vif->chan_ctxt == NULL","module",0x5a);
        }
      }
    }
    else {
      if (param->auth_type != '\x02') {
        iVar1 = 0;
        uVar4 = 9;
        goto LAB_2301eb3e;
      }
    }
    if (sm_env.connect_param != (sm_connect_req *)0x0) {
      assert_err("NULL == sm_env.connect_param","module",0x5d);
    }
    sm_env.connect_param = param;
    if (sm_env.connect_ind != (sm_connect_ind *)0x0) {
      assert_err("NULL == sm_env.connect_ind","module",0x61);
    }
    sm_env.connect_ind = (sm_connect_ind *)ke_msg_alloc(0x1802,src_id,dest_id,0x354);
    sm_env.exist_ssid_idx = -1;
    sm_env.ft_over_ds = false;
    printf("connecting using vif_idx %u\r\n",(uint)param->vif_idx);
    if (param->auth_type == '\x02') {
      sm_env.ft_over_ds = true;
      memcpy(&sm_env.ft_old_bssid,&vif_info_tab[param->vif_idx].bssid,6);
      ke_state_set(6,8);
      sm_disconnect_process(vif_info_tab + param->vif_idx,0);
    }
    else {
      if ((param->chan).freq == 0xffff) {
        sm_get_bss_params(&pmStack40,(scan_chan_tag **)&bssid);
      }
      else {
        pmStack40 = &param->bssid;
        bssid = (mac_addr *)&param->chan;
      }
      if ((pmStack40 == (mac_addr *)0x0) || ((scan_chan_tag *)bssid == (scan_chan_tag *)0x0)) {
        sm_scan_bss(pmStack40,(scan_chan_tag *)bssid);
      }
      else {
        sm_join_bss(pmStack40,(scan_chan_tag *)bssid,false);
      }
    }
    iVar1 = 1;
    uVar4 = 0;
  }
  else {
    iVar1 = 0;
    uVar4 = 8;
  }
LAB_2301eb3e:
  *puVar3 = uVar4;
  ke_msg_send(puVar3);
  return iVar1;
}



int rxu_mgt_ind_handler(ke_msg_id_t msgid,rxu_mgt_ind *param,ke_task_id_t dest_id,
                       ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  int iVar2;
  ushort uVar3;
  
