pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar3 = param->framectrl & 0xfc;
  if (uVar3 == 0xb0) {
    kVar1 = ke_state_get(6);
    if (CONCAT22(extraout_var,kVar1) == 5) {
      sm_auth_handler(param);
    }
  }
  else {
    if ((uVar3 == 0x10) || (uVar3 == 0x30)) {
      kVar1 = ke_state_get(6);
      if (CONCAT22(extraout_var_00,kVar1) == 6) {
        sm_assoc_rsp_handler(param);
      }
    }
    else {
      if (((uVar3 == 0xc0) || (uVar3 == 0xa0)) &&
         (kVar1 = ke_state_get(6), CONCAT22(extraout_var_01,kVar1) == 0)) {
        iVar2 = sm_deauth_handler(param);
        return iVar2;
      }
    }
  }
  return 0;
}



int mm_set_vif_state_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  byte bVar1;
  sm_connect_req *psVar2;
  ke_state_t kVar3;
  undefined2 extraout_var;
  uint8_t *puVar4;
  undefined *puVar5;
  uint8_t uVar6;
  uint uVar7;
  
  kVar3 = ke_state_get(6);
  psVar2 = sm_env.connect_param;
  if (CONCAT22(extraout_var,kVar3) == 7) {
    uVar7 = (uint)(sm_env.connect_param)->vif_idx;
    bVar1 = vif_info_tab[uVar7].u[4];
    puVar4 = (uint8_t *)ke_msg_alloc(0x4b,0,6,6);
    *(_Bool *)(puVar4 + 4) = psVar2->dont_wait_bcmc;
    *(uint16_t *)(puVar4 + 2) = psVar2->listen_interval;
    *puVar4 = psVar2->vif_idx;
    ke_msg_send();
    uVar6 = ((vif_info_tab[uVar7].flags & 1) == 0) + '\x01';
    sta_info_tab[bVar1].ctrl_port_state = uVar6;
    sta_info_tab[bVar1].ctrl_port_ethertype =
         psVar2->ctrl_port_ethertype >> 8 | psVar2->ctrl_port_ethertype << 8;
    if (uVar6 == '\x02') {
      puVar5 = (undefined *)ke_msg_alloc(0x1413,5,6,2);
      *puVar5 = 0;
      puVar5[1] = psVar2->vif_idx;
      ke_msg_send();
    }
    if ((*(uint *)&vif_info_tab[uVar7].bss_info.is_supplicant_enabled & 0x12800) == 0) {
      sm_connect_ind(0);
    }
  }
  return 0;
}



int me_set_active_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  mac_addr *pmStack24;
  mac_addr *bssid;
  scan_chan_tag *chan;
  
  kVar1 = ke_state_get(6);
  if ((CONCAT22(extraout_var,kVar1) != 4) &&
     (kVar1 = ke_state_get(6), CONCAT22(extraout_var_00,kVar1) != 8)) {
    assert_err(
               "(ke_state_get(TASK_SM) == SM_BSS_PARAM_SETTING) || (ke_state_get(TASK_SM) == SM_DISCONNECTING)"
               ,"module",0x216);
  }
  kVar1 = ke_state_get(6);
  if (CONCAT22(extraout_var_01,kVar1) == 8) {
    if (sm_env.ft_over_ds == false) {
      ke_state_set(6,0);
    }
    else {
      pmStack24 = (mac_addr *)0x0;
      bssid = (mac_addr *)0x0;
      sm_get_bss_params(&pmStack24,(scan_chan_tag **)&bssid);
      sm_join_bss(pmStack24,(scan_chan_tag *)bssid,false);
    }
  }
  else {
    if (sm_env.ft_over_ds == false) {
      sm_auth_send(1,(uint32_t *)0x0);
    }
    else {
      sm_assoc_req_send();
    }
  }
  return 0;
}



int mm_sta_add_cfm_handler
              (ke_msg_id_t msgid,mm_sta_add_cfm *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint uVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  uint uVar3;
  uint uVar4;
  
  kVar2 = ke_state_get(6);
  if (CONCAT22(extraout_var,kVar2) != 3) {
    assert_err("ke_state_get(TASK_SM) == SM_STA_ADDING","module",0x19c);
  }
  if (param->status == '\0') {
    uVar4 = (uint)param->sta_idx;
    uVar1 = (uint)sta_info_tab[uVar4].inst_nbr;
    memcpy(&sta_info_tab[uVar4].info,&vif_info_tab[uVar1].bss_info.rate_set,0xd);
    uVar3 = vif_info_tab[uVar1].bss_info.valid_flags;
    if ((uVar3 & 1) != 0) {
      sta_info_tab[uVar4].info.capa_flags = sta_info_tab[uVar4].info.capa_flags | 1;
    }
    if ((uVar3 & 2) != 0) {
      sta_info_tab[uVar4].info.capa_flags = sta_info_tab[uVar4].info.capa_flags | 2;
      memcpy(&sta_info_tab[uVar4].info.ht_cap,&vif_info_tab[uVar1].bss_info,0x20);
      me_set_sta_ht_vht_param(sta_info_tab + uVar4,&vif_info_tab[uVar1].bss_info);
    }
    sm_set_bss_param();
  }
  else {
    sm_connect_ind(0xf);
  }
  return 0;
}



int sm_disconnect_req_handler
              (ke_msg_id_t msgid,sm_disconnect_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  int iVar2;
  
  kVar1 = ke_state_get(6);
  iVar2 = 2;
  if (CONCAT22(extraout_var,kVar1) == 0) {
    sm_disconnect(param->vif_idx,param->reason_code);
    ke_msg_send_basic(0x1804,0xd,6);
    iVar2 = 0;
  }
  return iVar2;
}



int apm_sta_connect_timeout_ind_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint8_t sta_idx;
  sta_info_tag *psVar1;
  TickType_t TVar2;
  
  TVar2 = xTaskGetTickCount();
  psVar1 = sta_info_tab;
  sta_idx = '\0';
  do {
    if ((psVar1->time_last_seen != 0) && (30000 < (int)(TVar2 - psVar1->time_last_seen))) {
      apm_sta_fw_delete(sta_idx);
    }
    sta_idx = sta_idx + '\x01';
    psVar1 = psVar1 + 1;
  } while (sta_idx != '\f');
  ke_timer_set(0x1c0a,7,5000000);
  return 0;
}



int rxu_mgt_ind_handler(ke_msg_id_t msgid,rxu_mgt_ind *param,ke_task_id_t dest_id,
                       ke_task_id_t src_id)

{
  undefined4 uVar1;
  ushort uVar2;
  
  uVar2 = param->framectrl & 0xfc;
  if (uVar2 == 0x40) {
    apm_probe_req_handler();
  }
  else {
    if (uVar2 == 0xb0) {
      apm_auth_handler(param);
    }
    else {
      uVar1 = 0;
      if ((param->framectrl & 0xfc) != 0) {
        if (uVar2 != 0x20) {
          if (uVar2 == 0xc0) {
            apm_deauth_handler(param);
            return 0;
          }
          if (uVar2 == 0xa0) {
            apm_disassoc_handler(param);
            return 0;
          }
          if (uVar2 != 0x80) {
            return 0;
          }
          apm_beacon_handler(param);
          return 0;
        }
        uVar1 = 1;
      }
      apm_assoc_req_handler(uVar1);
    }
  }
  return 0;
}



int apm_sta_add_cfm_handler
              (ke_msg_id_t msgid,me_sta_add_cfm *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  if (uap_conn_info == (cm_ConnectionInfo_t *)0x0) {
    apm_sta_add(param->sta_idx);
  }
  else {
    uap_conn_info->staId = param->sta_idx;
    SendEAPOLMsgUsingBufDesc(uap_conn_info,(BufferDesc_t *)0x0);
  }
  return 0;
}



