pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int apm_sta_del_req_handler
              (ke_msg_id_t msgid,apm_sta_del_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined *puVar1;
  
  puVar1 = (undefined *)ke_msg_alloc(0x1c0c,src_id,dest_id,3);
  if ((vif_info_tab[param->vif_idx].type == '\x02') && (param->sta_idx < 0xd)) {
    apm_sta_remove(param->vif_idx,param->sta_idx);
    *puVar1 = 0;
  }
  else {
    *puVar1 = 0xff;
  }
  ke_msg_send(puVar1);
  return 0;
}


/*
Unable to decompile 'apm_stop_cac_req_handler'
Cause: Exception while decompiling 2301f08a: Decompiler process died

*/


int apm_conf_max_sta_req_handler
              (ke_msg_id_t msgid,apm_conf_max_sta_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  apm_env.max_sta_supported = param->max_sta_supported;
  if (0xc < apm_env.max_sta_supported) {
    apm_env.max_sta_supported = 0xc;
  }
  ke_msg_send_basic(0x1c0e,src_id,dest_id);
  return 0;
}


/*
Unable to decompile 'apm_start_cac_req_handler'
Cause: Exception while decompiling 2301f130: Decompiler process died

*/


int me_set_ps_disable_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  
  kVar1 = ke_state_get(7);
  if ((CONCAT22(extraout_var,kVar1) != 1) &&
     (kVar1 = ke_state_get(7), CONCAT22(extraout_var_00,kVar1) != 0)) {
    assert_err(
               "(ke_state_get(TASK_APM) == APM_BSS_PARAM_SETTING) || (ke_state_get(TASK_APM) == APM_IDLE)"
               ,"module",0xee);
  }
  kVar1 = ke_state_get(7);
  if (CONCAT22(extraout_var_01,kVar1) == 1) {
    apm_send_next_bss_param();
  }
  return 0;
}



int mm_bss_param_setting_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(7);
  if (CONCAT22(extraout_var,kVar1) != 1) {
    assert_err("ke_state_get(TASK_APM) == APM_BSS_PARAM_SETTING","module",0x110);
  }
  apm_send_next_bss_param();
  return 0;
}



int mm_bcn_change_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  
  kVar1 = ke_state_get(7);
  if (CONCAT22(extraout_var,kVar1) != 2) {
    assert_err("ke_state_get(TASK_APM) == APM_BCN_SETTING","module",0x156);
  }
  apm_start_cfm(0);
  return 0;
}



int apm_stop_req_handler
              (ke_msg_id_t msgid,apm_stop_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint uVar1;
  ke_state_t kVar2;
  undefined2 extraout_var;
  
  uVar1 = (uint)param->vif_idx;
  if ((vif_info_tab[uVar1].type == '\x02') && (vif_info_tab[uVar1].active != false)) {
    kVar2 = ke_state_get(7);
    if (CONCAT22(extraout_var,kVar2) != 0) {
      return 2;
    }
    if (apm_env.apm_emb_enabled != false) {
      apm_env.apm_emb_enabled = false;
    }
    apm_stop(vif_info_tab + uVar1);
    if (uap_conn_info != (cm_ConnectionInfo_t *)0x0) {
      RemoveAPKeyInfo(uap_conn_info);
      cm_DeleteConnection(uap_conn_info);
      uap_conn_info = (cm_ConnectionInfo_t *)0x0;
    }
  }
  ke_msg_send_basic(0x1c03,src_id,dest_id);
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int apm_start_req_handler
              (ke_msg_id_t msgid,apm_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint32_t uVar1;
  char "apm_start_req_handler" [22];
  uint8_t uVar2;
  _Bool _Var3;
  ke_state_t kVar4;
  uint16_t uVar5;
  undefined2 extraout_var_01;
  undefined3 extraout_var;
  scan_chan_tag *psVar6;
  undefined3 extraout_var_00;
  int iVar7;
  undefined *puVar8;
  uint uVar9;
  undefined uVar10;
  uint8_t *ssid;
  uint8_t uStack51;
  int8_t iStack50;
  uint8_t auStack49 [2];
  uint8_t chan_idx;
  int8_t pwr;
  uint8_t idx;
  
  printf("[WF] received APM Start %s:%d\r\n","apm_start_req_handler",0x4c);
  uVar9 = (uint)param->vif_idx;
  uVar10 = 4;
  if (vif_info_tab[uVar9].type == '\x02') {
    kVar4 = ke_state_get(7);
    if (CONCAT22(extraout_var_01,kVar4) == 0) {
      if (vif_info_tab[uVar9].active == false) {
        if (vif_info_tab[uVar9].chan_ctxt != (chan_ctxt_tag *)0x0) {
          assert_err("vif->chan_ctxt == NULL","module",0x67);
        }
        apm_env.param = param;
        uVar2 = me_add_chan_ctx(&uStack51,&param->chan,param->center_freq1,param->center_freq2,
                                param->ch_width);
        uVar10 = 1;
        if (CONCAT31(extraout_var,uVar2) == 0) {
          psVar6 = me_freq_to_chan_ptr((param->chan).band,(param->chan).freq);
          vif_info_tab[uVar9].bss_info.chan = psVar6;
          psVar6->tx_power = (param->chan).tx_power;
          vif_info_tab[uVar9].bss_info.center_freq1 = (uint16_t)param->center_freq1;
          vif_info_tab[uVar9].bss_info.center_freq2 = (uint16_t)param->center_freq2;
          uVar2 = param->ch_width;
          if (uVar2 == '\x04') {
            uVar2 = '\x03';
          }
          vif_info_tab[uVar9].bss_info.bw = uVar2;
          uVar2 = param->ch_width;
          vif_info_tab[uVar9].bss_info.power_constraint = '\0';
          vif_info_tab[uVar9].bss_info.phy_bw = uVar2;
          chan_ctxt_link(param->vif_idx,uStack51);
          apm_env.apm_emb_enabled = param->apm_emb_enabled;
          apm_env.hidden_ssid = param->hidden_ssid;
          _Var3 = apm_embedded_enabled(vif_info_tab + uVar9);
          if (CONCAT31(extraout_var_00,_Var3) != 0) {
            me_get_basic_rates(&param->rate_set,(mac_rateset *)param);
            if (param->qos_supported != '\0') {
              vif_info_tab[uVar9].bss_info.valid_flags =
                   vif_info_tab[uVar9].bss_info.valid_flags | 1;
            }
            if (me_env.ht_supported != false) {
              vif_info_tab[uVar9].bss_info.valid_flags =
                   vif_info_tab[uVar9].bss_info.valid_flags | 2;
            }
            vif_info_tab[uVar9].bss_info.beacon_interval = param->bcn_int;
            vif_info_tab[uVar9].bss_info.beacon_period = (ushort)param->beacon_period;
            vif_info_tab[uVar9].bss_info.sec_type = param->ap_sec_type;
            memcpy(&vif_info_tab[uVar9].bss_info.ssid,&param->ssid,0x22);
            vif_info_tab[uVar9].bss_info.ssid.array[vif_info_tab[uVar9].bss_info.ssid.length] = '\0'
            ;
            *(undefined4 *)vif_info_tab[uVar9].bss_info.bssid.array =
                 *(undefined4 *)vif_info_tab[uVar9].mac_addr.array;
            vif_info_tab[uVar9].bss_info.bssid.array[2] = vif_info_tab[uVar9].mac_addr.array[2];
            memcpy(&vif_info_tab[uVar9].bss_info.rate_set,&param->rate_set,0xd);
            vif_info_tab[uVar9].txq_params[0] = _DAT_44b00200;
            vif_info_tab[uVar9].txq_params[1] = _DAT_44b00204;
            vif_info_tab[uVar9].txq_params[2] = _DAT_44b00208;
            uVar1 = _DAT_44b0020c;
            vif_info_tab[uVar9].bss_info.edca_param.qos_info = '\0';
            vif_info_tab[uVar9].txq_params[3] = uVar1;
            *(undefined4 *)&vif_info_tab[uVar9].bss_info.aid_bitmap = 0xffff0000;
            apm_env.bcn_buf = (uint8_t *)ke_malloc(0x14d);
            uVar5 = me_build_beacon((uint32_t)apm_env.bcn_buf,vif_info_tab[uVar9].index,
                                    &param->tim_oft,&param->tim_len,apm_env.hidden_ssid);
            param->bcn_len = uVar5;
            if (param->ap_sec_type == '\0') {
              uap_conn_info = (cm_ConnectionInfo_t *)0x0;
            }
            else {
              uap_conn_info =
                   cm_InitConnection('\x02','\0','\0',
                                     (IEEEtypes_MacAddr_t *)&vif_info_tab[uVar9].bss_info.bssid,
                                     (IEEEtypes_MacAddr_t *)0x0,'\0',(unkbyte0 *)0x0);
              ssid = vif_info_tab[uVar9].bss_info.ssid.array;
              ap_setpsk(uap_conn_info,(CHAR *)ssid,(CHAR *)param->phrase);
              cm_SetComData(uap_conn_info,(char *)ssid);
              uap_conn_info->instNbr = param->vif_idx;
              printf("%s:uap_conn_info->instNbr = %d\r\n",0x23078994,(uint)uap_conn_info->instNbr);
              InitGroupKey(uap_conn_info);
            }
          }
          if ((param->chan).band == '\0') {
            uVar5 = me_legacy_rate_bitfield_build(&vif_info_tab[uVar9].bss_info.rate_set,true);
            if ((uVar5 & 0xf) == 0) {
              vif_info_tab[uVar9].bss_info.high_11b_rate = '\x01';
            }
            else {
              iVar7 = __clzsi2((uint)uVar5 & 0xf);
              vif_info_tab[uVar9].bss_info.high_11b_rate = '\x1f' - (char)iVar7;
            }
          }
          apm_set_bss_param();
          iStack50 = (vif_info_tab[uVar9].bss_info.chan)->tx_power;
          tpc_update_vif_tx_power(vif_info_tab + uVar9,&iStack50,auStack49);
          printf("[WF] return with other handler\r\n");
          return 1;
        }
      }
      else {
        uVar10 = 9;
      }
    }
    else {
      uVar10 = 8;
    }
  }
  printf("[WF] Sending APM CFM %s:%d\r\n",0x23078994,0xcc);
  puVar8 = (undefined *)ke_msg_alloc(0x1c01,src_id,dest_id,4);
  *puVar8 = uVar10;
  puVar8[1] = param->vif_idx;
  ke_msg_send();
  return 0;
}



int me_set_active_cfm_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ke_state_t kVar1;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  
  kVar1 = ke_state_get(7);
  if ((CONCAT22(extraout_var,kVar1) != 1) &&
     (kVar1 = ke_state_get(7), CONCAT22(extraout_var_00,kVar1) != 0)) {
    assert_err(
               "(ke_state_get(TASK_APM) == APM_BSS_PARAM_SETTING) || (ke_state_get(TASK_APM) == APM_IDLE)"
               ,"module",0x12f);
  }
  kVar1 = ke_state_get(7);
  if (CONCAT22(extraout_var_01,kVar1) == 1) {
    if (apm_env.bss_config.first != (co_list_hdr *)0x0) {
      assert_err("co_list_is_empty(&apm_env.bss_config)","module",0x135);
    }
    apm_bcn_set();
  }
  return 0;
}



int hostapd_mgt_ind_handler
              (ke_msg_id_t msgid,rxu_mgt_ind *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  ushort uVar1;
  
  uVar1 = param->framectrl & 0xfc;
  if ((uVar1 != 0x40) && (uVar1 != 0xb0)) {
    return 0;
  }
  ke_state_get(10);
  return 0;
}



void dump_cfg_entries(void)

{
  cfg_element_entry *pcVar1;
  char *pcVar2;
  char acStack64 [4];
  char strs [16];
  
  puts("================= CFG TASK =================\r\n");
  pcVar1 = cfg_entrys_mm;
  while (pcVar1 < &_fsymc_info_bloop) {
    printf("entry %p\r\n",pcVar1);
    printf("    task    : %lu\r\n",(blog_level_t *)pcVar1->task);
    printf("    element : %u\r\n",(uint)pcVar1->element);
    printf("    type    : %u\r\n",(uint)pcVar1->type);
    printf("    name    : %s\r\n",pcVar1->name);
    pcVar2 = cfg_api_element_dump(pcVar1->val,*(CFG_ELEMENT_TYPE *)&pcVar1->type,acStack64);
    printf("    type    : %s\r\n",pcVar2);
    printf("    val     : %s\r\n");
    puts("------------------------\r\n");
    pcVar1 = pcVar1 + 1;
  }
  puts("---------------------------------------------\r\n");
  return;
}



// WARNING: Variable defined which should be unmapped: val

int cfg_start_req_handler
              (ke_msg_id_t msgid,cfg_start_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined2 in_register_0000202a;
  undefined *puVar1;
  int iVar2;
  undefined4 uStack20;
  uint32_t val [1];
  
  if (param->ops == 0) {
    iVar2 = utils_tlv_bl_unpack_auto
                      ((uint32_t *)(param + 5),param[4].ops,*(uint16_t *)&param[3].ops,&uStack20);
    printf("unpack ret is %d, result is %lu\r\n",iVar2,uStack20);
    cfg_api_element_set(param[1].ops,param[2].ops,param[3].ops,&uStack20,(void *)0x0);
  }
  else {
    if (2 < param->ops) {
      dump_cfg_entries(CONCAT22(in_register_0000202a,msgid));
    }
  }
  puVar1 = (undefined *)ke_msg_alloc(0x3001,src_id,dest_id,1);
  *puVar1 = 0;
  ke_msg_send();
  return 0;
}



