pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void dbg_init(void)

{
  memset(&dbg_env,0,8);
  dbg_env.filter_module = 0xffffffff;
  dbg_env.filter_severity = 2;
  return;
}



void dbg_test_print(char *fmt,...)

{
  byte bVar1;
  uint uVar2;
  byte *pbVar3;
  va_list args;
  
  if (dbg_env.filter_severity != 0) {
    pbVar3 = (byte *)(fmt + 2);
    do {
      bVar1 = *fmt;
      uVar2 = (uint)bVar1;
      if (-1 < (char)bVar1) {
        return;
      }
      if (bVar1 < 0x88) {
        if ((~dbg_env.filter_module >> (uVar2 - 0x80 & 0x1f) & 1) != 0) {
          return;
        }
      }
      else {
        if (5 < (uVar2 + 0x66 & 0xff)) {
          assert_err("DBG_SEV_MIN <= prefix && prefix < DBG_SEV_MAX","module",0x297);
        }
        if (dbg_env.filter_severity <= uVar2 - 0x9a) {
          return;
        }
      }
      fmt = (char *)((byte *)fmt + 1);
    } while (pbVar3 != (byte *)fmt);
  }
  return;
}



int dbg_get_sys_stat_req_handler
              (ke_msg_id_t msgid,void *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  undefined4 *puVar1;
  
  puVar1 = (undefined4 *)ke_msg_alloc(0x40a,src_id,dest_id,0xc);
  *puVar1 = 0;
  puVar1[1] = 0;
  puVar1[2] = 0;
  ke_msg_send();
  return 0;
}



int dbg_mem_write_req_handler
              (ke_msg_id_t msgid,dbg_mem_write_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint32_t **ppuVar1;
  uint32_t **ppuVar2;
  
  ppuVar1 = (uint32_t **)ke_msg_alloc(0x403,src_id,dest_id,8);
  *(uint32_t *)param->memaddr = param->memdata;
  ppuVar2 = (uint32_t **)param->memaddr;
  *(uint32_t ***)ppuVar1 = ppuVar2;
  ppuVar1[1] = *ppuVar2;
  ke_msg_send();
  return 0;
}



int dbg_mem_read_req_handler
              (ke_msg_id_t msgid,dbg_mem_read_req *param,ke_task_id_t dest_id,ke_task_id_t src_id)

{
  uint32_t *puVar1;
  
  puVar1 = (uint32_t *)ke_msg_alloc(0x401,src_id,dest_id,8);
  puVar1[1] = *(uint32_t *)param->memaddr;
  *puVar1 = param->memaddr;
  ke_msg_send();
  return 0;
}



int dbg_set_sev_filter_req_handler
              (ke_msg_id_t msgid,dbg_set_sev_filter_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  dbg_env.filter_severity = param->sev_filter;
  ke_msg_send_basic(0x407,src_id,dest_id);
  return 0;
}



int dbg_set_mod_filter_req_handler
              (ke_msg_id_t msgid,dbg_set_mod_filter_req *param,ke_task_id_t dest_id,
              ke_task_id_t src_id)

{
  dbg_env.filter_module = param->mod_filter;
  ke_msg_send_basic(0x405,src_id,dest_id);
  return 0;
}



// WARNING: Type propagation algorithm not settling

co_list_hdr *
ke_queue_extract(co_list *queue,anon_subr__Bool_co_list_hdr_ptr_uint32_t *func,uint32_t arg)

{
  co_list_hdr cVar1;
  co_list_hdr cVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  co_list_hdr cVar4;
  
  cVar4 = (co_list_hdr)queue->first;
  cVar1 = (co_list_hdr)0x0;
  do {
    cVar2 = cVar1;
    cVar1 = cVar4;
    if (cVar1 == (co_list_hdr)0x0) {
      return (co_list_hdr *)0;
    }
    _Var3 = (*func)((co_list_hdr *)cVar1,arg);
    cVar4 = *(co_list_hdr *)cVar1;
  } while (CONCAT31(extraout_var,_Var3) == 0);
  if (cVar2 == (co_list_hdr)0x0) {
    *(co_list_hdr *)&queue->first = cVar4;
  }
  else {
    *(co_list_hdr *)cVar2 = cVar4;
  }
  if (*(int *)cVar1 == 0) {
    *(co_list_hdr *)&queue->last = cVar2;
  }
  else {
    *(undefined4 *)cVar1 = 0;
  }
  return (co_list_hdr *)cVar1;
}



void bl_aes_128(UINT8 *key,UINT8 *input,UINT8 *output)

{
  BL_AesEncrypt(key,'\x02',input,output);
  return;
}



void xor_128(UINT8 *a,UINT8 *b,UINT8 *out)

{
  byte *pbVar1;
  int iVar2;
  byte *pbVar3;
  byte *pbVar4;
  
  iVar2 = 0;
  do {
    pbVar1 = a + iVar2;
    pbVar4 = b + iVar2;
    pbVar3 = out + iVar2;
    iVar2 = iVar2 + 1;
    *pbVar3 = *pbVar1 ^ *pbVar4;
  } while (iVar2 != 0x10);
  return;
}



void leftshift_onebit(UINT8 *input,UINT8 *output)

{
  byte *pbVar1;
  int iVar2;
  byte bVar3;
  byte *pbVar4;
  
  bVar3 = 0;
  iVar2 = 0xf;
  do {
    pbVar1 = input + iVar2;
    pbVar4 = output + iVar2;
    iVar2 = iVar2 + -1;
    *pbVar4 = bVar3 | *pbVar1 << 1;
    bVar3 = *pbVar1 >> 7;
  } while (iVar2 != -1);
  return;
}



// WARNING: Variable defined which should be unmapped: tmp

void generate_subkey(UINT8 *key,UINT8 *K1,UINT8 *K2)

{
  UINT8 local_40 [4];
  UINT8 L [16];
  UINT8 Z [16];
  UINT8 tmp [16];
  
  memset(L + 0xc,0,0x10);
  bl_aes_128(key,L + 0xc,local_40);
  if ((char)local_40[0] < '\0') {
    leftshift_onebit(local_40,Z + 0xc);
    xor_128(Z + 0xc,"",K1);
  }
  else {
    leftshift_onebit(local_40,K1);
  }
  if ((char)*K1 < '\0') {
    leftshift_onebit(K1,Z + 0xc);
    xor_128(Z + 0xc,"",K2);
  }
  else {
    leftshift_onebit(K1,K2);
  }
  return;
}



void padding(UINT8 *lastb,UINT8 *pad,int length)

{
  int iVar1;
  
  iVar1 = 0;
  do {
    if (iVar1 < length) {
      pad[iVar1] = lastb[iVar1];
    }
    else {
      if (length == iVar1) {
        pad[length] = -0x80;
      }
      else {
        pad[iVar1] = '\0';
      }
    }
    iVar1 = iVar1 + 1;
  } while (iVar1 != 0x10);
  return;
}



void bl_aes_cmac(UINT8 *key,UINT8 *input,int length,UINT8 *mac)

{
  int iVar1;
  int iVar2;
  UINT8 *a;
  UINT8 *pUVar3;
  UINT8 local_80 [4];
  UINT8 X [16];
  UINT8 Y [16];
  UINT8 M_last [16];
  UINT8 padded [16];
  UINT8 K1 [16];
  UINT8 K2 [16];
  
  generate_subkey(key,padded + 0xc,K1 + 0xc);
  iVar1 = (length + 0xf) / 0x10;
  if (iVar1 == 0) {
    iVar1 = 1;
  }
  else {
    if ((length & 0xfU) == 0) {
      pUVar3 = padded;
      a = input + (iVar1 + -1) * 0x10;
      goto LAB_2301fbde;
    }
  }
  padding(input + (iVar1 + -1) * 0x10,M_last + 0xc,length % 0x10);
  pUVar3 = K1;
  a = M_last + 0xc;
LAB_2301fbde:
  xor_128(a,pUVar3 + 0xc,Y + 0xc);
  memset(local_80,0,0x10);
  iVar2 = 0;
  while (iVar2 < iVar1 + -1) {
    xor_128(local_80,input + iVar2 * 0x10,X + 0xc);
    bl_aes_128(key,X + 0xc,local_80);
    iVar2 = iVar2 + 1;
  }
  xor_128(local_80,Y + 0xc,X + 0xc);
  bl_aes_128(key,X + 0xc,local_80);
  iVar1 = 0;
  do {
    pUVar3 = local_80 + iVar1;
    a = mac + iVar1;
    iVar1 = iVar1 + 1;
    *a = *pUVar3;
  } while (iVar1 != 0x10);
  return;
}



int BL_AES_MEMCMP(UINT8 *dst,UINT8 *src,int len)

{
  int iVar1;
  int iVar2;
  
  iVar2 = 0;
  iVar1 = len;
  while (len != iVar2) {
    if (dst[iVar2] == src[iVar2]) {
      iVar1 = iVar1 + -1;
    }
    iVar2 = iVar2 + 1;
  }
  return -(uint)(iVar1 != 0);
}



