pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void BL_AES_MEMSET(UINT8 *dst,UINT8 val,int size)

{
  UINT8 *pUVar1;
  
  pUVar1 = dst;
  while (pUVar1 != dst + size) {
    *pUVar1 = val;
    pUVar1 = pUVar1 + 1;
  }
  return;
}



void BL_AES_MEMCPY(UINT8 *dst,UINT8 *src,int size)

{
  UINT8 *pUVar1;
  UINT8 *pUVar2;
  int iVar3;
  
  if (dst < src) {
    iVar3 = 0;
    while (iVar3 != size) {
      pUVar1 = src + iVar3;
      pUVar2 = dst + iVar3;
      iVar3 = iVar3 + 1;
      *pUVar2 = *pUVar1;
    }
    return;
  }
  while (size = size + -1, size != -1) {
    dst[size] = src[size];
  }
  return;
}



int BL_AesEncrypt(UINT8 *kek,UINT8 kekLen,UINT8 *data,UINT8 *ret)

{
  undefined3 in_register_0000202d;
  undefined auStack416 [4];
  UINT8 pBuf [400];
  
  rijndael_set_key((rijndael_ctx *)auStack416,kek,CONCAT31(in_register_0000202d,kekLen) << 6,1);
  rijndael_encrypt((rijndael_ctx *)auStack416,data,ret);
  return 0;
}



int BL_AesWrap(UINT8 *kek,UINT8 kekLen,UINT32 n,UINT8 *plain,UINT8 *keyIv,UINT8 *cipher)

{
  int iVar1;
  uint uVar2;
  int iVar3;
  int iVar4;
  UINT8 aUStack72 [4];
  UINT8 a [8];
  UINT8 b [16];
  
  if (n != 0) {
    BL_AES_MEMSET(a + 4,'\0',0x10);
    if (keyIv == (UINT8 *)0x0) {
      keyIv = BL_DEFAULT_IV;
    }
    BL_AES_MEMCPY(aUStack72,keyIv,8);
    BL_AES_MEMCPY(cipher + 8,plain,n << 3);
    uVar2 = 0;
    iVar4 = 6;
    do {
      iVar1 = 1;
      while (iVar3 = iVar1 * 8, iVar1 != n + 1) {
        BL_AES_MEMCPY(a + 4,aUStack72,8);
        BL_AES_MEMCPY(b + 4,cipher + iVar3,8);
        BL_AesEncrypt(kek,kekLen,a + 4,a + 4);
        BL_AES_MEMCPY(aUStack72,a + 4,8);
        a[3] = (char)uVar2 + (char)iVar1 ^ a[3];
        iVar1 = iVar1 + 1;
        BL_AES_MEMCPY(cipher + iVar3,b + 4,8);
      }
      iVar4 = iVar4 + -1;
      uVar2 = uVar2 + (n & 0xff) & 0xff;
    } while (iVar4 != 0);
    BL_AES_MEMCPY(cipher,aUStack72,8);
    return 0;
  }
  return -1;
}



int BL_AesUnWrap(UINT8 *kek,UINT8 kekLen,UINT32 n,UINT8 *cipher,UINT8 *keyIv,UINT8 *plain)

{
  uint uVar1;
  undefined3 in_register_0000202d;
  UINT32 UVar2;
  UINT8 *src;
  int iVar3;
  UINT8 aUStack472 [4];
  UINT8 a [8];
  UINT8 b [16];
  UINT8 pBuf [400];
  
  if (n != 0) {
    BL_AES_MEMSET(aUStack472,'\0',8);
    BL_AES_MEMSET(a + 4,'\0',0x10);
    BL_AES_MEMCPY(aUStack472,cipher,8);
    uVar1 = (n & 0xff) * 5;
    BL_AES_MEMCPY(plain,cipher + 8,n * 8);
    rijndael_set_key((rijndael_ctx *)(b + 0xc),kek,CONCAT31(in_register_0000202d,kekLen) << 6,0);
    iVar3 = 6;
    do {
      UVar2 = n;
      src = plain + n * 8 + -8;
      while (0 < (int)UVar2) {
        BL_AES_MEMCPY(a + 4,aUStack472,8);
        b[3] = (char)(uVar1 & 0xff) + (char)UVar2 ^ b[3];
        BL_AES_MEMCPY(b + 4,src,8);
        rijndael_decrypt((rijndael_ctx *)(b + 0xc),a + 4,a + 4);
        BL_AES_MEMCPY(aUStack472,a + 4,8);
        BL_AES_MEMCPY(src,b + 4,8);
        src = src + -8;
        UVar2 = UVar2 - 1;
      }
      uVar1 = (uVar1 & 0xff) - (n & 0xff);
      iVar3 = iVar3 + -1;
    } while (iVar3 != 0);
    if (keyIv == (UINT8 *)0x0) {
      keyIv = BL_DEFAULT_IV;
    }
    iVar3 = BL_AES_MEMCMP(keyIv,aUStack472,8);
    return -(uint)(iVar3 != 0);
  }
  return -1;
}



// WARNING: Variable defined which should be unmapped: pBuf

void Bl_hmac_md5(UINT8 *text_data,int text_len,UINT8 *key,int key_len,void *digest)

{
  ulong *puVar1;
  Bl_MD5_CTX *pBVar2;
  Bl_MD5_CTX *context;
  Bl_MD5_CTX *context_00;
  undefined auStack584 [4];
  Bl_MD5_CTX tctx;
  uchar pBuf [400];
  
  if (0x40 < key_len) {
    wpa_MD5Init((Bl_MD5_CTX *)auStack584);
    wpa_MD5Update((Bl_MD5_CTX *)auStack584,key,key_len);
    wpa_MD5Final(pBuf + 0x94,(Bl_MD5_CTX *)auStack584);
    key_len = 0x10;
    key = pBuf + 0x94;
  }
  memset(tctx.buffer + 0x3c,0,0x40);
  memcpy(tctx.buffer + 0x3c,key,key_len);
  context_00 = (Bl_MD5_CTX *)(pBuf + 0x3c);
  pBVar2 = (Bl_MD5_CTX *)(tctx.buffer + 0x3c);
  do {
    puVar1 = pBVar2->state;
    pBVar2->state[0] = pBVar2->state[0] ^ 0x36363636;
    pBVar2 = (Bl_MD5_CTX *)(puVar1 + 1);
  } while ((Bl_MD5_CTX *)(puVar1 + 1) != context_00);
  wpa_MD5Init(context_00);
  wpa_MD5Update(context_00,tctx.buffer + 0x3c,0x40);
  wpa_MD5Update(context_00,text_data,text_len);
  wpa_MD5Final((uchar *)digest,context_00);
  memset(tctx.buffer + 0x3c,0,0x40);
  memcpy(tctx.buffer + 0x3c,key,key_len);
  pBVar2 = (Bl_MD5_CTX *)(tctx.buffer + 0x3c);
  do {
    context = (Bl_MD5_CTX *)(pBVar2->state + 1);
    pBVar2->state[0] = pBVar2->state[0] ^ 0x5c5c5c5c;
    pBVar2 = context;
  } while (context != context_00);
  wpa_MD5Init(context);
  wpa_MD5Update(context,tctx.buffer + 0x3c,0x40);
  wpa_MD5Update(context,(UINT8 *)digest,0x10);
  wpa_MD5Final((uchar *)digest,context);
  return;
}



void Bl_hmac_sha1(uchar **ppText,int *pTextLen,int textNum,uchar *key,int key_len,uchar *output,
                 int outputLen)

{
  uint *puVar1;
  uint *__src;
  uchar **ppuVar2;
  int iVar3;
  uint *Message_Digest;
  uint local_1c0;
  uchar pBuf [400];
  
  if (0x40 < key_len) {
    Bl_SHA1Init((Bl_SHA1_CTX *)(pBuf + 0x50));
    Bl_SHA1Update((Bl_SHA1_CTX *)(pBuf + 0x50),key,key_len);
    Bl_SHA1Final((Bl_SHA1_CTX *)(pBuf + 0x50),key);
    key_len = 0x14;
  }
  memset(&local_1c0,0,0x40);
  memcpy(&local_1c0,key,key_len);
  Message_Digest = (uint *)(pBuf + 0x3c);
  puVar1 = &local_1c0;
  do {
    __src = puVar1 + 2;
    *puVar1 = *puVar1 ^ 0x36363636;
    puVar1[1] = puVar1[1] ^ 0x36363636;
    puVar1 = __src;
  } while (__src != Message_Digest);
  Bl_SHA1Init((Bl_SHA1_CTX *)(pBuf + 0x50));
  Bl_SHA1Update((Bl_SHA1_CTX *)(pBuf + 0x50),(UINT8 *)&local_1c0,0x40);
  iVar3 = 0;
  while (iVar3 < textNum) {
    puVar1 = (uint *)(pTextLen + iVar3);
    ppuVar2 = ppText + iVar3;
    iVar3 = iVar3 + 1;
    Bl_SHA1Update((Bl_SHA1_CTX *)(pBuf + 0x50),*ppuVar2,*puVar1);
  }
  Bl_SHA1Final((Bl_SHA1_CTX *)(pBuf + 0x50),(UINT8 *)Message_Digest);
  memset(&local_1c0,0,0x40);
  memcpy(&local_1c0,key,key_len);
  puVar1 = &local_1c0;
  do {
    __src = puVar1 + 2;
    *puVar1 = *puVar1 ^ 0x5c5c5c5c;
    puVar1[1] = puVar1[1] ^ 0x5c5c5c5c;
    puVar1 = __src;
  } while (__src != Message_Digest);
  Bl_SHA1Init((Bl_SHA1_CTX *)(pBuf + 0x50));
  Bl_SHA1Update((Bl_SHA1_CTX *)(pBuf + 0x50),(UINT8 *)&local_1c0,0x40);
  Bl_SHA1Update((Bl_SHA1_CTX *)(pBuf + 0x50),(UINT8 *)__src,0x14);
  Bl_SHA1Final((Bl_SHA1_CTX *)(pBuf + 0x50),(UINT8 *)__src);
  memcpy(output,__src,outputLen);
  return;
}



void Bl_PRF(uchar *key,int key_len,uchar *prefix,int prefix_len,uchar *data,int data_len,
           uchar *output,int len)

{
  char cVar1;
  int iVar2;
  int iVar3;
  int iVar4;
  int local_b0;
  int total_len;
  uchar *pText;
  UINT8 prf_input [120];
  
  total_len = (int)&pText;
  memset(&pText,0,0x78);
  if (prefix == (uchar *)0x0) {
    memcpy(&pText,data,data_len);
    local_b0 = data_len;
  }
  else {
    memcpy(&pText,prefix,prefix_len);
    local_b0 = prefix_len + 1 + data_len;
    *(undefined *)((int)&pText + prefix_len) = 0;
    memcpy((void *)((int)&pText + prefix_len + 1),data,data_len);
  }
  *(undefined *)((int)&pText + local_b0) = 0;
  iVar4 = 0;
  iVar3 = 0;
  local_b0 = local_b0 + 1;
  while( true ) {
    iVar2 = (iVar3 * -0x14 + len) * 0x1000000;
    cVar1 = (char)((uint)iVar2 >> 0x18);
    if ((len + 0x13) / 0x14 <= iVar3) break;
    if (0x14 < iVar2 >> 0x18) {
      cVar1 = '\x14';
    }
    Bl_hmac_sha1((uchar **)&total_len,&local_b0,1,key,key_len,output + iVar4,(int)cVar1);
    iVar4 = iVar4 + (int)cVar1;
    iVar3 = iVar3 + 1;
    *(char *)((int)&total_len + local_b0 + 3) = *(char *)((int)&total_len + local_b0 + 3) + '\x01';
  }
  return;
}



void wpa_MD5Transform(UINT32 *state,ulong *block)

{
  ulong uVar1;
  ulong uVar2;
  ulong uVar3;
  ulong uVar4;
  ulong uVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  ulong uVar13;
  ulong uVar14;
  ulong uVar15;
  ulong uVar16;
  ulong uVar17;
  ulong uVar18;
  ulong uVar19;
  uint uVar20;
  uint uVar21;
  ulong uVar22;
  ulong uVar23;
  ulong uVar24;
  ulong uVar25;
  
