pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar19 = *block;
  uVar20 = state[2];
  uVar21 = state[3];
  uVar12 = state[1];
  uVar5 = block[1];
  uVar8 = ((uVar20 ^ uVar21) & uVar12 ^ uVar21) + *state + uVar19 + 0xd76aa478;
  uVar9 = (uVar8 >> 0x19 | uVar8 * 0x80) + uVar12;
  uVar22 = block[2];
  uVar8 = ((uVar12 ^ uVar20) & uVar9 ^ uVar20) + uVar5 + 0xe8c7b756 + uVar21;
  uVar6 = (uVar8 >> 0x14 | uVar8 * 0x1000) + uVar9;
  uVar8 = ((uVar12 ^ uVar9) & uVar6 ^ uVar12) + uVar22 + 0x242070db + uVar20;
  uVar14 = block[3];
  uVar8 = (uVar8 * 0x20000 | uVar8 >> 0xf) + uVar6;
  uVar7 = ((uVar9 ^ uVar6) & uVar8 ^ uVar9) + uVar14 + 0xc1bdceee + uVar12;
  uVar24 = block[4];
  uVar7 = (uVar7 * 0x400000 | uVar7 >> 10) + uVar8;
  uVar9 = ((uVar6 ^ uVar8) & uVar7 ^ uVar6) + uVar24 + 0xf57c0faf + uVar9;
  uVar16 = block[5];
  uVar9 = (uVar9 >> 0x19 | uVar9 * 0x80) + uVar7;
  uVar6 = ((uVar8 ^ uVar7) & uVar9 ^ uVar8) + uVar16 + 0x4787c62a + uVar6;
  uVar1 = block[6];
  uVar6 = (uVar6 >> 0x14 | uVar6 * 0x1000) + uVar9;
  uVar8 = ((uVar7 ^ uVar9) & uVar6 ^ uVar7) + uVar1 + 0xa8304613 + uVar8;
  uVar18 = block[7];
  uVar8 = (uVar8 * 0x20000 | uVar8 >> 0xf) + uVar6;
  uVar7 = ((uVar9 ^ uVar6) & uVar8 ^ uVar9) + uVar18 + 0xfd469501 + uVar7;
  uVar4 = block[8];
  uVar7 = (uVar7 * 0x400000 | uVar7 >> 10) + uVar8;
  uVar9 = ((uVar6 ^ uVar8) & uVar7 ^ uVar6) + uVar4 + 0x698098d8 + uVar9;
  uVar2 = block[9];
  uVar9 = (uVar9 >> 0x19 | uVar9 * 0x80) + uVar7;
  uVar6 = ((uVar8 ^ uVar7) & uVar9 ^ uVar8) + uVar2 + 0x8b44f7af + uVar6;
  uVar13 = block[10];
  uVar6 = (uVar6 >> 0x14 | uVar6 * 0x1000) + uVar9;
  uVar8 = ((uVar7 ^ uVar9) & uVar6 ^ uVar7) + (uVar13 - 0xa44f) + uVar8;
  uVar23 = block[0xb];
  uVar8 = (uVar8 * 0x20000 | uVar8 >> 0xf) + uVar6;
  uVar7 = ((uVar9 ^ uVar6) & uVar8 ^ uVar9) + uVar23 + 0x895cd7be + uVar7;
  uVar15 = block[0xc];
  uVar7 = (uVar7 * 0x400000 | uVar7 >> 10) + uVar8;
  uVar9 = ((uVar6 ^ uVar8) & uVar7 ^ uVar6) + uVar15 + 0x6b901122 + uVar9;
  uVar25 = block[0xd];
  uVar9 = (uVar9 >> 0x19 | uVar9 * 0x80) + uVar7;
  uVar6 = ((uVar8 ^ uVar7) & uVar9 ^ uVar8) + uVar25 + 0xfd987193 + uVar6;
  uVar17 = block[0xe];
  uVar6 = (uVar6 >> 0x14 | uVar6 * 0x1000) + uVar9;
  uVar8 = ((uVar7 ^ uVar9) & uVar6 ^ uVar7) + uVar17 + 0xa679438e + uVar8;
  uVar3 = block[0xf];
  uVar8 = (uVar8 * 0x20000 | uVar8 >> 0xf) + uVar6;
  uVar7 = ((uVar9 ^ uVar6) & uVar8 ^ uVar9) + uVar3 + 0x49b40821 + uVar7;
  uVar7 = (uVar7 * 0x400000 | uVar7 >> 10) + uVar8;
  uVar9 = ((uVar8 ^ uVar7) & uVar6 ^ uVar8) + uVar5 + 0xf61e2562 + uVar9;
  uVar9 = (uVar9 >> 0x1b | uVar9 * 0x20) + uVar7;
  uVar6 = ((uVar7 ^ uVar9) & uVar8 ^ uVar7) + uVar1 + 0xc040b340 + uVar6;
  uVar6 = (uVar6 >> 0x17 | uVar6 * 0x200) + uVar9;
  uVar8 = ((uVar9 ^ uVar6) & uVar7 ^ uVar9) + uVar23 + 0x265e5a51 + uVar8;
  uVar8 = (uVar8 >> 0x12 | uVar8 * 0x4000) + uVar6;
  uVar7 = ((uVar6 ^ uVar8) & uVar9 ^ uVar6) + uVar19 + 0xe9b6c7aa + uVar7;
  uVar7 = (uVar7 * 0x100000 | uVar7 >> 0xc) + uVar8;
  uVar9 = ((uVar8 ^ uVar7) & uVar6 ^ uVar8) + uVar16 + 0xd62f105d + uVar9;
  uVar9 = (uVar9 >> 0x1b | uVar9 * 0x20) + uVar7;
  uVar6 = ((uVar7 ^ uVar9) & uVar8 ^ uVar7) + uVar13 + 0x2441453 + uVar6;
  uVar6 = (uVar6 >> 0x17 | uVar6 * 0x200) + uVar9;
  uVar8 = ((uVar9 ^ uVar6) & uVar7 ^ uVar9) + uVar3 + 0xd8a1e681 + uVar8;
  uVar8 = (uVar8 >> 0x12 | uVar8 * 0x4000) + uVar6;
  uVar7 = ((uVar6 ^ uVar8) & uVar9 ^ uVar6) + uVar24 + 0xe7d3fbc8 + uVar7;
  uVar7 = (uVar7 * 0x100000 | uVar7 >> 0xc) + uVar8;
  uVar9 = ((uVar8 ^ uVar7) & uVar6 ^ uVar8) + uVar2 + 0x21e1cde6 + uVar9;
  uVar9 = (uVar9 >> 0x1b | uVar9 * 0x20) + uVar7;
  uVar6 = ((uVar7 ^ uVar9) & uVar8 ^ uVar7) + uVar17 + 0xc33707d6 + uVar6;
  uVar6 = (uVar6 >> 0x17 | uVar6 * 0x200) + uVar9;
  uVar8 = ((uVar9 ^ uVar6) & uVar7 ^ uVar9) + uVar14 + 0xf4d50d87 + uVar8;
  uVar8 = (uVar8 >> 0x12 | uVar8 * 0x4000) + uVar6;
  uVar7 = ((uVar6 ^ uVar8) & uVar9 ^ uVar6) + uVar4 + 0x455a14ed + uVar7;
  uVar7 = (uVar7 * 0x100000 | uVar7 >> 0xc) + uVar8;
  uVar9 = ((uVar8 ^ uVar7) & uVar6 ^ uVar8) + uVar25 + 0xa9e3e905 + uVar9;
  uVar9 = (uVar9 >> 0x1b | uVar9 * 0x20) + uVar7;
  uVar6 = ((uVar7 ^ uVar9) & uVar8 ^ uVar7) + uVar22 + 0xfcefa3f8 + uVar6;
  uVar6 = (uVar6 >> 0x17 | uVar6 * 0x200) + uVar9;
  uVar8 = ((uVar9 ^ uVar6) & uVar7 ^ uVar9) + uVar8 + uVar18 + 0x676f02d9;
  uVar8 = (uVar8 >> 0x12 | uVar8 * 0x4000) + uVar6;
  uVar7 = (uVar9 & (uVar6 ^ uVar8) ^ uVar6) + uVar15 + 0x8d2a4c8a + uVar7;
  uVar7 = (uVar7 * 0x100000 | uVar7 >> 0xc) + uVar8;
  uVar9 = uVar9 + (uVar16 - 0x5c6be) + (uVar6 ^ uVar8 ^ uVar7);
  uVar10 = (uVar9 >> 0x1c | uVar9 * 0x10) + uVar7;
  uVar6 = (uVar8 ^ uVar7 ^ uVar10) + uVar4 + 0x8771f681 + uVar6;
  uVar6 = (uVar6 >> 0x15 | uVar6 * 0x800) + uVar10;
  uVar8 = (uVar7 ^ uVar10 ^ uVar6) + uVar23 + 0x6d9d6122 + uVar8;
  uVar8 = (uVar8 >> 0x10 | uVar8 * 0x10000) + uVar6;
  uVar7 = (uVar10 ^ uVar6 ^ uVar8) + uVar17 + 0xfde5380c + uVar7;
  uVar9 = (uVar7 * 0x800000 | uVar7 >> 9) + uVar8;
  uVar7 = (uVar6 ^ uVar8 ^ uVar9) + uVar5 + 0xa4beea44 + uVar10;
  uVar10 = (uVar7 >> 0x1c | uVar7 * 0x10) + uVar9;
  uVar6 = (uVar8 ^ uVar9 ^ uVar10) + uVar6 + uVar24 + 0x4bdecfa9;
  uVar6 = (uVar6 >> 0x15 | uVar6 * 0x800) + uVar10;
  uVar8 = (uVar9 ^ uVar10 ^ uVar6) + uVar8 + uVar18 + 0xf6bb4b60;
  uVar7 = (uVar8 >> 0x10 | uVar8 * 0x10000) + uVar6;
  uVar8 = (uVar10 ^ uVar6 ^ uVar7) + uVar13 + 0xbebfbc70 + uVar9;
  uVar9 = (uVar8 * 0x800000 | uVar8 >> 9) + uVar7;
  uVar8 = (uVar6 ^ uVar7 ^ uVar9) + uVar10 + uVar25 + 0x289b7ec6;
  uVar8 = (uVar8 >> 0x1c | uVar8 * 0x10) + uVar9;
  uVar6 = (uVar7 ^ uVar9 ^ uVar8) + uVar6 + uVar19 + 0xeaa127fa;
  uVar10 = (uVar6 >> 0x15 | uVar6 * 0x800) + uVar8;
  uVar6 = (uVar9 ^ uVar8 ^ uVar10) + uVar14 + 0xd4ef3085 + uVar7;
  uVar7 = (uVar6 >> 0x10 | uVar6 * 0x10000) + uVar10;
  uVar6 = (uVar8 ^ uVar10 ^ uVar7) + uVar9 + uVar1 + 0x4881d05;
  uVar6 = (uVar6 * 0x800000 | uVar6 >> 9) + uVar7;
  uVar8 = (uVar10 ^ uVar7 ^ uVar6) + uVar8 + uVar2 + 0xd9d4d039;
  uVar9 = (uVar8 >> 0x1c | uVar8 * 0x10) + uVar6;
  uVar8 = (uVar7 ^ uVar6 ^ uVar9) + uVar10 + uVar15 + 0xe6db99e5;
  uVar8 = (uVar8 >> 0x15 | uVar8 * 0x800) + uVar9;
  uVar7 = (uVar6 ^ uVar9 ^ uVar8) + uVar3 + 0x1fa27cf8 + uVar7;
  uVar7 = (uVar7 >> 0x10 | uVar7 * 0x10000) + uVar8;
  uVar6 = (uVar9 ^ uVar8 ^ uVar7) + uVar6 + uVar22 + 0xc4ac5665;
  uVar10 = (uVar6 * 0x800000 | uVar6 >> 9) + uVar7;
  uVar6 = ((~uVar8 | uVar10) ^ uVar7) + uVar19 + 0xf4292244 + uVar9;
  uVar9 = (uVar6 >> 0x1a | uVar6 * 0x40) + uVar10;
  uVar8 = ((~uVar7 | uVar9) ^ uVar10) + uVar18 + 0x432aff97 + uVar8;
  uVar8 = (uVar8 >> 0x16 | uVar8 * 0x400) + uVar9;
  uVar6 = ((~uVar10 | uVar8) ^ uVar9) + uVar17 + 0xab9423a7 + uVar7;
  uVar7 = (uVar6 >> 0x11 | uVar6 * 0x8000) + uVar8;
  uVar6 = ((~uVar9 | uVar7) ^ uVar8) + uVar10 + uVar16 + 0xfc93a039;
  uVar6 = (uVar6 * 0x200000 | uVar6 >> 0xb) + uVar7;
  uVar9 = ((~uVar8 | uVar6) ^ uVar7) + uVar9 + uVar15 + 0x655b59c3;
  uVar11 = (uVar9 >> 0x1a | uVar9 * 0x40) + uVar6;
  uVar8 = ((~uVar7 | uVar11) ^ uVar6) + uVar8 + uVar14 + 0x8f0ccc92;
  uVar10 = (uVar8 >> 0x16 | uVar8 * 0x400) + uVar11;
  uVar8 = ((~uVar6 | uVar10) ^ uVar11) + (uVar13 - 0x100b83) + uVar7;
  uVar7 = (uVar8 >> 0x11 | uVar8 * 0x8000) + uVar10;
  uVar8 = ((~uVar11 | uVar7) ^ uVar10) + uVar5 + 0x85845dd1 + uVar6;
  uVar9 = (uVar8 * 0x200000 | uVar8 >> 0xb) + uVar7;
  uVar8 = ((~uVar10 | uVar9) ^ uVar7) + uVar11 + uVar4 + 0x6fa87e4f;
  uVar6 = (uVar8 >> 0x1a | uVar8 * 0x40) + uVar9;
  uVar8 = ((~uVar7 | uVar6) ^ uVar9) + uVar10 + uVar3 + 0xfe2ce6e0;
  uVar8 = (uVar8 >> 0x16 | uVar8 * 0x400) + uVar6;
  uVar7 = ((~uVar9 | uVar8) ^ uVar6) + uVar7 + uVar1 + 0xa3014314;
  uVar7 = (uVar7 >> 0x11 | uVar7 * 0x8000) + uVar8;
  uVar9 = ((~uVar6 | uVar7) ^ uVar8) + uVar25 + 0x4e0811a1 + uVar9;
  uVar9 = (uVar9 * 0x200000 | uVar9 >> 0xb) + uVar7;
  uVar6 = ((~uVar8 | uVar9) ^ uVar7) + uVar6 + uVar24 + 0xf7537e82;
  uVar11 = (uVar6 >> 0x1a | uVar6 * 0x40) + uVar9;
  uVar8 = ((~uVar7 | uVar11) ^ uVar9) + uVar8 + uVar23 + 0xbd3af235;
  uVar10 = (uVar8 >> 0x16 | uVar8 * 0x400) + uVar11;
  uVar8 = ((~uVar9 | uVar10) ^ uVar11) + uVar7 + uVar22 + 0x2ad7d2bb;
  uVar6 = (uVar8 >> 0x11 | uVar8 * 0x8000) + uVar10;
  uVar8 = ((~uVar11 | uVar6) ^ uVar10) + uVar2 + 0xeb86d391 + uVar9;
  *state = uVar11 + *state;
  state[2] = uVar20 + uVar6;
  state[3] = uVar21 + uVar10;
  state[1] = uVar12 + uVar6 + (uVar8 * 0x200000 | uVar8 >> 0xb);
  memset(block,0,0x40);
  return;
}



