pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void wpa_MD5Init(Bl_MD5_CTX *context)

{
  context->state[0] = 0x67452301;
  context->state[1] = 0xefcdab89;
  context->state[2] = 0x98badcfe;
  context->count[1] = 0;
  context->count[0] = 0;
  context->state[3] = 0x10325476;
  return;
}



void wpa_MD5Update(Bl_MD5_CTX *context,UINT8 *input,UINT32 inputLen)

{
  uint uVar1;
  uint __n;
  
  uVar1 = context->count[0];
  __n = uVar1 + inputLen * 8;
  context->count[0] = __n;
  uVar1 = uVar1 >> 3 & 0x3f;
  if (__n < inputLen * 8) {
    context->count[1] = context->count[1] + 1;
  }
  context->count[1] = (inputLen >> 0x1d) + context->count[1];
  __n = 0x40 - uVar1;
  if (inputLen < __n) {
    __n = 0;
  }
  else {
    memcpy(context->buffer + uVar1,input,__n);
    wpa_MD5Transform((UINT32 *)context,(ulong *)context->buffer);
    while (__n + 0x3f < inputLen) {
      memcpy(context->scratch,input + __n,0x40);
      wpa_MD5Transform((UINT32 *)context,context->scratch);
      __n = __n + 0x40;
    }
    uVar1 = 0;
  }
  memcpy(context->buffer + uVar1,input + __n,inputLen - __n);
  return;
}



void wpa_MD5Final(uchar *digest,Bl_MD5_CTX *context)

{
  uint uVar1;
  int iVar2;
  UINT8 aUStack24 [4];
  uchar bits [8];
  
  memcpy(aUStack24,context->count,8);
  uVar1 = context->count[0] >> 3 & 0x3f;
  if (uVar1 < 0x38) {
    iVar2 = 0x38;
  }
  else {
    iVar2 = 0x78;
  }
  wpa_MD5Update(context,PADDING,iVar2 - uVar1);
  wpa_MD5Update(context,aUStack24,8);
  memcpy(digest,context,0x10);
  memset(context,0,0x98);
  return;
}



int rijndaelKeySetupEnc(u32 *rk,u8 *cipherKey,int keyBits)

{
  uint uVar1;
  uint uVar2;
  u32 *puVar3;
  u32 *puVar4;
  
  *rk = (uint)*cipherKey << 0x18 ^ (uint)cipherKey[1] << 0x10 ^ (uint)cipherKey[3] ^
        (uint)cipherKey[2] << 8;
  rk[1] = (uint)cipherKey[4] << 0x18 ^ (uint)cipherKey[5] << 0x10 ^ (uint)cipherKey[7] ^
          (uint)cipherKey[6] << 8;
  rk[2] = (uint)cipherKey[8] << 0x18 ^ (uint)cipherKey[9] << 0x10 ^ (uint)cipherKey[0xb] ^
          (uint)cipherKey[10] << 8;
  rk[3] = (uint)cipherKey[0xc] << 0x18 ^ (uint)cipherKey[0xd] << 0x10 ^ (uint)cipherKey[0xf] ^
          (uint)cipherKey[0xe] << 8;
  if (keyBits == 0x80) {
    puVar3 = rcon;
    puVar4 = rk + 0x24;
    while( true ) {
      uVar1 = *puVar3;
      uVar2 = rk[3];
      puVar3 = puVar3 + 1;
      uVar1 = *rk ^ uVar1 ^ (uint)Te4[uVar2 >> 0x18] ^ (uint)Te4[uVar2 & 0xff] << 8 ^
              (uint)Te4[uVar2 >> 0x10 & 0xff] << 0x18 ^ (uint)Te4[uVar2 >> 8 & 0xff] << 0x10;
      rk[4] = uVar1;
      uVar1 = uVar1 ^ rk[1];
      rk[5] = uVar1;
      uVar1 = uVar1 ^ rk[2];
      rk[6] = uVar1;
      rk[7] = uVar1 ^ uVar2;
      if (rk == puVar4) break;
      rk = rk + 4;
    }
    return 10;
  }
  return 0;
}



void rijndael_set_key(rijndael_ctx *ctx,u8 *key,int bits,int encrypt)

{
  int iVar1;
  u32 *rk;
  int iVar2;
  u32 uVar3;
  u32 *puVar4;
  uint uVar5;
  int *piVar6;
  
  rk = ctx->key;
  iVar2 = rijndaelKeySetupEnc(rk,key,bits);
  ctx->Nr = iVar2;
  if (encrypt == 0) {
    ctx->decrypt = 1;
    if (iVar2 == 0) {
      iVar2 = rijndaelKeySetupEnc(rk,key,bits);
    }
    puVar4 = rk;
    piVar6 = &ctx->decrypt + iVar2 * 4;
    while (encrypt < iVar2 * 4 - encrypt) {
      uVar3 = *puVar4;
      encrypt = encrypt + 4;
      *puVar4 = piVar6[2];
      piVar6[2] = uVar3;
      uVar3 = puVar4[1];
      puVar4[1] = piVar6[3];
      piVar6[3] = uVar3;
      uVar3 = puVar4[2];
      puVar4[2] = piVar6[4];
      piVar6[4] = uVar3;
      uVar3 = puVar4[3];
      puVar4[3] = piVar6[5];
      piVar6[5] = uVar3;
      puVar4 = puVar4 + 4;
      piVar6 = piVar6 + -4;
    }
    iVar1 = 1;
    while (iVar1 < iVar2) {
      puVar4 = rk + 4;
      uVar5 = *puVar4;
      iVar1 = iVar1 + 1;
      *puVar4 = Td2[Te4[uVar5 >> 8 & 0xff]] ^
                Td0[Te4[uVar5 >> 0x18]] ^ Td3[Te4[uVar5 & 0xff]] ^ Td1[Te4[uVar5 >> 0x10 & 0xff]];
      uVar5 = rk[5];
      rk[5] = Td2[Te4[uVar5 >> 8 & 0xff]] ^
              Td0[Te4[uVar5 >> 0x18]] ^ Td3[Te4[uVar5 & 0xff]] ^ Td1[Te4[uVar5 >> 0x10 & 0xff]];
      uVar5 = rk[6];
      rk[6] = Td2[Te4[uVar5 >> 8 & 0xff]] ^
              Td0[Te4[uVar5 >> 0x18]] ^ Td3[Te4[uVar5 & 0xff]] ^ Td1[Te4[uVar5 >> 0x10 & 0xff]];
      uVar5 = rk[7];
      rk[7] = Td2[Te4[uVar5 >> 8 & 0xff]] ^
              Td0[Te4[uVar5 >> 0x18]] ^ Td3[Te4[uVar5 & 0xff]] ^ Td1[Te4[uVar5 >> 0x10 & 0xff]];
      rk = puVar4;
    }
  }
  else {
    ctx->decrypt = 0;
  }
  return;
}



void rijndael_decrypt(rijndael_ctx *ctx,u8 *src,u8 *dst)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  u32 *puVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  int iVar13;
  uint uVar14;
  int iVar15;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  
  uVar10 = (uint)*src << 0x18 ^ (uint)src[1] << 0x10 ^ (uint)src[3] ^ (uint)src[2] << 8 ^
           ctx->key[0];
  uVar16 = (uint)src[4] << 0x18 ^ (uint)src[5] << 0x10 ^ (uint)src[7] ^ (uint)src[6] << 8 ^
           ctx->key[1];
  uVar14 = (uint)src[8] << 0x18 ^ (uint)src[9] << 0x10 ^ (uint)src[0xb] ^ (uint)src[10] << 8 ^
           ctx->key[2];
  uVar11 = (uint)src[0xc] << 0x18 ^ (uint)src[0xd] << 0x10 ^ (uint)src[0xf] ^ (uint)src[0xe] << 8 ^
           ctx->key[3];
  iVar13 = ctx->Nr >> 1;
  puVar4 = ctx->key;
  iVar15 = iVar13;
  while( true ) {
    uVar5 = Td0[uVar10 >> 0x18] ^ Td3[uVar16 & 0xff] ^ puVar4[4] ^
            *(uint *)((int)Td1 + (uVar11 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Td2 + (uVar14 >> 6 & 0x3fc));
    iVar15 = iVar15 + -1;
    uVar17 = uVar5 >> 0x10 & 0xff;
    uVar6 = Td0[uVar16 >> 0x18] ^ Td3[uVar14 & 0xff] ^ puVar4[5] ^
            *(uint *)((int)Td1 + (uVar10 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Td2 + (uVar11 >> 6 & 0x3fc));
    uVar8 = Td0[uVar14 >> 0x18] ^ Td3[uVar11 & 0xff] ^ puVar4[6] ^
            *(uint *)((int)Td1 + (uVar16 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Td2 + (uVar10 >> 6 & 0x3fc));
    uVar12 = Td0[uVar11 >> 0x18] ^ Td3[uVar10 & 0xff] ^ puVar4[7] ^
             *(uint *)((int)Td1 + (uVar14 >> 0xe & 0x3fc)) ^
             *(uint *)((int)Td2 + (uVar16 >> 6 & 0x3fc));
    uVar19 = uVar12 >> 0x10 & 0xff;
    uVar18 = uVar8 >> 8 & 0xff;
    uVar10 = puVar4[8];
    uVar16 = uVar12 >> 8 & 0xff;
    uVar11 = uVar6 >> 0x10 & 0xff;
    uVar14 = uVar5 >> 8 & 0xff;
    uVar9 = uVar8 >> 0x10 & 0xff;
    uVar7 = uVar6 >> 8 & 0xff;
    if (iVar15 == 0) break;
    uVar10 = Td0[uVar5 >> 0x18] ^ Td3[uVar6 & 0xff] ^ uVar10 ^ Td1[uVar19] ^ Td2[uVar18];
    uVar16 = Td0[uVar6 >> 0x18] ^ Td3[uVar8 & 0xff] ^ puVar4[9] ^ Td1[uVar17] ^ Td2[uVar16];
    uVar14 = Td0[uVar8 >> 0x18] ^ Td3[uVar12 & 0xff] ^ puVar4[10] ^ Td1[uVar11] ^ Td2[uVar14];
    uVar11 = Td0[uVar12 >> 0x18] ^ Td3[uVar5 & 0xff] ^ puVar4[0xb] ^ Td1[uVar9] ^ Td2[uVar7];
    puVar4 = puVar4 + 8;
  }
  puVar4 = ctx->key + iVar13 * 8;
  uVar10 = (uint)Td4[uVar5 >> 0x18] << 0x18 ^ (uint)Td4[uVar19] << 0x10 ^ (uint)Td4[uVar6 & 0xff] ^
           (uint)Td4[uVar18] << 8 ^ uVar10;
  *dst = (u8)(uVar10 >> 0x18);
  dst[1] = (u8)(uVar10 >> 0x10);
  dst[2] = (u8)(uVar10 >> 8);
  bVar1 = Td4[uVar17];
  bVar2 = Td4[uVar6 >> 0x18];
  bVar3 = Td4[uVar8 & 0xff];
  dst[3] = (u8)uVar10;
  uVar10 = (uint)bVar2 << 0x18 ^ (uint)bVar1 << 0x10 ^ (uint)bVar3 ^ (uint)Td4[uVar16] << 8 ^
           puVar4[1];
  dst[4] = (u8)(uVar10 >> 0x18);
  dst[5] = (u8)(uVar10 >> 0x10);
  dst[6] = (u8)(uVar10 >> 8);
  dst[7] = (u8)uVar10;
  bVar1 = Td4[uVar12 >> 0x18];
  uVar10 = (uint)Td4[uVar8 >> 0x18] << 0x18 ^ (uint)Td4[uVar11] << 0x10 ^ (uint)Td4[uVar12 & 0xff] ^
           (uint)Td4[uVar14] << 8 ^ puVar4[2];
  dst[8] = (u8)(uVar10 >> 0x18);
  dst[9] = (u8)(uVar10 >> 0x10);
  dst[0xb] = (u8)uVar10;
  bVar2 = Td4[uVar9];
  dst[10] = (u8)(uVar10 >> 8);
  uVar10 = (uint)bVar1 << 0x18 ^ (uint)bVar2 << 0x10 ^ (uint)Td4[uVar5 & 0xff] ^
           (uint)Td4[uVar7] << 8 ^ puVar4[3];
  dst[0xc] = (u8)(uVar10 >> 0x18);
  dst[0xd] = (u8)(uVar10 >> 0x10);
  dst[0xe] = (u8)(uVar10 >> 8);
  dst[0xf] = (u8)uVar10;
  return;
}



void rijndael_encrypt(rijndael_ctx *ctx,u8 *src,u8 *dst)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  u32 *puVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  int iVar13;
  uint uVar14;
  int iVar15;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  
