pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar10 = (uint)*src << 0x18 ^ (uint)src[1] << 0x10 ^ (uint)src[3] ^ (uint)src[2] << 8 ^
           ctx->key[0];
  uVar16 = (uint)src[4] << 0x18 ^ (uint)src[5] << 0x10 ^ (uint)src[7] ^ (uint)src[6] << 8 ^
           ctx->key[1];
  uVar14 = (uint)src[8] << 0x18 ^ (uint)src[9] << 0x10 ^ (uint)src[0xb] ^ (uint)src[10] << 8 ^
           ctx->key[2];
  uVar11 = (uint)src[0xc] << 0x18 ^ (uint)src[0xd] << 0x10 ^ (uint)src[0xf] ^ (uint)src[0xe] << 8 ^
           ctx->key[3];
  iVar13 = ctx->Nr >> 1;
  puVar4 = ctx->key;
  iVar15 = iVar13;
  while( true ) {
    uVar8 = Te0[uVar10 >> 0x18] ^ Te3[uVar11 & 0xff] ^ puVar4[4] ^
            *(uint *)((int)Te1 + (uVar16 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Te2 + (uVar14 >> 6 & 0x3fc));
    iVar15 = iVar15 + -1;
    uVar6 = Te0[uVar16 >> 0x18] ^ Te3[uVar10 & 0xff] ^ puVar4[5] ^
            *(uint *)((int)Te1 + (uVar14 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Te2 + (uVar11 >> 6 & 0x3fc));
    uVar5 = Te0[uVar14 >> 0x18] ^ Te3[uVar16 & 0xff] ^ puVar4[6] ^
            *(uint *)((int)Te1 + (uVar11 >> 0xe & 0x3fc)) ^
            *(uint *)((int)Te2 + (uVar10 >> 6 & 0x3fc));
    uVar12 = Te0[uVar11 >> 0x18] ^ Te3[uVar14 & 0xff] ^ puVar4[7] ^
             *(uint *)((int)Te1 + (uVar10 >> 0xe & 0x3fc)) ^
             *(uint *)((int)Te2 + (uVar16 >> 6 & 0x3fc));
    uVar19 = uVar6 >> 0x10 & 0xff;
    uVar18 = uVar5 >> 8 & 0xff;
    uVar10 = puVar4[8];
    uVar17 = uVar5 >> 0x10 & 0xff;
    uVar16 = uVar12 >> 8 & 0xff;
    uVar11 = uVar12 >> 0x10 & 0xff;
    uVar14 = uVar8 >> 8 & 0xff;
    uVar9 = uVar8 >> 0x10 & 0xff;
    uVar7 = uVar6 >> 8 & 0xff;
    if (iVar15 == 0) break;
    uVar10 = Te0[uVar8 >> 0x18] ^ Te3[uVar12 & 0xff] ^ uVar10 ^ Te1[uVar19] ^ Te2[uVar18];
    uVar16 = Te0[uVar6 >> 0x18] ^ Te3[uVar8 & 0xff] ^ puVar4[9] ^ Te1[uVar17] ^ Te2[uVar16];
    uVar14 = Te0[uVar5 >> 0x18] ^ Te3[uVar6 & 0xff] ^ puVar4[10] ^ Te1[uVar11] ^ Te2[uVar14];
    uVar11 = Te0[uVar12 >> 0x18] ^ Te3[uVar5 & 0xff] ^ puVar4[0xb] ^ Te1[uVar9] ^ Te2[uVar7];
    puVar4 = puVar4 + 8;
  }
  puVar4 = ctx->key + iVar13 * 8;
  uVar10 = (uint)Te4[uVar8 >> 0x18] << 0x18 ^ (uint)Te4[uVar19] << 0x10 ^ (uint)Te4[uVar12 & 0xff] ^
           (uint)Te4[uVar18] << 8 ^ uVar10;
  *dst = (u8)(uVar10 >> 0x18);
  dst[1] = (u8)(uVar10 >> 0x10);
  dst[2] = (u8)(uVar10 >> 8);
  bVar1 = Te4[uVar17];
  bVar2 = Te4[uVar6 >> 0x18];
  bVar3 = Te4[uVar8 & 0xff];
  dst[3] = (u8)uVar10;
  uVar10 = (uint)bVar2 << 0x18 ^ (uint)bVar1 << 0x10 ^ (uint)bVar3 ^ (uint)Te4[uVar16] << 8 ^
           puVar4[1];
  dst[4] = (u8)(uVar10 >> 0x18);
  dst[5] = (u8)(uVar10 >> 0x10);
  dst[6] = (u8)(uVar10 >> 8);
  dst[7] = (u8)uVar10;
  bVar1 = Te4[uVar12 >> 0x18];
  uVar10 = (uint)Te4[uVar5 >> 0x18] << 0x18 ^ (uint)Te4[uVar11] << 0x10 ^ (uint)Te4[uVar6 & 0xff] ^
           (uint)Te4[uVar14] << 8 ^ puVar4[2];
  dst[8] = (u8)(uVar10 >> 0x18);
  dst[9] = (u8)(uVar10 >> 0x10);
  dst[0xb] = (u8)uVar10;
  bVar2 = Te4[uVar9];
  dst[10] = (u8)(uVar10 >> 8);
  uVar10 = (uint)bVar1 << 0x18 ^ (uint)bVar2 << 0x10 ^ (uint)Te4[uVar5 & 0xff] ^
           (uint)Te4[uVar7] << 8 ^ puVar4[3];
  dst[0xc] = (u8)(uVar10 >> 0x18);
  dst[0xd] = (u8)(uVar10 >> 0x10);
  dst[0xe] = (u8)(uVar10 >> 8);
  dst[0xf] = (u8)uVar10;
  return;
}



void Bl_SHA1ProcessMessageBlock(Bl_SHA1_CTX *context)

{
  uint uVar1;
  uint uVar2;
  uint uVar3;
  UINT32 *pUVar4;
  uint uVar5;
  UINT32 *pUVar6;
  UINT32 *pUVar7;
  uint uVar8;
  UINT32 UVar9;
  uint uVar10;
  uint uVar11;
  UINT32 UVar12;
  uint uVar13;
  uint uVar14;
  uint uVar15;
  UINT32 UVar16;
  
  pUVar4 = context->Scratch;
  pUVar6 = pUVar4;
  do {
    pUVar7 = pUVar6 + 1;
    *pUVar6 = (uint)*(byte *)(pUVar6 + 0x10) << 0x18 | (uint)*(byte *)((int)pUVar6 + 0x41) << 0x10 |
              (uint)*(byte *)((int)pUVar6 + 0x42) << 8 | (uint)*(byte *)((int)pUVar6 + 0x43);
    pUVar6 = pUVar7;
  } while ((UINT32 *)context->Message_Block != pUVar7);
  uVar11 = 0;
  uVar8 = context->Intermediate_Hash[2];
  uVar10 = context->Intermediate_Hash[0];
  UVar12 = context->Intermediate_Hash[1];
  uVar2 = context->Intermediate_Hash[3];
  UVar16 = context->Intermediate_Hash[4];
  do {
    uVar13 = uVar2;
    uVar3 = uVar10;
    uVar2 = uVar8;
    if ((uVar11 & 0x30) == 0) {
      UVar9 = context->Scratch[uVar11];
    }
    else {
      uVar8 = pUVar4[uVar11 + 0xd & 0xf] ^ pUVar4[uVar11 + 8 & 0xf] ^ pUVar4[uVar11 & 0xf] ^
              pUVar4[uVar11 + 2 & 0xf];
      UVar9 = uVar8 >> 0x1f | uVar8 << 1;
      pUVar4[uVar11 & 0xf] = UVar9;
    }
    uVar11 = uVar11 + 1;
    uVar10 = UVar9 + ((uVar2 ^ uVar13) & UVar12 ^ uVar13) +
                     (uVar3 << 5 | uVar3 >> 0x1b) + 0x5a827999 + UVar16;
    uVar8 = UVar12 << 0x1e | UVar12 >> 2;
    UVar12 = uVar3;
    UVar16 = uVar13;
  } while (uVar11 != 0x14);
  do {
    uVar14 = uVar10;
    uVar1 = uVar2;
    uVar2 = uVar11 + 0xd;
    uVar10 = uVar11 + 8;
    uVar15 = uVar11 & 0xf;
    uVar5 = uVar11 + 2;
    uVar11 = uVar11 + 1;
    uVar2 = pUVar4[uVar2 & 0xf] ^ pUVar4[uVar10 & 0xf] ^ pUVar4[uVar15] ^ pUVar4[uVar5 & 0xf];
    uVar2 = uVar2 >> 0x1f | uVar2 << 1;
    pUVar4[uVar15] = uVar2;
    uVar10 = (uVar3 ^ uVar8 ^ uVar1) + (uVar14 << 5 | uVar14 >> 0x1b) + 0x6ed9eba1 + uVar2 + uVar13;
    uVar5 = uVar3 << 0x1e | uVar3 >> 2;
    uVar2 = uVar8;
    uVar3 = uVar14;
    uVar8 = uVar5;
    uVar13 = uVar1;
  } while (uVar11 != 0x28);
  do {
    uVar8 = uVar10;
    uVar13 = uVar11 + 0xd;
    uVar10 = uVar11 + 8;
    uVar15 = uVar11 & 0xf;
    uVar3 = uVar11 + 2;
    uVar11 = uVar11 + 1;
    uVar10 = pUVar4[uVar13 & 0xf] ^ pUVar4[uVar10 & 0xf] ^ pUVar4[uVar15] ^ pUVar4[uVar3 & 0xf];
    uVar10 = uVar10 >> 0x1f | uVar10 << 1;
    pUVar4[uVar15] = uVar10;
    uVar10 = ((uVar5 | uVar2) & uVar14 | uVar5 & uVar2) + (uVar8 << 5 | uVar8 >> 0x1b) + 0x8f1bbcdc
             + uVar10 + uVar1;
    uVar13 = uVar14 << 0x1e | uVar14 >> 2;
    uVar1 = uVar2;
    uVar14 = uVar8;
    uVar3 = uVar2;
    uVar2 = uVar5;
    uVar5 = uVar13;
  } while (uVar11 != 0x3c);
  do {
    uVar15 = uVar13;
    uVar5 = uVar2;
    uVar1 = uVar10;
    uVar10 = uVar11 + 0xd;
    uVar13 = uVar11 + 8;
    uVar2 = uVar11 & 0xf;
    uVar14 = uVar11 + 2;
    uVar11 = uVar11 + 1;
    uVar10 = pUVar4[uVar10 & 0xf] ^ pUVar4[uVar13 & 0xf] ^ pUVar4[uVar2] ^ pUVar4[uVar14 & 0xf];
    uVar10 = uVar10 >> 0x1f | uVar10 << 1;
    pUVar4[uVar2] = uVar10;
    uVar10 = uVar10 + (uVar8 ^ uVar15 ^ uVar5) + (uVar1 << 5 | uVar1 >> 0x1b) + 0xca62c1d6 + uVar3;
    uVar13 = uVar8 << 0x1e | uVar8 >> 2;
    uVar8 = uVar1;
    uVar3 = uVar5;
    uVar2 = uVar15;
  } while (uVar11 != 0x50);
  context->Message_Block_Index = 0;
  UVar12 = context->Intermediate_Hash[1];
  context->Intermediate_Hash[0] = uVar10 + context->Intermediate_Hash[0];
  context->Intermediate_Hash[1] = uVar1 + UVar12;
  context->Intermediate_Hash[2] = uVar13 + context->Intermediate_Hash[2];
  context->Intermediate_Hash[3] = uVar15 + context->Intermediate_Hash[3];
  context->Intermediate_Hash[4] = uVar5 + context->Intermediate_Hash[4];
  return;
}



int Bl_SHA1Init(Bl_SHA1_CTX *context)

{
  if (context != (Bl_SHA1_CTX *)0x0) {
    context->Intermediate_Hash[0] = 0x67452301;
    context->Intermediate_Hash[1] = 0xefcdab89;
    context->Intermediate_Hash[2] = 0x98badcfe;
    context->Intermediate_Hash[3] = 0x10325476;
    context->Length_Low = 0;
    context->Length_High = 0;
    context->Intermediate_Hash[4] = 0xc3d2e1f0;
    *(undefined4 *)&context->Message_Block_Index = 0;
    return 0;
  }
  return 1;
}



