pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int Bl_SHA1Final(Bl_SHA1_CTX *context,UINT8 *Message_Digest)

{
  short sVar1;
  ushort uVar2;
  int iVar3;
  uint uVar4;
  UINT32 UVar5;
  SINT16 *pSVar6;
  
  uVar4 = 1;
  if (((context != (Bl_SHA1_CTX *)0x0) && (Message_Digest != (UINT8 *)0x0)) &&
     (uVar4 = (uint)context->Corrupted, context->Corrupted == 0)) {
    if (context->Computed == '\0') {
      iVar3 = (int)context->Message_Block_Index;
      context->Message_Block_Index = (SINT16)((uint)((iVar3 + 1) * 0x10000) >> 0x10);
      context->Message_Block[iVar3] = -0x80;
      if (iVar3 < 0x38) {
        while( true ) {
          sVar1 = context->Message_Block_Index;
          if (0x37 < (int)sVar1) break;
          context->Message_Block_Index = sVar1 + 1;
          context->Message_Block[(int)sVar1] = '\0';
        }
      }
      else {
        while( true ) {
          sVar1 = context->Message_Block_Index;
          if (0x3f < (int)sVar1) break;
          context->Message_Block_Index = sVar1 + 1;
          context->Message_Block[(int)sVar1] = '\0';
        }
        Bl_SHA1ProcessMessageBlock(context);
        while( true ) {
          sVar1 = context->Message_Block_Index;
          if (0x37 < (int)sVar1) break;
          context->Message_Block_Index = sVar1 + 1;
          context->Message_Block[(int)sVar1] = '\0';
        }
      }
      UVar5 = context->Length_High;
      *(ushort *)(context->Message_Block + 0x3a) =
           *(ushort *)&context->Length_High << 8 | *(ushort *)&context->Length_High >> 8;
      context->Message_Block[0x39] = (UINT8)(UVar5 >> 0x10);
      uVar2 = *(ushort *)&context->Length_Low;
      context->Message_Block[0x38] = (UINT8)(UVar5 >> 0x18);
      UVar5 = context->Length_Low;
      *(ushort *)(context->Message_Block + 0x3e) = uVar2 << 8 | uVar2 >> 8;
      context->Message_Block[0x3d] = (UINT8)(UVar5 >> 0x10);
      context->Message_Block[0x3c] = (UINT8)(UVar5 >> 0x18);
      Bl_SHA1ProcessMessageBlock(context);
      pSVar6 = (SINT16 *)context->Message_Block;
      do {
        *(UINT8 *)pSVar6 = '\0';
        pSVar6 = (SINT16 *)((int)pSVar6 + 1);
      } while (&context->Message_Block_Index != pSVar6);
      context->Length_Low = 0;
      context->Length_High = 0;
      context->Computed = '\x01';
    }
    uVar4 = 0;
    do {
      Message_Digest[uVar4] =
           (UINT8)(*(uint *)((int)context->Intermediate_Hash + (uVar4 & 0xfffffffc)) >>
                  ((~uVar4 & 3) << 3));
      uVar4 = uVar4 + 1;
    } while (uVar4 != 0x14);
    memset(context,0,0xa0);
    return 0;
  }
  return uVar4;
}



int Bl_SHA1Update(Bl_SHA1_CTX *context,UINT8 *message_array,uint length)

{
  short sVar1;
  UINT8 *pUVar2;
  uint uVar3;
  UINT32 UVar4;
  int iVar5;
  
  if (length == 0) {
    return 0;
  }
  uVar3 = 1;
  if ((context != (Bl_SHA1_CTX *)0x0) && (message_array != (UINT8 *)0x0)) {
    if (context->Computed == '\0') {
      uVar3 = (uint)context->Corrupted;
      if (context->Corrupted == 0) {
        pUVar2 = message_array + length;
        while ((message_array != pUVar2 && (context->Corrupted == '\0'))) {
          sVar1 = context->Message_Block_Index;
          iVar5 = ((int)sVar1 + 1) * 0x10000;
          context->Message_Block_Index = (SINT16)((uint)iVar5 >> 0x10);
          context->Message_Block[(int)sVar1] = *message_array;
          UVar4 = context->Length_Low + 8;
          context->Length_Low = UVar4;
          if ((UVar4 == 0) &&
             (UVar4 = context->Length_High + 1, context->Length_High = UVar4, UVar4 == 0)) {
            context->Corrupted = '\x01';
          }
          if (iVar5 >> 0x10 == 0x40) {
            Bl_SHA1ProcessMessageBlock(context);
          }
          message_array = message_array + 1;
        }
        uVar3 = 0;
      }
    }
    else {
      context->Corrupted = '\x03';
      uVar3 = 3;
    }
  }
  return uVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

Status_e supplicantRestoreDefaults(void)

{
  char "supplicantRestoreDefaults" [26];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantRestoreDefaults");
  pmkCacheInit();
  pmkCacheRomInit();
  dbg_test_print("%dms : Leave: %s\n",_DAT_44b00120 / 1000,0x2307af3c);
  return FW_SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void supplicantFuncInit(void)

{
  char "supplicantFuncInit" [19];
  
  dbg_test_print("%dms : Enter: %s\n",_DAT_44b00120 / 1000,"supplicantFuncInit");
  supplicantRestoreDefaults();
  dbg_test_print("%dms : Leave: %s\n",0x2307af58);
  return;
}



void ap_setpsk(cm_ConnectionInfo_t *connPtr,CHAR *ssid,CHAR *passphrase)

{
  apInfo_t *paVar1;
  size_t sVar2;
  
  paVar1 = cm_GetApInfo(connPtr);
  if (paVar1 != (apInfo_t *)0x0) {
    sVar2 = strlen(ssid);
    (paVar1->bssConfig).comData.SsIdLen = (IEEEtypes_Len_t)sVar2;
    memcpy(&(paVar1->bssConfig).comData,ssid,0x20);
    sVar2 = strlen(passphrase);
    (paVar1->bssConfig).RsnConfig.PSKPassPhraseLen = (UINT8)sVar2;
    memcpy((paVar1->bssConfig).RsnConfig.PSKPassPhrase,passphrase,0x40);
    return;
  }
  return;
}



void ap_resetConfiguration(cm_ConnectionInfo_t *connPtr)

{
  ushort uVar1;
  apInfo_t *paVar2;
  apSpecificData_t *paVar3;
  size_t sVar4;
  
  paVar2 = cm_GetApInfo(connPtr);
  paVar3 = cm_GetApData(connPtr);
  if ((paVar2 != (apInfo_t *)0x0) && (paVar3 != (apSpecificData_t *)0x0)) {
    sVar4 = strlen("Marvell Micro AP");
    (paVar2->bssConfig).comData.SsIdLen = (IEEEtypes_Len_t)sVar4;
    memcpy(&(paVar2->bssConfig).comData,"Marvell Micro AP",0x20);
    (paVar2->bssData).updatePassPhrase = 1;
    memset(&(paVar2->bssConfig).RsnConfig,0,0x7c);
    uVar1 = *(ushort *)&(paVar2->bssConfig).RsnConfig;
    (paVar2->bssConfig).RsnConfig.AuthKeyCount = 1;
    *(ushort *)&(paVar2->bssConfig).RsnConfig = uVar1 & 0xf7 | 0x108;
    *(ushort *)&(paVar2->bssConfig).RsnConfig.wpa2UcstCipher =
         *(ushort *)&(paVar2->bssConfig).RsnConfig.wpa2UcstCipher & 0xf7 | 0x108;
    (paVar2->bssConfig).RsnConfig.MaxPwsHskRetries = '\x03';
    (paVar2->bssConfig).RsnConfig.MaxGrpHskRetries = '\x03';
    (paVar2->bssConfig).RsnConfig.PwsHskTimeOut = 100;
    (paVar2->bssConfig).RsnConfig.GrpHskTimeOut = 100;
    (paVar2->bssConfig).RsnConfig.GrpReKeyTime = 0x15180;
  }
  return;
}



void InitializeAp(cm_ConnectionInfo_t *connPtr)

{
  ushort uVar1;
  apInfo_t *paVar2;
  apSpecificData_t *paVar3;
  size_t sVar4;
  
