pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  paVar2 = cm_GetApInfo(connPtr);
  paVar3 = cm_GetApData(connPtr);
  if ((paVar2 != (apInfo_t *)0x0) && (paVar3 != (apSpecificData_t *)0x0)) {
    sVar4 = strlen("Marvell Micro AP");
    (paVar2->bssConfig).comData.SsIdLen = (IEEEtypes_Len_t)sVar4;
    memcpy(&(paVar2->bssConfig).comData,"Marvell Micro AP",0x20);
    (paVar2->bssData).updatePassPhrase = 1;
    memset(&(paVar2->bssConfig).RsnConfig,0,0x7c);
    uVar1 = *(ushort *)&(paVar2->bssConfig).RsnConfig;
    (paVar2->bssConfig).RsnConfig.AuthKeyCount = 1;
    *(ushort *)&(paVar2->bssConfig).RsnConfig = uVar1 & 0xf7 | 0x108;
    *(ushort *)&(paVar2->bssConfig).RsnConfig.wpa2UcstCipher =
         *(ushort *)&(paVar2->bssConfig).RsnConfig.wpa2UcstCipher & 0xf7 | 0x108;
    (paVar2->bssConfig).RsnConfig.MaxPwsHskRetries = '\x03';
    (paVar2->bssConfig).RsnConfig.MaxGrpHskRetries = '\x03';
    (paVar2->bssConfig).RsnConfig.PwsHskTimeOut = 100;
    (paVar2->bssConfig).RsnConfig.GrpHskTimeOut = 100;
    (paVar2->bssConfig).RsnConfig.GrpReKeyTime = 0x15180;
  }
  return;
}



int bl60x_check_mac_status(int *is_ok)

{
  int iVar1;
  dump_data_t *pdVar2;
  
  iVar1 = 0;
  pdVar2 = dump_data_poll;
  while( true ) {
    if ((int)(uint)dump_data_ptr <= iVar1) {
      *is_ok = 0;
      return 0;
    }
    if (pdVar2->mac_debugRegHWSM2 != 0x8801e000) break;
    iVar1 = iVar1 + 1;
    pdVar2 = pdVar2 + 1;
  }
  *is_ok = 1;
  return 0;
}



void helper_record_dump(void)

{
  uint32_t *puVar1;
  dump_data_t *pdVar2;
  int iVar3;
  
  pdVar2 = dump_data_poll;
  puts("========= helper_record_dump\r\n");
  iVar3 = 0;
  while (iVar3 < (int)(uint)dump_data_ptr) {
    printf("[%d] time %ld, func %s\r\n",iVar3,pdVar2->time,pdVar2->func_name);
    printf("MAC: %08lx: rxControlCs %d,txControlCs %d,macControlCs %d\r\n",pdVar2->mac_debugRegHWSM2
           ,pdVar2->mac_debugRegHWSM2 & 0x3f,pdVar2->mac_debugRegHWSM2 >> 8 & 0x1ff,
           (uint)*(byte *)((int)&pdVar2->mac_debugRegHWSM2 + 3));
    iVar3 = iVar3 + 1;
    printf("MAC: Coex %04x,Backoff %04x,MPIF %04x,MPIF2 %04x\r\n",(uint)pdVar2->mac_debugPortCoex,
           (uint)pdVar2->mac_debugPortBackoff,(uint)pdVar2->mac_debugPortMacPhyIf,
           (uint)pdVar2->mac_debugPortMacPhyIf2);
    printf("PHY: MainFSM %04x,TDTX %04x,DSSSCCK1 %04x,DSSSCCKTx %04x\r\n",
           (uint)pdVar2->phy_debugPortMainFSM,(uint)pdVar2->phy_debugPortTDTX,
           (uint)pdVar2->phy_debugPortDSSSCCK1,(uint)pdVar2->phy_debugPortDSSSCCKTx);
    puVar1 = &pdVar2->rf_state;
    pdVar2 = pdVar2 + 1;
    printf("RFC: RC %s, RF %s\r\n",rf_state_str[*puVar1]);
  }
  printf("\r\n\r\n");
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void helper_record_rc_rf_states(uint *param_1,uint *param_2)

{
  uint uVar1;
  
  _DAT_40001220 = _DAT_40001220 & 0xfffffff | 0x20000000;
  uVar1 = _DAT_40001224 >> 0x19;
  *param_1 = _DAT_40001224 >> 0x1c & 7;
  *param_2 = uVar1 & 7;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void helper_record_all_states(char *func_name)

{
  uint32_t uVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  
  uVar1 = _DAT_44b00120;
  uVar4 = (uint)dump_data_ptr;
  dump_data_poll[uVar4].func_name = func_name;
  dump_data_poll[uVar4].time = uVar1;
  helper_record_rc_rf_states(uVar4 * 0x28 + 0x42012024,uVar4 * 0x28 + 0x42012028);
  dump_data_poll[uVar4].mac_debugRegHWSM1 = _DAT_44b00500;
  dump_data_poll[uVar4].mac_debugRegHWSM2 = _DAT_44b00504;
  _DAT_44b00510 = _DAT_44b00510 & 0xffff0000 | 0x31;
  *(undefined4 *)&dump_data_poll[uVar4].mac_debugPortCoex = _DAT_44b0050c;
  _DAT_44b00510 = _DAT_44b00510 & 0xffff0000 | 0x2f0b;
  *(undefined4 *)&dump_data_poll[uVar4].mac_debugPortMacPhyIf = _DAT_44b0050c;
  _DAT_44900068 = _DAT_44900068 & 0xffff0000 | 0x14;
  _DAT_400000d0 = 4;
  _DAT_400000d4 = 0x40000004;
  _DAT_400000d8 = 0x80000004;
  _DAT_400000dc = 0xc0000004;
  uVar2 = _DAT_400000e0 & 0xfffffffe;
  uVar3 = _DAT_400000e0 >> 1;
  _DAT_400000e0 = uVar2;
  dump_data_poll[uVar4].phy_debugPortTDTX = (uint16_t)uVar3;
  dump_data_poll[uVar4].phy_debugPortMainFSM = (ushort)(uVar2 >> 0x11);
  _DAT_44900074 = 0xb09;
  uVar2 = _DAT_400000e0 & 0xfffffffe;
  uVar3 = _DAT_400000e0 >> 1;
  _DAT_400000e0 = uVar2;
  dump_data_poll[uVar4].phy_debugPortDSSSCCK1 = (uint16_t)uVar3;
  dump_data_poll[uVar4].phy_debugPortDSSSCCKTx = (ushort)(uVar2 >> 0x11);
  dump_data_ptr = dump_data_ptr + 1 & 0xf;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

u32_conflict3 ipc_emb2app_rawstatus_get(void)

{
  return _DAT_44800004;
}



void ipc_host_init(ipc_host_env_tag *env,ipc_host_cb_tag *cb,
                  ipc_shared_env_tag_conflict3 *shared_env_ptr,void *pthis)

{
  printf("[IPC] [TX] Low level size %d, driver size %d, total size %d\r\n",internel_cal_size_tx_desc
         ,internel_cal_size_tx_hdr,internel_cal_size_tx_desc + internel_cal_size_tx_hdr);
  utils_list_init(&tx_list_bl);
  memset(env,0,0xe4);
  *(ipc_shared_env_tag_conflict3 **)&env->shared = shared_env_ptr;
  memcpy(env,cb,0x20);
  env->rx_bufnb = 2;
  env->rxdesc_nb = '\x02';
  env->ipc_e2amsg_bufnb = 8;
  env->ipc_e2amsg_bufsz = 0x3e0;
  env->pthis = pthis;
  env->rx_bufsz = 0x800;
  env->tx_host_id = env->tx_host_id0;
  env->txdesc = (txdesc_host *)shared_env_ptr->txdesc0;
  memset((txdesc_host *)shared_env_ptr->txdesc0,0,0xcc0);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int ipc_host_msg_push(ipc_host_env_tag *env,void *msg_buf,uint16_t len)

{
  undefined2 in_register_00002032;
  int iVar1;
  ipc_shared_env_tag_conflict30 *piVar2;
  int iVar3;
  
  iVar1 = *(int *)((int)msg_buf + 0xc);
  piVar2 = env->shared;
  iVar3 = 0;
  while (iVar3 < CONCAT22(in_register_00002032,len)) {
    *(undefined4 *)((int)(piVar2->msg_a2e_buf).msg + iVar3) = *(undefined4 *)(iVar1 + iVar3);
    iVar3 = iVar3 + 4;
  }
  env->msga2e_hostid = msg_buf;
  _DAT_44800000 = 2;
  return 0;
}



uint32_t ipc_host_get_rawstatus(ipc_host_env_tag *env)

{
  u32_conflict3 uVar1;
  
  uVar1 = ipc_emb2app_rawstatus_get();
  return uVar1;
}



txdesc_host * ipc_host_txdesc_get(ipc_host_env_tag *env)

{
  uint uVar1;
  uint uVar2;
  
  uVar1 = env->txdesc_used_idx;
  uVar2 = env->txdesc_free_idx;
  if (uVar2 < uVar1) {
    used_issue = used_issue + 1;
  }
  if (uVar1 + 4 != uVar2) {
    if (uVar2 - uVar1 < 5) {
      return env->txdesc + (uVar2 & 3);
    }
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  return (txdesc_host *)0x0;
}



