pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_host_txdesc_push(ipc_host_env_tag *env,void *host_id)

{
  uint uVar1;
  
  uVar1 = env->txdesc_free_idx & 3;
  env->txdesc[uVar1].ready = 0xffffffff;
  env->tx_host_id[uVar1] = host_id;
  env->txdesc_free_idx = env->txdesc_free_idx + 1;
  _DAT_44800000 = 0x100;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_host_irq(ipc_host_env_tag *env,uint32_t status)

{
  uint uVar1;
  uint8_t uVar2;
  int iVar3;
  undefined3 extraout_var;
  void *pvVar4;
  anon_subr_uint8_t_void_ptr_void_ptr_for_recv_msgack_ind *paVar5;
  uint uVar6;
  int *piVar7;
  uint uVar8;
  
  uVar1 = _DAT_4480001c | status;
  _DAT_44800008 = status;
  if ((uVar1 & 0x780) != 0) {
    piVar7 = nx_txdesc_cnt_msk;
    uVar8 = 7;
    do {
      if ((1 << (uVar8 & 0x1f) & uVar1) != 0) {
        while( true ) {
          uVar6 = env->txdesc_used_idx & *piVar7;
          if ((env->tx_host_id[uVar6] == (void *)0x0) ||
             (iVar3 = (*(env->cb).send_data_cfm)(env->pthis,env->tx_host_id[uVar6]), iVar3 != 0))
          break;
          env->tx_host_id[uVar6] = (void *)0x0;
          env->txdesc_used_idx = env->txdesc_used_idx + 1;
          bl_tx_notify();
        }
      }
      uVar8 = uVar8 + 1;
      piVar7 = (int *)((uint *)piVar7 + 1);
    } while (uVar8 != 0xb);
  }
  bl_tx_resend();
  if ((uVar1 & 4) != 0) {
    pvVar4 = env->msga2e_hostid;
    env->msga2e_cnt = env->msga2e_cnt + '\x01';
    paVar5 = (env->cb).recv_msgack_ind;
    env->msga2e_hostid = (void *)0x0;
    (*paVar5)(env->pthis,pvVar4);
  }
  if ((uVar1 & 1) != 0) {
    do {
      uVar2 = (*(env->cb).recv_dbg_ind)
                        (env->pthis,
                         (&(env->cb).recv_data_ind)[((uint)env->ipc_host_dbg_idx + 0x16) * 2]);
    } while (CONCAT31(extraout_var,uVar2) == 0);
  }
  if ((uVar1 & 0x10) != 0) {
    (*(env->cb).prim_tbtt_ind)(env->pthis);
  }
  if ((uVar1 & 0x20) != 0) {
                    // WARNING: Could not recover jumptable at 0x230223be. Too many branches
                    // WARNING: Treating indirect jump as call
    (*(env->cb).sec_tbtt_ind)(env->pthis);
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_host_enable_irq(ipc_host_env_tag *env,uint32_t value)

{
  _DAT_4480000c = value;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ipc_host_disable_irq_e2a(void)

{
  _DAT_44800010 = 0x7ff;
  return;
}



int bl_main_disconnect(void)

{
  bl_send_sm_disconnect_req(&wifi_hw,0x34);
  return 0;
}



int bl_main_powersaving(int mode)

{
  int iVar1;
  
  iVar1 = bl_send_mm_powersaving_req(&wifi_hw,mode);
  return iVar1;
}



int bl_main_denoise(int mode)

{
  int iVar1;
  
  iVar1 = bl_send_mm_denoise_req(&wifi_hw,mode);
  return iVar1;
}



int bl_main_monitor(void)

{
  undefined auStack56 [4];
  mm_monitor_cfm cfm;
  
  memset(auStack56,0,0x28);
  bl_send_monitor_enable(&wifi_hw,(mm_monitor_cfm *)auStack56);
  return 0;
}



int bl_main_phy_up(void)

{
  int iVar1;
  
  iVar1 = bl_send_start(&wifi_hw);
  if (iVar1 == 0) {
    wifi_hw.drv_flags = wifi_hw.drv_flags | 4;
  }
  else {
    iVar1 = -1;
  }
  return iVar1;
}



int bl_main_monitor_channel_set(int channel,int use_40MHZ)

{
  undefined auStack56 [4];
  mm_monitor_channel_cfm cfm;
  
  bl_send_monitor_channel_set(&wifi_hw,(mm_monitor_channel_cfm *)auStack56,channel,use_40MHZ);
  return 0;
}



int bl_main_if_remove(uint8_t vif_index)

{
  undefined3 in_register_00002029;
  
  printf("[WF] MM_REMOVE_IF_REQ Sending with vif_index %u...\r\n",
         CONCAT31(in_register_00002029,vif_index));
  bl_send_remove_if(&wifi_hw,vif_index);
  printf("[WF] MM_REMOVE_IF_REQ Done\r\n");
  return 0;
}



int bl_main_raw_send(uint8_t *pkt,int len)

{
  int iVar1;
  
  iVar1 = bl_send_scanu_raw_send(&wifi_hw,pkt,len);
  return iVar1;
}



int bl_main_rate_config(uint8_t sta_idx,uint16_t fixed_rate_cfg)

{
  int iVar1;
  
  iVar1 = bl_send_me_rate_config_req(&wifi_hw,sta_idx,fixed_rate_cfg);
  return iVar1;
}



int bl_main_set_country_code(char *country_code)

{
  bl_msg_update_channel_cfg(country_code);
  bl_send_me_chan_config_req(&wifi_hw);
  return 0;
}



int bl_main_get_channel_nums(void)

{
  return channel_num_default;
}



int bl_main_if_add(int is_sta,netif *netif,uint8_t *vif_index)

{
  uint uVar1;
  int iVar2;
  undefined *puVar3;
  mm_add_if_cfm amStack36 [2];
  mm_add_if_cfm add_if_cfm;
  
  if (is_sta == 0) {
    puVar3 = &UNK_2307b2d0;
  }
  else {
    puVar3 = &UNK_2307b2cc;
  }
  printf("[WF] MM_ADD_IF_REQ Sending: %s\r\n",puVar3);
  iVar2 = bl_send_add_if(&wifi_hw,netif->hwaddr,(is_sta == 0) + NL80211_IFTYPE_STATION,false,
                         amStack36);
  printf("[WF] MM_ADD_IF_REQ Done\r\n");
  if (iVar2 == 0) {
    if (amStack36[0].status == '\0') {
      uVar1 = (uint)amStack36[0].inst_nbr;
      if (is_sta != 0) {
        wifi_hw.vif_index_sta = (uint)amStack36[0].inst_nbr;
        uVar1 = wifi_hw.vif_index_ap;
      }
      wifi_hw.vif_index_ap = uVar1;
      *vif_index = amStack36[0].inst_nbr;
      printf("[WF] vif_index from LAMC is %d\r\n");
      wifi_hw.vif_table[amStack36[0].inst_nbr].dev = netif;
      wifi_hw.vif_table[amStack36[0].inst_nbr].up = true;
    }
    else {
      printf("%s: Status Error(%d)\n",&UNK_2307b314);
      iVar2 = -5;
    }
  }
  return iVar2;
}



int bl_main_apm_start(char *ssid,char *password,int channel,uint8_t vif_index,uint8_t hidden_ssid)

{
  int iVar1;
  undefined3 in_register_00002035;
  apm_start_cfm local_24;
  apm_start_cfm start_ap_cfm;
  
  memset(&local_24,0,4);
  printf("[WF] APM_START_REQ Sending with vif_index %u\r\n",CONCAT31(in_register_00002035,vif_index)
        );
  iVar1 = bl_send_apm_start_req(&wifi_hw,&local_24,ssid,password,channel,vif_index,hidden_ssid);
  printf("[WF] APM_START_REQ Done\r\n");
  printf("[WF] status is %02X\r\n",(uint)local_24.status);
  printf("[WF] vif_idx is %02X\r\n",(uint)local_24.vif_idx);
  printf("[WF] ch_idx is %02X\r\n",(uint)local_24.ch_idx);
  printf("[WF] bcmc_idx is %02X\r\n",(uint)local_24.bcmc_idx);
  wifi_hw.ap_bcmc_idx = (uint)local_24.bcmc_idx;
  return iVar1;
}



int bl_main_apm_stop(uint8_t vif_index)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  printf("[WF] APM_STOP_REQ Sending with vif_index %u\r\n",CONCAT31(in_register_00002029,vif_index))
  ;
  iVar1 = bl_send_apm_stop_req(&wifi_hw,vif_index);
  printf("[WF] APM_STOP_REQ Done\r\n");
  return iVar1;
}



