pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_main_apm_sta_cnt_get(uint8_t *sta_cnt)

{
  *sta_cnt = '\f';
  return 0;
}



int bl_main_apm_sta_info_get(wifi_apm_sta_info *apm_sta_info,uint8_t idx)

{
  undefined3 in_register_0000202d;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_0000202d,idx);
  if (wifi_hw.sta_table[iVar1].is_used != '\0') {
    apm_sta_info->sta_idx = wifi_hw.sta_table[iVar1].sta_idx;
    apm_sta_info->is_used = wifi_hw.sta_table[iVar1].is_used;
    apm_sta_info->rssi = (int)wifi_hw.sta_table[iVar1].rssi;
    apm_sta_info->tsflo = wifi_hw.sta_table[iVar1].tsflo;
    apm_sta_info->tsfhi = wifi_hw.sta_table[iVar1].tsfhi;
    apm_sta_info->data_rate = wifi_hw.sta_table[iVar1].data_rate;
    memcpy(apm_sta_info->sta_mac,wifi_hw.sta_table + iVar1,6);
    return 0;
  }
  return 0;
}



int bl_main_apm_sta_delete(uint8_t sta_idx)

{
  byte vif_idx;
  undefined3 in_register_00002029;
  int iVar1;
  int iVar2;
  apm_sta_del_cfm aStack36;
  apm_sta_del_cfm sta_del_cfm;
  
  iVar1 = CONCAT31(in_register_00002029,sta_idx);
  memset(&aStack36,0,3);
  vif_idx = wifi_hw.sta_table[iVar1].vif_idx;
  printf("[WF] APM_STA_DEL_REQ: sta_idx = %u, vif_idx = %u\r\n",iVar1,(uint)vif_idx);
  bl_send_apm_sta_del_req(&wifi_hw,&aStack36,sta_idx,vif_idx);
  iVar2 = -1;
  if (aStack36.status == '\0') {
    memset(wifi_hw.sta_table + iVar1,0,0x1c);
    iVar2 = 0;
  }
  return iVar2;
}



int bl_main_apm_remove_all_sta(void)

{
  uint8_t sta_idx;
  u8 *puVar1;
  
  puVar1 = &wifi_hw.sta_table[0].is_used;
  sta_idx = '\0';
  do {
    if (*puVar1 == '\x01') {
      bl_main_apm_sta_delete(sta_idx);
    }
    sta_idx = sta_idx + '\x01';
    puVar1 = puVar1 + 0x1c;
  } while (sta_idx != '\f');
  return 0;
}



int bl_main_conf_max_sta(uint8_t max_sta_supported)

{
  int iVar1;
  
  iVar1 = bl_send_apm_conf_max_sta_req(&wifi_hw,max_sta_supported);
  return iVar1;
}



int bl_main_cfg_task_req
              (uint32_t ops,uint32_t task,uint32_t element,uint32_t type,void *arg1,void *arg2)

{
  int iVar1;
  
  iVar1 = bl_send_cfg_task_req(&wifi_hw,ops,task,element,type,arg1,arg2);
  return iVar1;
}



int bl_main_scan(void)

{
  bl_send_scanu_req(&wifi_hw);
  return 0;
}



int bl_cfg80211_connect(bl_hw *bl_hw,cfg80211_connect_params *sme)

{
  int iVar1;
  sm_connect_cfm asStack20 [4];
  sm_connect_cfm sm_connect_cfm;
  
  iVar1 = bl_send_sm_connect_req(bl_hw,sme,asStack20);
  if (iVar1 == 0) {
    iVar1 = -5;
    if ((byte)asStack20[0] < 10) {
      iVar1 = (int)(char)CSWTCH_6[(byte)asStack20[0]];
    }
  }
  return iVar1;
}



// WARNING: Could not reconcile some variable overlaps

int bl_main_connect(uint8_t *ssid,int ssid_len,uint8_t *psk,int psk_len,uint8_t *pmk,int pmk_len,
                   uint8_t *mac,uint8_t band,uint16_t freq)

{
  short in_stack_00000000;
  nl80211_band anStack272 [4];
  cfg80211_connect_params sme;
  
  memset(anStack272,0,0xf0);
  sme.crypto.cipher_group = 0;
  sme.ssid_len._0_1_ = __NL80211_AUTHTYPE_NUM;
  sme.pmk._0_1_ = (u8)psk_len;
  sme.pmk._1_1_ = (u8)pmk_len;
  if (mac != (uint8_t *)0x0) {
    sme.channel_hint = (ieee80211_channel *)mac;
  }
  if (in_stack_00000000 != 0) {
    sme.channel._4_4_ = 0;
    anStack272[0] = band;
  }
  sme.bssid_hint = ssid;
  sme.ssid = (u8 *)ssid_len;
  sme.crypto.wep_tx_key = (int)psk;
  sme.key = pmk;
  bl_cfg80211_connect(&wifi_hw,(cfg80211_connect_params *)anStack272);
  return 0;
}



void bl_main_event_handle(void)

{
  bl_irq_bottomhalf(&wifi_hw);
  bl_tx_try_flush();
  return;
}



void bl_main_lowlevel_init(void)

{
  bl_irqs_init(&wifi_hw);
  return;
}



int bl_main_rtthread_start(bl_hw **bl_hw)

{
  int iVar1;
  char *__format;
  
  bl_main_lowlevel_init();
  *bl_hw = &wifi_hw;
  wifi_hw.vifs.next = &wifi_hw.vifs;
  wifi_hw.vifs.prev = &wifi_hw.vifs;
  wifi_hw.mod_params = &bl_mod_params;
  iVar1 = bl_platform_on(&wifi_hw);
  if (iVar1 == 0) {
    ipc_host_enable_irq(wifi_hw.ipc_env,0x7ff);
    bl_wifi_enable_irq();
    iVar1 = bl_send_reset(&wifi_hw);
    if (iVar1 == 0) {
      vTaskDelay(5);
      iVar1 = bl_send_version_req(&wifi_hw,&wifi_hw.version_cfm);
      if (iVar1 != 0) {
        return 0;
      }
      printf("[version] lmac %u.%u.%u.%u\r\n",wifi_hw.version_cfm.version_lmac >> 0x18,
             wifi_hw.version_cfm.version_lmac >> 0x10 & 0xff,
             wifi_hw.version_cfm.version_lmac >> 8 & 0xff,wifi_hw.version_cfm.version_lmac & 0xff);
      printf("[version] version_machw_1 %08X\r\n",wifi_hw.version_cfm.version_machw_1);
      printf("[version] version_machw_2 %08X\r\n",wifi_hw.version_cfm.version_machw_2);
      printf("[version] version_phy_1 %08X\r\n",wifi_hw.version_cfm.version_phy_1);
      printf("[version] version_phy_2 %08X\r\n",wifi_hw.version_cfm.version_phy_2);
      printf("[version] features %08X\r\n",wifi_hw.version_cfm.features);
      iVar1 = bl_handle_dynparams(&wifi_hw);
      if (iVar1 == 0) {
        bl_send_me_config_req(&wifi_hw);
        bl_send_me_chan_config_req(&wifi_hw);
        wifi_hw.status = RWNX_INTERFACE_STATUS_UP;
        return 0;
      }
      __format = "bl_handle_dynparams Error\r\n";
    }
    else {
      __format = "bl_send_reset Error\r\n";
    }
  }
  else {
    __format = "bl_platform_on Error\r\n";
  }
  printf(__format);
  return 0;
}



int bl_handle_dynparams(bl_hw *bl_hw)

{
  ushort uVar1;
  short sVar2;
  char "bl_handle_dynparams" [20];
  int iVar3;
  short sVar4;
  uint uVar5;
  bl_mod_params *pbVar6;
  
  uVar5 = bl_hw->flags;
  bl_hw->flags = uVar5 | 0x40000;
  pbVar6 = bl_hw->mod_params;
  if (pbVar6->tdls != false) {
    bl_hw->flags = uVar5 | 0x58000;
  }
  if (pbVar6->ap_uapsd_on != false) {
    bl_hw->flags = bl_hw->flags | 0x4000;
  }
  if (5 < (uint)pbVar6->phy_cfg) {
    pbVar6->phy_cfg = 2;
  }
  if (2 < (uint)bl_hw->mod_params->mcs_map) {
    bl_hw->mod_params->mcs_map = 0;
  }
  uVar1 = (bl_hw->ht_cap).cap;
  pbVar6 = bl_hw->mod_params;
  iVar3 = pbVar6->nss;
  (bl_hw->ht_cap).cap = uVar1 | 0x100;
  if (pbVar6->ldpc_on != false) {
    (bl_hw->ht_cap).cap = uVar1 | 0x101;
  }
  sVar2 = (short)iVar3;
  if (pbVar6->use_2040 == false) {
    (bl_hw->ht_cap).mcs.rx_highest = sVar2 * 0x41;
    (bl_hw->ht_cap).mcs.rx_mask[0] = -1;
  }
  else {
    uVar1 = (bl_hw->ht_cap).cap;
    (bl_hw->ht_cap).mcs.rx_mask[4] = '\x01';
    (bl_hw->ht_cap).cap = uVar1 | 2;
    (bl_hw->ht_cap).mcs.rx_highest = sVar2 * 0x87;
  }
  if (1 < iVar3) {
    (bl_hw->ht_cap).cap = (bl_hw->ht_cap).cap | 0x80;
  }
  if (pbVar6->sgi != false) {
    uVar1 = (bl_hw->ht_cap).cap;
    (bl_hw->ht_cap).cap = uVar1 | 0x20;
    if (pbVar6->use_2040 == false) {
      sVar4 = 0x48;
    }
    else {
      (bl_hw->ht_cap).cap = uVar1 | 0x60;
      sVar4 = 0x96;
    }
    (bl_hw->ht_cap).mcs.rx_highest = sVar2 * sVar4;
  }
  (bl_hw->ht_cap).cap = (bl_hw->ht_cap).cap | 0xc;
  if (pbVar6->ht_on == false) {
    (bl_hw->ht_cap).ht_supported = false;
  }
  if (pbVar6->custregd != false) {
    printf("\n\n%s: CAUTION: USING PERMISSIVE CUSTOM REGULATORY RULES\n\n","bl_handle_dynparams");
    return 0;
  }
  return 0;
}



int bl_send_msg(bl_hw *bl_hw,void *msg_params,int reqcfm,lmac_msg_id_t reqid,void *cfm)

{
  ushort uVar1;
  lmac_msg_id_t lVar2;
  bool bVar3;
  char "bl_send_msg" [12];
  bl_cmd *__s;
  int iVar4;
  undefined2 in_register_00002036;
  lmac_msg *pv;
  
  iVar4 = CONCAT22(in_register_00002036,reqid);
  pv = (lmac_msg *)((int)msg_params + -8);
  if ((((((bl_hw->drv_flags >> 2 & 1) == 0) && ((reqid & 0xfffd) != 1)) && (iVar4 != 5)) &&
      ((iVar4 != 0x23 && ((reqid & 0xfffd) != 0x1401)))) && (iVar4 != 0x32)) {
    printf("%s: bypassing (RWNX_DEV_RESTARTING set) 0x%02x\n","bl_send_msg",iVar4);
  }
  else {
    if (bl_hw->ipc_env != (ipc_host_env_tag *)0x0) {
      uVar1 = *(ushort *)((int)msg_params + -8);
      bVar3 = true;
      if (((uVar1 != 0x41) && (uVar1 != 0x50)) && ((uVar1 + 0xebf4 & 0xfffb) != 0)) {
        bVar3 = (uVar1 & 0xfffb) == 0x2408;
      }
      __s = (bl_cmd *)pvPortMalloc(0x40);
      if (__s == (bl_cmd *)0x0) {
        vPortFree(pv);
        printf("%s: failed to allocate mem for cmd, size is %d\r\n",0x2307b550,0x40);
        return -0xc;
      }
      memset(__s,0,0x40);
      __s->result = 4;
      lVar2 = *(lmac_msg_id_t *)((int)msg_params + -8);
      __s->reqid = reqid;
      __s->a2e_msg = pv;
      __s->id = lVar2;
      __s->e2a_msg = cfm;
      if (bVar3) {
        __s->flags = 1;
      }
      if (reqcfm != 0) {
        __s->flags = __s->flags | 2;
      }
      iVar4 = (*(bl_hw->cmd_mgr).queue)(&bl_hw->cmd_mgr,__s);
      if (!bVar3) {
        vPortFree(__s);
        return iVar4;
      }
      return __s->result;
    }
    printf("%s: bypassing (restart must have failed)\r\n",0x2307b550);
  }
  vPortFree(pv);
  return -0x10;
}



void * bl_msg_zalloc(lmac_msg_id_t id,lmac_task_id_t dest_id,uint16_t param_len)

{
  lmac_msg_id_t *__s;
  undefined2 in_register_00002032;
  size_t xWantedSize;
  
  xWantedSize = CONCAT22(in_register_00002032,param_len) + 8;
  __s = (lmac_msg_id_t *)pvPortMalloc(xWantedSize);
  if (__s == (lmac_msg_id_t *)0x0) {
    printf("%s: msg allocation failed\n",0x2307b540);
  }
  else {
    memset(__s,0,xWantedSize);
    *__s = id;
    __s[1] = dest_id;
    __s[2] = 100;
    __s[3] = param_len;
    __s = __s + 4;
  }
  return __s;
}



void bl_msg_update_channel_cfg(char *code)

{
  int iVar1;
  int iVar2;
  char *__format;
  ieee80211_dot_d *piVar3;
  
  piVar3 = country_list;
  iVar1 = 0;
  do {
    iVar2 = strcmp(piVar3->code,code);
    if (iVar2 == 0) {
      __format = "[WF] country code %s used, num of channel %d\r\n";
      channel_num_default = country_list[iVar1].channel_num;
      channels_default = country_list[iVar1].channels;
      goto LAB_23022de2;
    }
    iVar1 = iVar1 + 1;
    piVar3 = piVar3 + 1;
  } while (iVar1 != 4);
  channel_num_default = 0xe;
  __format = "[WF] %s NOT found, using JP instead, num of channel %d\r\n";
  channels_default = bl_channels_24_JP;
LAB_23022de2:
  printf(__format,code,channel_num_default);
  return;
}



int bl_msg_get_channel_nums(void)

{
  return channel_num_default;
}



int bl_send_reset(bl_hw *bl_hw)

{
  void *msg_params;
  int iVar1;
  
  msg_params = bl_msg_zalloc(0,0,0);
  if (msg_params != (void *)0x0) {
    iVar1 = bl_send_msg(bl_hw,msg_params,1,1,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



