pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_send_monitor_enable(bl_hw *bl_hw,mm_monitor_cfm *cfm)

{
  undefined4 *msg_params;
  int iVar1;
  
  msg_params = (undefined4 *)bl_msg_zalloc(0x5c,0,4);
  if (msg_params != (undefined4 *)0x0) {
    *msg_params = 1;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x5d,cfm);
    return iVar1;
  }
  return -0xc;
}



int bl_send_monitor_channel_set(bl_hw *bl_hw,mm_monitor_channel_cfm *cfm,int channel,int use_40Mhz)

{
  uint uVar1;
  uint *msg_params;
  int iVar2;
  
  msg_params = (uint *)bl_msg_zalloc(0x5e,0,0xc);
  if (msg_params == (uint *)0x0) {
    return -0xc;
  }
  if (channel - 1U < 0xe) {
    if (channel == 0xe) {
      uVar1 = 0x9b4;
    }
    else {
      uVar1 = channel * 5 + 0x967U & 0xffff;
    }
  }
  else {
    uVar1 = 0xffff;
  }
  *msg_params = uVar1;
  if (use_40Mhz == 0) {
    msg_params[1] = 0;
  }
  else {
    msg_params[1] = 1;
    if (use_40Mhz != 1) {
      msg_params[2] = 1;
      goto LAB_23022f04;
    }
  }
  msg_params[2] = 0;
LAB_23022f04:
  iVar2 = bl_send_msg(bl_hw,msg_params,1,0x5f,cfm);
  return iVar2;
}



int bl_send_version_req(bl_hw *bl_hw,mm_version_cfm *cfm)

{
  void *msg_params;
  int iVar1;
  
  msg_params = bl_msg_zalloc(4,0,0);
  if (msg_params != (void *)0x0) {
    iVar1 = bl_send_msg(bl_hw,msg_params,1,5,cfm);
    return iVar1;
  }
  return -0xc;
}



int bl_send_me_config_req(bl_hw *bl_hw)

{
  u8 *puVar1;
  u16 *msg_params;
  int iVar2;
  u8 *puVar3;
  ieee80211_mcs_info *piVar4;
  
  msg_params = (u16 *)bl_msg_zalloc(0x1400,5,0x34);
  if (msg_params != (u16 *)0x0) {
    printf("[ME] HT supp %d, VHT supp %d\r\n",1,0);
    msg_params[0x17] = 1;
    *msg_params = (bl_hw->ht_cap).cap;
    *(u8 *)(msg_params + 1) = (bl_hw->ht_cap).ampdu_density << 2 | (bl_hw->ht_cap).ampdu_factor;
    piVar4 = &(bl_hw->ht_cap).mcs;
    puVar3 = (u8 *)((int)msg_params + 3);
    while (piVar4 != (ieee80211_mcs_info *)&bl_hw->vif_started) {
      puVar1 = piVar4->rx_mask;
      piVar4 = (ieee80211_mcs_info *)(piVar4->rx_mask + 1);
      *puVar3 = *puVar1;
      puVar3 = puVar3 + 1;
    }
    msg_params[10] = 0;
    *(undefined4 *)(msg_params + 0xc) = 0;
    *(undefined *)(msg_params + 0xe) = 0;
    *(_Bool *)(msg_params + 0x18) = bl_hw->mod_params->ps_on;
    msg_params[0x16] = (u16)bl_hw->mod_params->tx_lft;
    iVar2 = bl_send_msg(bl_hw,msg_params,1,0x1401,(void *)0x0);
    return iVar2;
  }
  return -0xc;
}



int bl_send_me_chan_config_req(bl_hw *bl_hw)

{
  byte bVar1;
  void *msg_params;
  int iVar2;
  uint uVar3;
  u16 *puVar4;
  
  msg_params = bl_msg_zalloc(0x1402,5,0xfe);
  if (msg_params == (void *)0x0) {
    return -0xc;
  }
  *(undefined *)((int)msg_params + 0xfc) = 0;
  iVar2 = 0;
  while (iVar2 < channel_num_default) {
    bVar1 = *(byte *)((int)msg_params + 0xfc);
    puVar4 = (u16 *)((uint)bVar1 * 6 + (int)msg_params);
    *(undefined *)((int)puVar4 + 3) = 0;
    if ((channels_default[iVar2].flags & 1) != 0) {
      *(undefined *)((int)puVar4 + 3) = 2;
    }
    uVar3 = channels_default[iVar2].flags;
    *(undefined *)(puVar4 + 1) = 0;
    *(byte *)((int)puVar4 + 3) = (uVar3 & 10) != 0 | *(byte *)((int)puVar4 + 3);
    *puVar4 = channels_default[iVar2].center_freq;
    *(char *)(puVar4 + 2) = (char)channels_default[iVar2].max_power;
    uVar3 = (uint)bVar1 + 1 & 0xff;
    *(undefined *)((int)msg_params + 0xfc) = (char)uVar3;
    if (uVar3 == 0xe) break;
    iVar2 = iVar2 + 1;
  }
  *(undefined *)((int)msg_params + 0xfd) = 0;
  iVar2 = bl_send_msg(bl_hw,msg_params,1,0x1403,(void *)0x0);
  return iVar2;
}



int bl_send_me_rate_config_req(bl_hw *bl_hw,uchar sta_idx,uint16_t fixed_rate_cfg)

{
  uchar *msg_params;
  int iVar1;
  
  msg_params = (uchar *)bl_msg_zalloc(0x1410,5,4);
  if (msg_params != (uchar *)0x0) {
    *msg_params = sta_idx;
    *(uint16_t *)(msg_params + 2) = fixed_rate_cfg;
    iVar1 = bl_send_msg(bl_hw,msg_params,0,0,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_start(bl_hw *bl_hw)

{
  void *__dest;
  int iVar1;
  
  __dest = bl_msg_zalloc(2,0,0x48);
  if (__dest != (void *)0x0) {
    (bl_hw->phy_config).parameters = 1;
    memcpy(__dest,&bl_hw->phy_config,0x40);
    *(int *)((int)__dest + 0x40) = bl_hw->mod_params->uapsd_timeout;
    *(undefined2 *)((int)__dest + 0x44) = (short)bl_hw->mod_params->lp_clk_ppm;
    iVar1 = bl_send_msg(bl_hw,__dest,1,3,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_add_if(bl_hw *bl_hw,uchar *mac,nl80211_iftype iftype,_Bool p2p,mm_add_if_cfm *cfm)

{
  undefined *msg_params;
  int iVar1;
  undefined uVar2;
  
  msg_params = (undefined *)bl_msg_zalloc(6,0,8);
  if (msg_params == (undefined *)0x0) {
    return -0xc;
  }
  memcpy(msg_params + 1,mac,6);
  switch((uint)iftype - 1 & 0xff) {
  case 0:
    uVar2 = 1;
    break;
  case 3:
    return -1;
  case 6:
    uVar2 = 3;
    break;
  case 7:
    msg_params[7] = 1;
  default:
    *msg_params = 0;
    goto LAB_2302320e;
  case 8:
    msg_params[7] = 1;
  case 2:
    uVar2 = 2;
  }
  *msg_params = uVar2;
LAB_2302320e:
  iVar1 = bl_send_msg(bl_hw,msg_params,1,7,cfm);
  return iVar1;
}



int bl_send_remove_if(bl_hw *bl_hw,uchar inst_nbr)

{
  uchar *msg_params;
  int iVar1;
  
  msg_params = (uchar *)bl_msg_zalloc(8,0,1);
  if (msg_params != (uchar *)0x0) {
    *msg_params = inst_nbr;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,9,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_scanu_req(bl_hw *bl_hw)

{
  u16 uVar1;
  u16 *msg_params;
  int iVar2;
  ieee80211_channel *piVar3;
  int iVar4;
  u16 *puVar5;
  
  msg_params = (u16 *)bl_msg_zalloc(0x1000,4,0x154);
  if (msg_params != (u16 *)0x0) {
    iVar4 = bl_hw->vif_index_sta;
    msg_params[0xa6] = 0;
    *(char *)(msg_params + 0xa7) = (char)iVar4;
    iVar4 = channel_num_default;
    *(undefined *)((int)msg_params + 0x14f) = (char)channel_num_default;
    *(undefined4 *)(msg_params + 0xa0) = 0xffffffff;
    msg_params[0xa2] = 0xffff;
    msg_params[0xa8] = 0x100;
    *(undefined4 *)(msg_params + 0xa4) = 0;
    iVar2 = 0;
    puVar5 = msg_params;
    while (iVar2 < (int)(iVar4 & 0xffU)) {
      piVar3 = channels_default + iVar2;
      *(nl80211_band *)(puVar5 + 1) = piVar3->band;
      uVar1 = piVar3->center_freq;
      *(undefined *)((int)puVar5 + 3) = 1;
      *puVar5 = uVar1;
      *(char *)(puVar5 + 2) = (char)piVar3->max_reg_power;
      iVar2 = iVar2 + 1;
      puVar5 = puVar5 + 3;
    }
    iVar4 = bl_send_msg(bl_hw,msg_params,0,0,(void *)0x0);
    return iVar4;
  }
  return -0xc;
}



int bl_send_scanu_raw_send(bl_hw *bl_hw,uint8_t *pkt,int len)

{
  uint8_t **msg_params;
  int iVar1;
  undefined auStack36 [4];
  scanu_raw_send_cfm cfm;
  
  msg_params = (uint8_t **)bl_msg_zalloc(0x1005,4,8);
  if (msg_params == (uint8_t **)0x0) {
    iVar1 = -0xc;
  }
  else {
    *msg_params = pkt;
    *(int *)(msg_params + 1) = len;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1006,auStack36);
  }
  return iVar1;
}



int bl_send_sm_connect_req(bl_hw *bl_hw,cfg80211_connect_params *sme,sm_connect_cfm *cfm)

{
  _Bool _Var1;
  char "bl_send_sm_connect_req" [23];
  undefined *msg_params;
  int iVar2;
  nl80211_auth_type nVar3;
  u32_conflict15 uVar4;
  uint uVar5;
  uint uVar6;
  __be16 _Var7;
  u8 *puVar8;
  uint __n;
  
  msg_params = (undefined *)bl_msg_zalloc(0x1800,6,0x1c4);
  if (msg_params == (undefined *)0x0) {
    return -0xc;
  }
  __n = 0;
  if ((sme->crypto).n_ciphers_pairwise != 0) {
    uVar4 = (sme->crypto).ciphers_pairwise[0];
    __n = 4;
    if ((1 < uVar4 - 0xfac01) && (__n = 0, uVar4 == 0xfac05)) {
      __n = 4;
    }
  }
  if ((sme->crypto).control_port != false) {
    __n = __n | 1;
  }
  if ((sme->crypto).control_port_no_encrypt != false) {
    __n = __n | 2;
  }
  if (((sme->crypto).cipher_group & 0xfffffffb) != 0xfac01) {
    __n = __n | 8;
  }
  if (sme->mfp == NL80211_MFP_REQUIRED) {
    __n = __n | 0x10;
  }
  _Var7 = (sme->crypto).control_port_ethertype;
  if (_Var7 == 0) {
    _Var7 = 0x888e;
  }
  *(__be16 *)(msg_params + 0x34) = _Var7;
  puVar8 = sme->bssid;
  if (puVar8 == (u8 *)0x0) {
LAB_23023458:
    memcpy(msg_params + 0x22,&mac_addr_bcst,6);
  }
  else {
    if (*puVar8 == -1) {
      uVar5 = 0;
      if (((puVar8[1] == -1) && (puVar8[2] == -1)) &&
         ((puVar8[3] == -1 && ((puVar8[4] == -1 && (puVar8[5] == -1)))))) goto LAB_23023458;
    }
    else {
      if ((((*puVar8 == '\0') && (puVar8[1] == '\0')) && (puVar8[2] == '\0')) &&
         ((puVar8[3] == '\0' && (uVar5 = (uint)puVar8[4], puVar8[4] == 0)))) {
        if (puVar8[5] == '\0') goto LAB_23023458;
      }
      else {
        uVar5 = 0;
      }
    }
    do {
      uVar6 = uVar5 + 1;
      msg_params[uVar5 + 0x22] = sme->bssid[uVar5];
      uVar5 = uVar6;
    } while (uVar6 != 6);
  }
  msg_params[0x3d] = (char)bl_hw->vif_index_sta;
  if ((sme->channel).center_freq == 0) {
    *(undefined2 *)(msg_params + 0x28) = 0xffff;
  }
  else {
    msg_params[0x2a] = (sme->channel).band;
    *(u16 *)(msg_params + 0x28) = (sme->channel).center_freq;
    *(bool *)(msg_params + 0x2b) = ((sme->channel).flags & 10) != 0;
  }
  uVar5 = 0;
  while (uVar5 < sme->ssid_len) {
    msg_params[uVar5 + 1] = sme->ssid[uVar5];
    uVar5 = uVar5 + 1;
  }
  *msg_params = (char)sme->ssid_len;
  *(uint *)(msg_params + 0x30) = __n;
  __n = sme->ie_len;
  if (0x100 < __n) {
    printf("%s:%d\r\n","bl_send_sm_connect_req",0x30a);
    return -0x16;
  }
  if (__n != 0) {
    memcpy(msg_params + 0x40,sme->ie,__n);
  }
  *(short *)(msg_params + 0x36) = (short)sme->ie_len;
  _Var1 = bl_mod_params.listen_bcmc;
  *(short *)(msg_params + 0x38) = (short)bl_mod_params.listen_itv;
  msg_params[0x3a] = _Var1 ^ 1;
  nVar3 = sme->auth_type;
  if (nVar3 == __NL80211_AUTHTYPE_NUM) {
    nVar3 = NL80211_AUTHTYPE_OPEN_SYSTEM;
  }
  msg_params[0x3b] = nVar3;
  msg_params[0x3c] = (char)bl_mod_params.uapsd_queues;
  msg_params[0x140] = 1;
  if (sme->key_len != 0) {
    memcpy(msg_params + 0x141,sme->key,(uint)sme->key_len);
  }
  if (sme->pmk_len != 0) {
    memcpy(msg_params + 0x181,sme->pmk,(uint)sme->pmk_len);
  }
  iVar2 = bl_send_msg(bl_hw,msg_params,1,0x1801,cfm);
  return iVar2;
}



int bl_send_sm_disconnect_req(bl_hw *bl_hw,u16 reason)

{
  u16 *msg_params;
  int iVar1;
  
