pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  msg_params = (u16 *)bl_msg_zalloc(0x1803,6,4);
  if (msg_params != (u16 *)0x0) {
    *msg_params = reason;
    *(char *)(msg_params + 1) = (char)bl_hw->vif_index_sta;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1804,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_mm_powersaving_req(bl_hw *bl_hw,int mode)

{
  undefined *msg_params;
  int iVar1;
  
  msg_params = (undefined *)bl_msg_zalloc(0x31,0,1);
  if (msg_params != (undefined *)0x0) {
    *msg_params = (char)mode;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x32,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_mm_denoise_req(bl_hw *bl_hw,int mode)

{
  undefined *msg_params;
  int iVar1;
  
  msg_params = (undefined *)bl_msg_zalloc(0x30,0,1);
  if (msg_params != (undefined *)0x0) {
    *msg_params = (char)mode;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x32,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_apm_start_req
              (bl_hw *bl_hw,apm_start_cfm *cfm,char *ssid,char *password,int channel,uchar vif_index
              ,uchar hidden_ssid)

{
  void *msg_params;
  size_t __n;
  int iVar1;
  uint uVar2;
  undefined auStack44 [4];
  uint8_t rate [12];
  
  memcpy(auStack44,&DAT_2307b534,0xc);
  msg_params = bl_msg_zalloc(0x1c00,7,0xa8);
  if (msg_params == (void *)0x0) {
    iVar1 = -0xc;
  }
  else {
    *(undefined *)((int)msg_params + 0x10) = 0;
    if (channel - 1U < 0xe) {
      if (channel == 0xe) {
        uVar2 = 0x9b4;
      }
      else {
        uVar2 = channel * 5 + 0x967U & 0xffff;
      }
    }
    else {
      uVar2 = 0xffff;
    }
    *(undefined2 *)((int)msg_params + 0xe) = (short)uVar2;
    *(uint *)((int)msg_params + 0x14) = uVar2;
    *(undefined2 *)((int)msg_params + 0x28) = 100;
    *(undefined4 *)((int)msg_params + 0x2c) = 8;
    *(undefined2 *)((int)msg_params + 0x30) = 0x8e88;
    *(undefined *)((int)msg_params + 0x32) = 6;
    *(uchar *)((int)msg_params + 0x1d) = hidden_ssid;
    *(uchar *)((int)msg_params + 0x33) = vif_index;
    *(undefined *)((int)msg_params + 0x11) = 0;
    *(undefined *)((int)msg_params + 0x12) = 0;
    *(undefined4 *)((int)msg_params + 0x18) = 0;
    *(undefined *)((int)msg_params + 0x1c) = 0;
    *(undefined4 *)((int)msg_params + 0x20) = 0;
    *(undefined4 *)((int)msg_params + 0x24) = 0;
    __n = strlen(password);
    *(undefined *)((int)msg_params + 0x34) = 1;
    *(bool *)((int)msg_params + 0x66) = __n != 0;
    __n = strlen(ssid);
    memcpy((void *)((int)msg_params + 0x45),ssid,__n);
    __n = strlen(password);
    memcpy((void *)((int)msg_params + 0x67),password,__n);
    __n = strlen(ssid);
    *(undefined *)((int)msg_params + 0x44) = (char)__n;
    *(undefined *)((int)msg_params + 0x35) = 0xc;
    memcpy((void *)((int)msg_params + 0x36),auStack44,0xc);
    *(undefined2 *)((int)msg_params + 0x42) = 0x101;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1c01,cfm);
  }
  return iVar1;
}



int bl_send_apm_stop_req(bl_hw *bl_hw,uchar vif_idx)

{
  uchar *msg_params;
  int iVar1;
  
  msg_params = (uchar *)bl_msg_zalloc(0x1c02,7,1);
  if (msg_params != (uchar *)0x0) {
    *msg_params = vif_idx;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1c03,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_apm_sta_del_req(bl_hw *bl_hw,apm_sta_del_cfm *cfm,uchar sta_idx,uchar vif_idx)

{
  uchar *msg_params;
  int iVar1;
  
  msg_params = (uchar *)bl_msg_zalloc(0x1c0b,7,2);
  if (msg_params != (uchar *)0x0) {
    msg_params[1] = sta_idx;
    *msg_params = vif_idx;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1c0c,cfm);
    return iVar1;
  }
  return -0xc;
}



int bl_send_apm_conf_max_sta_req(bl_hw *bl_hw,uchar max_sta_supported)

{
  uchar *msg_params;
  int iVar1;
  
  msg_params = (uchar *)bl_msg_zalloc(0x1c0d,7,1);
  if (msg_params != (uchar *)0x0) {
    *msg_params = max_sta_supported;
    iVar1 = bl_send_msg(bl_hw,msg_params,1,0x1c0e,(void *)0x0);
    return iVar1;
  }
  return -0xc;
}



int bl_send_cfg_task_req
              (bl_hw *bl_hw,uint32_t ops,uint32_t task,uint32_t element,uint32_t type,void *arg1,
              void *arg2)

{
  uint32_t *msg_params;
  int iVar1;
  TickType_t TVar2;
  uint32_t uVar3;
  
  msg_params = (uint32_t *)bl_msg_zalloc(0x3000,0xc,0x24);
  if (msg_params == (uint32_t *)0x0) {
    return -0xc;
  }
  *msg_params = ops;
  if (ops < 3) {
    if (ops == 0) {
      msg_params[1] = task;
      msg_params[2] = element;
      msg_params[3] = type;
      uVar3 = utils_tlv_bl_pack_auto(msg_params + 5,8,(uint16_t)type,arg1);
      msg_params[4] = uVar3;
    }
  }
  else {
    if (ops != 3) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] ASSERT: %s:%d\r\n",TVar2,&UNK_2307c064,&UNK_2307c058,0x40f,
                &UNK_2307c058,0x40f);
      do {
                    // WARNING: Do nothing block with infinite loop
      } while( true );
    }
    msg_params[1] = task;
    msg_params[2] = element;
    msg_params[4] = 0;
  }
  iVar1 = bl_send_msg(bl_hw,msg_params,1,0x3001,(void *)0x0);
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl_platform_on(bl_hw *bl_hw)

{
  int iVar1;
  
  ipc_shenv = &ipc_shared_env;
  iVar1 = bl_ipc_init(bl_hw,(ipc_shared_env_tag_conflict21 *)&ipc_shared_env);
  if (iVar1 == 0) {
    _DAT_44800008 = 0xffffffff;
  }
  return iVar1;
}



int bl_rx_chan_pre_switch_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  return 0;
}



int bl_rx_rssi_status_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  if (cb_rssi != (wifi_event_rssi_cb_t *)0x0) {
    (*cb_rssi)(cb_rssi_env,*(int8_t *)((int)msg->param + 2));
    return 0;
  }
  return 0;
}



int bl_rx_apm_sta_del_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  printf("[WF] APM_STA_DEL_IND\r\n");
  printf("[WF]    sta_idx %u\r\n",(uint)*(byte *)msg->param);
  if (*(byte *)msg->param < 0xc) {
    bl_hw->sta_table[*(byte *)msg->param].is_used = '\0';
  }
  else {
    printf("[WF]    --------- Potential illegal sta_idx\r\n");
  }
  aos_post_event(2,0x16,(uint)*(byte *)msg->param);
  return 0;
}



int bl_rx_apm_sta_add_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  byte bVar1;
  int *piVar2;
  
  printf("[WF] APM_STA_ADD_IND\r\n");
  printf("[WF]    flags %08X\r\n",msg->param[0]);
  printf("[WF]    MAC %02X:%02X:%02X:%02X:%02X:%02X\r\n",(uint)*(byte *)(msg->param + 1),
         (uint)*(byte *)((int)msg->param + 5),(uint)*(byte *)((int)msg->param + 6),
         (uint)*(byte *)((int)msg->param + 7),(uint)*(byte *)(msg->param + 2),
         (uint)*(byte *)((int)msg->param + 9));
  printf("[WF]    vif_idx %u\r\n",(uint)*(byte *)((int)msg->param + 10));
  printf("[WF]    sta_idx %u\r\n",(uint)*(byte *)((int)msg->param + 0xb));
  bVar1 = *(byte *)((int)msg->param + 0xb);
  if (bVar1 < 0xc) {
    memcpy(bl_hw->sta_table + (uint)bVar1,msg->param + 1,6);
    piVar2 = &bl_hw->is_up + (uint)bVar1 * 7;
    *(undefined *)((int)piVar2 + 0xc99) = *(undefined *)((int)msg->param + 0xb);
    *(undefined *)((int)piVar2 + 0xc9a) = *(undefined *)((int)msg->param + 10);
    *(undefined *)(piVar2 + 0x326) = 1;
    *(undefined *)(piVar2 + 0x327) = *(undefined *)(msg->param + 3);
    piVar2[0x328] = msg->param[4];
    piVar2[0x329] = msg->param[5];
    *(undefined *)(piVar2 + 0x32a) = *(undefined *)(msg->param + 6);
  }
  else {
    printf("[WF]    ------ Potential illegal sta_idx\r\n");
  }
  aos_post_event(2,0x15,(uint)*(byte *)((int)msg->param + 0xb));
  return 0;
}



