pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

void notify_event_scan_done(int join_scan)

{
  wifi_event wStack24;
  uint8_t buffer [8];
  
  memset(&wStack24,0,4);
  memset(buffer,0,4);
  buffer._0_4_ = 0xec;
  wStack24 = (wifi_event)((uint)(join_scan != 0) + 1);
  if (cb_event != (wifi_event_cb_t *)0x0) {
    (*cb_event)(cb_event_env,&wStack24);
  }
  return;
}



int bl_rx_scanu_join_cfm(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  notify_event_scan_done(1);
  return 0;
}



int bl_rx_scanu_start_cfm(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  notify_event_scan_done(0);
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int bl_rx_chan_switch_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  wifi_event wStack24;
  uint8_t buffer [8];
  
  buffer._0_4_ = (uint)*(byte *)msg->param;
  memset(&wStack24,0,4);
  memset(buffer,0,4);
  wStack24 = (wifi_event)0x0;
  if (cb_event != (wifi_event_cb_t *)0x0) {
    (*cb_event)(cb_event_env,&wStack24);
  }
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int bl_rx_sm_connect_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  netif *netif;
  sm_reason_code *psVar1;
  uint uVar2;
  int iVar3;
  u32_l local_40;
  wifi_event_sm_connect_ind ind_new;
  
  psVar1 = reason_list;
  iVar3 = 0;
  do {
    if (psVar1->reason_code == *(uint16_t *)msg->param) goto LAB_23023c3e;
    iVar3 = iVar3 + 1;
    psVar1 = psVar1 + 1;
  } while (iVar3 != 0x10);
  iVar3 = 0;
LAB_23023c3e:
  printf("[RX] Connection Status\r\n");
  printf("[RX]   status_code %u\r\n",(uint)*(ushort *)msg->param);
  printf("[RX]   connect result: %s\r\n",reason_list[iVar3].action);
  printf("[RX]   MAC %02X:%02X:%02X:%02X:%02X:%02X\r\n",(uint)*(byte *)((int)msg->param + 2),
         (uint)*(byte *)((int)msg->param + 3),(uint)*(byte *)(msg->param + 1),
         (uint)*(byte *)((int)msg->param + 5),(uint)*(byte *)((int)msg->param + 6),
         (uint)*(byte *)((int)msg->param + 7));
  printf("[RX]   vif_idx %u\r\n",(uint)*(byte *)((int)msg->param + 9));
  printf("[RX]   ap_idx %u\r\n",(uint)*(byte *)((int)msg->param + 10));
  printf("[RX]   ch_idx %u\r\n",(uint)*(byte *)((int)msg->param + 0xb));
  printf("[RX]   qos %u\r\n",(uint)*(byte *)(msg->param + 3));
  printf("[RX]   acm %u\r\n",(uint)*(byte *)((int)msg->param + 0xd));
  printf("[RX]   assoc_req_ie_len %u\r\n",(uint)*(ushort *)((int)msg->param + 0xe));
  printf("[RX]   assoc_rsp_ie_len %u\r\n",(uint)*(ushort *)(msg->param + 4));
  printf("[RX]   aid %u\r\n",(uint)*(ushort *)(msg->param + 0xcd));
  printf("[RX]   band %u\r\n",(uint)*(byte *)((int)msg->param + 0x336));
  printf("[RX]   center_freq %u\r\n",(uint)*(ushort *)(msg->param + 0xce));
  printf("[RX]   width %u\r\n",(uint)*(byte *)((int)msg->param + 0x33a));
  printf("[RX]   center_freq1 %u\r\n",msg->param[0xcf]);
  printf("[RX]   center_freq2 %u\r\n",msg->param[0xd0]);
  if (*(short *)msg->param == 0) {
    bl_hw->sta_idx = (uint)*(byte *)((int)msg->param + 10);
    bl_hw->is_up = 1;
  }
  else {
    bl_hw->is_up = 0;
  }
  memset(&local_40,0,0x20);
  local_40 = msg->param[0];
  ind_new._0_4_ = msg->param[1];
  ind_new.bssid[2] = *(uint8_t *)((int)msg->param + 9);
  ind_new.bssid[3] = *(uint8_t *)((int)msg->param + 10);
  ind_new.bssid[4] = *(uint8_t *)((int)msg->param + 0xb);
  ind_new._8_4_ = (uint)*(byte *)(msg->param + 3);
  ind_new.qos._0_2_ = *(uint16_t *)(msg->param + 0xcd);
  ind_new.qos._2_1_ = *(uint8_t *)((int)msg->param + 0x336);
  ind_new.aid = *(uint16_t *)(msg->param + 0xce);
  ind_new.band = *(uint8_t *)((int)msg->param + 0x33a);
  ind_new._20_4_ = msg->param[0xcf];
  ind_new.center_freq1 = msg->param[0xd0];
  if (cb_sm_connect_ind != (wifi_event_sm_connect_ind_cb_t *)0x0) {
    (*cb_sm_connect_ind)(cb_sm_connect_ind_env,(wifi_event_sm_connect_ind *)&local_40);
  }
  if (*(short *)msg->param == 0) {
    uVar2 = (uint)*(byte *)((int)msg->param + 9);
    if (bl_hw->vif_table + uVar2 != (bl_vif *)0x0) {
      netif = (netif *)(&bl_hw->is_up + uVar2 * 0x31)[0xda];
      if (netif != (netif *)0x0) {
        netifapi_netif_common(netif,netif_set_link_up,(netifapi_errt_fn)0x0);
        netifapi_netif_common
                  ((netif *)(&bl_hw->is_up + uVar2 * 0x31)[0xda],netif_set_default,
                   (netifapi_errt_fn)0x0);
        return 0;
      }
    }
    printf("[RX]  -------- CRITICAL when check netif. ptr is %p:%p\r\n");
  }
  return 0;
}



// WARNING: Variable defined which should be unmapped: ind_new
// WARNING: Could not reconcile some variable overlaps

int bl_rx_sm_disconnect_ind(bl_hw *bl_hw,bl_cmd *cmd,ipc_e2a_msg *msg)

{
  netif *netif;
  uint uVar1;
  ip4_addr_t iStack28;
  ip4_addr_t addr_any;
  wifi_event_sm_disconnect_ind ind_new;
  
  iStack28 = (ip4_addr_t)ipaddr_addr("0.0.0.0");
  printf("[RX] sm_disconnect_ind\r\n       reason_code %u\r\n",(uint)*(ushort *)msg->param);
  printf("[RX]    vif_idx %u\r\n",(uint)*(byte *)((int)msg->param + 2));
  printf("[RX]     ft_over_ds %u\r\n",(uint)*(byte *)((int)msg->param + 3));
  if (cb_sm_disconnect_ind != (wifi_event_sm_disconnect_ind_cb_t *)0x0) {
    memset(&addr_any,0,8);
    addr_any.addr._0_2_ = *(uint16_t *)msg->param;
    addr_any.addr._2_1_ = *(uint8_t *)((int)msg->param + 2);
    (*cb_sm_disconnect_ind)(cb_sm_disconnect_ind_env,(wifi_event_sm_disconnect_ind *)&addr_any);
  }
  uVar1 = (uint)*(byte *)((int)msg->param + 2);
  if (bl_hw->vif_table + uVar1 != (bl_vif *)0x0) {
    netif = (netif *)(&bl_hw->is_up + uVar1 * 0x31)[0xda];
    if (netif != (netif *)0x0) {
      netifapi_netif_common(netif,netif_set_link_down,(netifapi_errt_fn)0x0);
      netifapi_netif_set_addr
                ((netif *)(&bl_hw->is_up + uVar1 * 0x31)[0xda],&iStack28,&iStack28,&iStack28);
    }
  }
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

undefined4 bl_rx_scanu_result_ind(int param_1,longlong param_2)

{
  uchar uVar1;
  void *__src;
  undefined3 extraout_var;
  uint __n;
  SecurityMode_t *security_mode;
  _Bool wpa2_prefered;
  byte bVar2;
  ushort uVar3;
  int iVar4;
  byte *pbVar5;
  byte *pbVar6;
  _Bool _Stack121;
  uint8_t auStack120 [32];
  undefined2 uStack88;
  undefined2 uStack86;
  undefined2 uStack84;
  undefined auStack82 [33];
  int8_t iStack49;
  int8_t iStack48;
  int8_t iStack47;
  byte bStack46;
  uint8_t uStack45;
  undefined4 uStack44;
  undefined4 uStack40;
  uint uStack36;
  SecurityMode_t aSStack32 [4];
  
  _Stack121 = false;
  memset(auStack120,0,0x20);
  security_mode = (SecurityMode_t *)0x80;
  uVar3 = *(ushort *)(param_1 + 0x24) & 0xfc;
  if (uVar3 != 0x80) {
    if (uVar3 != 0x50) {
      printf("Bug Scan IND?\r\n");
      return 0;
    }
    printf("Probe Response\r\n");
    if (cb_probe_resp_ind == (wifi_event_probe_resp_ind_cb_t *)0x0) {
      return 0;
    }
    (*cb_probe_resp_ind)((void *)0x0,param_2);
    return 0;
  }
  if (cb_beacon_ind == (wifi_event_beacon_ind_cb_t *)0x0) {
    return 0;
  }
  memset(&uStack88,0,0x38);
  uVar3 = *(ushort *)(param_1 + 8);
  pbVar6 = (byte *)(param_1 + 0x48);
  iVar4 = 0;
  pbVar5 = pbVar6;
  while (iVar4 < (int)(uint)uVar3) {
    security_mode = (SecurityMode_t *)(uint)*pbVar5;
    __n = (uint)pbVar5[1];
    if (*pbVar5 == 0) {
      if (pbVar5[1] < 0x21) {
        uStack36 = __n;
        memcpy(auStack82,pbVar5 + 2,__n);
        security_mode = aSStack32;
        auStack82[pbVar5[1]] = 0;
      }
      break;
    }
    iVar4 = iVar4 + __n + 2;
    pbVar5 = pbVar5 + __n + 2;
  }
  iVar4 = 0;
  pbVar5 = pbVar6;
  while (iVar4 < (int)(uint)*(ushort *)(param_1 + 8)) {
    security_mode = (SecurityMode_t *)(uint)pbVar5[1];
    if (*pbVar5 == 3) {
      if (pbVar5[1] < 0x21) {
        bStack46 = pbVar5[2];
      }
      break;
    }
    security_mode = security_mode + 1;
    iVar4 = &security_mode->field_0x0 + iVar4;
    pbVar5 = pbVar5 + (int)security_mode;
  }
  if ((*(ushort *)(param_1 + 0x46) & 0x10) == 0) {
    uStack45 = '\0';
    goto LAB_230240a6;
  }
  __n = (uint)uVar3 - 0x24 & 0xffff;
  __src = (void *)mac_ie_find(pbVar6,__n,0x30);
  iVar4 = 0;
  if (__src != (void *)0x0) {
    wpa2_prefered = (_Bool)(uStack40._1_1_ | 0x20);
    uStack40 = uStack40 | 0x2000;
    memcpy(auStack120,__src,(uint)*(byte *)((int)__src + 1) + 2 & 0xff);
    uVar1 = process_rsn_ie(auStack120,(Cipher_t *)((int)&uStack44 + 3),(Cipher_t *)&uStack40,
                           &_Stack121,security_mode,wpa2_prefered);
    iVar4 = CONCAT31(extraout_var,uVar1);
  }
  __src = (void *)mac_vsie_find(pbVar6,__n,&DAT_2307c188,4);
  if ((__src != (void *)0x0) && (uStack40 = uStack40 | 0x800, iVar4 == 0)) {
    memcpy(auStack120,__src,(uint)*(byte *)((int)__src + 1) + 2 & 0xff);
    process_wpa_ie(auStack120,(Cipher_t *)((int)&uStack44 + 1),(Cipher_t *)((int)&uStack44 + 2));
  }
  if ((uStack40 & 0x2800) == 0x2800) {
    bVar2 = (byte)uStack40._0_1_ | (byte)uStack44._2_1_;
    __n = (uint)bVar2 & 8;
    if ((bVar2 & 4) == 0) {
      if ((bVar2 & 8) != 0) {
        if (((uStack44 & 0x8000800) == 0) && ((uStack44 & 0x4000400) != 0)) goto LAB_23024090;
LAB_23024118:
        bVar2 = 2;
        goto next;
      }
    }
    else {
LAB_2302408c:
      bVar2 = 3;
      if (__n != 0) {
LAB_23024090:
        bVar2 = 4;
      }
next:
      uStack44 = uStack44 & 0xffffff00 | (uint)bVar2;
      if ((uStack40 & 0x2800) != 0x2800) goto LAB_23024172;
    }
    uStack45 = '\x04';
  }
  else {
    if ((uStack40 & 0x800) == 0) {
      if ((uStack40 & 0x2000) == 0) {
        uStack44 = CONCAT31(uStack44._1_3_,1);
      }
      else {
        __n = uStack40 & 8;
        if ((uStack40 & 4) != 0) goto LAB_2302408c;
        if ((uStack40 & 8) != 0) {
          uStack44._1_1_ = uStack44._3_1_;
          goto LAB_23024146;
        }
      }
    }
    else {
      __n = (uint)(byte)uStack44._2_1_ & 8;
      if ((uStack44 & 0x40000) != 0) goto LAB_2302408c;
      if ((uStack44 & 0x80000) != 0) {
LAB_23024146:
        if ((((byte)uStack44._1_1_ & 8) != 0) || (((byte)uStack44._1_1_ & 4) == 0))
        goto LAB_23024118;
        goto LAB_23024090;
      }
    }
LAB_23024172:
    if ((uStack40 & 0x2000) == 0) {
      if ((uStack40 & 0x800) == 0) {
        uStack45 = '\x01';
      }
      else {
        uStack45 = '\x02';
      }
    }
    else {
      uStack45 = '\x03';
    }
  }
LAB_230240a6:
  iStack49 = *(int8_t *)(param_1 + 0x20);
  iStack48 = *(int8_t *)(param_1 + 0x21);
  iStack47 = *(int8_t *)(param_1 + 0x22);
  uStack88 = *(undefined2 *)(param_1 + 0x34);
  uStack86 = *(undefined2 *)(param_1 + 0x36);
  uStack84 = *(undefined2 *)(param_1 + 0x38);
  (*cb_beacon_ind)(cb_beacon_ind_env,(wifi_event_beacon_ind_conflict *)&uStack88);
  return 0;
}



undefined4 bl_rx_mesh_path_update_ind(void)

{
  return 0;
}



