pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
undefined4 bl_rx_mesh_proxy_update_ind(void)

{
  return 0;
}



undefined4 bl_rx_remain_on_channel_exp_ind(void)

{
  return 0;
}



undefined4 bl_rx_ps_change_ind(void)

{
  return 0;
}



undefined4 bl_rx_traffic_req_ind(void)

{
  return 0;
}



undefined4 bl_rx_csa_counter_ind(void)

{
  return 0;
}



undefined4 bl_rx_csa_finish_ind(void)

{
  return 0;
}



undefined4 bl_rx_csa_traffic_ind(void)

{
  return 0;
}



undefined4 bl_rx_channel_survey_ind(void)

{
  return 0;
}



undefined4 bl_rx_dbg_error_ind(void)

{
  return 0;
}



undefined4 bl_rx_tdls_chan_switch_cfm(void)

{
  return 0;
}



undefined4 bl_rx_tdls_chan_switch_ind(void)

{
  return 0;
}



undefined4 bl_rx_tdls_chan_switch_base_ind(void)

{
  return 0;
}



undefined4 bl_rx_tdls_peer_ps_ind(void)

{
  return 0;
}



undefined4 bl_rx_me_tkip_mic_failure_ind(void)

{
  return 0;
}



undefined4 bl_rx_me_tx_credits_update_ind(void)

{
  return 0;
}



undefined4 bl_rx_mesh_path_create_cfm(void)

{
  return 0;
}



undefined4 bl_rx_mesh_peer_update_ind(void)

{
  return 0;
}



int bl_rx_sm_connect_ind_cb_register(void *env,wifi_event_sm_connect_ind_cb_t *cb)

{
  cb_sm_connect_ind = cb;
  cb_sm_connect_ind_env = env;
  return 0;
}



int bl_rx_sm_disconnect_ind_cb_register(void *env,wifi_event_sm_disconnect_ind_cb_t *cb)

{
  cb_sm_disconnect_ind = cb;
  cb_sm_disconnect_ind_env = env;
  return 0;
}



int bl_rx_beacon_ind_cb_register(void *env,wifi_event_beacon_ind_cb_t *cb)

{
  cb_beacon_ind = cb;
  cb_beacon_ind_env = env;
  return 0;
}



int bl_rx_probe_resp_ind_cb_register(void *env,wifi_event_probe_resp_ind_cb_t *cb)

{
  cb_probe_resp_ind = cb;
  return 0;
}



int bl_rx_pkt_cb_register(void *env,wifi_event_pkt_cb_t *cb)

{
  cb_pkt = cb;
  cb_pkt_env = env;
  return 0;
}



int bl_rx_pkt_cb_unregister(void *env)

{
  cb_pkt = (wifi_event_pkt_cb_t *)0x0;
  cb_pkt_env = (void *)0x0;
  return 0;
}



int bl_rx_rssi_cb_register(void *env,wifi_event_rssi_cb_t *cb)

{
  cb_rssi = cb;
  cb_rssi_env = env;
  return 0;
}



int bl_rx_event_register(void *env,wifi_event_cb_t *cb)

{
  cb_event = cb;
  cb_event_env = env;
  return 0;
}



void bl_rx_e2a_handler(void *arg)

{
                    // WARNING: Could not recover jumptable at 0x230242f0. Too many branches
                    // WARNING: Treating indirect jump as call
  (*wifi_hw.cmd_mgr.msgind)
            ((bl_cmd_mgr *)0x4201d5b0,(ipc_e2a_msg *)arg,
             (msg_cb_fct *)msg_hdlrs[*(ushort *)arg >> 10][(uint)*(ushort *)arg & 0x3ff]);
  return;
}



void bl_rx_pkt_cb(uint8_t *pkt,int len)

{
  if (cb_pkt != (wifi_event_pkt_cb_t *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2302430a. Too many branches
                    // WARNING: Treating indirect jump as call
    (*cb_pkt)(cb_pkt_env,pkt,len);
    return;
  }
  return;
}



void bl_tx_push(bl_hw *bl_hw,bl_txhdr_conflict1 *txhdr)

{
  hostdesc *phVar1;
  hostdesc *phVar2;
  txdesc_host *ptVar3;
  hostdesc_conflict44 *phVar4;
  uint32_t *host_id;
  
  host_id = txhdr->p;
  ptVar3 = ipc_host_txdesc_get(bl_hw->ipc_env);
  if (&ptVar3->host == (hostdesc *)0x0) {
    printf("%d:ASSERT_ERR(host)\n",0x37);
  }
  phVar1 = &ptVar3->host;
  phVar4 = &txhdr->host;
  do {
    phVar2 = (hostdesc *)((int)&phVar1->pbuf_addr + 1);
    *(undefined *)&phVar1->pbuf_addr = *(undefined *)&phVar4->pbuf_addr;
    phVar1 = phVar2;
    phVar4 = (hostdesc_conflict44 *)((int)&phVar4->pbuf_addr + 1);
  } while ((hostdesc *)ptVar3->pad_txdesc != phVar2);
  ipc_host_txdesc_push(bl_hw->ipc_env,host_id);
  (bl_hw->stats).cfm_balance = (bl_hw->stats).cfm_balance + 1;
  return;
}



void bl_tx_resend(void)

{
  bl_hw *bl_hw;
  txdesc_host *ptVar1;
  uint uVar2;
  
  vTaskEnterCritical();
  while ((txhdr_pos_r != txhdr_pos_w &&
         (ptVar1 = ipc_host_txdesc_get(bl_hw_static->ipc_env), bl_hw = bl_hw_static,
         ptVar1 != (txdesc_host *)0x0))) {
    uVar2 = txhdr_pos_r & 7;
    txhdr_hodler[uVar2]->status = 0;
    bl_tx_push(bl_hw,(bl_txhdr_conflict1 *)txhdr_hodler[uVar2]);
    txhdr_pos_r = txhdr_pos_r + 1;
  }
  vTaskExitCritical();
  return;
}



void bl_tx_try_flush(void)

{
  txdesc_host *ptVar1;
  bl_txhdr_conflict1 *txhdr;
  
  vTaskEnterCritical();
  while ((ptVar1 = ipc_host_txdesc_get(bl_hw_static->ipc_env), ptVar1 != (txdesc_host *)0x0 &&
         (txhdr = (bl_txhdr_conflict1 *)utils_list_pop_front(&tx_list_bl),
         txhdr != (bl_txhdr_conflict1 *)0x0))) {
    bl_tx_push(bl_hw_static,txhdr);
  }
  vTaskExitCritical();
  return;
}



int bl_txdatacfm(void *pthis,void *host_id)

{
  bl_txhdr_conflict *pbVar1;
  int iVar2;
  
  pbVar1 = (bl_txhdr_conflict *)((-*(int *)((int)host_id + 4) & 3U) + *(int *)((int)host_id + 4));
  iVar2 = pbVar1->status;
  if (iVar2 == 0) {
    return -1;
  }
  if (iVar2 << 0xf < 0) {
    if (((txhdr_pos_w + 1 ^ txhdr_pos_r) & 7) != 0) {
      puts(" push back\r\n");
      txhdr_hodler[txhdr_pos_w & 7] = pbVar1;
      txhdr_pos_w = txhdr_pos_w + 1;
      return 0;
    }
    puts(" NOT push back when no mem\r\n");
  }
  pbuf_free((pbuf *)host_id);
  return 0;
}



void bl_tx_notify(void)

{
  if (taskHandle_output != (TaskHandle_t)0x0) {
    xTaskGenericNotify(taskHandle_output,0,eIncrement,(uint32_t *)0x0);
    return;
  }
  return;
}



err_t bl_output(bl_hw *bl_hw,netif *netif,pbuf *p,int is_sta)

{
  u16_t uVar1;
  undefined2 uVar2;
  utils_list_hdr *list_hdr;
  err_t eVar3;
  u8_t uVar4;
  undefined3 extraout_var;
  undefined uVar5;
  pbuf *ppVar6;
  uint8_t *mac;
  int iVar7;
  utils_list_hdr *puVar8;
  
  if ((bl_hw == (bl_hw *)0x0) || ((netif->flags & 4) == 0)) {
    printf("[TX] wifi is down, return now\r\n");
    eVar3 = -0xb;
  }
  else {
    if (taskHandle_output == (TaskHandle_t)0x0) {
      taskHandle_output = xTaskGetCurrentTaskHandle();
    }
    mac = (uint8_t *)p->payload;
    uVar1 = p->tot_len;
    bl_hw_static = bl_hw;
    uVar4 = pbuf_header(p,0x80);
    if (CONCAT31(extraout_var,uVar4) == 0) {
      list_hdr = (utils_list_hdr *)((-(int)p->payload & 3U) + (int)p->payload);
      memset(list_hdr,0,0x5c);
      *(pbuf **)&list_hdr[2].next = p;
      memcpy(list_hdr + 7,mac,6);
      memcpy((void *)((int)&list_hdr[8].next + 2),mac + 6,6);
      *(pbuf **)&list_hdr[3].next = p;
      uVar2 = *(undefined2 *)(mac + 0xc);
      *(undefined *)((int)&list_hdr[0xd].next + 2) = 0;
      *(undefined2 *)&list_hdr[10].next = uVar2;
      if (is_sta == 0) {
        uVar5 = *(undefined *)&bl_hw->vif_index_ap;
      }
      else {
        uVar5 = *(undefined *)&bl_hw->vif_index_sta;
      }
      *(undefined *)((int)&list_hdr[0xd].next + 3) = uVar5;
      *(undefined2 *)((int)&list_hdr[0xe].next + 2) = 0;
      *(u16_t *)&list_hdr[5].next = uVar1 - 0xe;
      if (is_sta == 0) {
        iVar7 = bl_utils_idx_lookup(bl_hw,mac);
        *(char *)&list_hdr[0xe].next = (char)iVar7;
      }
      else {
        *(char *)&list_hdr[0xe].next = (char)bl_hw->sta_idx;
      }
      puVar8 = list_hdr + 0xf;
      iVar7 = 0;
      ppVar6 = p;
      do {
        if (iVar7 == 0) {
          list_hdr[0xf].next = (utils_list_hdr *)((int)ppVar6->payload + 0x8e);
          list_hdr[0x13].next = (utils_list_hdr *)((uint)ppVar6->len - 0x8e);
        }
        else {
          if (iVar7 == 4) {
            printf("[TX] [PBUF] Please fix for bigger chained pbuf, total_len %d\r\n",
                   (uint)p->tot_len);
          }
          puVar8->next = (utils_list_hdr *)ppVar6->payload;
          puVar8[4].next = (utils_list_hdr *)(uint)ppVar6->len;
        }
        ppVar6 = ppVar6->next;
        iVar7 = iVar7 + 1;
        puVar8 = puVar8 + 1;
      } while (ppVar6 != (pbuf *)0x0);
      if (2 < iVar7) {
        printf("[TX] [LOOP] Chain Used %d\r\n",iVar7);
      }
      list_hdr[4].next = (utils_list_hdr *)0x11111111;
      list_hdr[6].next = list_hdr + 1;
      list_hdr[1].next = (utils_list_hdr *)0x0;
      pbuf_ref(p);
      vTaskEnterCritical();
      utils_list_push_back(&tx_list_bl,list_hdr);
      vTaskExitCritical();
      bl_irq_handler();
      eVar3 = '\0';
    }
    else {
      printf("[TX] Reserve room failed for header\r\n");
      eVar3 = -0xc;
    }
  }
  return eVar3;
}



u8 bl_radarind(void *pthis,void *hostid)

{
  return '\0';
}



u8 bl_msgackind(bl_hw *pthis,void *hostid)

{
  (*(pthis->cmd_mgr).llind)(&pthis->cmd_mgr,(bl_cmd *)hostid);
  return '\0';
}



void bl_prim_tbtt_ind(void *pthis)

{
  return;
}



