pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void my_pbuf_free_custom(pbuf *p)

{
  bl60x_firmwre_mpdu_free(p[1].payload);
  return;
}



undefined4 bl_dbgind(void)

{
  return 0;
}



void bl_sec_tbtt_ind(void)

{
  return;
}



void my_pbuf_free_custom_fake(void)

{
  return;
}



// WARNING: Control flow encountered bad instruction data

int tcpip_stack_input(void *swdesc,uchar status,void *hwhdr,uint msdu_offset,wifi_pkt *pkt)

{
  if ((status & 1) == 0) {
    return -1;
  }
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



int bl_utils_idx_lookup(bl_hw *bl_hw,uint8_t *mac)

{
  bl_sta *__s1;
  int iVar1;
  int iVar2;
  
  __s1 = bl_hw->sta_table;
  iVar1 = 0;
  while ((__s1->is_used == '\0' || (iVar2 = memcmp(__s1,mac,6), iVar2 != 0))) {
    iVar1 = iVar1 + 1;
    __s1 = __s1 + 1;
    if (iVar1 == 0xc) {
      return wifi_hw.ap_bcmc_idx;
    }
  }
  return iVar1;
}



int bl_ipc_init(bl_hw *bl_hw,ipc_shared_env_tag_conflict21 *ipc_shared_mem)

{
  code *local_30;
  ipc_host_cb_tag cb;
  
  memset(&local_30,0,0x20);
  cb.recv_data_ind = bl_radarind;
  cb.recv_msg_ind = bl_msgackind;
  cb.recv_msgack_ind = bl_dbgind;
  local_30 = bl_txdatacfm;
  cb.recv_dbg_ind = bl_prim_tbtt_ind;
  cb.prim_tbtt_ind = bl_sec_tbtt_ind;
  cb.send_data_cfm = (anon_subr_int_void_ptr_void_ptr_for_send_data_cfm *)0x0;
  cb.recv_radar_ind = (anon_subr_uint8_t_void_ptr_void_ptr_for_recv_radar_ind *)0x0;
  ipc_env = (ipc_host_env_tag *)pvPortMalloc(0xe4);
  bl_hw->ipc_env = ipc_env;
  ipc_host_init(ipc_env,(ipc_host_cb_tag *)&local_30,(ipc_shared_env_tag_conflict3 *)ipc_shared_mem,
                bl_hw);
  bl_cmd_mgr_init(&bl_hw->cmd_mgr);
  return 0;
}



void bl_utils_dump(void)

{
  int iVar1;
  uint uVar2;
  int iVar3;
  
  puts("---------- bl_utils_dump -----------\r\n");
  printf("txdesc_free_idx: %lu(%lu)\r\n",ipc_env->txdesc_free_idx,ipc_env->txdesc_free_idx & 3);
  printf("txdesc_used_idx: %lu(%lu)\r\n",ipc_env->txdesc_used_idx,ipc_env->txdesc_used_idx & 3);
  iVar1 = 0;
  printf("tx_host_id0 cnt: %d(used %ld)\r\n",4,ipc_env->txdesc_free_idx - ipc_env->txdesc_used_idx);
  puts("  list:   pbuf    status ptr  status\r\n");
  do {
    uVar2 = ipc_env->txdesc_used_idx + iVar1;
    if (uVar2 == ipc_env->txdesc_free_idx) break;
    iVar1 = iVar1 + 1;
    iVar3 = *(int *)((&(ipc_env->cb).recv_radar_ind)[(uVar2 & 3) + 0x10] + 4);
    iVar3 = (-iVar3 & 3U) + iVar3;
    printf("    [%lu]%p(%p:%08lX)\r\n",*(undefined4 *)(iVar3 + 0x18),*(undefined4 *)(iVar3 + 4));
  } while (iVar1 != 4);
  puts("========== bl_utils_dump End =======\r\n");
  return;
}



_Bool stateSnifferGuard(void *ch,event *event)

{
  return (_Bool)(ch == (void *)(uint)*(byte *)event->data);
}



_Bool stateConnectedIPYesGuard_ip_update(void *ch,event *event)

{
  return (_Bool)(ch == (void *)(uint)*(byte *)event->data);
}



void printErrMsg(void *stateData,event *event)

{
  printf("ENTERED ERROR STATE!");
  return;
}



void stateSnifferExit(void *stateData,event *event)

{
  printf("[WF][SM] Exiting %s state\r\n",stateData);
  return;
}



void stateSnifferAction(void *oldStateData,event *event,void *newStateData)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n",oldStateData);
  return;
}



void stateConnectedIPNoAction_ipgot(void *oldStateData,event *event,void *newStateData)

{
  uint *puVar1;
  uint *puVar2;
  uint uVar3;
  uint uVar4;
  
  puVar1 = (uint *)((int)event->data + 0xd);
  puVar2 = (uint *)((int)event->data + 0x11);
  uVar4 = *puVar1;
  uVar3 = *puVar2;
  printf(
         "[WF][SM] IP GOT IP:%u.%u.%u.%u, MASK: %u.%u.%u.%u, Gateway: %u.%u.%u.%u, dns1: %u.%u.%u.%u, dns2: %u.%u.%u.%u\r\n"
         ,uVar4 & 0xff,uVar4 >> 8 & 0xff,(uint)(*(uint3 *)puVar1 >> 0x10),uVar4 >> 0x18,uVar3 & 0xff
         ,uVar3 >> 8 & 0xff,(uint)(*(uint3 *)puVar2 >> 0x10));
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n",oldStateData,newStateData);
  return;
}



void stateGlobalEnter(void *stateData,event *event)

{
  printf("[WF][SM] Entering %s state\r\n",stateData);
  return;
}



void stateGlobalAction(void *oldStateData,event *event,void *newStateData)

{
  printf("[WF][SM] Global Action\r\n");
  return;
}



void stateConnectingEnter(void *stateData,event *event)

{
  printf("[WF][SM] Entering %s state\r\n",stateData);
  aos_post_event(2,8,0);
  return;
}



_Bool stateSnifferGuard_ChannelSet(void *ch,event *event)

{
  byte *pbVar1;
  
  pbVar1 = (byte *)event->data;
  if (ch == (void *)(uint)*pbVar1) {
    bl_main_monitor_channel_set(*(int *)(pbVar1 + 1),*(int *)(pbVar1 + 5));
    return false;
  }
  return false;
}



_Bool stateIdleGuard_sniffer(void *ev,event *event)

{
  if (ev == (void *)(uint)*(byte *)event->data) {
    bl_main_monitor();
    return true;
  }
  return false;
}



void stateConnectedIPNoExit(void *stateData,event *event)

{
  printf("[WF][SM] Exiting %s state\r\n",stateData);
  xTimerGenericCommand((TimerHandle_t)((int)stateData + 0x20),3,0,(BaseType_t *)0x0,0);
  xTimerGenericCommand((TimerHandle_t)((int)stateData + 0x20),5,0,(BaseType_t *)0x0,0);
  return;
}



void stateDisconnect_action_idle(void *oldStateData,event *event,void *newStateData)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n",oldStateData);
  printf("[WF][SM] Removing STA interface...\r\n");
  bl_main_if_remove(wifiMgmr.wlan_sta.vif_index);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void stateDisconnect_action_reconnect(void *oldStateData,event *event,void *newStateData)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n",oldStateData);
  printf("[WF][SM]  Action Connect\r\n");
  printf("           ssid %s\r\n",(uint8_t *)((int)oldStateData + 0x4d));
  printf("           ssid len %u\r\n",*(undefined4 *)((int)oldStateData + 0x6e));
  printf("           psk %s\r\n",(uint8_t *)((int)oldStateData + 0x72));
  printf("           psk len %u\r\n",*(undefined4 *)((int)oldStateData + 0xf4));
  printf("           pmk %s\r\n",(uint8_t *)((int)oldStateData + 0xb3));
  printf("           pmk len %u\r\n",*(undefined4 *)((int)oldStateData + 0xf8));
  printf("           mac %02X:%02X:%02X:%02X:%02X:%02X\r\n",
         (uint)*(byte *)((int)oldStateData + 0x101),(uint)*(byte *)((int)oldStateData + 0x100),
         (uint)*(byte *)((int)oldStateData + 0xff),(uint)*(byte *)((int)oldStateData + 0xfe),
         (uint)*(byte *)((int)oldStateData + 0xfd),(uint)*(byte *)((int)oldStateData + 0xfc));
  bl_main_connect((uint8_t *)((int)oldStateData + 0x4d),*(int *)((int)oldStateData + 0x6e),
                  (uint8_t *)((int)oldStateData + 0x72),*(int *)((int)oldStateData + 0xf4),
                  (uint8_t *)((int)oldStateData + 0xb3),*(int *)((int)oldStateData + 0xf8),
                  (uint8_t *)((int)oldStateData + 0xfc),'\0',_DAT_00000010);
  aos_post_event(2,3,0);
  return;
}



void ip_obtaining_timeout(timer_cb_arg_t data)

{
  pvTimerGetTimerID((TimerHandle_t)data);
  printf("[WF][SM] IP obtaining timeout\r\n");
  wifi_mgmr_api_fw_disconnect();
  return;
}



