pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void stateConnectedIPNoEnter(void *stateData,event *event)

{
  uint32_t uVar1;
  uint32_t uVar2;
  uint32_t uVar3;
  uint32_t uVar4;
  uint32_t uVar5;
  TickType_t xOptionalValue;
  ip4_addr_t iStack44;
  ip4_addr_t addr_ipaddr;
  ip4_addr_t addr_netmask;
  ip4_addr_t addr_gw;
  
  printf("[WF][SM] Entering %s state\r\n",stateData);
  xTimerCreateStatic("wifi IP obtaining",15000,0,stateData,ip_obtaining_timeout,
                     (StaticTimer_t *)(TimerHandle_t)((int)stateData + 0x20));
  xOptionalValue = xTaskGetTickCount();
  xTimerGenericCommand
            ((TimerHandle_t)((int)stateData + 0x20),1,xOptionalValue,(BaseType_t *)0x0,0xffffffff);
  vTaskEnterCritical();
  uVar5 = wifiMgmr.wlan_sta.ipv4.dns2;
  uVar4 = wifiMgmr.wlan_sta.ipv4.dns1;
  uVar3 = wifiMgmr.wlan_sta.ipv4.gw;
  uVar2 = wifiMgmr.wlan_sta.ipv4.mask;
  uVar1 = wifiMgmr.wlan_sta.ipv4.ip;
  vTaskExitCritical();
  if (uVar1 == 0) {
    printf("[WF][SM] DHCP Starting...%p\r\n",0x4201e474);
    wifi_netif_dhcp_start((netif *)&wifiMgmr.wlan_sta.netif);
  }
  else {
    printf("[WF][SM] Static IP Starting...%p\r\n",0x4201e474);
    iStack44 = (ip_addr_t)uVar4;
    dns_setserver('\0',(ip_addr_t *)&iStack44);
    iStack44 = (ip_addr_t)uVar5;
    dns_setserver('\x01',(ip_addr_t *)&iStack44);
    iStack44 = (ip_addr_t)uVar1;
    addr_ipaddr = uVar2;
    addr_netmask = uVar3;
    netifapi_netif_common((netif *)&wifiMgmr.wlan_sta.netif,dhcp_stop,(netifapi_errt_fn)0x0);
    netifapi_netif_set_addr((netif *)&wifiMgmr.wlan_sta.netif,&iStack44,&addr_ipaddr,&addr_netmask);
  }
  aos_post_event(2,4,0);
  return;
}



_Bool stateConnectedIPNoGuard_disconnect(void *ch,event *event)

{
  if (ch == (void *)(uint)*(byte *)event->data) {
    bl_main_disconnect();
    return false;
  }
  return false;
}



_Bool stateConnectedIPYesGuard_disconnect(void *ch,event *event)

{
  if (ch == (void *)(uint)*(byte *)event->data) {
    bl_main_disconnect();
    return false;
  }
  return false;
}



_Bool stateConnectedIPYesGuard_rcconfig(void *ch,event *event)

{
  byte *pbVar1;
  
  pbVar1 = (byte *)event->data;
  if (ch == (void *)(uint)*pbVar1) {
    printf("[WF][SM] rate config, use sta_idx 0, rate_config %04X\r\n",*(undefined4 *)(pbVar1 + 1));
    bl_main_rate_config('\0',*(uint16_t *)(pbVar1 + 1));
  }
  return false;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void stateIdleAction_connect(void *oldStateData,event *event,void *newStateData)

{
  void *pvVar1;
  wifi_mgmr_profile_msg_t *profile_msg;
  char *pcVar2;
  
  pvVar1 = event->data;
  *(undefined *)((int)pvVar1 + 0x2d) = 0;
  *(undefined *)((int)pvVar1 + 0x72) = 0;
  printf("[WF][SM] Action Connect\r\n");
  profile_msg = (wifi_mgmr_profile_msg_t *)((int)pvVar1 + 0xd);
  printf("           ssid %s\r\n",profile_msg);
  printf("           ssid len %u\r\n",*(undefined4 *)((int)pvVar1 + 0x2e));
  printf("           psk %s\r\n",(uint8_t *)((int)pvVar1 + 0x32));
  printf("           psk len %u\r\n",*(undefined4 *)((int)pvVar1 + 0xb4));
  printf("           pmk %s\r\n",(uint8_t *)((int)pvVar1 + 0x73));
  printf("           pmk len %u\r\n",*(undefined4 *)((int)pvVar1 + 0xb8));
  printf("           channel band %d\r\n",(uint)*(byte *)((int)pvVar1 + 0xc2));
  printf("           channel freq %d\r\n",(uint)*(ushort *)((int)pvVar1 + 0xc3));
  printf("           mac %02X:%02X:%02X:%02X:%02X:%02X\r\n",(uint)*(byte *)((int)pvVar1 + 0xc1),
         (uint)*(byte *)((int)pvVar1 + 0xc0),(uint)*(byte *)((int)pvVar1 + 0xbf),
         (uint)*(byte *)((int)pvVar1 + 0xbe),(uint)*(byte *)((int)pvVar1 + 0xbd),
         (uint)*(byte *)((int)pvVar1 + 0xbc));
  if (*(char *)((int)pvVar1 + 0xc5) == '\0') {
    pcVar2 = "false";
  }
  else {
    pcVar2 = "true";
  }
  printf("           dhcp status: %s\r\n",pcVar2);
  wifi_mgmr_profile_add(&wifiMgmr,profile_msg,-1);
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n",oldStateData,newStateData);
  bl_main_connect((uint8_t *)profile_msg,*(int *)((int)pvVar1 + 0x2e),
                  (uint8_t *)((int)pvVar1 + 0x32),*(int *)((int)pvVar1 + 0xb4),
                  (uint8_t *)((int)pvVar1 + 0x73),*(int *)((int)pvVar1 + 0xb8),
                  (uint8_t *)((int)pvVar1 + 0xbc),*(uint8_t *)((int)pvVar1 + 0xc2),_DAT_00000010);
  return;
}



_Bool stateGlobal_cfg_req(void *ch,event *event)

{
  char *pcVar1;
  
  pcVar1 = (char *)event->data;
  if (*pcVar1 == '\x16') {
    bl_main_cfg_task_req
              (*(uint32_t *)(pcVar1 + 0xd),*(uint32_t *)(pcVar1 + 0x11),*(uint32_t *)(pcVar1 + 0x15)
               ,*(uint32_t *)(pcVar1 + 0x19),pcVar1 + 0x21,(void *)0x0);
    return false;
  }
  return false;
}



_Bool stateGlobalGuard_fw_powersaving(void *ch,event *event)

{
  char *pcVar1;
  
  pcVar1 = (char *)event->data;
  if (*pcVar1 == '\x10') {
    printf("------>>>>>> Powersaving CMD, mode: %u\r\n",*(undefined4 *)(pcVar1 + 1));
    bl_main_powersaving(*(int *)(pcVar1 + 1));
  }
  return false;
}



_Bool stateGlobalGuard_conf_max_sta(void *ev,event *event)

{
  char *pcVar1;
  
  pcVar1 = (char *)event->data;
  if (*pcVar1 == '\n') {
    printf("[WF][SM] Conf max sta supported %lu...\r\n",*(undefined4 *)(pcVar1 + 1));
    bl_main_conf_max_sta(pcVar1[1]);
  }
  return false;
}



_Bool stateGlobalGuard_AP(void *ev,event *event)

{
  char "stateGlobalGuard_AP" [20];
  char *pcVar1;
  int iVar2;
  
  pcVar1 = (char *)event->data;
  if (*pcVar1 == '\b') {
    iVar2 = bl_main_if_add(0,(netif *)&wifiMgmr.wlan_ap.netif,&wifiMgmr.wlan_ap.vif_index);
    if (iVar2 == 0) {
      netifapi_netif_common
                ((netif *)&wifiMgmr.wlan_ap.netif,netif_set_link_up,(netifapi_errt_fn)0x0);
      netifapi_netif_common((netif *)&wifiMgmr.wlan_ap.netif,dhcpd_start,(netifapi_errt_fn)0x0);
      printf("[WF][SM] start AP with ssid %s;\r\n",pcVar1 + 0x11);
      printf("[WF][SM]               pwd  %s;\r\n",pcVar1 + 0x37);
      printf("[WF][SM]               channel  %ld;\r\n",*(undefined4 *)(pcVar1 + 0xd));
      bl_main_apm_start(pcVar1 + 0x11,pcVar1 + 0x37,*(int *)(pcVar1 + 0xd),
                        wifiMgmr.wlan_ap.vif_index,pcVar1[0x32]);
      wifiMgmr.inf_ap_enabled = 1;
      dns_server_init();
      aos_post_event(2,0xb,0);
    }
    else {
      printf("[WF][SM] %s: add AP iface failed\r\n","stateGlobalGuard_AP");
    }
  }
  return false;
}



