pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
_Bool stateGlobalGuard_scan_beacon(void *ch,event *event)

{
  byte bVar1;
  bool bVar2;
  byte *pbVar3;
  int iVar4;
  int iVar5;
  TickType_t TVar6;
  size_t sVar7;
  int iVar8;
  int iVar9;
  TickType_t TVar10;
  uint32_t uVar11;
  wifi_mgmr_t *pwVar12;
  int iVar13;
  wifi_mgmr_scan_item_t *__s;
  uint32_t uVar14;
  
  pbVar3 = (byte *)event->data;
  if (ch == (void *)(uint)*pbVar3) {
    pwVar12 = &wifiMgmr;
    if ((((int)(uint)pbVar3[0x3b] <= wifiMgmr.channel_nums) && (pbVar3[0x3b] != 0)) &&
       ((pbVar3[0xd] != 0 || ((wifiMgmr.features & 1) != 0)))) {
      TVar6 = xTaskGetTickCount();
      bVar2 = false;
      uVar14 = 0xffffffff;
      iVar4 = -1;
      iVar13 = 0;
      iVar9 = -1;
      do {
        iVar5 = iVar13;
        if (wifiMgmr.channel_nums < (int)(uint)pwVar12->scan_items[0].channel) {
          memset(pwVar12->scan_items,0,0x3c);
          pwVar12->scan_items[0].is_used = '\0';
        }
        else {
          if (pwVar12->scan_items[0].is_used != '\0') {
            uVar11 = pwVar12->scan_items[0].timestamp_lastseen;
            if ((!bVar2) || ((int)(uVar11 - uVar14) < 0)) {
              iVar4 = iVar13;
              uVar14 = uVar11;
            }
            iVar8 = memcmp(pwVar12->scan_items[0].bssid,pbVar3 + 0x35,6);
            iVar5 = iVar9;
            bVar2 = true;
            if ((iVar8 == 0) &&
               (iVar9 = strcmp((char *)(pbVar3 + 0xd),(char *)pwVar12->scan_items), bVar2 = true,
               iVar9 == 0)) {
              if (((char)pbVar3[0x3c] < wifiMgmr.scan_items[iVar13].rssi) &&
                 (TVar10 = xTaskGetTickCount(),
                 (int)(TVar10 - wifiMgmr.scan_items[iVar13].timestamp_lastseen) < 3000)) {
                return false;
              }
              wifiMgmr.scan_items[iVar13].channel = pbVar3[0x3b];
              wifiMgmr.scan_items[iVar13].rssi = pbVar3[0x3c];
              wifiMgmr.scan_items[iVar13].ppm_abs = pbVar3[0x3d];
              bVar1 = pbVar3[0x3e];
              wifiMgmr.scan_items[iVar13].timestamp_lastseen = TVar6;
              wifiMgmr.scan_items[iVar13].ppm_rel = bVar1;
              wifiMgmr.scan_items[iVar13].auth = pbVar3[0x3f];
              wifiMgmr.scan_items[iVar13].cipher = pbVar3[0x40];
              return false;
            }
          }
        }
        iVar13 = iVar13 + 1;
        pwVar12 = (wifi_mgmr_t *)&(pwVar12->wlan_sta).netif.input;
        iVar9 = iVar5;
      } while (iVar13 != 0x32);
      if ((iVar5 != -1) || (iVar5 = iVar4, iVar4 != -1)) {
        __s = wifiMgmr.scan_items + iVar5;
        memset(__s,0,0x3c);
        strncpy((char *)__s,(char *)(pbVar3 + 0xd),0x20);
        wifiMgmr.scan_items[iVar5].ssid_tail[0] = '\0';
        sVar7 = strlen((char *)__s);
        wifiMgmr.scan_items[iVar5].ssid_len = sVar7;
        memcpy(wifiMgmr.scan_items[iVar5].bssid,pbVar3 + 0x35,6);
        wifiMgmr.scan_items[iVar5].channel = pbVar3[0x3b];
        bVar1 = pbVar3[0x3c];
        wifiMgmr.scan_items[iVar5].timestamp_lastseen = TVar6;
        wifiMgmr.scan_items[iVar5].rssi = bVar1;
        wifiMgmr.scan_items[iVar5].auth = pbVar3[0x3f];
        wifiMgmr.scan_items[iVar5].cipher = pbVar3[0x40];
        wifiMgmr.scan_items[iVar5].is_used = '\x01';
      }
    }
  }
  return false;
}



void __reload_tsen(timer_cb_arg_t data)

{
  pvTimerGetTimerID((TimerHandle_t)data);
  wifi_mgmr_api_fw_tsen_reload();
  return;
}



void event_cb_wifi_event_mgmr(input_event_t *event,void *private_data)

{
  if (event->code == 0x14) {
    aos_post_delayed_action(0x55,trigger_auto_denoise,(void *)0x0);
    return;
  }
  return;
}



void trigger_auto_denoise(void *arg)

{
  if (auto_repeat != 0) {
    wifi_mgmr_api_denoise_enable();
    aos_post_delayed_action(0x55,trigger_auto_denoise,(void *)0x0);
    return;
  }
  return;
}



void stateDisconnect_exit(void *stateData,event *event)

{
  printf("[WF][SM] Exiting %s state\r\n",stateData);
  if (*(char *)((int)stateData + 0x4c) != '\0') {
    printf("Delete Timer.\r\n");
    xTimerGenericCommand((TimerHandle_t)((int)stateData + 0x20),3,0,(BaseType_t *)0x0,0);
    xTimerGenericCommand((TimerHandle_t)((int)stateData + 0x20),5,0,(BaseType_t *)0x0,0);
    *(undefined *)((int)stateData + 0x4c) = 0;
    return;
  }
  printf("Delete Timer Skipped\r\n");
  return;
}



void disconnect_retry(timer_cb_arg_t data)

{
  void *pvVar1;
  int iVar2;
  
  pvVar1 = pvTimerGetTimerID((TimerHandle_t)data);
  iVar2 = wifi_mgmr_profile_get(&wifiMgmr,(wifi_mgmr_profile_msg_t *)((int)pvVar1 + 0x4d));
  if (iVar2 != 0) {
    printf("[WF][SM] Retry Again --->>> retry Abort, since profile copy failed\r\n");
    return;
  }
  printf("[WF][SM] Retry Again --->>> retry connect\r\n");
  wifi_mgmr_api_reconnect();
  return;
}



_Bool stateGlobalGuard_fw_disconnect(void *ch,event *event)

{
  if (*(char *)event->data == '\x0f') {
    printf("Disconnect CMD\r\n");
    bl_main_disconnect();
    return false;
  }
  return false;
}



void stateConnectedIPYes_exit(void *stateData,event *event)

{
  ip4_addr_t iStack20;
  ip4_addr_t addr_ipaddr;
  
  iStack20 = (ip4_addr_t)0x0;
  printf("[WF][SM] Exiting %s state\r\n",stateData);
  netifapi_netif_common((netif *)&wifiMgmr.wlan_sta.netif,dhcp_stop,(netifapi_errt_fn)0x0);
  netifapi_netif_set_addr((netif *)&wifiMgmr.wlan_sta.netif,&iStack20,&iStack20,&iStack20);
  if (auto_repeat != 0) {
    auto_repeat = 0;
    bl_main_denoise(0);
  }
  return;
}



_Bool stateGlobalGuard_denoise(void *ev,event *event)

{
  int mode;
  
  if (*(char *)event->data != '\f') {
    return false;
  }
  if (*(int *)(event->data + 1) == 0) {
    auto_repeat = 0;
    mode = 0;
  }
  else {
    if (wifiMgmr.m.currentState != &stateConnectedIPYes) {
      return false;
    }
    mode = 3;
    if (auto_repeat == 0) {
      auto_repeat = 1;
      bl_main_denoise(1);
      aos_post_event(2,0x14,0);
      return false;
    }
  }
  bl_main_denoise(mode);
  return false;
}



_Bool stateIdleGuard_connect(void *ev,event *event)

{
  int iVar1;
  
  if (ev == (void *)(uint)*(byte *)event->data) {
    iVar1 = bl_main_if_add(1,(netif *)&wifiMgmr.wlan_sta.netif,&wifiMgmr.wlan_sta.vif_index);
    if (iVar1 != 0) {
      printf("[WF][SM] %s: add STA iface failed\r\n","stateIdleGuard_connect");
    }
    return (_Bool)(iVar1 == 0);
  }
  return false;
}



_Bool stateIfaceDownGuard_phyup(void *ev,event *event)

{
  bool bVar1;
  int iVar2;
  
  if (ev == (void *)(uint)*(byte *)event->data) {
    iVar2 = bl_main_phy_up();
    bVar1 = iVar2 == 0;
  }
  else {
    printf("[WF][SM] state mismatch\r\n");
    bVar1 = false;
  }
  return (_Bool)bVar1;
}



_Bool stateSnifferGuard_raw_send(void *ch,event *event)

{
  char *pcVar1;
  
