pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (((wifiMgmr.m.currentState != &stateIdle) && (wifiMgmr.m.currentState != &stateIfaceDown)) &&
     (pcVar1 = (char *)event->data, *pcVar1 == '\x15')) {
    bl_main_raw_send(*(uint8_t **)(pcVar1 + 1),*(int *)(pcVar1 + 5));
    return false;
  }
  return false;
}



_Bool stateGlobalGuard_stop(void *ev,event *event)

{
  if (*(char *)event->data == '\t') {
    printf("[WF][SM] Stoping AP interface...\r\n");
    bl_main_apm_stop(wifiMgmr.wlan_ap.vif_index);
    printf("[WF][SM] Removing and deauth all sta client...\r\n");
    bl_main_apm_remove_all_sta();
    printf("[WF][SM] Removing AP interface...\r\n");
    bl_main_if_remove(wifiMgmr.wlan_ap.vif_index);
    printf("[WF][SM] Stopping DHCP on AP interface...\r\n");
    netifapi_netif_common((netif *)&wifiMgmr.wlan_ap.netif,(netifapi_void_fn)0x0,dhcp_server_stop);
    printf("[WF][SM] Removing ETH interface ...\r\n");
    netifapi_netif_common((netif *)&wifiMgmr.wlan_ap.netif,netif_remove,(netifapi_errt_fn)0x0);
    wifiMgmr.inf_ap_enabled = 0;
    aos_post_event(2,0xc,0);
    return false;
  }
  return false;
}



_Bool stateGlobalGuard_enable_autoreconnect(void *ch,event *event)

{
  if (ch == (void *)(uint)*(byte *)event->data) {
    printf("Enable Auto Reconnect\r\n");
    wifi_mgmr_profile_autoreconnect_enable(&wifiMgmr,-1);
    return false;
  }
  return false;
}



_Bool stateGlobalGuard_disable_autoreconnect(void *ch,event *event)

{
  bool bVar1;
  
  if (ch == (void *)(uint)*(byte *)event->data) {
    bVar1 = wifiMgmr.m.currentState != &stateDisconnect;
    if (bVar1) {
      printf("Disable Auto Reconnect\r\n");
      wifi_mgmr_profile_autoreconnect_disable(&wifiMgmr,-1);
    }
    else {
      printf("Disable Autoreconnect in Disconnec State\r\n");
      printf("[WF][SM] Removing STA interface...\r\n");
      bl_main_if_remove(wifiMgmr.wlan_sta.vif_index);
    }
    return (_Bool)!bVar1;
  }
  return false;
}



// WARNING: Variable defined which should be unmapped: is_ok

void stateDisconnect_enter(void *stateData,event *event)

{
  int iVar1;
  TickType_t xOptionalValue;
  uint uVar2;
  uint uStack20;
  int is_ok;
  
  uStack20 = 0;
  printf("[WF][SM] Entering %s state\r\n",stateData);
  iVar1 = wifi_mgmr_profile_autoreconnect_is_enabled(&wifiMgmr,-1);
  if (iVar1 == 0) {
    printf("[WF][SM] Will NOT retry connect\r\n");
  }
  else {
    xTimerCreateStatic("wifi disconnect",2000,0,stateData,disconnect_retry,
                       (StaticTimer_t *)(TimerHandle_t)((int)stateData + 0x20));
    printf("[WF][SM] Will retry in 2000 ticks\r\n");
    xOptionalValue = xTaskGetTickCount();
    xTimerGenericCommand
              ((TimerHandle_t)((int)stateData + 0x20),1,xOptionalValue,(BaseType_t *)0x0,0xffffffff)
    ;
    *(undefined *)((int)stateData + 0x4c) = 1;
  }
  aos_post_event(2,5,(uint)wifiMgmr.wifi_mgmr_stat_info.status_code);
  uVar2 = bl60x_check_mac_status((int *)&uStack20);
  if ((uVar2 | uStack20) == 0) {
    aos_post_event(2,0x17,0);
    helper_record_dump();
  }
  if ((wifiMgmr.pending_task & 1) != 0) {
    printf("[WF][SM] Pending Scan Sent\r\n");
    bl_main_scan();
    wifiMgmr.pending_task = wifiMgmr.pending_task & 0xfffffffe;
  }
  return;
}



_Bool stateGlobalGuard_fw_scan(void *ch,event *event)

{
  if (*(char *)event->data == '\x12') {
    if (((wifiMgmr.m.currentState == &stateConnecting) ||
        (wifiMgmr.m.currentState == &stateConnectedIPNo)) ||
       (wifiMgmr.m.currentState == &stateDisconnect)) {
      printf("------>>>>>> Scan CMD Pending\r\n");
      wifiMgmr.pending_task = wifiMgmr.pending_task | 1;
    }
    else {
      if (((wifiMgmr.m.currentState == &stateIdle) ||
          (wifiMgmr.m.currentState == &stateConnectedIPYes)) ||
         (wifiMgmr.m.currentState == &stateSniffer)) {
        printf("------>>>>>> Scan CMD\r\n");
        bl_main_scan();
      }
      else {
        printf("------>>>>>> FW busy\r\n");
        aos_post_event(2,9,1);
      }
    }
    return false;
  }
  return false;
}



uint stateDisconnect_guard(uint param_1,int param_2)

{
  return (uint)(param_1 == (uint)**(byte **)(param_2 + 4));
}



void stateGlobalExit(void)

{
  printf("[WF][SM] Entering %s state\r\n");
  return;
}



void stateSnifferEnter(void)

{
  printf("[WF][SM] Entering %s state\r\n");
  return;
}



uint stateConnectingGuard(uint param_1,int param_2)

{
  return (uint)(param_1 == (uint)**(byte **)(param_2 + 4));
}



void stateConnectingAction_connected(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



void stateConnectingAction_disconnect(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



void stateConnectingExit(void)

{
  printf("[WF][SM] Exiting %s state\r\n");
  return;
}



void stateIdleAction_sniffer(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



void stateIdleEnter(void)

{
  printf("[WF][SM] Entering %s state\r\n");
  return;
}



void stateIdleExit(void)

{
  printf("[WF][SM] Entering %s state\r\n");
  return;
}



void stateIfaceDownAction_phyup(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



void stateIfaceDownEnter(void)

{
  printf("[WF][SM] Entering %s state\r\n");
  return;
}



void stateIfaceDownExit(void)

{
  printf("[WF][SM] Exiting %s state\r\n");
  return;
}



uint stateConnectedIPNoGuard(uint param_1,int param_2)

{
  return (uint)(param_1 == (uint)**(byte **)(param_2 + 4));
}



void stateConnectedIPNoAction_disconnect(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



uint stateConnectedIPYesGuard(uint param_1,int param_2)

{
  return (uint)(param_1 == (uint)**(byte **)(param_2 + 4));
}



void stateConnectedIPYes_action(void)

{
  printf("[WF][SM] State Action ###%s### --->>> ###%s###\r\n");
  return;
}



void stateConnectedIPYes_enter(void *stateData,event *event)

{
  printf("[WF][SM] Entering %s state\r\n",stateData);
  aos_post_event(2,7,0);
  if ((wifiMgmr.pending_task & 1) != 0) {
    printf("[WF][SM] Pending Scan Sent\r\n");
    bl_main_scan();
    wifiMgmr.pending_task = wifiMgmr.pending_task & 0xfffffffe;
  }
  return;
}



char * wifi_mgmr_auth_to_str(uint8_t auth)

{
  undefined3 in_register_00002029;
  
