pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  switch(CONCAT31(in_register_00002029,auth)) {
  case 0:
    return "Open";
  case 1:
    return "WEP";
  case 2:
    return "WPA-PSK";
  case 3:
    return "WPA2-PSK";
  case 4:
    return "WPA2-PSK/WPA-PSK";
  case 5:
    return "WPA/WPA2-Enterprise";
  default:
    return "Unknown";
  }
}



char * wifi_mgmr_cipher_to_str(uint8_t cipher)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,cipher);
  if (iVar1 == 0) {
    return "NONE";
  }
  if (iVar1 == 1) {
    return "WEP";
  }
  if (iVar1 == 2) {
    return "AES";
  }
  if (iVar1 != 3) {
    if (iVar1 != 4) {
      return "Unknown";
    }
    return "TKIP/AES";
  }
  return "TKIP";
}



int wifi_mgmr_event_notify(wifi_mgmr_msg_t *msg)

{
  size_t sVar1;
  int iVar2;
  
  while (wifiMgmr.ready == '\0') {
    printf("Wait Wi-Fi Mgmr Start up...\r\n");
    vTaskDelay(0x14);
  }
  sVar1 = xStreamBufferSend((StreamBufferHandle_t)&wifiMgmr.mq,msg,msg->len,0xffffffff);
  iVar2 = 0;
  if (sVar1 == 0) {
    printf("Failed when send msg 0x%p, len dec:%u\r\n",msg,msg->len);
    iVar2 = -1;
  }
  return iVar2;
}



// WARNING: Could not reconcile some variable overlaps

void wifi_mgmr_start(void)

{
  TickType_t xOptionalValue;
  size_t sVar1;
  void *pvRxData;
  int16_t iStack274;
  int16_t temp;
  int iStack272;
  event ev;
  uint8_t buffer [232];
  
  pvRxData = (void *)((int)&ev.data + 1);
  iStack272 = 1;
  ev.type = (int)pvRxData;
  stateM_init(&wifiMgmr.m,&stateIfaceDown,&stateError);
  wifi_mgmr_event_init();
  aos_register_event_filter(2,event_cb_wifi_event_mgmr,(void *)0x0);
  aos_post_event(2,2,0);
  hal_sys_capcode_update(-1,-1);
  printf("[WF][SM] reload tsen \r\n");
  xTimerCreateStatic("wifi reload tsen",10000,1,&state_tsen_reload_data,__reload_tsen,
                     (StaticTimer_t *)&state_tsen_reload_data.timer);
  xOptionalValue = xTaskGetTickCount();
  xTimerGenericCommand
            ((TimerHandle_t)&state_tsen_reload_data.timer,1,xOptionalValue,(BaseType_t *)0x0,
             0xffffffff);
  do {
    while( true ) {
      do {
        sVar1 = xStreamBufferReceive((StreamBufferHandle_t)&wifiMgmr.mq,pvRxData,0xe0,0xffffffff);
      } while (sVar1 == 0);
      if (ev.data._1_1_ != 0xd) break;
      iStack274 = 0;
      if ((((wifiMgmr.m.currentState == &stateConnecting) ||
           (wifiMgmr.m.currentState == &stateDisconnect)) ||
          (wifiMgmr.m.currentState == &stateConnectedIPYes)) ||
         ((wifiMgmr.m.currentState == &stateSniffer ||
          (wifiMgmr.m.currentState == &stateConnectedIPNo)))) {
        bl_tsen_adc_get(&iStack274,0);
        phy_tcal_callback(iStack274);
      }
    }
    iStack272 = 1;
    if (0xd < ev.data._1_1_) {
      iStack272 = (uint)(0x16 < ev.data._1_1_) << 1;
    }
    stateM_handleEvent(&wifiMgmr.m,(event *)&stack0xfffffef0);
  } while( true );
}



void _wifi_mgmr_entry(void *pvParameters)

{
  wifi_conf_t *conf;
  TaskHandle_t aptStack36 [4];
  code *pcStack20;
  
  pcStack20 = wifi_mgmr_start_background;
  conf = (wifi_conf_t *)wifi_mgmr_start();
  wifi_mgmr_drv_init(conf);
  aptStack36[0] = (TaskHandle_t)0x0;
  xTaskCreate(_wifi_mgmr_entry,"wifi_mgmr",0x300,(void *)0x0,0x1c,aptStack36);
  return;
}



void wifi_mgmr_start_background(wifi_conf_t *conf)

{
  TaskHandle_t ptStack20;
  TaskHandle_t xHandle;
  
  wifi_mgmr_drv_init(conf);
  ptStack20 = (TaskHandle_t)0x0;
  xTaskCreate(_wifi_mgmr_entry,"wifi_mgmr",0x300,(void *)0x0,0x1c,&ptStack20);
  return;
}



int wifi_mgmr_init(void)

{
  StreamBufferHandle_t pSVar1;
  
  pSVar1 = xStreamBufferGenericCreateStatic
                     (0x8c0,0,1,wifiMgmr.mq_pool,(StaticStreamBuffer_t *)&wifiMgmr.mq);
  wifiMgmr.ready = '\x01';
  wifiMgmr.scan_item_timeout = 15000;
  return (uint)(pSVar1 == (StreamBufferHandle_t)0x0);
}



int wifi_mgmr_state_get_internal(int *state)

{
  uint16_t uVar1;
  int iVar2;
  
  uVar1 = wifiMgmr.wifi_mgmr_stat_info.status_code;
  if (wifiMgmr.m.currentState == &stateIdle) {
    if (wifiMgmr.inf_ap_enabled != 0) {
      iVar2 = 0x11;
      goto LAB_230262ac;
    }
    iVar2 = 1;
  }
  else {
    if (wifiMgmr.m.currentState == &stateConnecting) {
      if (wifiMgmr.inf_ap_enabled != 0) {
        iVar2 = 0x12;
        goto LAB_230262ac;
      }
      iVar2 = 2;
    }
    else {
      if (wifiMgmr.m.currentState == &stateConnectedIPNo) {
        if (wifiMgmr.inf_ap_enabled == 0) {
          iVar2 = 3;
        }
        else {
          iVar2 = 0x13;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.m.currentState == &stateConnectedIPYes) {
        if (wifiMgmr.inf_ap_enabled == 0) {
          iVar2 = 4;
        }
        else {
          iVar2 = 0x14;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.m.currentState != &stateDisconnect) {
        if (wifiMgmr.m.currentState == &stateIfaceDown) {
          iVar2 = 6;
        }
        else {
          if (wifiMgmr.m.currentState != &stateSniffer) {
            *state = 0;
            return 0;
          }
          iVar2 = 7;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.inf_ap_enabled != 0) {
        iVar2 = 0x15;
        goto LAB_230262ac;
      }
      iVar2 = 5;
    }
  }
  *state = iVar2;
  if (uVar1 == 8) {
    iVar2 = 8;
  }
  else {
    if (uVar1 != 0xc) {
      return 0;
    }
    iVar2 = 9;
  }
LAB_230262ac:
  *state = iVar2;
  return 0;
}



void wifi_mgmr_set_connect_stat_info(wifi_event_sm_connect_ind *ind,uint8_t type_ind)

{
  uint8_t uVar1;
  uint8_t *puVar2;
  uint8_t *puVar3;
  
  wifiMgmr.wifi_mgmr_stat_info.status_code = ind->status_code;
  puVar2 = ind->bssid;
  puVar3 = wifiMgmr.wifi_mgmr_stat_info.bssid;
  do {
    uVar1 = *puVar2;
    puVar2 = puVar2 + 1;
    *puVar3 = uVar1;
    puVar3 = puVar3 + 1;
  } while (puVar2 != &ind->vif_idx);
  wifiMgmr.wifi_mgmr_stat_info.type_ind = type_ind;
  wifiMgmr.wifi_mgmr_stat_info.chan_freq = ind->center_freq;
  wifiMgmr.wifi_mgmr_stat_info.chan_band = ind->band;
  return;
}



