pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int wifi_mgmr_set_country_code_internal(char *country_code)

{
  bl_main_set_country_code(country_code);
  strncpy(wifiMgmr.country_code,country_code,3);
  wifiMgmr.country_code[2] = '\0';
  wifiMgmr.channel_nums = bl_main_get_channel_nums();
  return 0;
}



int wifi_mgmr_ap_sta_cnt_get_internal(uint8_t *sta_cnt)

{
  bl_main_apm_sta_cnt_get(sta_cnt);
  return 0;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

int wifi_mgmr_ap_sta_info_get_internal(wifi_mgmr_sta_basic_info_t *sta_info_internal,uint8_t idx)

{
  undefined2 uStack40;
  wifi_apm_sta_info apm_sta_info;
  
  memset(&uStack40,0,0x18);
  bl_main_apm_sta_info_get((wifi_apm_sta_info *)&uStack40,idx);
  *(undefined2 *)sta_info_internal = uStack40;
  sta_info_internal->rssi = apm_sta_info.tsflo;
  sta_info_internal->tsflo = apm_sta_info.tsfhi;
  sta_info_internal->tsfhi = apm_sta_info.sta_mac._2_4_;
  sta_info_internal->data_rate = (uint8_t)apm_sta_info.rssi;
  memcpy(sta_info_internal->sta_mac,&uStack40 + 1,6);
  return 0;
}



int wifi_mgmr_ap_sta_delete_internal(uint8_t sta_idx)

{
  bl_main_apm_sta_delete(sta_idx);
  return 0;
}



int wifi_mgmr_scan_complete_notify(void)

{
  wifi_mgmr_scan_complete_callback();
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int wifi_mgmr_api_connect(char *ssid,char *psk,char *pmk,uint8_t *mac,uint8_t band,uint16_t freq)

{
  size_t __n;
  int iVar1;
  undefined3 in_register_00002039;
  undefined2 in_register_0000203e;
  WIFI_MGMR_EVENT_T WStack232;
  undefined uStack231;
  undefined uStack230;
  undefined uStack229;
  uint8_t buffer [198];
  
  memset(&WStack232,0,0xc6);
  WStack232 = WIFI_MGMR_EVENT_APP_CONNECT;
  uStack231 = 0x44;
  uStack230 = 0x33;
  uStack229 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = -0x3a;
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  __n = strlen(ssid);
  buffer._42_2_ = (undefined2)__n;
  buffer._44_2_ = (undefined2)(__n >> 0x10);
  memcpy(buffer + 9,ssid,__n);
  buffer[41] = '\0';
  if (psk == (char *)0x0) {
    buffer._176_4_ = 0;
LAB_23026504:
    buffer[110] = '\0';
    if (pmk == (char *)0x0) {
      buffer._180_4_ = 0;
    }
    else {
      buffer._180_4_ = strlen(pmk);
      if (buffer._180_4_ != 0) {
        if (buffer._180_4_ != 0x40) goto LAB_23026562;
        memcpy(buffer + 0x6f,pmk,0x40);
      }
    }
    buffer[175] = '\0';
    if (mac != (uint8_t *)0x0) {
      memcpy(buffer + 0xb8,mac,6);
    }
    if (CONCAT22(in_register_0000203e,freq) != 0) {
      buffer[191] = (uint8_t)freq;
      buffer[192] = (uint8_t)(freq >> 8);
      buffer[190] = band;
      printf("wifi mgmr band:%d freq: %d\r\n",CONCAT31(in_register_00002039,band),
             CONCAT22(in_register_0000203e,freq));
    }
    buffer[193] = '\x01';
    wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack232);
    iVar1 = 0;
  }
  else {
    buffer._176_4_ = strlen(psk);
    if (buffer._176_4_ < 0x41) {
      if (buffer._176_4_ != 0) {
        memcpy(buffer + 0x2e,psk,buffer._176_4_);
      }
      goto LAB_23026504;
    }
LAB_23026562:
    iVar1 = -1;
  }
  return iVar1;
}



int wifi_mgmr_api_cfg_req
              (uint32_t ops,uint32_t task,uint32_t element,uint32_t type,uint32_t length,
              uint32_t *buf)

{
  int iVar1;
  WIFI_MGMR_EVENT_T WStack100;
  undefined uStack99;
  undefined uStack98;
  undefined uStack97;
  uint8_t buffer [65];
  
  if (length < 0x21) {
    memset(&WStack100,0,0x41);
    WStack100 = WIFI_MGMR_EVENT_FW_CFG_REQ;
    uStack99 = 0x44;
    uStack98 = 0x33;
    uStack97 = 0x22;
    buffer[0] = '\x11';
    buffer[1] = -0x78;
    buffer[2] = 'w';
    iVar1 = length + 0xc6;
    buffer[3] = 'f';
    buffer[4] = 'U';
    buffer[6] = (uint8_t)((uint)iVar1 >> 8);
    buffer[7] = (uint8_t)((uint)iVar1 >> 0x10);
    buffer[10] = (uint8_t)(ops >> 8);
    buffer[11] = (uint8_t)(ops >> 0x10);
    buffer[14] = (uint8_t)(task >> 8);
    buffer[15] = (uint8_t)(task >> 0x10);
    buffer[18] = (uint8_t)(element >> 8);
    buffer[19] = (uint8_t)(element >> 0x10);
    buffer[22] = (uint8_t)(type >> 8);
    buffer[23] = (uint8_t)(type >> 0x10);
    buffer[5] = (uint8_t)iVar1;
    buffer[9] = (uint8_t)ops;
    buffer[13] = (uint8_t)task;
    buffer[17] = (uint8_t)element;
    buffer[21] = (uint8_t)type;
    buffer[26] = (uint8_t)(length >> 8);
    buffer[27] = (uint8_t)(length >> 0x10);
    buffer[8] = (uint8_t)((uint)iVar1 >> 0x18);
    buffer[12] = (uint8_t)(ops >> 0x18);
    buffer[16] = (uint8_t)(task >> 0x18);
    buffer[20] = (uint8_t)(element >> 0x18);
    buffer[24] = (uint8_t)(type >> 0x18);
    buffer[25] = (uint8_t)length;
    buffer[28] = (uint8_t)(length >> 0x18);
    if (length != 0) {
      memcpy(buffer + 0x1d,buf,length);
    }
    wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack100);
    return 0;
  }
  return -1;
}



// WARNING: Variable defined which should be unmapped: buffer

int wifi_mgmr_api_ip_got(uint32_t ip,uint32_t mask,uint32_t gw,uint32_t dns1,uint32_t dns2)

{
  WIFI_MGMR_EVENT_T WStack52;
  undefined uStack51;
  undefined uStack50;
  undefined uStack49;
  uint8_t buffer [33];
  
  memset(&WStack52,0,0x21);
  WStack52 = WIFI_MGMR_EVENT_APP_IP_GOT;
  uStack51 = 0x44;
  uStack50 = 0x33;
  uStack49 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '!';
  buffer[10] = (uint8_t)(ip >> 8);
  buffer[11] = (uint8_t)(ip >> 0x10);
  buffer[14] = (uint8_t)(mask >> 8);
  buffer[15] = (uint8_t)(mask >> 0x10);
  buffer[18] = (uint8_t)(gw >> 8);
  buffer[19] = (uint8_t)(gw >> 0x10);
  buffer[9] = (uint8_t)ip;
  buffer[13] = (uint8_t)mask;
  buffer[17] = (uint8_t)gw;
  buffer[21] = (uint8_t)dns1;
  buffer[22] = (uint8_t)(dns1 >> 8);
  buffer[12] = (uint8_t)(ip >> 0x18);
  buffer[16] = (uint8_t)(mask >> 0x18);
  buffer[20] = (uint8_t)(gw >> 0x18);
  buffer[23] = (uint8_t)(dns1 >> 0x10);
  buffer[24] = (uint8_t)(dns1 >> 0x18);
  buffer[25] = (uint8_t)dns2;
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  buffer[26] = (uint8_t)(dns2 >> 8);
  buffer[27] = (uint8_t)(dns2 >> 0x10);
  buffer[28] = (uint8_t)(dns2 >> 0x18);
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack52);
  return 0;
}



