pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int wifi_mgmr_api_ip_update(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_GLB_IP_UPDATE;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_reconnect(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_RECONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_disable_autoreconnect(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_GLB_DISABLE_AUTORECONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_enable_autoreconnect(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_GLB_ENABLE_AUTORECONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_disconnect(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_DISCONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_rate_config(uint16_t config)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_RC_CONFIG;
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  uStack31 = (undefined)config;
  buffer[4] = 'U';
  uStack30 = (undefined)(config >> 8);
  uStack29 = 0;
  buffer[0] = '\0';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_conf_max_sta(uint8_t max_sta_supported)

{
  WIFI_MGMR_EVENT_T local_20;
  uint8_t uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_CONF_MAX_STA;
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  uStack30 = 0;
  uStack29 = 0;
  buffer[0] = '\0';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  uStack31 = max_sta_supported;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_ifaceup(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_PHY_UP;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_sniffer_enable(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_SNIFFER;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_scan_item_beacon
              (uint8_t channel,int8_t rssi,uint8_t auth,uint8_t *mac,uint8_t *ssid,int len,
              int8_t ppm_abs,int8_t ppm_rel,uint8_t cipher)

{
  WIFI_MGMR_EVENT_T WStack108;
  undefined uStack107;
  undefined uStack106;
  undefined uStack105;
  uint8_t buffer [73];
  
  memset(&WStack108,0,0x49);
  WStack108 = WIFI_MGMR_EVENT_GLB_SCAN_IND_BEACON;
  uStack107 = 0x44;
  uStack106 = 0x33;
  uStack105 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = 'I';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  memcpy(buffer + 9,ssid,len);
  buffer[45] = (uint8_t)len;
  buffer[46] = (uint8_t)((uint)len >> 8);
  buffer[47] = (uint8_t)((uint)len >> 0x10);
  buffer[48] = (uint8_t)((uint)len >> 0x18);
  buffer[41] = '\0';
  memcpy(buffer + 0x31,mac,6);
  buffer[55] = channel;
  buffer[56] = rssi;
  buffer[57] = ppm_abs;
  buffer[58] = ppm_rel;
  buffer[59] = auth;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack108);
  return 0;
}



int wifi_mgmr_api_fw_disconnect(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
