pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_FW_DISCONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_fw_tsen_reload(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  local_20 = WIFI_MGMR_EVENT_APP_RELOAD_TSEN;
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_fw_scan(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_FW_SCAN;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_fw_powersaving(int mode)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_FW_POWERSAVING;
  uStack30 = (undefined)((uint)mode >> 8);
  uStack29 = (undefined)((uint)mode >> 0x10);
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  uStack31 = (undefined)mode;
  buffer[4] = 'U';
  buffer[0] = (uint8_t)((uint)mode >> 0x18);
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int wifi_mgmr_api_ap_start(char *ssid,char *passwd,int channel,uint8_t hidden_ssid)

{
  size_t sVar1;
  int iVar2;
  undefined3 in_register_00002035;
  WIFI_MGMR_EVENT_T WStack156;
  undefined uStack155;
  undefined uStack154;
  undefined uStack153;
  uint8_t buffer [124];
  
  if (ssid == (char *)0x0) {
    return -1;
  }
  memset(&WStack156,0,0x7c);
  sVar1 = strlen(ssid);
  buffer[47] = (uint8_t)sVar1;
  buffer._48_4_ = buffer._48_4_ & 0xff000000 | sVar1 >> 8;
  if (sVar1 < 0x21) {
    if (passwd != (char *)0x0) {
      buffer._116_4_ = strlen(passwd);
      if (0x20 < buffer._116_4_) goto LAB_23026f80;
    }
    WStack156 = WIFI_MGMR_EVENT_APP_AP_START;
    uStack155 = 0x44;
    uStack154 = 0x33;
    uStack153 = 0x22;
    buffer[0] = '\x11';
    buffer[1] = -0x78;
    buffer[2] = 'w';
    buffer[3] = 'f';
    buffer[4] = 'U';
    buffer[5] = '|';
    buffer[6] = '\0';
    buffer[7] = '\0';
    buffer[8] = '\0';
    memcpy(buffer + 0xd,ssid,(uint)buffer[47] | buffer._48_4_ << 8);
    if (passwd == (char *)0x0) {
      buffer._116_4_ = 0;
    }
    else {
      memcpy(buffer + 0x33,passwd,buffer._116_4_);
    }
    buffer[9] = (uint8_t)channel;
    buffer[10] = (uint8_t)((uint)channel >> 8);
    buffer[46] = CONCAT31(in_register_00002035,hidden_ssid) != 0;
    buffer[11] = (uint8_t)((uint)channel >> 0x10);
    buffer[12] = (uint8_t)((uint)channel >> 0x18);
    wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack156);
    iVar2 = 0;
  }
  else {
LAB_23026f80:
    iVar2 = -1;
  }
  return iVar2;
}



int wifi_mgmr_api_ap_stop(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_AP_STOP;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_idle(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  buffer[0] = '\x11';
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  local_20 = WIFI_MGMR_EVENT_APP_IDLE;
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_denoise_enable(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_DENOISE;
  uStack31 = 1;
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  uStack30 = 0;
  uStack29 = 0;
  buffer[0] = '\0';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_denoise_disable(void)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_APP_DENOISE;
  buffer[1] = -0x78;
  buffer[2] = 'w';
  buffer[3] = 'f';
  buffer[4] = 'U';
  uStack31 = 0;
  uStack30 = 0;
  uStack29 = 0;
  buffer[0] = '\0';
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_raw_send(uint8_t *pkt,int len)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  uint8_t buffer [13];
  
