pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  memset(&local_20,0,0xd);
  local_20 = WIFI_MGMR_EVENT_FW_DATA_RAW_SEND;
  uStack30 = (undefined)((uint)pkt >> 8);
  uStack29 = (undefined)((uint)pkt >> 0x10);
  buffer[2] = (uint8_t)((uint)len >> 8);
  uStack31 = SUB41(pkt,0);
  buffer[1] = (uint8_t)len;
  buffer[3] = (uint8_t)((uint)len >> 0x10);
  buffer[0] = (uint8_t)((uint)pkt >> 0x18);
  buffer[4] = (uint8_t)((uint)len >> 0x18);
  buffer[5] = '\r';
  buffer[6] = '\0';
  buffer[7] = '\0';
  buffer[8] = '\0';
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return 0;
}



int wifi_mgmr_api_set_country_code(char *country_code)

{
  wifi_mgmr_set_country_code_internal(country_code);
  return 0;
}



void cmd_rf_dump(char *buf,int len,int argc,char **argv)

{
  return;
}



void cmd_dump_reset(char *buf,int len,int argc,char **argv)

{
  pkt_counter = 10;
  return;
}



void cmd_wifi_power_table_update(char *buf,int len,int argc,char **argv)

{
  int8_t aiStack56 [4];
  int8_t power_table_test [38];
  
  memcpy(aiStack56,&DAT_2307d844,0x26);
  bl_tpc_update_power_table(aiStack56);
  return;
}



void cmd_wifi_state_get(char *buf,int len,int argc,char **argv)

{
  char *__format;
  int iStack20;
  int state;
  
  iStack20 = 0;
  wifi_mgmr_state_get(&iStack20);
  switch(iStack20) {
  case 0:
    __format = "wifi state unknown\r\n";
    break;
  case 1:
    __format = "wifi state idle\r\n";
    break;
  case 2:
    __format = "wifi state connecting\r\n";
    break;
  case 3:
    __format = "wifi state connected ip getting\r\n";
    break;
  case 4:
    __format = "wifi state connected ip got\r\n";
    break;
  case 5:
    __format = "wifi state disconnect\r\n";
    break;
  case 6:
    __format = "wifi state ifdown\r\n";
    break;
  case 7:
    __format = "wifi state sniffer\r\n";
    break;
  case 8:
    __format = "wifi state psk error\r\n";
    break;
  case 9:
    __format = "wifi state no ap found\r\n";
    break;
  default:
    goto switchD_2302724c_caseD_a;
  case 0x11:
    __format = "wifi state with ap idle\r\n";
    break;
  case 0x12:
    __format = "wifi state with ap connecting\r\n";
    break;
  case 0x13:
    __format = "wifi state with ap connected ip getting\r\n";
    break;
  case 0x14:
    __format = "wifi state with ap connected ip got\r\n";
    break;
  case 0x15:
    __format = "wifi state with ap disconnect\r\n";
  }
  printf(__format);
switchD_2302724c_caseD_a:
  return;
}



void wifi_sta_get_state_cmd(char *buf,int len,int argc,char **argv)

{
  char "wifi_sta_get_state_cmd" [23];
  char *__format;
  int iStack20;
  int state;
  
  iStack20 = 0;
  wifi_mgmr_state_get(&iStack20);
  printf("%s:wifi state = 0x%x\r\n","wifi_sta_get_state_cmd",iStack20);
  if (iStack20 == 0) {
    __format = "wifi current state: WIFI_STATE_UNKNOWN\r\n";
  }
  else {
    if (iStack20 == 1) {
      __format = "wifi current state: WIFI_STATE_IDLE\r\n";
    }
    else {
      if (iStack20 == 2) {
        __format = "wifi current state: WIFI_STATE_CONNECTING\r\n";
      }
      else {
        if (iStack20 == 3) {
          __format = "wifi current state: WIFI_STATE_CONNECTED_IP_GETTING\r\n";
        }
        else {
          if (iStack20 == 4) {
            __format = "wifi current state: WIFI_STATE_CONNECTED_IP_GOT\r\n";
          }
          else {
            if (iStack20 == 5) {
              __format = "wifi current state: WIFI_STATE_DISCONNECT\r\n";
            }
            else {
              if (iStack20 == 0x11) {
                __format = "wifi current state: WIFI_STATE_WITH_AP_IDLE\r\n";
              }
              else {
                if (iStack20 == 0x12) {
                  __format = "wifi current state: WIFI_STATE_WITH_AP_CONNECTING\r\n";
                }
                else {
                  if (iStack20 == 0x13) {
                    __format = "wifi current state: WIFI_STATE_WITH_AP_CONNECTED_IP_GETTING\r\n";
                  }
                  else {
                    if (iStack20 == 0x14) {
                      __format = "wifi current state: WIFI_STATE_WITH_AP_CONNECTED_IP_GOT\r\n";
                    }
                    else {
                      if (iStack20 == 0x15) {
                        __format = "wifi current state: WIFI_STATE_WITH_AP_DISCONNECT\r\n";
                      }
                      else {
                        if (iStack20 == 6) {
                          __format = "wifi current state: WIFI_STATE_IFDOWN\r\n";
                        }
                        else {
                          if (iStack20 == 7) {
                            __format = "wifi current state: WIFI_STATE_SNIFFER\r\n";
                          }
                          else {
                            if (iStack20 == 8) {
                              __format = "wifi current state: WIFI_STATE_PSK_ERROR\r\n";
                            }
                            else {
                              if (iStack20 == 9) {
                                __format = "wifi current state: WIFI_STATE_NO_AP_FOUND\r\n";
                              }
                              else {
                                __format = "wifi current state: invalid\r\n";
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
  printf(__format);
  return;
}



// WARNING: Could not reconcile some variable overlaps

void wifi_edca_dump_cmd(char *buf,int len,int argc,char **argv)

{
  byte local_15;
  byte local_14;
  byte local_13;
  uint8_t aifs;
  ushort uStack18;
  uint8_t cwmin;
  uint8_t cwmax;
  uint16_t txop;
  
  local_15 = 0;
  local_14 = 0;
  local_13 = 0;
  uStack18 = 0;
  puts("EDCA Statistic:\r\n");
  bl60x_edca_get(0,&local_15,&local_14,&local_13,(uint16_t *)&stack0xffffffee);
  puts("  AC_BK:");
  printf("aifs %3u, cwmin %3u, cwmax %3u, txop %4u\r\n",(uint)local_15,(uint)local_14,(uint)local_13
         ,(uint)uStack18);
  bl60x_edca_get(1,&local_15,&local_14,&local_13,(uint16_t *)&stack0xffffffee);
  puts("  AC_BE:");
  printf("aifs %3u, cwmin %3u, cwmax %3u, txop %4u\r\n",(uint)local_15,(uint)local_14,(uint)local_13
         ,(uint)uStack18);
  bl60x_edca_get(2,&local_15,&local_14,&local_13,(uint16_t *)&stack0xffffffee);
  puts("  AC_VI:");
  printf("aifs %3u, cwmin %3u, cwmax %3u, txop %4u\r\n",(uint)local_15,(uint)local_14,(uint)local_13
         ,(uint)uStack18);
  bl60x_edca_get(3,&local_15,&local_14,&local_13,(uint16_t *)&stack0xffffffee);
  puts("  AC_VO:");
  printf("aifs %3u, cwmin %3u, cwmax %3u, txop %4u\r\n",(uint)local_15,(uint)local_14,(uint)local_13
         ,(uint)uStack18);
  return;
}



