pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

void wifi_ap_sta_list_get_cmd(char *buf,int len,int argc,char **argv)

{
  char cVar1;
  uint uVar2;
  char *__format;
  wifi_ap_data_rate *pwVar3;
  byte bStack77;
  uint8_t sta_cnt;
  uint uStack76;
  int state;
  wifi_sta_basic_info sta_info;
  
  uStack76 = 0;
  bStack77 = 0;
  wifi_mgmr_state_get((int *)&stack0xffffffb4);
  if ((uStack76 & 0x10) == 0) {
    __format = "wifi AP is not enabled, state = %d\r\n";
    uVar2 = uStack76;
  }
  else {
    wifi_mgmr_ap_sta_cnt_get(&bStack77);
    if (bStack77 != 0) {
      memset(&state,0,0x18);
      printf("sta list:\r\n");
      printf(
            "-----------------------------------------------------------------------------------\r\n"
            );
      printf(
            "No.      StaIndex      Mac-Address       Signal      DateRate            TimeStamp\r\n"
            );
      printf(
            "-----------------------------------------------------------------------------------\r\n"
            );
      uVar2 = 0;
      do {
        if (bStack77 <= uVar2) {
          return;
        }
        wifi_mgmr_ap_sta_info_get((wifi_sta_basic_info *)&state,(uint8_t)uVar2);
        if ((state._1_1_ != '\0') && ((uint8_t)state != -0x11)) {
          pwVar3 = data_rate_list;
          cVar1 = '\0';
          do {
            if (pwVar3->data_rate == (uint8_t)sta_info.rssi) break;
            cVar1 = cVar1 + '\x01';
            pwVar3 = pwVar3 + 1;
          } while (cVar1 != '\f');
          printf(
                 " %u          %u        %02X:%02X:%02X:%02X:%02X:%02X    %d      %s      0x%llx\r\n"
                 ,uVar2,(uint)state._2_1_,(uint)state._3_1_,(uint)sta_info.sta_idx,
                 (uint)sta_info.is_used,(uint)sta_info.sta_mac[0]);
        }
        uVar2 = uVar2 + 1 & 0xff;
      } while( true );
    }
    uVar2 = 0;
    __format = "no sta connect current AP, sta_cnt = %d\r\n";
  }
  printf(__format,uVar2);
  return;
}



// WARNING: Could not reconcile some variable overlaps

void wifi_ap_sta_delete_cmd(char *buf,int len,int argc,char **argv)

{
  char cVar1;
  byte idx;
  char *__format;
  size_t sVar2;
  char *pcVar3;
  char *__s;
  byte bVar4;
  char cVar5;
  byte bStack45;
  uint8_t sta_cnt;
  char *pcStack44;
  int state;
  wifi_sta_basic_info sta_info;
  
  pcStack44 = (char *)0x0;
  bStack45 = 0;
  if (argc == 2) {
    wifi_mgmr_state_get((int *)&stack0xffffffd4);
    if (((uint)pcStack44 & 0x10) == 0) {
      __format = "wifi AP is not enabled, state = %d\r\n";
      pcVar3 = pcStack44;
    }
    else {
      printf("Delete Sta No.%s \r\n",argv[1]);
      __s = argv[1];
      idx = 0;
      sVar2 = strlen(__s);
      cVar5 = '\x01';
      __format = __s + sVar2;
      *__format = '\0';
      pcVar3 = __format;
      while ((int)(__format + -(int)pcVar3) < (int)sVar2) {
        cVar1 = pcVar3[-1];
        bVar4 = cVar1 - 0x30;
        if (9 < bVar4) {
          if ((byte)(cVar1 + 0x9fU) < 6) {
            bVar4 = cVar1 + 0xa9;
          }
          else {
            bVar4 = 0;
            if ((byte)(cVar1 + 0xbfU) < 6) {
              bVar4 = cVar1 - 0x37;
            }
          }
        }
        pcVar3 = pcVar3 + -1;
        idx = idx + bVar4 * cVar5;
        cVar5 = cVar5 * '\n';
      }
      pcVar3 = (char *)(uint)idx;
      printf("sta_str: %s, str_len: %d, sta_num: %d, q: %s\r\n",__s,pcVar3);
      printf("sta num = %d \r\n",pcVar3);
      wifi_mgmr_ap_sta_cnt_get(&bStack45);
      if ((bStack45 == 0) || ((char *)(uint)bStack45 < pcVar3)) {
        __format = "no valid sta in list or sta idx(%d) is invalid\r\n";
        pcVar3 = (char *)(uint)bStack45;
      }
      else {
        memset(&state,0,0x18);
        wifi_mgmr_ap_sta_info_get((wifi_sta_basic_info *)&state,idx);
        if ((state._1_1_ != '\0') && ((uint8_t)state != -0x11)) {
          printf("sta info: No.%u,sta_idx = %u,mac = %02X:%02X:%02X:%02X:%02X:%02X,rssi = %d\r\n",
                 pcVar3,(uint)state._2_1_,(uint)state._3_1_,(uint)sta_info.sta_idx,
                 (uint)sta_info.is_used,(uint)sta_info.sta_mac[0]);
          wifi_mgmr_ap_sta_delete((uint8_t)state);
          return;
        }
        __format = "No.%d sta is invalid\r\n";
      }
    }
  }
  else {
    __format = "[USAGE]: %s sta_num\r\n";
    pcVar3 = *argv;
  }
  printf(__format,pcVar3);
  return;
}



void cmd_wifi_coex_pta_force_off(char *buf,int len,int argc,char **argv)

{
  coex_wifi_pta_forece_enable(0);
  return;
}



void cmd_wifi_coex_pta_force_on(char *buf,int len,int argc,char **argv)

{
  coex_wifi_pta_forece_enable(1);
  return;
}



void cmd_wifi_coex_pti_force_off(char *buf,int len,int argc,char **argv)

{
  coex_wifi_pti_forece_enable(0);
  return;
}



void cmd_wifi_coex_pti_force_on(char *buf,int len,int argc,char **argv)

{
  coex_wifi_pti_forece_enable(1);
  return;
}



void cmd_wifi_coex_rf_force_off(char *buf,int len,int argc,char **argv)

{
  coex_wifi_rf_forece_enable(0);
  return;
}



void cmd_wifi_coex_rf_force_on(char *buf,int len,int argc,char **argv)

{
  coex_wifi_rf_forece_enable(1);
  return;
}



void cmd_wifi_mib(char *buf,int len,int argc,char **argv)

{
  hal_mib_dump();
  utils_hexdump(*argv,0x1e);
  return;
}



void cmd_wifi_cfg(char *buf,int len,int argc,char **argv)

{
  uint uVar1;
  uint32_t task;
  int iVar2;
  uint32_t ops;
  uint32_t length;
  uint32_t *buf_00;
  uint32_t element;
  uint32_t type;
  uint32_t uStack88;
  uint32_t val [1];
  getopt_env_t getopt_env;
  
  type = 0;
  utils_getopt_init((getopt_env_t *)val,0);
  element = 0;
  task = 0;
  uVar1 = 4;
  while (iVar2 = utils_getopt((getopt_env_t *)val,argc,argv,":c:T:e:t:v:"), iVar2 != -1) {
    if (iVar2 == 99) {
      iVar2 = strcmp("dump",(char *)val);
      if (iVar2 == 0) {
        uVar1 = 3;
      }
      else {
        iVar2 = strcmp("set",(char *)val);
        if (iVar2 == 0) {
          uVar1 = 0;
        }
        else {
          iVar2 = strcmp("get",(char *)val);
          if (iVar2 == 0) {
            uVar1 = 1;
          }
          else {
            iVar2 = strcmp("reset",(char *)val);
            if (iVar2 == 0) {
              uVar1 = 2;
            }
          }
        }
      }
    }
    else {
      if (iVar2 < 100) {
        if (iVar2 == 0x3f) {
          printf("%s: unknown option %c\r\n",*argv,getopt_env.opterr);
          return;
        }
        if (iVar2 == 0x54) {
          type = atoi((char *)val);
        }
      }
      else {
        if (iVar2 == 0x74) {
          task = atoi((char *)val);
        }
        else {
          if (iVar2 == 0x76) {
            uStack88 = atoi((char *)val);
          }
          else {
            if (iVar2 == 0x65) {
              element = atoi((char *)val);
            }
          }
        }
      }
    }
  }
  printf("Target CFG Element Info, task: %lu, element %lu, type %lu, val %lu\r\n",task,element,type,
         uStack88);
  if (uVar1 == 2) {
    printf("    OPS: %s\r\n","reset");
    buf_00 = (uint32_t *)0x0;
    length = 0;
    type = 0;
    ops = 2;
  }
  else {
    if (uVar1 < 3) {
      if (uVar1 == 1) {
        printf("    OPS: %s\r\n",0x2308276c);
        buf_00 = &uStack88;
        length = 4;
        ops = 1;
        goto LAB_230278a4;
      }
    }
    else {
      if (uVar1 == 3) {
        printf("    OPS: %s\r\n",0x23082780);
        buf_00 = (uint32_t *)0x0;
        length = 0;
        type = 0;
        element = 0;
        task = 0;
        ops = 3;
        goto LAB_230278a4;
      }
      if (uVar1 == 4) {
        printf("UNKNOWN OPS\r\n");
        return;
      }
    }
    printf("    OPS: %s\r\n",0x23082744);
    buf_00 = &uStack88;
    length = 4;
    ops = 0;
  }
LAB_230278a4:
  wifi_mgmr_cfg_req(ops,task,element,type,length,buf_00);
  return;
}



void cmd_wifi_ap_stop(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_ap_stop((wifi_interface_t *)0x0);
  printf("--->>> cmd_wifi_ap_stop\r\n");
  return;
}



// WARNING: Variable defined which should be unmapped: ssid_name

void cmd_wifi_ap_start(char *buf,int len,int argc,char **argv)

{
  wifi_interface_t *interface;
  uint hidden_ssid;
  char *passwd;
  int channel;
  uint8_t auStack56 [3];
  byte bStack53;
  uint8_t mac [6];
  char ssid_name [32];
  
  memset(auStack56,0,6);
  bl_wifi_mac_addr_get(auStack56);
  memset(mac + 4,0,0x20);
  snprintf((char *)(mac + 4),0x20,"BL60X_uAP_%02X%02X%02X",(uint)bStack53,(uint)mac[0],(uint)mac[1])
  ;
  interface = (wifi_interface_t *)wifi_mgmr_ap_enable();
  if (argc == 1) {
    channel = 1;
    passwd = (char *)0x0;
    hidden_ssid = 0;
  }
  else {
    channel = atoi(argv[1]);
    if (10 < channel - 1U) {
      return;
    }
    passwd = "12345678";
    hidden_ssid = (uint)(argc == 3);
  }
  wifi_mgmr_ap_start(interface,(char *)(mac + 4),hidden_ssid,passwd,channel);
  return;
}



void wifi_sniffer_off_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_sniffer_disable();
  wifi_mgmr_sniffer_unregister((void *)0x0);
  return;
}



void wifi_sniffer_on_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_sniffer_enable();
  wifi_mgmr_sniffer_register((void *)0x0,sniffer_cb);
  return;
}



