pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int wifi_denoise_disable_cmd(void)

{
  WIFI_MGMR_EVENT_T WStack32;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  undefined uStack28;
  undefined uStack27;
  undefined uStack26;
  undefined uStack25;
  undefined uStack24;
  undefined uStack23;
  undefined uStack22;
  undefined uStack21;
  undefined uStack20;
  
  memset(&WStack32,0,0xd);
  WStack32 = WIFI_MGMR_EVENT_APP_DENOISE;
  uStack27 = 0x88;
  uStack26 = 0x77;
  uStack25 = 0x66;
  uStack24 = 0x55;
  uStack31 = 0;
  uStack30 = 0;
  uStack29 = 0;
  uStack28 = 0;
  uStack23 = 0xd;
  uStack22 = 0;
  uStack21 = 0;
  uStack20 = 0;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack32);
  return 0;
}



int wifi_denoise_enable_cmd(void)

{
  WIFI_MGMR_EVENT_T WStack32;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  undefined uStack28;
  undefined uStack27;
  undefined uStack26;
  undefined uStack25;
  undefined uStack24;
  undefined uStack23;
  undefined uStack22;
  undefined uStack21;
  undefined uStack20;
  
  memset(&WStack32,0,0xd);
  WStack32 = WIFI_MGMR_EVENT_APP_DENOISE;
  uStack31 = 1;
  uStack27 = 0x88;
  uStack26 = 0x77;
  uStack25 = 0x66;
  uStack24 = 0x55;
  uStack30 = 0;
  uStack29 = 0;
  uStack28 = 0;
  uStack23 = 0xd;
  uStack22 = 0;
  uStack21 = 0;
  uStack20 = 0;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack32);
  return 0;
}



void wifi_power_saving_off_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_sta_powersaving(0);
  return;
}



void wifi_power_saving_on_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_sta_powersaving(2);
  return;
}



void wifi_rc_fixed_disable(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_rate_config(0xffff);
  return;
}



int wifi_disable_autoreconnect_cmd(void)

{
  wifi_mgmr_api_disable_autoreconnect();
  return 0;
}



int wifi_enable_autoreconnect_cmd(void)

{
  wifi_mgmr_api_enable_autoreconnect();
  return 0;
}



void wifi_disconnect_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_sta_disconnect();
  vTaskDelay(1000);
  wifi_mgmr_sta_disable((wifi_interface_t *)0x0);
  return;
}



int wifi_sta_ip_unset_cmd(void)

{
  int iVar1;
  
  iVar1 = wifi_mgmr_sta_ip_set(0,0,0,0,0);
  return iVar1;
}



// WARNING: Could not reconcile some variable overlaps

void wifi_sta_ip_info(char *buf,int len,int argc,char **argv)

{
  char *pcVar1;
  ip4_addr_t iStack80;
  ip4_addr_t ip;
  ip4_addr_t gw;
  ip4_addr_t mask;
  ip4_addr_t dns1;
  ip4_addr_t dns2;
  int rssi;
  int8_t power_rate_table [38];
  
  wifi_mgmr_sta_ip_get((uint32_t *)&iStack80,(uint32_t *)&ip,(uint32_t *)&gw);
  wifi_mgmr_sta_dns_get((uint32_t *)&mask,(uint32_t *)&dns1);
  wifi_mgmr_rssi_get((int *)&dns2);
  bl_tpc_power_table_get((int8_t *)&rssi);
  printf("RSSI:   %ddbm\r\n",dns2);
  pcVar1 = ip4addr_ntoa(&iStack80);
  printf("IP  :   %s \r\n",pcVar1);
  pcVar1 = ip4addr_ntoa(&gw);
  printf("MASK:   %s \r\n",pcVar1);
  pcVar1 = ip4addr_ntoa(&ip);
  printf("GW  :   %s \r\n",pcVar1);
  pcVar1 = ip4addr_ntoa(&mask);
  printf("DNS1:   %s \r\n",pcVar1);
  pcVar1 = ip4addr_ntoa(&dns1);
  printf("DNS2:   %s \r\n",pcVar1);
  puts("Power Table (dbm):\r\n");
  puts("--------------------------------\r\n");
  printf("  11b: %u %u %u %u             (1Mbps 2Mbps 5.5Mbps 11Mbps)\r\n",(int)(char)rssi,
         (int)rssi._1_1_,(int)rssi._2_1_,(int)rssi._3_1_);
  printf(
         "  11g: %u %u %u %u %u %u %u %u (6Mbps 9Mbps 12Mbps 18Mbps 24Mbps 36Mbps 48Mbps 54Mbps)\r\n"
         ,(int)power_rate_table[4],(int)power_rate_table[5],(int)power_rate_table[6],
         (int)power_rate_table[7],(int)power_rate_table[8],(int)power_rate_table[9],
         (int)power_rate_table[10]);
  printf("  11n: %u %u %u %u %u %u %u %u (MCS0 ~ MCS7)\r\n",(int)power_rate_table[12],
         (int)power_rate_table[13],(int)power_rate_table[14],(int)power_rate_table[15],
         (int)power_rate_table[16],(int)power_rate_table[17],(int)power_rate_table[18]);
  puts("--------------------------------\r\n");
  return;
}



void cmd_wifi_raw_send(char *buf,int len,int argc,char **argv)

{
  uint32_t seq;
  char *__s;
  int iVar1;
  
  iVar1 = seq << 4;
  packet_raw[22] = (uint8_t)iVar1;
  seq = seq + 1;
  packet_raw[23] = (uint8_t)((uint)iVar1 >> 8);
  iVar1 = wifi_mgmr_raw_80211_send(packet_raw,0x18);
  if (iVar1 == 0) {
    __s = "Raw send succeed\r\n";
  }
  else {
    __s = "Raw send failed\r\n";
  }
  puts(__s);
  return;
}



void wifi_scan_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_mgmr_scan((void *)0x0,(scan_complete_cb_t *)0x0);
  return;
}



void sniffer_cb(void *env,uint8_t *pkt,int len)

{
  TickType_t TVar1;
  
  sniffer_counter_5067 = sniffer_counter_5067 + 1;
  TVar1 = xTaskGetTickCount();
  if (10000 < (int)(TVar1 - last_tick_5069)) {
    last_tick_5069 = xTaskGetTickCount();
  }
  return;
}



void cmd_wifi_dump(char *buf,int len,int argc,char **argv)

{
  if (argc < 2) {
    puts("[CLI] Dump statistic use normal mode\r\n");
    vTaskEnterCritical();
  }
  else {
    puts("[CLI] Dump statistic use forced mode\r\n");
    vTaskEnterCritical();
  }
  bl60x_fw_dump_statistic((uint)(argc >= 2));
  vTaskExitCritical();
  return;
}



void cmd_wifi_ap_conf_max_sta(char *buf,int len,int argc,char **argv)

{
  int iVar1;
  
  if (argc != 2) {
    printf("Usage: wifi_ap_max_sta [num]\r\n");
    return;
  }
  iVar1 = atoi(argv[1]);
  printf("Conf Max Sta to %d\r\n",iVar1);
  wifi_mgmr_conf_max_sta((uint8_t)iVar1);
  return;
}



void wifi_mon_cmd(char *buf,int len,int argc,char **argv)

{
  if (1 < argc) {
    wifi_mgmr_sniffer_enable();
    return;
  }
  wifi_mgmr_sniffer_register((void *)0x0,sniffer_cb);
  return;
}



void wifi_rc_fixed_enable(char *buf,int len,int argc,char **argv)

{
  uint uVar1;
  uint uVar2;
  uint uVar3;
  char *pcVar4;
  uint uVar5;
  
  if (argc != 4) {
    printf("rc_fix_en [b/g/n] [MCS] [GI]");
    return;
  }
  uVar1 = atoi(argv[1]);
  uVar5 = uVar1 & 0xff;
  uVar2 = atoi(argv[2]);
  uVar3 = atoi(argv[3]);
  if (uVar5 == 1) {
    pcVar4 = "n mode";
  }
  else {
    pcVar4 = "b/g mdoe";
  }
  printf("wifi set mode:%s, mcs:%d, gi:%d\r\n",pcVar4,uVar2 & 0xff,uVar3 & 0xff);
  if (uVar5 == 1) {
    uVar1 = ((uVar1 & 0xff) << 0xc | (uVar3 & 0xff) << 9) & 0xffff | uVar2 & 0xff;
  }
  else {
    uVar1 = 0;
    if (uVar5 == 0) {
      uVar1 = uVar2 & 0xff | 0x600;
    }
  }
  printf("wifi rc:0x%x\r\n",uVar1);
  wifi_mgmr_rate_config((uint16_t)uVar1);
  return;
}



void wifi_connect_cmd(char *buf,int len,int argc,char **argv)

{
  wifi_interface_t *wifi_interface;
  
  if (argc != 3) {
    printf("[USAGE]: %s [ssid] [password]\r\n",*argv);
    return;
  }
  wifi_interface = (wifi_interface_t *)wifi_mgmr_sta_enable();
  wifi_mgmr_sta_connect(wifi_interface,argv[1],argv[2],(char *)0x0,(uint8_t *)0x0,'\0',0);
  return;
}



