pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void wifi_sta_ip_set_cmd(char *buf,int len,int argc,char **argv)

{
  ip4_addr_t ip;
  ip4_addr_t mask;
  ip4_addr_t gw;
  ip4_addr_t dns1;
  ip4_addr_t dns2;
  ip4_addr_t iStack56;
  ip4_addr_t addr;
  char addr_str [20];
  
  if (argc == 6) {
    ip = (ip4_addr_t)ipaddr_addr(argv[1]);
    mask = (ip4_addr_t)ipaddr_addr(argv[2]);
    gw = (ip4_addr_t)ipaddr_addr(argv[3]);
    dns1 = (ip4_addr_t)ipaddr_addr(argv[4]);
    dns2 = (ip4_addr_t)ipaddr_addr(argv[5]);
    iStack56 = ip;
    ip4addr_ntoa_r(&iStack56,(char *)&addr,0x14);
    puts("IP  : ");
    puts((char *)&addr);
    puts("\r\n");
    iStack56 = mask;
    ip4addr_ntoa_r(&iStack56,(char *)&addr,0x14);
    puts("MASK: ");
    puts((char *)&addr);
    puts("\r\n");
    iStack56 = gw;
    ip4addr_ntoa_r(&iStack56,(char *)&addr,0x14);
    puts("GW  : ");
    puts((char *)&addr);
    puts("\r\n");
    iStack56 = dns1;
    ip4addr_ntoa_r(&iStack56,(char *)&addr,0x14);
    puts("DNS1: ");
    puts((char *)&addr);
    puts("\r\n");
    iStack56 = dns2;
    ip4addr_ntoa_r(&iStack56,(char *)&addr,0x14);
    puts("DNS2: ");
    puts((char *)&addr);
    puts("\r\n");
    wifi_mgmr_sta_ip_set((uint32_t)ip,(uint32_t)mask,(uint32_t)gw,(uint32_t)dns1,(uint32_t)dns2);
  }
  else {
    puts("Illegal CMD format\r\n");
  }
  return;
}



void wifi_scan_filter_cmd(char *buf,int len,int argc,char **argv)

{
  if (argc == 2) {
    wifi_mgmr_scan_filter_hidden_ssid((uint)(*argv[1] == '1'));
    return;
  }
  return;
}



void wifi_capcode_cmd(char *buf,int len,int argc,char **argv)

{
  uint8_t uVar1;
  char *__format;
  undefined3 extraout_var;
  int iVar2;
  char *pcVar3;
  
  if (argc - 1U < 2) {
    if (argc != 1) {
      iVar2 = atoi(argv[1]);
      printf("Setting capcode to %d\r\n",iVar2);
      if (0 < iVar2) {
        hal_sys_capcode_update((uint8_t)iVar2,(uint8_t)iVar2);
        return;
      }
      return;
    }
    uVar1 = hal_sys_capcode_get();
    pcVar3 = (char *)CONCAT31(extraout_var,uVar1);
    __format = "Capcode %u is being used\r\n";
  }
  else {
    pcVar3 = *argv;
    __format = "Usage: %s capcode\r\n";
  }
  printf(__format,pcVar3);
  return;
}



int wifi_mgmr_cli_scanlist(void)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  byte bVar4;
  byte bVar5;
  byte bVar6;
  wifi_mgmr_t *pwVar7;
  int iVar8;
  TickType_t TVar9;
  
  printf("cached scan list\r\n");
  pwVar7 = &wifiMgmr;
  printf(
        "****************************************************************************************************\r\n"
        );
  iVar8 = 0;
  do {
    if (pwVar7->scan_items[0].is_used == '\0') {
LAB_2302810e:
      printf("index[%02d]: empty\r\n",iVar8);
    }
    else {
      TVar9 = xTaskGetTickCount();
      if ((uint)wifiMgmr.scan_item_timeout <= TVar9 - pwVar7->scan_items[0].timestamp_lastseen)
      goto LAB_2302810e;
      bVar1 = pwVar7->scan_items[0].channel;
      bVar2 = pwVar7->scan_items[0].bssid[0];
      bVar3 = pwVar7->scan_items[0].bssid[1];
      bVar4 = pwVar7->scan_items[0].bssid[2];
      bVar5 = pwVar7->scan_items[0].bssid[3];
      bVar6 = pwVar7->scan_items[0].bssid[4];
      wifi_mgmr_auth_to_str(pwVar7->scan_items[0].auth);
      wifi_mgmr_cipher_to_str(pwVar7->scan_items[0].cipher);
      printf(
             "index[%02d]: channel %02u, bssid %02X:%02X:%02X:%02X:%02X:%02X, rssi %3d, ppm abs:rel %3d : %3d, auth %20s, cipher:%12s, SSID %s\r\n"
             ,iVar8,(uint)bVar1,(uint)bVar2,(uint)bVar3,(uint)bVar4,(uint)bVar5,(uint)bVar6);
    }
    iVar8 = iVar8 + 1;
    pwVar7 = (wifi_mgmr_t *)&(pwVar7->wlan_sta).netif.input;
    if (iVar8 == 0x32) {
      printf(
            "----------------------------------------------------------------------------------------------------\r\n"
            );
      return 0;
    }
  } while( true );
}



int wifi_mgmr_ext_dump_needed(void)

{
  bool bVar1;
  
  bVar1 = 0 < pkt_counter;
  if (bVar1) {
    pkt_counter = pkt_counter + -1;
  }
  return (uint)bVar1;
}



int wifi_mgmr_cli_init(void)

{
  return 0;
}



int mac_is_unvalid(uint8_t *mac)

{
  int iVar1;
  
  iVar1 = 1;
  do {
    if (mac[iVar1] != *mac) {
      return 0;
    }
    iVar1 = iVar1 + 1;
  } while (iVar1 != 6);
  return (uint)((byte)(*mac - 1) < 0xfe) ^ 1;
}



int wifi_mgmr_psk_cal(char *password,char *ssid,int ssid_len,char *output)

{
  int iVar1;
  uchar auStack48 [4];
  char psk [32];
  
  iVar1 = bl60x_fw_password_hash(password,(uchar *)ssid,ssid_len,auStack48);
  if (iVar1 == 0) {
    utils_bin2hex(output,auStack48,0x20);
  }
  return iVar1;
}



int wifi_mgmr_drv_init(wifi_conf_t *conf)

{
  bl606a0_wifi_init(conf);
  wifi_mgmr_api_set_country_code((char *)conf);
  wifi_mgmr_init();
  wifi_mgmr_api_ifaceup();
  return 0;
}



// WARNING: Variable defined which should be unmapped: gw

wifi_interface_t wifi_mgmr_sta_enable(void)

{
  int done;
  int iVar1;
  ip4_addr_t iStack28;
  ip4_addr_t ipaddr;
  ip4_addr_t netmask;
  ip4_addr_t gw;
  
  if (done == 1) {
    printf("----- BUG FIXME? NOT do STA enable again\r\n");
  }
  else {
    done = 1;
    printf("---------STA enable\r\n");
    wifiMgmr.wlan_sta.mode = 0;
    iStack28 = (ip4_addr_t)0x0;
    ipaddr = 0;
    netmask = 0;
    memcpy(wifiMgmr.wlan_sta.netif.hwaddr,wifiMgmr.wlan_sta.mac,6);
    iVar1 = mac_is_unvalid(wifiMgmr.wlan_sta.netif.hwaddr);
    if (iVar1 != 0) {
      bl_wifi_mac_addr_get(wifiMgmr.wlan_sta.netif.hwaddr);
      iVar1 = mac_is_unvalid(wifiMgmr.wlan_sta.netif.hwaddr);
      if (iVar1 != 0) {
        wifiMgmr.wlan_sta.netif.hwaddr._0_2_ = 0x50c0;
        wifiMgmr.wlan_sta.netif.hwaddr._2_4_ = 0x100c943;
      }
      memcpy(wifiMgmr.wlan_sta.mac,wifiMgmr.wlan_sta.netif.hwaddr,6);
    }
    netifapi_netif_add((netif *)&wifiMgmr.wlan_sta.netif,&iStack28,&ipaddr,&netmask,(void *)0x0,
                       bl606a0_wifi_netif_init,tcpip_input);
    wifiMgmr.wlan_sta.netif.name = 0x7473;
    wifiMgmr.wlan_sta.netif.flags = wifiMgmr.wlan_sta.netif.flags | 0x24;
    netif_set_default((netif *)&wifiMgmr.wlan_sta.netif);
    netif_set_up((netif *)&wifiMgmr.wlan_sta.netif);
  }
  return &wifiMgmr.wlan_sta;
}



int wifi_mgmr_sta_disable(wifi_interface_t *interface)

{
  wifi_mgmr_api_idle();
  return 0;
}



int wifi_mgmr_sta_ip_get(uint32_t *ip,uint32_t *gw,uint32_t *mask)

{
  *ip = wifiMgmr.wlan_sta.netif.ip_addr;
  *mask = wifiMgmr.wlan_sta.netif.netmask;
  *gw = wifiMgmr.wlan_sta.netif.gw;
  return 0;
}



int wifi_mgmr_sta_dns_get(uint32_t *dns1,uint32_t *dns2)

{
  ip_addr_t *piVar1;
  
  piVar1 = dns_getserver('\0');
  *dns1 = piVar1->addr;
  piVar1 = dns_getserver('\x01');
  *dns2 = piVar1->addr;
  return 0;
}



int wifi_mgmr_sta_ip_set(uint32_t ip,uint32_t mask,uint32_t gw,uint32_t dns1,uint32_t dns2)

{
  vTaskEnterCritical();
  wifiMgmr.wlan_sta.ipv4.ip = ip;
  wifiMgmr.wlan_sta.ipv4.mask = mask;
  wifiMgmr.wlan_sta.ipv4.gw = gw;
  wifiMgmr.wlan_sta.ipv4.dns1 = dns1;
  wifiMgmr.wlan_sta.ipv4.dns2 = dns2;
  vTaskExitCritical();
  wifi_mgmr_api_ip_update();
  return 0;
}



int wifi_mgmr_sta_ip_unset(void)

{
  int iVar1;
  
  iVar1 = wifi_mgmr_sta_ip_set(0,0,0,0,0);
  return iVar1;
}



int wifi_mgmr_sta_disconnect(void)

{
  wifi_mgmr_api_disconnect();
  return 0;
}



int wifi_mgmr_sta_powersaving(int ps)

{
  if ((ps == 1) || (ps == 2)) {
    wifi_mgmr_api_fw_powersaving(ps);
    ps = 0;
  }
  else {
    if (ps == 0) {
      wifi_mgmr_api_fw_powersaving(0);
    }
    else {
      ps = -1;
    }
  }
  return ps;
}



