pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int wifi_mgmr_sta_autoconnect_enable(void)

{
  wifi_mgmr_api_enable_autoreconnect();
  return 0;
}



int wifi_mgmr_sta_autoconnect_disable(void)

{
  wifi_mgmr_api_disable_autoreconnect();
  return 0;
}



void wifi_mgmr_sta_ssid_set(char *ssid)

{
  size_t __n;
  
  __n = strlen(ssid);
  if (__n != 0) {
    __n = strlen(ssid);
    memcpy(wifiMgmr.wifi_mgmr_stat_info.ssid,ssid,__n);
    return;
  }
  return;
}



void wifi_mgmr_sta_psk_set(char *psk)

{
  size_t __n;
  
  __n = strlen(psk);
  if (__n != 0) {
    __n = strlen(psk);
    memcpy(wifiMgmr.wifi_mgmr_stat_info.psk,psk,__n);
    return;
  }
  return;
}



int wifi_mgmr_sta_connect
              (wifi_interface_t *wifi_interface,char *ssid,char *psk,char *pmk,uint8_t *mac,
              uint8_t band,uint16_t freq)

{
  int iVar1;
  
  wifi_mgmr_sta_ssid_set(ssid);
  wifi_mgmr_sta_psk_set(psk);
  iVar1 = wifi_mgmr_api_connect(ssid,psk,pmk,mac,band,freq);
  return iVar1;
}



// WARNING: Variable defined which should be unmapped: gw

wifi_interface_t wifi_mgmr_ap_enable(void)

{
  int iVar1;
  ip4_addr_t iStack28;
  ip4_addr_t ipaddr;
  ip4_addr_t netmask;
  ip4_addr_t gw;
  
  wifiMgmr.wlan_ap.mode = 1;
  iStack28 = (ip4_addr_t)0x10ba8c0;
  ipaddr = 0xffffff;
  netmask = 0;
  memcpy(wifiMgmr.wlan_ap.netif.hwaddr,wifiMgmr.wlan_ap.mac,6);
  iVar1 = mac_is_unvalid(wifiMgmr.wlan_ap.netif.hwaddr);
  if (iVar1 != 0) {
    bl_wifi_mac_addr_get(wifiMgmr.wlan_ap.netif.hwaddr);
    iVar1 = mac_is_unvalid(wifiMgmr.wlan_ap.netif.hwaddr);
    if (iVar1 != 0) {
      wifiMgmr.wlan_ap.netif.hwaddr._0_2_ = 0x50c0;
      wifiMgmr.wlan_ap.netif.hwaddr._2_4_ = 0x100c943;
    }
    memcpy(wifiMgmr.wlan_ap.mac,wifiMgmr.wlan_ap.netif.hwaddr,6);
  }
  netifapi_netif_add((netif *)&wifiMgmr.wlan_ap.netif,&iStack28,&ipaddr,&netmask,(void *)0x0,
                     bl606a0_wifi_netif_init,tcpip_input);
  wifiMgmr.wlan_ap.netif.name = 0x7061;
  netif_set_default((netif *)&wifiMgmr.wlan_ap.netif);
  netif_set_up((netif *)&wifiMgmr.wlan_ap.netif);
  return &wifiMgmr.wlan_ap;
}



int wifi_mgmr_ap_start(wifi_interface_t *interface,char *ssid,int hidden_ssid,char *passwd,
                      int channel)

{
  wifi_mgmr_api_ap_start(ssid,passwd,channel,(uint8_t)hidden_ssid);
  return 0;
}



int wifi_mgmr_ap_stop(wifi_interface_t *interface)

{
  wifi_mgmr_api_ap_stop();
  return 0;
}



int wifi_mgmr_ap_sta_cnt_get(uint8_t *sta_cnt)

{
  wifi_mgmr_ap_sta_cnt_get_internal(sta_cnt);
  return 0;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

int wifi_mgmr_ap_sta_info_get(wifi_sta_basic_info *sta_info,uint8_t idx)

{
  undefined2 uStack40;
  wifi_mgmr_sta_basic_info sta_info_internal;
  
  memset(&uStack40,0,0x18);
  wifi_mgmr_ap_sta_info_get_internal((wifi_mgmr_sta_basic_info_t *)&uStack40,idx);
  *(undefined2 *)sta_info = uStack40;
  sta_info->rssi = sta_info_internal.tsflo;
  sta_info->tsflo = sta_info_internal.tsfhi;
  sta_info->tsfhi = sta_info_internal.sta_mac._2_4_;
  sta_info->data_rate = (uint8_t)sta_info_internal.rssi;
  memcpy(sta_info->sta_mac,&uStack40 + 1,6);
  return 0;
}



int wifi_mgmr_ap_sta_delete(uint8_t sta_idx)

{
  wifi_mgmr_ap_sta_delete_internal(sta_idx);
  return 0;
}



int wifi_mgmr_sniffer_register(void *env,sniffer_cb_t *cb)

{
  bl_rx_pkt_cb_register(env,(wifi_event_pkt_cb_t *)cb);
  return 0;
}



int wifi_mgmr_sniffer_unregister(void *env)

{
  bl_rx_pkt_cb_unregister(env);
  return 0;
}



int wifi_mgmr_sniffer_enable(void)

{
  wifi_mgmr_api_sniffer_enable();
  return 0;
}



int wifi_mgmr_sniffer_disable(void)

{
  wifi_mgmr_api_idle();
  return 0;
}



int wifi_mgmr_rate_config(uint16_t config)

{
  WIFI_MGMR_EVENT_T WStack32;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  undefined uStack28;
  undefined uStack27;
  undefined uStack26;
  undefined uStack25;
  undefined uStack24;
  undefined uStack23;
  undefined uStack22;
  undefined uStack21;
  undefined uStack20;
  
  memset(&WStack32,0,0xd);
  WStack32 = WIFI_MGMR_EVENT_APP_RC_CONFIG;
  uStack27 = 0x88;
  uStack26 = 0x77;
  uStack25 = 0x66;
  uStack31 = (undefined)config;
  uStack24 = 0x55;
  uStack30 = (undefined)(config >> 8);
  uStack29 = 0;
  uStack28 = 0;
  uStack23 = 0xd;
  uStack22 = 0;
  uStack21 = 0;
  uStack20 = 0;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack32);
  return 0;
}



int wifi_mgmr_conf_max_sta(uint8_t max_sta_supported)

{
  WIFI_MGMR_EVENT_T WStack32;
  uint8_t uStack31;
  undefined uStack30;
  undefined uStack29;
  undefined uStack28;
  undefined uStack27;
  undefined uStack26;
  undefined uStack25;
  undefined uStack24;
  undefined uStack23;
  undefined uStack22;
  undefined uStack21;
  undefined uStack20;
  
  memset(&WStack32,0,0xd);
  WStack32 = WIFI_MGMR_EVENT_APP_CONF_MAX_STA;
  uStack27 = 0x88;
  uStack26 = 0x77;
  uStack25 = 0x66;
  uStack24 = 0x55;
  uStack30 = 0;
  uStack29 = 0;
  uStack28 = 0;
  uStack23 = 0xd;
  uStack22 = 0;
  uStack21 = 0;
  uStack20 = 0;
  uStack31 = max_sta_supported;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack32);
  return 0;
}



int wifi_mgmr_state_get(int *state)

{
  uint16_t uVar1;
  int iVar2;
  
  uVar1 = wifiMgmr.wifi_mgmr_stat_info.status_code;
  if (wifiMgmr.m.currentState == &stateIdle) {
    if (wifiMgmr.inf_ap_enabled != 0) {
      iVar2 = 0x11;
      goto LAB_230262ac;
    }
    iVar2 = 1;
  }
  else {
    if (wifiMgmr.m.currentState == &stateConnecting) {
      if (wifiMgmr.inf_ap_enabled != 0) {
        iVar2 = 0x12;
        goto LAB_230262ac;
      }
      iVar2 = 2;
    }
    else {
      if (wifiMgmr.m.currentState == &stateConnectedIPNo) {
        if (wifiMgmr.inf_ap_enabled == 0) {
          iVar2 = 3;
        }
        else {
          iVar2 = 0x13;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.m.currentState == &stateConnectedIPYes) {
        if (wifiMgmr.inf_ap_enabled == 0) {
          iVar2 = 4;
        }
        else {
          iVar2 = 0x14;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.m.currentState != &stateDisconnect) {
        if (wifiMgmr.m.currentState == &stateIfaceDown) {
          iVar2 = 6;
        }
        else {
          if (wifiMgmr.m.currentState != &stateSniffer) {
            *state = 0;
            return 0;
          }
          iVar2 = 7;
        }
        goto LAB_230262ac;
      }
      if (wifiMgmr.inf_ap_enabled != 0) {
        iVar2 = 0x15;
        goto LAB_230262ac;
      }
      iVar2 = 5;
    }
  }
  *state = iVar2;
  if (uVar1 == 8) {
    iVar2 = 8;
  }
  else {
    if (uVar1 != 0xc) {
      return 0;
    }
    iVar2 = 9;
  }
LAB_230262ac:
  *state = iVar2;
  return 0;
}



int wifi_mgmr_rssi_get(int *rssi)

{
  *rssi = (int)wifiMgmr.wlan_sta.field_5;
  return 0;
}



int wifi_mgmr_raw_80211_send(uint8_t *pkt,int len)

{
  if (len < 0x1e1) {
    wifi_mgmr_api_raw_send(pkt,len);
    return 0;
  }
  return -1;
}



int wifi_mgmr_scan(void *data,scan_complete_cb_t *cb)

{
  scan_cb = cb;
  scan_data = data;
  wifi_mgmr_api_fw_scan();
  return 0;
}



