pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int wifi_mgmr_cfg_req(uint32_t ops,uint32_t task,uint32_t element,uint32_t type,uint32_t length,
                     uint32_t *buf)

{
  int iVar1;
  WIFI_MGMR_EVENT_T WStack100;
  undefined uStack99;
  undefined uStack98;
  undefined uStack97;
  undefined uStack96;
  undefined uStack95;
  undefined uStack94;
  undefined uStack93;
  undefined uStack92;
  undefined uStack91;
  undefined uStack90;
  undefined uStack89;
  undefined uStack88;
  undefined uStack87;
  undefined uStack86;
  undefined uStack85;
  undefined uStack84;
  undefined uStack83;
  undefined uStack82;
  undefined uStack81;
  undefined uStack80;
  undefined uStack79;
  undefined uStack78;
  undefined uStack77;
  undefined uStack76;
  undefined uStack75;
  undefined uStack74;
  undefined uStack73;
  undefined uStack72;
  undefined uStack71;
  undefined uStack70;
  undefined uStack69;
  undefined uStack68;
  undefined auStack67 [39];
  
  if (length < 0x21) {
    memset(&WStack100,0,0x41);
    WStack100 = WIFI_MGMR_EVENT_FW_CFG_REQ;
    uStack99 = 0x44;
    uStack98 = 0x33;
    uStack97 = 0x22;
    uStack96 = 0x11;
    uStack95 = 0x88;
    uStack94 = 0x77;
    iVar1 = length + 0xc6;
    uStack93 = 0x66;
    uStack92 = 0x55;
    uStack90 = (undefined)((uint)iVar1 >> 8);
    uStack89 = (undefined)((uint)iVar1 >> 0x10);
    uStack86 = (undefined)(ops >> 8);
    uStack85 = (undefined)(ops >> 0x10);
    uStack82 = (undefined)(task >> 8);
    uStack81 = (undefined)(task >> 0x10);
    uStack78 = (undefined)(element >> 8);
    uStack77 = (undefined)(element >> 0x10);
    uStack74 = (undefined)(type >> 8);
    uStack73 = (undefined)(type >> 0x10);
    uStack91 = (undefined)iVar1;
    uStack87 = (undefined)ops;
    uStack83 = (undefined)task;
    uStack79 = (undefined)element;
    uStack75 = (undefined)type;
    uStack70 = (undefined)(length >> 8);
    uStack69 = (undefined)(length >> 0x10);
    uStack88 = (undefined)((uint)iVar1 >> 0x18);
    uStack84 = (undefined)(ops >> 0x18);
    uStack80 = (undefined)(task >> 0x18);
    uStack76 = (undefined)(element >> 0x18);
    uStack72 = (undefined)(type >> 0x18);
    uStack71 = (undefined)length;
    uStack68 = (undefined)(length >> 0x18);
    if (length != 0) {
      memcpy(auStack67,buf,length);
    }
    wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&WStack100);
    return 0;
  }
  return -1;
}



int wifi_mgmr_scan_filter_hidden_ssid(int filter)

{
  vTaskEnterCritical();
  if (filter == 0) {
    wifiMgmr.features = wifiMgmr.features | 1;
  }
  else {
    wifiMgmr.features = wifiMgmr.features & 0xfffffffe;
  }
  vTaskExitCritical();
  return 0;
}



int wifi_mgmr_scan_complete_callback(void)

{
  char "wifi_mgmr_scan_complete_callback" [33];
  undefined4 uStack20;
  int status;
  
  uStack20 = 0;
  printf("%s: scan complete\r\n","wifi_mgmr_scan_complete_callback");
  if (scan_cb != (scan_complete_cb_t *)0x0) {
    uStack20 = 1;
    (*scan_cb)(scan_data,&uStack20);
  }
  return 0;
}



char * wifi_mgmr_status_code_str(uint16_t status_code)

{
  undefined2 in_register_0000202a;
  
  if (CONCAT22(in_register_0000202a,status_code) < 0x11) {
    return *(char **)(CSWTCH_17 + CONCAT22(in_register_0000202a,status_code) * 4);
  }
  return "Unknown Status Code";
}



int wifi_mgmr_profile_add(wifi_mgmr_t *mgmr,wifi_mgmr_profile_msg_t *profile_msg,int index)

{
  wifi_mgmr_profile_t *__s;
  int iVar1;
  
  if (index == -1) {
    __s = mgmr->profiles;
    if (__s == (wifi_mgmr_profile_t *)0x0) {
      return -1;
    }
  }
  else {
    if (mgmr->profiles[0].isUsed == '\0') {
      iVar1 = 0;
    }
    else {
      if (mgmr->profiles[1].isUsed != '\0') {
        return -1;
      }
      iVar1 = 1;
    }
    mgmr->profile_active_index = iVar1;
    __s = mgmr->profiles + iVar1;
    printf("[WF][PF] Using free profile, idx is @%d\r\n");
  }
  memset(__s,0,0xc4);
  *(undefined2 *)&__s->isActive = 0x100;
  __s->ssid_len = profile_msg->ssid_len;
  __s->psk_len = profile_msg->psk_len;
  __s->pmk_len = profile_msg->pmk_len;
  __s->priority = -1;
  memcpy(__s,profile_msg,0x21);
  memcpy(__s->psk,profile_msg->psk,0x41);
  memcpy(__s->pmk,profile_msg->pmk,0x41);
  memcpy(__s->mac,profile_msg->mac,6);
  __s->dhcp_use = profile_msg->dhcp_use;
  return 0;
}



int wifi_mgmr_profile_get(wifi_mgmr_t *mgmr,wifi_mgmr_profile_msg_t *profile_msg)

{
  int iVar1;
  uint8_t *puVar2;
  undefined4 uVar3;
  
  if (mgmr->profiles[0].isUsed == '\x01') {
    iVar1 = 0;
  }
  else {
    iVar1 = 1;
    if (mgmr->profiles[1].isUsed != '\x01') {
      return -1;
    }
  }
  printf("[WF][PF] Using profile, idx is @%d\r\n",iVar1);
  memset(profile_msg,0,0xb9);
  puVar2 = &mgmr->ready + iVar1 * 0xc4;
  uVar3 = *(undefined4 *)(puVar2 + 0x114);
  *(char *)&profile_msg->ssid_len = (char)uVar3;
  *(undefined *)((int)&profile_msg->ssid_len + 1) = (char)((uint)uVar3 >> 8);
  *(undefined *)((int)&profile_msg->ssid_len + 2) = (char)((uint)uVar3 >> 0x10);
  *(undefined *)((int)&profile_msg->ssid_len + 3) = (char)((uint)uVar3 >> 0x18);
  uVar3 = *(undefined4 *)(puVar2 + 0x15c);
  *(char *)&profile_msg->psk_len = (char)uVar3;
  *(undefined *)((int)&profile_msg->psk_len + 1) = (char)((uint)uVar3 >> 8);
  *(undefined *)((int)&profile_msg->psk_len + 2) = (char)((uint)uVar3 >> 0x10);
  *(undefined *)((int)&profile_msg->psk_len + 3) = (char)((uint)uVar3 >> 0x18);
  uVar3 = *(undefined4 *)(puVar2 + 0x1a4);
  *(char *)&profile_msg->pmk_len = (char)uVar3;
  *(undefined *)((int)&profile_msg->pmk_len + 1) = (char)((uint)uVar3 >> 8);
  *(undefined *)((int)&profile_msg->pmk_len + 2) = (char)((uint)uVar3 >> 0x10);
  *(undefined *)((int)&profile_msg->pmk_len + 3) = (char)((uint)uVar3 >> 0x18);
  profile_msg->dhcp_use = puVar2[0x1ae];
  memcpy(profile_msg,mgmr->profiles + iVar1,0x21);
  memcpy(profile_msg->psk,mgmr->profiles[iVar1].psk,0x41);
  memcpy(profile_msg->pmk,mgmr->profiles[iVar1].pmk,0x41);
  memcpy(profile_msg->mac,mgmr->profiles[iVar1].mac,6);
  return 0;
}



int wifi_mgmr_profile_autoreconnect_is_enabled(wifi_mgmr_t *mgmr,int index)

{
  return (uint)(mgmr->disable_autoreconnect == '\0');
}



int wifi_mgmr_profile_autoreconnect_disable(wifi_mgmr_t *mgmr,int index)

{
  mgmr->disable_autoreconnect = '\x01';
  return 0;
}



int wifi_mgmr_profile_autoreconnect_enable(wifi_mgmr_t *mgmr,int index)

{
  mgmr->disable_autoreconnect = '\0';
  return 0;
}



int wifi_netif_dhcp_start(netif *netif)

{
  netifapi_netif_common(netif,(netifapi_void_fn)0x0,dhcp_start);
  return 0;
}



void cb_rssi_ind(void *env,int8_t rssi)

{
  wifiMgmr.wlan_sta.field_5 = rssi;
  return;
}



void cb_probe_resp_ind(void *env)

{
  printf("timestamp = 0x%llx\r\n");
  return;
}



void cb_beacon_ind(void *env,wifi_event_beacon_ind_conflict4 *ind)

{
  wifi_mgmr_api_scan_item_beacon
            (ind->channel,ind->rssi,ind->auth,(uint8_t *)ind,ind->ssid,ind->ssid_len,ind->ppm_abs,
             ind->ppm_rel,DAT_00000010);
  return;
}



