pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

void cb_disconnect_ind(void *env,wifi_event_sm_disconnect_ind *ind)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  wifi_mgmr_msg_t msg_wifi;
  
  memset(&local_20,0,0xd);
  printf("sending disconnect\r\n");
  local_20 = WIFI_MGMR_EVENT_FW_IND_DISCONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  msg_wifi.ev = WIFI_MGMR_EVENT_FW_CHANNEL_SET;
  msg_wifi.data1._0_1_ = 0x88;
  msg_wifi.data1._1_1_ = 0x77;
  msg_wifi.data1._2_1_ = 0x66;
  msg_wifi.data1._3_1_ = 0x55;
  msg_wifi.data2._0_1_ = 0xd;
  wifiMgmr.wifi_mgmr_stat_info.type_ind = '\x02';
  wifiMgmr.wifi_mgmr_stat_info.status_code = ind->reason_code;
  msg_wifi.data2._1_1_ = 0;
  msg_wifi.data2._2_1_ = 0;
  msg_wifi.data2._3_1_ = 0;
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return;
}



// WARNING: Could not reconcile some variable overlaps

void cb_connect_ind(void *env,wifi_event_sm_connect_ind *ind)

{
  WIFI_MGMR_EVENT_T local_20;
  undefined uStack31;
  undefined uStack30;
  undefined uStack29;
  wifi_mgmr_msg_t msg_wifi;
  
  memset(&local_20,0,0xd);
  local_20 = (ind->status_code == 0) + WIFI_MGMR_EVENT_FW_IND_DISCONNECT;
  uStack31 = 0x44;
  uStack30 = 0x33;
  uStack29 = 0x22;
  msg_wifi.ev = WIFI_MGMR_EVENT_FW_CHANNEL_SET;
  msg_wifi.data1._0_1_ = 0x88;
  msg_wifi.data1._1_1_ = 0x77;
  msg_wifi.data1._2_1_ = 0x66;
  msg_wifi.data1._3_1_ = 0x55;
  msg_wifi.data2._0_1_ = 0xd;
  msg_wifi.data2._1_1_ = 0;
  msg_wifi.data2._2_1_ = 0;
  msg_wifi.data2._3_1_ = 0;
  wifi_mgmr_set_connect_stat_info(ind,'\x01');
  wifi_mgmr_event_notify((wifi_mgmr_msg_t *)&local_20);
  return;
}



void cb_event_ind(void *env,wifi_event *event)

{
  int iVar1;
  uint16_t code;
  uint32_t uVar2;
  
  uVar2 = event->id;
  if (uVar2 == 1) {
    puts("[WIFI] [IND] SCAN Done\r\n");
    wifi_mgmr_scan_complete_notify();
    code = 9;
LAB_23028b2c:
    aos_post_event(2,code,0);
    return;
  }
  if (uVar2 == 0) {
    uVar2 = event[1].id;
    iVar1 = -400;
    wifiMgmr.channel = uVar2;
  }
  else {
    if (uVar2 == 2) {
      code = 10;
      goto LAB_23028b2c;
    }
    iVar1 = -0x154;
  }
  printf(" SKIP Notify for set Empty Address\r\n" + iVar1 + 0x20,uVar2);
  return;
}



int wifi_mgmr_event_init(void)

{
  bl_rx_sm_connect_ind_cb_register((void *)0x0,cb_connect_ind);
  bl_rx_sm_disconnect_ind_cb_register((void *)0x0,cb_disconnect_ind);
  bl_rx_beacon_ind_cb_register((void *)0x0,cb_beacon_ind);
  bl_rx_probe_resp_ind_cb_register((void *)0x0,cb_probe_resp_ind);
  bl_rx_rssi_cb_register((void *)0x0,cb_rssi_ind);
  bl_rx_event_register((void *)0x0,cb_event_ind);
  return 0;
}



void cmd_mgr_print(bl_cmd_mgr *cmd_mgr)

{
  list_head *plVar1;
  
  xQueueSemaphoreTake((QueueHandle_t)cmd_mgr->lock,0xffffffff);
  plVar1 = (cmd_mgr->cmds).next;
  while (plVar1 != &cmd_mgr->cmds) {
    plVar1 = plVar1->next;
  }
  xQueueGenericSend((QueueHandle_t)cmd_mgr->lock,(void *)0x0,0,0);
  return;
}



void cmd_complete(bl_cmd *cmd)

{
  ushort uVar1;
  int *in_a1;
  int iVar2;
  int *piVar3;
  
  (cmd->list).next = (list_head *)((int)&(cmd->list).next[-1].prev + 3);
  piVar3 = (int *)in_a1[1];
  iVar2 = *in_a1;
  *(int **)(iVar2 + 4) = piVar3;
  *piVar3 = iVar2;
  *in_a1 = 0x100100;
  in_a1[1] = 0x200200;
  uVar1 = *(ushort *)(in_a1 + 6);
  *(ushort *)(in_a1 + 6) = uVar1 | 0x20;
  if ((uVar1 & 1) != 0) {
    vPortFree(in_a1);
    return;
  }
  if ((uVar1 & 0x18) == 0) {
    in_a1[0xf] = 0;
    xEventGroupSetBits((EventGroupHandle_t)(in_a1 + 7),1);
    return;
  }
  return;
}



int cmd_mgr_msgind(bl_cmd_mgr *cmd_mgr,ipc_e2a_msg *msg,msg_cb_fct *cb)

{
  bool bVar1;
  bl_cmd *pbVar2;
  int iVar3;
  
  xQueueSemaphoreTake((QueueHandle_t)cmd_mgr->lock,0xffffffff);
  pbVar2 = (bl_cmd *)(cmd_mgr->cmds).next;
  do {
    if (pbVar2 == (bl_cmd *)&cmd_mgr->cmds) {
      bVar1 = false;
LAB_23028c80:
      xQueueGenericSend((QueueHandle_t)cmd_mgr->lock,(void *)0x0,0,0);
      if ((!bVar1) && (cb != (msg_cb_fct *)0x0)) {
        (*cb)((bl_hw *)&cmd_mgr[-1].drain,(bl_cmd *)0x0,msg);
      }
      return 0;
    }
    if (((pbVar2->reqid == msg->id) && ((pbVar2->flags & 0x10) != 0)) &&
       ((cb == (msg_cb_fct *)0x0 ||
        (iVar3 = (*cb)((bl_hw *)&cmd_mgr[-1].drain,pbVar2,msg), iVar3 == 0)))) {
      pbVar2->flags = pbVar2->flags & 0xffef;
      if ((pbVar2->e2a_msg != (char *)0x0) && (msg->param_len != 0)) {
        memcpy(pbVar2->e2a_msg,msg->param,(uint)msg->param_len);
      }
      bVar1 = true;
      if ((pbVar2->flags & 0x18) == 0) {
        cmd_complete((bl_cmd *)&cmd_mgr->queue_sz);
      }
      goto LAB_23028c80;
    }
    pbVar2 = (bl_cmd *)(pbVar2->list).next;
  } while( true );
}



int cmd_mgr_llind(bl_cmd_mgr *cmd_mgr,bl_cmd *cmd)

{
  ushort uVar1;
  char "cmd_mgr_llind" [14];
  bl_cmd *msg_buf;
  bl_cmd *pbVar2;
  _Bool __warned;
  
  xQueueSemaphoreTake((QueueHandle_t)cmd_mgr->lock,0xffffffff);
  msg_buf = (bl_cmd *)(cmd_mgr->cmds).next;
  pbVar2 = (bl_cmd *)0x0;
  do {
    if (msg_buf == (bl_cmd *)&cmd_mgr->cmds) {
      msg_buf = (bl_cmd *)0x0;
      if (pbVar2 != (bl_cmd *)0x0) {
LAB_23028d50:
        uVar1 = cmd->flags;
        cmd->flags = uVar1 & 0xfff7;
        if ((uVar1 & 0x10) == 0) {
          cmd_complete((bl_cmd *)&cmd_mgr->queue_sz);
        }
        if (msg_buf != (bl_cmd *)0x0) {
LAB_23028d6c:
          msg_buf->flags = msg_buf->flags & 0xfffb;
          ipc_host_msg_push(*(ipc_host_env_tag **)(cmd_mgr + 1),msg_buf,
                            (uint16_t)(((uint)msg_buf->a2e_msg->param_len + 8) * 0x10000 >> 0x10));
          vPortFree(msg_buf->a2e_msg);
        }
      }
      xQueueGenericSend((QueueHandle_t)cmd_mgr->lock,(void *)0x0,0,0);
      return 0;
    }
    if ((pbVar2 == (bl_cmd *)0x0) && ((list_head *)msg_buf->tkn == (list_head *)cmd->tkn)) {
      pbVar2 = msg_buf;
      if ((msg_buf != cmd) && (__warned == false)) {
        printf("%s:%d\r\n","cmd_mgr_llind",0xcf);
        __warned = true;
      }
    }
    else {
      if ((msg_buf->flags & 4) != 0) {
        if (pbVar2 == (bl_cmd *)0x0) goto LAB_23028d6c;
        goto LAB_23028d50;
      }
    }
    msg_buf = (bl_cmd *)(msg_buf->list).next;
  } while( true );
}



undefined4 cmd_mgr_queue(char *param_1,char **param_2)

{
  bool bVar1;
  ushort uVar2;
  undefined4 uVar3;
  EventBits_t EVar4;
  char *pcVar5;
  char **ppcVar6;
  int iVar7;
  
  xQueueSemaphoreTake(*(QueueHandle_t *)(param_1 + 0x18),0xffffffff);
  if (*param_1 == '\x02') {
    param_2[0xf] = &DAT_00000020;
    xQueueGenericSend(*(QueueHandle_t *)(param_1 + 0x18),(void *)0x0,0,0);
    uVar3 = 0xffffffe0;
  }
  else {
    if (param_1 + 0x10 == *(char **)(param_1 + 0x10)) {
      bVar1 = false;
    }
    else {
      if (*(int *)(param_1 + 8) == *(int *)(param_1 + 0xc)) {
        param_2[0xf] = &DAT_0000000c;
        xQueueGenericSend(*(QueueHandle_t *)(param_1 + 0x18),(void *)0x0,0,0);
        return 0xfffffff4;
      }
      bVar1 = false;
      if ((*(ushort *)(*(int *)(param_1 + 0x14) + 0x18) & 0xc) != 0) {
        bVar1 = true;
        *(ushort *)(param_2 + 6) = *(ushort *)(param_2 + 6) | 4;
      }
    }
    if ((*(ushort *)(param_2 + 6) & 2) == 0) {
      uVar2 = 8;
    }
    else {
      uVar2 = 0x18;
    }
    *(ushort *)(param_2 + 6) = *(ushort *)(param_2 + 6) | uVar2;
    pcVar5 = *(char **)(param_1 + 4);
    *(char **)(param_1 + 4) = pcVar5 + 1;
    param_2[5] = pcVar5;
    param_2[0xf] = &DAT_00000004;
    if ((*(ushort *)(param_2 + 6) & 1) == 0) {
      xEventGroupCreateStatic((StaticEventGroup_t *)(param_2 + 7));
    }
    ppcVar6 = *(char ***)(param_1 + 0x14);
    *(char ***)(param_1 + 0x14) = param_2;
    *param_2 = param_1 + 0x10;
    *(char ***)(param_2 + 1) = ppcVar6;
    *(char ***)ppcVar6 = param_2;
    iVar7 = *(int *)(param_1 + 8);
    *(int *)(param_1 + 8) = iVar7 + 1;
    xQueueGenericSend(*(QueueHandle_t *)(param_1 + 0x18),(void *)0x0,0,0);
    if (!bVar1) {
      ipc_host_msg_push(*(ipc_host_env_tag **)(param_1 + 0x30),param_2,
                        (uint16_t)(((uint)*(ushort *)(param_2[3] + 6) + 8) * 0x10000 >> 0x10));
      vPortFree(param_2[3]);
    }
    if ((*(ushort *)(param_2 + 6) & 1) == 0) {
      EVar4 = xEventGroupWaitBits((EventGroupHandle_t)(param_2 + 7),1,1,0,(iVar7 + 1) * 1000000);
      if ((EVar4 & 1) == 0) {
        xQueueSemaphoreTake(*(QueueHandle_t *)(param_1 + 0x18),0xffffffff);
        *param_1 = '\x02';
        if ((*(ushort *)(param_2 + 6) & 0x20) == 0) {
          param_2[0xf] = (char *)0x6e;
          cmd_complete((bl_cmd *)(param_1 + 8));
        }
        xQueueGenericSend(*(QueueHandle_t *)(param_1 + 0x18),(void *)0x0,0,0);
      }
      vEventGroupDelete((EventGroupHandle_t)(param_2 + 7));
    }
    else {
      param_2[0xf] = (char *)0x0;
    }
    uVar3 = 0;
  }
  return uVar3;
}



void cmd_mgr_drain(bl_cmd_mgr *cmd_mgr)

{
  list_head *plVar1;
  list_head *plVar2;
  list_head *plVar3;
  list_head *plVar4;
  
  xQueueSemaphoreTake((QueueHandle_t)cmd_mgr->lock,0xffffffff);
  plVar2 = (cmd_mgr->cmds).next;
  plVar3 = plVar2->next;
  while (plVar1 = plVar3, plVar2 != &cmd_mgr->cmds) {
    plVar4 = plVar2->prev;
    plVar3 = plVar2->next;
    plVar3->prev = plVar4;
    plVar4->next = plVar3;
    plVar2->next = (list_head *)0x100100;
    plVar2->prev = (list_head *)0x200200;
    cmd_mgr->queue_sz = cmd_mgr->queue_sz - 1;
    if ((*(ushort *)&plVar2[3].next & 1) == 0) {
      xEventGroupSetBits((EventGroupHandle_t)&plVar2[3].prev,1);
    }
    plVar3 = plVar1->next;
    plVar2 = plVar1;
  }
  xQueueGenericSend((QueueHandle_t)cmd_mgr->lock,(void *)0x0,0,0);
  return;
}



void bl_cmd_mgr_init(bl_cmd_mgr *cmd_mgr)

{
  QueueHandle_t pQVar1;
  
  (cmd_mgr->cmds).next = &cmd_mgr->cmds;
  (cmd_mgr->cmds).prev = &cmd_mgr->cmds;
  pQVar1 = xQueueCreateMutex('\x01');
  cmd_mgr->max_queue_sz = 8;
  cmd_mgr->queue = cmd_mgr_queue;
  cmd_mgr->print = cmd_mgr_print;
  cmd_mgr->drain = cmd_mgr_drain;
  cmd_mgr->llind = cmd_mgr_llind;
  *(QueueHandle_t *)&cmd_mgr->lock = pQVar1;
  cmd_mgr->msgind = cmd_mgr_msgind;
  return;
}



