pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_irqs_init(bl_hw *bl_hw)

{
  return 0;
}



void bl_irq_bottomhalf(bl_hw *bl_hw)

{
  uint uVar1;
  uint status;
  TickType_t TVar2;
  
  xTaskGetTickCount();
  uVar1 = 0;
  status = ipc_host_get_rawstatus(bl_hw->ipc_env);
  do {
    while (status != 0) {
      uVar1 = uVar1 | status;
      ipc_host_irq(bl_hw->ipc_env,status);
      status = ipc_host_get_rawstatus(bl_hw->ipc_env);
    }
    TVar2 = xTaskGetTickCount();
    if ((uVar1 & 8) != 0) {
      (bl_hw->stats).last_rx = TVar2;
    }
    if ((uVar1 & 0x780) != 0) {
      (bl_hw->stats).last_tx = TVar2;
    }
    ipc_host_enable_irq(bl_hw->ipc_env,0x7ff);
    status = ipc_host_get_rawstatus(bl_hw->ipc_env);
  } while (status != 0);
  return;
}



// WARNING: Exceeded maximum restarts with more pending

void goToErrorState(stateMachine *fsm,event *event)

{
  state *psVar1;
  
  fsm->previousState = fsm->currentState;
  psVar1 = fsm->errorState;
  fsm->currentState = psVar1;
  if ((psVar1 != (state *)0x0) &&
     (psVar1->entryAction != (anon_subr_void_void_ptr_event_ptr_for_entryAction *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x23029062. Too many branches
                    // WARNING: Treating indirect jump as call
    (*psVar1->entryAction)(psVar1->data);
    return;
  }
  return;
}



void stateM_init(stateMachine *fsm,state *initialState,state *errorState)

{
  if (fsm != (stateMachine *)0x0) {
    fsm->currentState = initialState;
    fsm->previousState = (state *)0x0;
    fsm->errorState = errorState;
  }
  return;
}



// WARNING: Type propagation algorithm not settling

int stateM_handleEvent(stateMachine *fsm,event *event)

{
  state *psVar1;
  state *psVar2;
  int iVar3;
  int *piVar4;
  uint uVar5;
  
  if (fsm == (stateMachine *)0x0) {
    return -2;
  }
  iVar3 = -2;
  if (event != (event *)0x0) {
    psVar1 = fsm->currentState;
    if (psVar1 == (state *)0x0) {
LAB_23029090:
      goToErrorState(fsm,event);
      iVar3 = -1;
    }
    else {
      psVar2 = (state *)psVar1->numTransitions;
      while (psVar2 != (state *)0x0) {
        uVar5 = 0;
        while (uVar5 < psVar1->numTransitions) {
          piVar4 = &psVar1->transitions->eventType + uVar5 * 5;
          if ((*piVar4 == event->type) &&
             (((code *)piVar4[2] == (code *)0x0 ||
              (iVar3 = (*(code *)piVar4[2])(piVar4[1],event), iVar3 != 0)))) {
            psVar1 = (state *)piVar4[4];
            if ((state *)piVar4[4] != (state *)0x0) {
              do {
                psVar2 = psVar1;
                psVar1 = psVar2->entryState;
              } while (psVar2->entryState != (state *)0x0);
              psVar1 = fsm->currentState;
              if ((psVar1 != psVar2) &&
                 (psVar1->exitAction != (anon_subr_void_void_ptr_event_ptr_for_exitAction *)0x0)) {
                (*psVar1->exitAction)(psVar1->data,event);
              }
              if ((code *)piVar4[3] != (code *)0x0) {
                (*(code *)piVar4[3])(fsm->currentState->data,event,psVar2->data);
              }
              if ((fsm->currentState != psVar2) &&
                 (psVar2->entryAction != (anon_subr_void_void_ptr_event_ptr_for_entryAction *)0x0))
              {
                (*psVar2->entryAction)(psVar2->data,event);
              }
              psVar1 = fsm->currentState;
              fsm->currentState = psVar2;
              fsm->previousState = psVar1;
              if (psVar1 == psVar2) {
                return 1;
              }
              if (fsm->errorState == psVar2) {
                return -1;
              }
              if (psVar2->numTransitions == 0) {
                return 3;
              }
              return 0;
            }
            goto LAB_23029090;
          }
          uVar5 = uVar5 + 1;
        }
        psVar1 = psVar1->parentState;
        psVar2 = psVar1;
      }
      iVar3 = 2;
    }
  }
  return iVar3;
}



void netif_status_callback(netif *netif)

{
  uint32_t ip;
  char *pcVar1;
  ip_addr_t *piVar2;
  uint32_t mask;
  uint32_t gw;
  uint32_t dns1;
  
  pcVar1 = ip4addr_ntoa((ip4_addr_t *)&netif->ip_addr);
  printf("[lwip] netif status callback\r\n  IP: %s\r\n",pcVar1);
  pcVar1 = ip4addr_ntoa((ip4_addr_t *)&netif->netmask);
  printf("  MK: %s\r\n",pcVar1);
  pcVar1 = ip4addr_ntoa((ip4_addr_t *)&netif->gw);
  printf("  GW: %s\r\n",pcVar1);
  if (((ip4_addr_t *)&netif->ip_addr != (ip4_addr_t *)0x0) && ((netif->ip_addr).addr != 0)) {
    wifi_mgmr_api_ip_update();
    mask = (netif->netmask).addr;
    gw = (netif->gw).addr;
    ip = (netif->ip_addr).addr;
    piVar2 = dns_getserver('\0');
    dns1 = piVar2->addr;
    piVar2 = dns_getserver('\x01');
    wifi_mgmr_api_ip_got(ip,mask,gw,dns1,piVar2->addr);
    return;
  }
  printf(" SKIP Notify for set Empty Address\r\n");
  return;
}



err_t wifi_tx(netif *netif,pbuf *p)

{
  err_t eVar1;
  TickType_t TVar2;
  pbuf *ppVar3;
  
  ppVar3 = p;
  if (p->tot_len < 0x5eb) {
    do {
      ppVar3 = ppVar3->next;
    } while (ppVar3 != (pbuf *)0x0);
    eVar1 = '\0';
    bl_output(bl606a0_sta,netif,p,(uint)(netif[-1].client_data[1] == (void *)0x0));
  }
  else {
    TVar2 = xTaskGetTickCount();
    eVar1 = -0xc;
    if (2000 < TVar2 - ticks_7281) {
      printf("[TX] %s, TX size too big: %u bytes\r\n",&__func___7282,(uint)p->tot_len);
      ticks_7281 = xTaskGetTickCount();
    }
  }
  return eVar1;
}



err_t bl606a0_wifi_netif_init(netif *netif)

{
  netif->hostname = "bl606a0";
  netif->mtu = 0x5dc;
  *(undefined2 *)&netif->hwaddr_len = 0xa06;
  netif->output = etharp_output;
  netif->linkoutput = wifi_tx;
  netif_set_status_callback(netif,netif_status_callback);
  return '\0';
}



int bl606a0_wifi_init(wifi_conf_t *conf)

{
  int iVar1;
  byte bStack24;
  byte bStack23;
  byte bStack22;
  byte bStack21;
  uint8_t mac [6];
  
