pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  printf("\r\n\r\n[BL] Initi Wi-Fi");
  memset(&bStack24,0,6);
  bl_wifi_mac_addr_get(&bStack24);
  printf(" with MAC #### %02X:%02X:%02X:%02X:%02X:%02X ####\r\n",(uint)bStack24,(uint)bStack23,
         (uint)bStack22,(uint)bStack21,(uint)mac[0],(uint)mac[1]);
  bl_msg_update_channel_cfg((char *)conf);
  printf("-----------------------------------------------------\r\n");
  bl_wifi_clock_enable();
  memset(&bl606a0_sta,0,4);
  iVar1 = bl_main_rtthread_start((bl_hw **)&bl606a0_sta);
  return iVar1;
}



uint32_t fdt32_ld(fdt32_t *p)

{
  return (uint)*(byte *)((int)p + 2) << 8 |
         (uint)*(byte *)p << 0x18 | (uint)*(byte *)((int)p + 1) << 0x10 |
         (uint)*(byte *)((int)p + 3);
}



int nextprop_(void *fdt,int offset)

{
  uint32_t uVar1;
  int iStack36;
  int nextoffset;
  
  while( true ) {
    uVar1 = fdt_next_tag(fdt,offset,&iStack36);
    if (uVar1 == 3) {
      return offset;
    }
    if (uVar1 == 9) break;
    offset = iStack36;
    if (uVar1 != 4) {
      return -1;
    }
  }
  if (iStack36 < 0) {
    return iStack36;
  }
  return -0xb;
}



fdt_property * fdt_get_property_by_offset_(void *fdt,int offset,int *lenp)

{
  fdt_property *pfVar1;
  uint32_t uVar2;
  
  uVar2 = fdt_check_prop_offset_(fdt,offset);
  if ((int)uVar2 < 0) {
    pfVar1 = (fdt_property *)0x0;
    if (lenp == (int *)0x0) {
      return (fdt_property *)0x0;
    }
  }
  else {
    uVar2 = fdt32_ld((fdt32_t *)((int)fdt + 8));
    pfVar1 = (fdt_property *)((int)fdt + uVar2 + offset);
    if (lenp == (int *)0x0) {
      return pfVar1;
    }
    uVar2 = fdt32_ld(&pfVar1->len);
  }
  *lenp = uVar2;
  return pfVar1;
}



char * fdt_get_string(void *fdt,int stroffset,int *lenp)

{
  char *__s;
  uint32_t uVar1;
  void *pvVar2;
  uint __n;
  uint uVar3;
  
  uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0xc));
  pvVar2 = (void *)fdt_ro_probe_(fdt);
  if (pvVar2 == (void *)0x0) {
    uVar3 = uVar1 + stroffset;
    uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 4));
    if (uVar3 < uVar1) {
      __n = uVar1 - uVar3;
      uVar1 = fdt32_ld((fdt32_t *)fdt);
      if (uVar1 == 0xd00dfeed) {
        if (-1 < stroffset) {
          uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
          if (0x10 < uVar1) {
            uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x20));
            if (uVar1 <= (uint)stroffset) goto LAB_230294a2;
            if (uVar1 - stroffset < __n) {
              __n = uVar1 - stroffset;
            }
          }
LAB_23029442:
          __s = (char *)((int)fdt + uVar3);
          pvVar2 = memchr(__s,0,__n);
          if (pvVar2 != (void *)0x0) {
            pvVar2 = (void *)((int)pvVar2 - (int)__s);
            goto joined_r0x23029498;
          }
          pvVar2 = (void *)0xfffffff8;
          goto fail;
        }
      }
      else {
        if (uVar1 != 0x2ff20112) {
          pvVar2 = (void *)0xfffffff3;
          goto fail;
        }
        if ((stroffset < 0) &&
           (uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x20)), -uVar1 <= (uint)stroffset)) {
          if ((uint)-stroffset < __n) {
            __n = -stroffset;
          }
          goto LAB_23029442;
        }
      }
    }
LAB_230294a2:
    pvVar2 = (void *)0xfffffffc;
  }
fail:
  __s = (char *)0x0;
joined_r0x23029498:
  if (lenp != (int *)0x0) {
    *(void **)lenp = pvVar2;
  }
  return __s;
}



char * fdt_get_name(void *fdt,int nodeoffset,int *len)

{
  uint32_t uVar1;
  size_t sVar2;
  uint32_t uVar3;
  char *__s;
  
  uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 8));
  sVar2 = fdt_ro_probe_(fdt);
  if ((sVar2 == 0) && (sVar2 = fdt_check_node_offset_(fdt,nodeoffset), -1 < (int)sVar2)) {
    uVar3 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
    __s = (char *)((int)fdt + nodeoffset + uVar1 + 4);
    if (uVar3 < 0x10) {
      __s = strrchr(__s,0x2f);
      if (__s == (char *)0x0) {
        sVar2 = 0xfffffff5;
        goto fail;
      }
      __s = __s + 1;
    }
    if (len == (int *)0x0) {
      return __s;
    }
    sVar2 = strlen(__s);
  }
  else {
fail:
    __s = (char *)0x0;
    if (len == (int *)0x0) {
      return (char *)0x0;
    }
  }
  *len = sVar2;
  return __s;
}



int fdt_subnode_offset_namelen(void *fdt,int offset,char *name,int namelen)

{
  int iVar1;
  char *__s1;
  void *pvVar2;
  int iStack40;
  int depth;
  int olen;
  
  iVar1 = fdt_ro_probe_(fdt);
  if (iVar1 == 0) {
    iStack40 = 0;
    while (-1 < offset) {
      if (iStack40 < 0) goto LAB_23029550;
      if ((((iStack40 == 1) && (__s1 = fdt_get_name(fdt,offset,&depth), __s1 != (char *)0x0)) &&
          (namelen <= depth)) && (iVar1 = memcmp(__s1,name,namelen), iVar1 == 0)) {
        if (__s1[namelen] == '\0') {
          return offset;
        }
        pvVar2 = memchr(name,0x40,namelen);
        if ((pvVar2 == (void *)0x0) && (__s1[namelen] == '@')) {
          return offset;
        }
      }
      offset = fdt_next_node(fdt,offset,&iStack40);
    }
    iVar1 = offset;
    if (iStack40 < 0) {
LAB_23029550:
      iVar1 = -1;
    }
  }
  return iVar1;
}



int fdt_subnode_offset(void *fdt,int parentoffset,char *name)

{
  size_t namelen;
  int iVar1;
  
  namelen = strlen(name);
  iVar1 = fdt_subnode_offset_namelen(fdt,parentoffset,name,namelen);
  return iVar1;
}



int fdt_first_property_offset(void *fdt,int nodeoffset)

{
  int offset;
  
  offset = fdt_check_node_offset_(fdt,nodeoffset);
  if (-1 < offset) {
    offset = nextprop_(fdt,offset);
    return offset;
  }
  return offset;
}



int fdt_next_property_offset(void *fdt,int offset)

{
  int offset_00;
  
  offset_00 = fdt_check_prop_offset_(fdt,offset);
  if (-1 < offset_00) {
    offset_00 = nextprop_(fdt,offset_00);
    return offset_00;
  }
  return offset_00;
}



// WARNING: Variable defined which should be unmapped: slen

fdt_property *
fdt_get_property_namelen_(void *fdt,int offset,char *name,int namelen,int *lenp,int *poffset)

{
  int offset_00;
  fdt_property *pfVar1;
  uint32_t stroffset;
  char *__s1;
  int iVar2;
  int iStack36;
  int slen;
  
  offset_00 = fdt_first_property_offset(fdt,offset);
  do {
    if (offset_00 < 0) {
LAB_2302964e:
      if (lenp != (int *)0x0) {
        *lenp = offset_00;
      }
      return (fdt_property *)0x0;
    }
    pfVar1 = fdt_get_property_by_offset_(fdt,offset_00,lenp);
    if (pfVar1 == (fdt_property *)0x0) {
      offset_00 = -0xd;
      goto LAB_2302964e;
    }
    stroffset = fdt32_ld(&pfVar1->nameoff);
    __s1 = fdt_get_string(fdt,stroffset,&iStack36);
    if (((__s1 != (char *)0x0) && (namelen == iStack36)) &&
       (iVar2 = memcmp(__s1,name,namelen), iVar2 == 0)) {
      if (poffset == (int *)0x0) {
        return pfVar1;
      }
      *poffset = offset_00;
      return pfVar1;
    }
    offset_00 = fdt_next_property_offset(fdt,offset_00);
  } while( true );
}



