pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void * fdt_getprop_namelen(void *fdt,int nodeoffset,char *name,int namelen,int *lenp)

{
  fdt_property *pfVar1;
  uint32_t uVar2;
  int iStack20;
  int poffset;
  
  pfVar1 = fdt_get_property_namelen_(fdt,nodeoffset,name,namelen,lenp,&iStack20);
  if (pfVar1 != (fdt_property *)0x0) {
    uVar2 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
    if (((uVar2 < 0x10) && ((iStack20 + 0xcU & 7) != 0)) &&
       (uVar2 = fdt32_ld(&pfVar1->len), 7 < uVar2)) {
      pfVar1 = (fdt_property *)&pfVar1[1].len;
    }
    else {
      pfVar1 = pfVar1 + 1;
    }
  }
  return pfVar1;
}



void * fdt_getprop(void *fdt,int nodeoffset,char *name,int *lenp)

{
  size_t namelen;
  void *pvVar1;
  
  namelen = strlen(name);
  pvVar1 = fdt_getprop_namelen(fdt,nodeoffset,name,namelen,lenp);
  return pvVar1;
}



// WARNING: Variable defined which should be unmapped: length

int fdt_stringlist_count(void *fdt,int nodeoffset,char *property)

{
  int iVar1;
  char *__string;
  size_t sVar2;
  char *pcVar3;
  int iStack20;
  int length;
  
  __string = (char *)fdt_getprop(fdt,nodeoffset,property,&iStack20);
  iVar1 = iStack20;
  if (__string != (char *)0x0) {
    pcVar3 = __string + iStack20;
    iVar1 = 0;
    while (__string < pcVar3) {
      sVar2 = strnlen(__string,(size_t)(pcVar3 + -(int)__string));
      iStack20 = sVar2 + 1;
      __string = __string + iStack20;
      if (pcVar3 < __string) {
        return -0xf;
      }
      iVar1 = iVar1 + 1;
    }
  }
  return iVar1;
}



char * fdt_stringlist_get(void *fdt,int nodeoffset,char *property,int idx,int *lenp)

{
  char *__string;
  size_t sVar1;
  int iVar2;
  char *pcVar3;
  int iStack36;
  int length;
  
  __string = (char *)fdt_getprop(fdt,nodeoffset,property,&iStack36);
  if (__string == (char *)0x0) {
    if (lenp != (int *)0x0) {
      *lenp = iStack36;
      return (char *)0x0;
    }
  }
  else {
    pcVar3 = __string + iStack36;
    while (__string < pcVar3) {
      sVar1 = strnlen(__string,(size_t)(pcVar3 + -(int)__string));
      iStack36 = sVar1 + 1;
      if (pcVar3 < __string + iStack36) {
        iVar2 = -0xf;
        if (lenp == (int *)0x0) {
          return (char *)0x0;
        }
        goto LAB_230297ce;
      }
      if (idx == 0) {
        if (lenp != (int *)0x0) {
          *lenp = sVar1;
          return __string;
        }
        return __string;
      }
      idx = idx + -1;
      __string = __string + iStack36;
    }
    if (lenp != (int *)0x0) {
      iVar2 = -1;
LAB_230297ce:
      *lenp = iVar2;
    }
  }
  return (char *)0x0;
}



void blfdt(char *buf,int len,int argc,char **argv)

{
  tc_fdt_wifi();
  tc_blfdtdump();
  return;
}



int blfdt_cli_init(void)

{
  return 0;
}



uint32_t fdt32_ld(fdt32_t *p)

{
  return (uint)*(byte *)((int)p + 2) << 8 |
         (uint)*(byte *)p << 0x18 | (uint)*(byte *)((int)p + 1) << 0x10 |
         (uint)*(byte *)((int)p + 3);
}



int fdt_ro_probe_(void *fdt)

{
  uint32_t uVar1;
  int iVar2;
  
  uVar1 = fdt32_ld((fdt32_t *)fdt);
  if (uVar1 == 0xd00dfeed) {
    uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
    iVar2 = -10;
    if (1 < uVar1) {
      uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x18));
      iVar2 = 0;
      if (0x11 < uVar1) {
        iVar2 = -10;
      }
    }
  }
  else {
    iVar2 = -9;
    if (uVar1 == 0x2ff20112) {
      uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x24));
      iVar2 = 0;
      if (uVar1 == 0) {
        iVar2 = -7;
      }
    }
  }
  return iVar2;
}



void * fdt_offset_ptr(void *fdt,int offset,uint len)

{
  uint32_t uVar1;
  void *pvVar2;
  uint uVar3;
  
  uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 8));
  uVar3 = uVar1 + offset;
  pvVar2 = (void *)0x0;
  if ((uint)offset <= uVar3) {
    pvVar2 = (void *)0x0;
    if (uVar3 <= uVar3 + len) {
      uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 4));
      pvVar2 = (void *)0x0;
      if (uVar3 + len <= uVar1) {
        uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
        if (0x10 < uVar1) {
          if (len + offset < (uint)offset) {
            return (void *)0x0;
          }
          uVar1 = fdt32_ld((fdt32_t *)((int)fdt + 0x24));
          if (uVar1 < len + offset) {
            return (void *)0x0;
          }
        }
        pvVar2 = (void *)((int)fdt + uVar3);
      }
    }
  }
  return pvVar2;
}



uint32_t fdt_next_tag(void *fdt,int startoffset,int *nextoffset)

{
  int offset;
  int offset_00;
  uint *puVar1;
  char *pcVar2;
  void *pvVar3;
  uint32_t uVar4;
  uint uVar5;
  uint uVar6;
  
  *nextoffset = -8;
  puVar1 = (uint *)fdt_offset_ptr(fdt,startoffset,4);
  if (puVar1 != (uint *)0x0) {
    uVar5 = *puVar1;
    offset = startoffset + 4;
    uVar5 = uVar5 << 0x18 | uVar5 >> 0x18 | (uVar5 >> 8 & 0xff) << 0x10 |
            (uVar5 >> 0x10 & 0xff) << 8;
    *nextoffset = -0xb;
    offset_00 = offset;
    switch(uVar5) {
    case 1:
      do {
        offset = offset_00 + 1;
        pcVar2 = (char *)fdt_offset_ptr(fdt,offset_00,1);
        if (pcVar2 == (char *)0x0) {
          return 9;
        }
        offset_00 = offset;
      } while (*pcVar2 != '\0');
      break;
    case 2:
    case 4:
    case 9:
      break;
    case 3:
      puVar1 = (uint *)fdt_offset_ptr(fdt,offset,4);
      if (puVar1 == (uint *)0x0) {
        return 9;
      }
      uVar6 = *puVar1;
      uVar6 = uVar6 << 0x18 | uVar6 >> 0x18 | (uVar6 >> 8 & 0xff) << 0x10 |
              (uVar6 >> 0x10 & 0xff) << 8;
      uVar4 = fdt32_ld((fdt32_t *)((int)fdt + 0x14));
      offset = startoffset + 0xcU + uVar6;
      if (((uVar4 < 0x10) && (7 < uVar6)) && ((startoffset + 0xcU & 7) != 0)) {
        offset = offset + 4;
      }
      break;
    default:
      goto LAB_23029986;
    }
    pvVar3 = fdt_offset_ptr(fdt,startoffset,offset - startoffset);
    if (pvVar3 != (void *)0x0) {
      *nextoffset = offset + 3U & 0xfffffffc;
      return uVar5;
    }
  }
LAB_23029986:
  return 9;
}



