pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int fdt_check_node_offset_(void *fdt,int offset)

{
  uint32_t uVar1;
  int aiStack20 [4];
  
  if (((offset < 0) || ((offset & 3U) != 0)) ||
     (aiStack20[0] = offset, uVar1 = fdt_next_tag(fdt,offset,aiStack20), uVar1 != 1)) {
    aiStack20[0] = -4;
  }
  return aiStack20[0];
}



int fdt_check_prop_offset_(void *fdt,int offset)

{
  uint32_t uVar1;
  int aiStack20 [4];
  
  if (((offset < 0) || ((offset & 3U) != 0)) ||
     (aiStack20[0] = offset, uVar1 = fdt_next_tag(fdt,offset,aiStack20), uVar1 != 3)) {
    aiStack20[0] = -4;
  }
  return aiStack20[0];
}



int fdt_next_node(void *fdt,int offset,int *depth)

{
  uint32_t uVar1;
  int iVar2;
  int iStack36;
  int nextoffset;
  
  iStack36 = 0;
  if (offset < 0) goto LAB_23029a68;
  iStack36 = fdt_check_node_offset_(fdt,offset);
  iVar2 = iStack36;
  do {
    if (iVar2 < 0) {
      return iStack36;
    }
LAB_23029a68:
    do {
      while (iVar2 = iStack36, uVar1 = fdt_next_tag(fdt,iStack36,&iStack36), uVar1 != 2) {
        if (uVar1 == 9) {
          if (iStack36 < 0) {
            if (iStack36 != -8) {
              return iStack36;
            }
            if (depth != (int *)0x0) {
              return -8;
            }
          }
          return -1;
        }
        if (uVar1 == 1) {
          if (depth == (int *)0x0) {
            return iVar2;
          }
          *depth = *depth + 1;
          return iVar2;
        }
      }
    } while (depth == (int *)0x0);
    iVar2 = *depth + -1;
    *depth = iVar2;
  } while( true );
}



uint32_t fdt32_to_cpu(fdt32_t x)

{
  return (x >> 0x10 & 0xff) << 8 | x << 0x18 | x >> 0x18 | (x >> 8 & 0xff) << 0x10;
}



uint64_t fdt64_to_cpu(void)

{
  uint64_t in_fa0;
  
  return in_fa0;
}



uint32_t fdt32_ld(fdt32_t *p)

{
  return (uint)*(byte *)((int)p + 2) << 8 |
         (uint)*(byte *)p << 0x18 | (uint)*(byte *)((int)p + 1) << 0x10 |
         (uint)*(byte *)((int)p + 3);
}



_Bool util_is_printable_string(void *data,int len)

{
  byte *pbVar1;
  undefined uVar2;
  byte *pbVar3;
  byte *pbVar4;
  
  if (len == 0) {
LAB_23029ba0:
    uVar2 = 0;
  }
  else {
    pbVar1 = (byte *)(len + (int)data);
    uVar2 = 0;
    if (pbVar1[-1] == 0) {
      while (pbVar3 = (byte *)data, data < pbVar1) {
        do {
          pbVar4 = pbVar3;
          if ((*pbVar3 == 0) || ((_ctype_[(uint)*pbVar3 + 1] & 0x97) == 0)) break;
          pbVar3 = pbVar3 + 1;
          pbVar4 = pbVar1;
        } while (pbVar1 != pbVar3);
        if ((*pbVar4 != 0) || ((byte *)data == pbVar4)) goto LAB_23029ba0;
        data = pbVar4 + 1;
      }
      uVar2 = 1;
    }
  }
  return (_Bool)uVar2;
}



void utilfdt_print_data(char *data,int len)

{
  char *__format;
  _Bool _Var1;
  undefined3 extraout_var;
  size_t sVar2;
  uint32_t uVar3;
  undefined1 *puVar4;
  int iVar5;
  
  if (len == 0) {
    return;
  }
  _Var1 = util_is_printable_string(data,len);
  if (CONCAT31(extraout_var,_Var1) != 0) {
    printf(" = ");
    __format = data + len;
    while( true ) {
      printf("\"%s\"",data);
      sVar2 = strlen(data);
      data = data + sVar2 + 1;
      if (__format <= data) break;
      printf(", ");
    }
    return;
  }
  if ((len & 3U) == 0) {
    printf(" = <");
    iVar5 = 0;
    while (iVar5 < len / 4) {
      uVar3 = fdt32_to_cpu(*(fdt32_t *)(data + iVar5 * 4));
      puVar4 = (undefined1 *)0x23080f8c;
      if (len / 4 + -1 <= iVar5) {
        puVar4 = &DAT_23088e60;
      }
      printf("0x%08x%s",uVar3,puVar4);
      iVar5 = iVar5 + 1;
    }
    __format = ">";
  }
  else {
    printf(" = [");
    iVar5 = 0;
    while (iVar5 < len) {
      puVar4 = (undefined1 *)0x23080f8c;
      if (len + -1 <= iVar5) {
        puVar4 = &DAT_23088e60;
      }
      printf("%02x%s",(uint)(byte)data[iVar5],puVar4);
      iVar5 = iVar5 + 1;
    }
    __format = "]";
  }
  printf(__format);
  return;
}



undefined4 tc_blfdtdump(void)

{
  uint8_t *__s;
  uint *puVar1;
  fdt32_t *pfVar2;
  TickType_t TVar3;
  uint32_t len;
  uint32_t uVar4;
  uint32_t uVar5;
  uint32_t uVar6;
  uint32_t uVar7;
  uint32_t uVar8;
  uint uVar9;
  uint uVar10;
  undefined *puVar11;
  undefined4 uVar12;
  size_t sVar13;
  char *__format;
  uint uVar14;
  uint uVar15;
  int iVar16;
  fdt32_t *pfVar17;
  undefined *puVar18;
  int iVar19;
  fdt32_t *data;
  uint64_t uVar20;
  fdt32_t *pfStack72;
  
  __s = tc_wifi_dtb;
  while( true ) {
    if ((int)(&UNK_2308063b + -(int)__s) < 4) break;
    __s = (uint8_t *)memchr(__s,0xd0,-(int)__s + 0x23080637);
    if ((fdt32_t *)__s == (fdt32_t *)0x0) goto LAB_23029ed2;
    len = fdt32_ld((fdt32_t *)__s);
    if (len == 0xd00dfeed) {
      puVar18 = &UNK_2308063b + -(int)__s;
      if ((((((undefined *)0x27 < puVar18) && (len = fdt32_ld((fdt32_t *)__s + 5), len < 0x12)) &&
           (len = fdt32_ld((fdt32_t *)__s + 6), len < 0x12)) &&
          ((puVar11 = (undefined *)fdt32_ld((fdt32_t *)__s + 1), puVar11 < puVar18 &&
           (puVar11 = (undefined *)fdt32_ld((fdt32_t *)__s + 2), puVar11 < puVar18)))) &&
         (puVar11 = (undefined *)fdt32_ld((fdt32_t *)__s + 3), puVar11 < puVar18))
      goto LAB_23029d34;
      printf("%s: skipping fdt magic at offset %#tx\r\n","fdtbuff",(fdt32_t *)__s + -0x8c1fce3);
    }
    __s = (uint8_t *)((int)__s + 1);
  }
  if (((fdt32_t *)__s == (fdt32_t *)0x0) || (&UNK_2308063b + -(int)__s < (undefined *)0x28)) {
LAB_23029ed2:
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] %s: could not locate fdt magic\r\n",&DAT_23072bcc,
              "tc_blfdt_dump.c",0x149,"fdtbuff");
    printf("dump failed\r\n");
    uVar12 = 0xffffffff;
  }
  else {
LAB_23029d34:
    printf("%s: found fdt at offset %#tx\r\n","fdtbuff",(fdt32_t *)__s + -0x8c1fce3);
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] dump_blob.",TVar3,&DAT_2307f16c,"tc_blfdt_dump.c",0x153);
    len = fdt32_to_cpu(((fdt32_t *)__s)[4]);
    uVar4 = fdt32_to_cpu(((fdt32_t *)__s)[2]);
    uVar5 = fdt32_to_cpu(((fdt32_t *)__s)[3]);
    uVar6 = fdt32_to_cpu(((fdt32_t *)__s)[5]);
    uVar7 = fdt32_to_cpu(((fdt32_t *)__s)[1]);
    printf("/dts-v1/;\r\n");
    uVar8 = fdt32_to_cpu(*(fdt32_t *)__s);
    printf("// magic:\t\t0x%lx\r\n",uVar8);
    printf("// totalsize:\t\t0x%lx (%lu)\r\n",uVar7);
    printf("// off_dt_struct:\t0x%lx\r\n",uVar4);
    printf("// off_dt_strings:\t0x%lx\r\n",uVar5);
    printf("// off_mem_rsvmap:\t0x%lx\r\n",len);
    printf("// version:\t\t%lu\r\n",uVar6);
    uVar7 = fdt32_to_cpu(((fdt32_t *)__s)[6]);
    printf("// last_comp_version:\t%lu\r\n",uVar7);
    if (1 < uVar6) {
      uVar7 = fdt32_to_cpu(((fdt32_t *)__s)[7]);
      printf("// boot_cpuid_phys:\t0x%lx\r\n",uVar7);
      if (uVar6 != 2) {
        uVar7 = fdt32_to_cpu(((fdt32_t *)__s)[8]);
        printf("// size_dt_strings:\t0x%lx\r\n",uVar7);
        if (0x10 < uVar6) {
          uVar7 = fdt32_to_cpu(((fdt32_t *)__s)[9]);
          printf("// size_dt_struct:\t0x%lx\r\n",uVar7);
        }
      }
    }
    printf("\r\n");
    puVar1 = (uint *)(len + (int)__s);
    while( true ) {
      uVar9 = *puVar1;
      uVar14 = puVar1[1];
      fdt64_to_cpu();
      uVar10 = puVar1[2];
      uVar15 = puVar1[3];
      uVar20 = fdt64_to_cpu();
      if ((uVar9 | uVar10 | uVar15 | uVar14) == 0) break;
      printf("/memreserve/ %#llx %#llx;\r\n",uVar10,uVar15,(int)uVar20);
      puVar1 = puVar1 + 4;
    }
    iVar19 = 0;
    pfStack72 = (fdt32_t *)&DAT_23085d30;
    pfVar17 = (fdt32_t *)((int)__s + uVar4);
    while( true ) {
      data = pfVar17 + 1;
      len = fdt32_to_cpu(*pfVar17);
      if (len == 9) break;
      puVar18 = &DAT_2307f0c0;
      if ((len < 10) &&
         (puVar18 = *(undefined **)(&names_3639 + len * 4),
         *(undefined **)(&names_3639 + len * 4) == (undefined *)0x0)) {
        puVar18 = &DAT_2307f0c0;
      }
      printf("// %04x: tag: 0x%08lx (%s)\r\n",(int)data + (-4 - (int)__s),len,puVar18);
      if (len == 1) {
        sVar13 = strlen((char *)data);
        pfVar2 = data;
        if (*(char *)(pfVar17 + 1) == '\0') {
          pfVar2 = pfStack72;
        }
        printf("%*s%s {\r\n",&DAT_23088e60,pfVar2);
        iVar19 = iVar19 + 1;
        pfVar17 = (fdt32_t *)((int)data + sVar13 + 4 & 0xfffffffc);
      }
      else {
        if (len == 2) {
          iVar19 = iVar19 + -1;
          __format = "%*s};\r\n";
LAB_2302a036:
          printf(__format,&DAT_23088e60);
          pfVar17 = data;
        }
        else {
          if (len == 4) {
            __format = "%*s// [NOP]\r\n";
            goto LAB_2302a036;
          }
          if (len != 3) {
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] %*s ** Unknown tag 0x%08lx\r\n",&DAT_23072bcc,
                      "tc_blfdt_dump.c",0xf7,iVar19 << 2,&DAT_23088e60,len);
            break;
          }
          data = pfVar17 + 3;
          len = fdt32_to_cpu(pfVar17[1]);
          uVar4 = fdt32_to_cpu(pfVar17[2]);
          iVar16 = (int)__s + uVar5 + uVar4;
          if ((uVar6 < 0x10) && (7 < (int)len)) {
            data = (fdt32_t *)((uint)((int)pfVar17 + 0x13) & 0xfffffff8);
          }
          printf("// %04x: string: %s\r\n",iVar16);
          printf("// %04x: value\r\n",(fdt32_t *)((int)data - (int)__s));
          printf("%*s%s",iVar19 << 2,&DAT_23088e60,iVar16);
          utilfdt_print_data((char *)data,len);
          pfVar17 = (fdt32_t *)((int)data + len + 3 & 0xfffffffc);
          printf(";\r\n");
        }
      }
    }
    printf("dump successed\r\n");
    uVar12 = 0;
  }
  return uVar12;
}



undefined4 tc_fdt_wifi_module(void)

{
  int idx;
  int parentoffset;
  char *format;
  int nodeoffset;
  uint *puVar1;
  TickType_t TVar2;
  void *__src;
  int iVar3;
  undefined4 uVar4;
  uint uVar5;
  int iStack308;
  undefined auStack304 [256];
  
  iStack308 = 0;
  parentoffset = fdt_subnode_offset(tc_wifi_dtb,0,"wifi");
  if (parentoffset < 1) {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar4 = 0x37;
    format = "[%10u][%s: %s:%4d] wifi NULL.\r\n";
  }
  else {
    nodeoffset = fdt_subnode_offset(tc_wifi_dtb,parentoffset,"region");
    if (0 < nodeoffset) {
      puVar1 = (uint *)fdt_getprop(tc_wifi_dtb,nodeoffset,"country_code",&iStack308);
      if (puVar1 == (uint *)0x0) {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        uVar4 = 0x42;
        format = "[%10u][%s: %s:%4d] country_code NULL.\r\n";
        goto LAB_2302a1c6;
      }
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar5 = *puVar1;
      bl_printk("[%10u][%s: %s:%4d] value = %ld, lentmp = %d\r\n",TVar2,&DAT_2307f16c,
                "tc_blfdt_wifi.c",0x40,
                uVar5 << 0x18 | uVar5 >> 0x18 | (uVar5 >> 8 & 0xff) << 0x10 |
                (uVar5 >> 0x10 & 0xff) << 8,iStack308);
    }
    nodeoffset = fdt_subnode_offset(tc_wifi_dtb,parentoffset,"mac");
    if (0 < nodeoffset) {
      __src = fdt_getprop(tc_wifi_dtb,nodeoffset,"sta_mac_addr",&iStack308);
      if (iStack308 != 6) {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        uVar4 = 0x52;
        format = "[%10u][%s: %s:%4d] sta_mac_addr NULL.\r\n";
        goto LAB_2302a1c6;
      }
      memcpy(auStack304,__src,6);
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] sta_mac :\r\n",TVar2,&DAT_2307f16c,"tc_blfdt_wifi.c",0x4f);
      log_buf_out("tc_blfdt_wifi.c",0x50,auStack304,6,LOG_BUF_OUT_DATA_TYPE_HEX);
      __src = fdt_getprop(tc_wifi_dtb,nodeoffset,"ap_mac_addr",&iStack308);
      if (iStack308 == 6) {
        memcpy(auStack304,__src,6);
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] ap_mac :\r\n",TVar2,&DAT_2307f16c,"tc_blfdt_wifi.c",0x5c);
        log_buf_out("tc_blfdt_wifi.c",0x5d,auStack304,6,LOG_BUF_OUT_DATA_TYPE_HEX);
      }
    }
    nodeoffset = fdt_subnode_offset(tc_wifi_dtb,parentoffset,"ap");
    if (nodeoffset < 1) {
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      uVar4 = 0x98;
    }
    else {
      iVar3 = fdt_stringlist_count(tc_wifi_dtb,nodeoffset,"ssid");
      if (0 < iVar3) {
        idx = 0;
        do {
          format = fdt_stringlist_get(tc_wifi_dtb,nodeoffset,"ssid",idx,&iStack308);
          if (0 < iStack308) {
            if (TrapNetCounter == 0) {
              TVar2 = xTaskGetTickCount();
            }
            else {
              TVar2 = xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] ap string[%d] = %s, lentmp = %d\r\n",TVar2,&DAT_2307f16c,
                      "tc_blfdt_wifi.c",0x6a,idx,format,iStack308);
          }
          idx = idx + 1;
        } while (iVar3 != idx);
        iVar3 = fdt_stringlist_count(tc_wifi_dtb,nodeoffset,"pwd");
        if (iVar3 < 1) {
          if (TrapNetCounter == 0) {
            xTaskGetTickCount();
          }
          else {
            xTaskGetTickCountFromISR();
          }
          uVar4 = 0x7d;
          format = "[%10u][%s: %s:%4d] pwd NULL.\r\n";
        }
        else {
          idx = 0;
          do {
            format = fdt_stringlist_get(tc_wifi_dtb,nodeoffset,"pwd",idx,&iStack308);
            if (0 < iStack308) {
              if (TrapNetCounter == 0) {
                TVar2 = xTaskGetTickCount();
              }
              else {
                TVar2 = xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] pwd string[%d] = %s, lentmp = %d\r\n",TVar2,
                        &DAT_2307f16c,"tc_blfdt_wifi.c",0x79,idx,format,iStack308);
            }
            idx = idx + 1;
          } while (iVar3 != idx);
          puVar1 = (uint *)fdt_getprop(tc_wifi_dtb,nodeoffset,"ap_channel",&iStack308);
          if (puVar1 == (uint *)0x0) {
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            uVar4 = 0x86;
            format = "[%10u][%s: %s:%4d] ap_channel NULL.\r\n";
          }
          else {
            if (TrapNetCounter == 0) {
              TVar2 = xTaskGetTickCount();
            }
            else {
              TVar2 = xTaskGetTickCountFromISR();
            }
            uVar5 = *puVar1;
            bl_printk("[%10u][%s: %s:%4d] ap_channel = %ld\r\n",TVar2,&DAT_2307f16c,
                      "tc_blfdt_wifi.c",0x84,
                      uVar5 << 0x18 | uVar5 >> 0x18 | (uVar5 >> 8 & 0xff) << 0x10 |
                      (uVar5 >> 0x10 & 0xff) << 8);
            iVar3 = fdt_stringlist_count(tc_wifi_dtb,nodeoffset,"auto_chan_detect");
            idx = 0;
            if (iVar3 < 1) {
              if (TrapNetCounter == 0) {
                xTaskGetTickCount();
              }
              else {
                xTaskGetTickCountFromISR();
              }
              uVar4 = 0x94;
              format = "[%10u][%s: %s:%4d] auto_chan_detect NULL.\r\n";
            }
            else {
              do {
                format = fdt_stringlist_get(tc_wifi_dtb,nodeoffset,"auto_chan_detect",idx,&iStack308
                                           );
                if (0 < iStack308) {
                  if (TrapNetCounter == 0) {
                    TVar2 = xTaskGetTickCount();
                  }
                  else {
                    TVar2 = xTaskGetTickCountFromISR();
                  }
                  bl_printk("[%10u][%s: %s:%4d] auto_chan_detect string[%d] = %s, lentmp = %d\r\n",
                            TVar2,&DAT_2307f16c,"tc_blfdt_wifi.c",0x90,idx,format,iStack308);
                }
                idx = idx + 1;
              } while (iVar3 != idx);
              parentoffset = fdt_subnode_offset(tc_wifi_dtb,parentoffset,"brd_rf");
              if (parentoffset < 1) {
                if (TrapNetCounter == 0) {
                  xTaskGetTickCount();
                }
                else {
                  xTaskGetTickCountFromISR();
                }
                uVar4 = 0xdc;
                format = "[%10u][%s: %s:%4d] brd_rf NULL.\r\n";
              }
              else {
                __src = fdt_getprop(tc_wifi_dtb,parentoffset,"xtal",&iStack308);
                if (iStack308 == 0x14) {
                  memcpy(auStack304,__src,0x14);
                  if (TrapNetCounter == 0) {
                    TVar2 = xTaskGetTickCount();
                  }
                  else {
                    TVar2 = xTaskGetTickCountFromISR();
                  }
                  bl_printk("[%10u][%s: %s:%4d] xtal :\r\n",TVar2,&DAT_2307f16c,"tc_blfdt_wifi.c",
                            0xa5);
                  log_buf_out("tc_blfdt_wifi.c",0xa6,auStack304,0x14,LOG_BUF_OUT_DATA_TYPE_HEX);
                  __src = fdt_getprop(tc_wifi_dtb,parentoffset,"pwr_table",&iStack308);
                  if (iStack308 != 0x100) {
                    if (TrapNetCounter == 0) {
                      xTaskGetTickCount();
                    }
                    else {
                      xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] pwr_table NULL. lentmp = %d.\r\n",&DAT_23072bcc,
                              "tc_blfdt_wifi.c",0xb4,iStack308);
                    return 0xffffffff;
                  }
                  memcpy(auStack304,__src,0x100);
                  if (TrapNetCounter == 0) {
                    TVar2 = xTaskGetTickCount();
                  }
                  else {
                    TVar2 = xTaskGetTickCountFromISR();
                  }
                  bl_printk("[%10u][%s: %s:%4d] pwr_table :\r\n",TVar2,&DAT_2307f16c,
                            "tc_blfdt_wifi.c",0xb1);
                  log_buf_out("tc_blfdt_wifi.c",0xb2,auStack304,0x100,LOG_BUF_OUT_DATA_TYPE_HEX);
                  __src = fdt_getprop(tc_wifi_dtb,parentoffset,"channel_div_table",&iStack308);
                  if (iStack308 == 0x3c) {
                    memcpy(auStack304,__src,0x3c);
                    if (TrapNetCounter == 0) {
                      TVar2 = xTaskGetTickCount();
                    }
                    else {
                      TVar2 = xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] channel_div_table :\r\n",TVar2,&DAT_2307f16c,
                              "tc_blfdt_wifi.c",0xbd);
                    log_buf_out("tc_blfdt_wifi.c",0xbe,auStack304,0x3c,LOG_BUF_OUT_DATA_TYPE_HEX);
                    __src = fdt_getprop(tc_wifi_dtb,parentoffset,"channel_cnt_table",&iStack308);
                    if (iStack308 == 0x38) {
                      memcpy(auStack304,__src,0x38);
                      if (TrapNetCounter == 0) {
                        TVar2 = xTaskGetTickCount();
                      }
                      else {
                        TVar2 = xTaskGetTickCountFromISR();
                      }
                      bl_printk("[%10u][%s: %s:%4d] channel_cnt_table :\r\n",TVar2,&DAT_2307f16c,
                                "tc_blfdt_wifi.c",0xc9);
                      log_buf_out("tc_blfdt_wifi.c",0xca,auStack304,0x38,LOG_BUF_OUT_DATA_TYPE_HEX);
                      __src = fdt_getprop(tc_wifi_dtb,parentoffset,"lo_fcal_div",&iStack308);
                      if (iStack308 == 4) {
                        memcpy(auStack304,__src,4);
                        if (TrapNetCounter == 0) {
                          TVar2 = xTaskGetTickCount();
                        }
                        else {
                          TVar2 = xTaskGetTickCountFromISR();
                        }
                        bl_printk("[%10u][%s: %s:%4d] lo_fcal_div :\r\n",TVar2,&DAT_2307f16c,
                                  "tc_blfdt_wifi.c",0xd5);
                        log_buf_out("tc_blfdt_wifi.c",0xd6,auStack304,4,LOG_BUF_OUT_DATA_TYPE_HEX);
                        return 0;
                      }
                      if (TrapNetCounter == 0) {
                        xTaskGetTickCount();
                      }
                      else {
                        xTaskGetTickCountFromISR();
                      }
                      uVar4 = 0xd8;
                      format = "[%10u][%s: %s:%4d] lo_fcal_div NULL.\r\n";
                    }
                    else {
                      if (TrapNetCounter == 0) {
                        xTaskGetTickCount();
                      }
                      else {
                        xTaskGetTickCountFromISR();
                      }
                      uVar4 = 0xcc;
                      format = "[%10u][%s: %s:%4d] channel_cnt_table NULL.\r\n";
                    }
                  }
                  else {
                    if (TrapNetCounter == 0) {
                      xTaskGetTickCount();
                    }
                    else {
                      xTaskGetTickCountFromISR();
                    }
                    uVar4 = 0xc0;
                    format = "[%10u][%s: %s:%4d] channel_div_table NULL.\r\n";
                  }
                }
                else {
                  if (TrapNetCounter == 0) {
                    xTaskGetTickCount();
                  }
                  else {
                    xTaskGetTickCountFromISR();
                  }
                  uVar4 = 0xa8;
                  format = "[%10u][%s: %s:%4d] xtal NULL.";
                }
              }
            }
          }
        }
        goto LAB_2302a1c6;
      }
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      uVar4 = 0x6e;
    }
    format = "[%10u][%s: %s:%4d] ap NULL.\r\n";
  }
LAB_2302a1c6:
  bl_printk(format,&DAT_23072bcc,"tc_blfdt_wifi.c",uVar4);
  return 0xffffffff;
}



int tc_fdt_wifi(void)

{
  int iVar1;
  char *__format;
  
