pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  iVar1 = tc_fdt_wifi_module();
  if (iVar1 == 0) {
    __format = "fdt wifi module successed\r\n";
  }
  else {
    __format = "fdt wifi module failed\r\n";
  }
  printf(__format);
  return iVar1;
}



void cmd_blog_info_dump(char *buf,int len,int argc,char **argv)

{
  blog_info_t *pbVar1;
  blog_info_t *pbVar2;
  size_t __n;
  int iVar3;
  char *pcVar4;
  byte *pbVar5;
  byte **ppbVar6;
  char local_b0 [4];
  char name_buf [128];
  
  memset(local_b0,0,0x80);
  bl_printk("blog code1 = %p - %p\r\n",&_fsymc_info_bloop,&_fsymf_info_bloopbloop_base);
  bl_printk("blog code2 = %p - %p\r\n",&_fsymf_info_bloopbloop_base,&_bl_static_blogfile_code_end);
  bl_printk("blog code3 = %p - %p\r\n",&_bl_static_blogfile_code_end,&_bl_static_blogfile_code_end);
  pbVar1 = &_fsymc_info_bloop;
  do {
    if ((blog_info_t *)((int)&_fsymc_info_loopset.name + 3U) < pbVar1) {
      return;
    }
    __n = strlen(pbVar1->name);
    if (0x80 < __n) {
      bl_printk("name too long.\r\n");
      return;
    }
    if (local_b0[0] == '\0') {
LAB_2302aada:
      bl_printk("[%-48s] = [%d]\r\n",pbVar1->name,(uint)*pbVar1->level);
      if ((local_b0[0] == '\0') || (iVar3 = strcmp(pbVar1->name,local_b0), iVar3 != 0)) {
        pbVar2 = &_fsymf_info_bloopbloop_base;
        strcpy(local_b0,pbVar1->name);
        while (pbVar2 < (blog_info_t *)&_bl_static_blogfile_code_end) {
          pcVar4 = strstr(pbVar2->name,pbVar1->name);
          if (pcVar4 == pbVar2->name) {
            ppbVar6 = (byte **)&_bl_static_blogfile_code_end;
            bl_printk("[%-48s] = [%d]\r\n",pcVar4,(uint)*pbVar2->level);
            while (ppbVar6 < &_bl_static_blogfile_code_end) {
              pbVar5 = (byte *)strstr((char *)ppbVar6[1],pbVar2->name);
              if (pbVar5 == ppbVar6[1]) {
                bl_printk("[%-48s] = [%d]\r\n",pbVar5,(uint)**ppbVar6);
              }
              ppbVar6 = ppbVar6 + 2;
            }
          }
          pbVar2 = pbVar2 + 1;
        }
      }
    }
    else {
      iVar3 = strcmp(local_b0,pbVar1->name);
      if (iVar3 != 0) {
        __n = strlen(local_b0);
        memset(local_b0,0,__n);
        goto LAB_2302aada;
      }
    }
    pbVar1 = pbVar1 + 1;
  } while( true );
}



void cmd_blog_set_level(char *buf,int len,int argc,char **argv)

{
  blog_info_t *pbVar1;
  int iVar2;
  char *format;
  size_t sVar3;
  int iVar4;
  char *__s;
  int iVar5;
  blog_info_t *pbVar6;
  blog_level_t bVar7;
  int iVar8;
  
  if (argc != 3) {
    bl_printk("arg error.\r\n");
    goto LAB_2302ab82;
  }
  iVar2 = strcmp(argv[1],"all");
  if (iVar2 == 0) {
    bVar7 = BLOG_LEVEL_ALL;
LAB_2302ac30:
    __s = argv[2];
    sVar3 = strlen(__s);
    iVar5 = 0;
    iVar2 = 0;
    while (iVar2 < (int)sVar3) {
      if (__s[iVar2] == '.') {
        iVar5 = iVar5 + 1;
      }
      iVar2 = iVar2 + 1;
    }
    if (iVar5 == 0) {
      pbVar1 = &_fsymf_info_bloopbloop_base;
      pbVar6 = &_fsymc_info_bloop;
    }
    else {
      if (iVar5 == 1) {
        pbVar1 = (blog_info_t *)&_bl_static_blogfile_code_end;
        pbVar6 = &_fsymf_info_bloopbloop_base;
      }
      else {
        if (iVar5 != 2) {
          __s = argv[2];
          format = "input name = %s not support.\r\n";
          goto LAB_2302ac28;
        }
        pbVar1 = (blog_info_t *)&_bl_static_blogfile_code_end;
        pbVar6 = (blog_info_t *)&_bl_static_blogfile_code_end;
      }
    }
    iVar2 = ((int)((int)pbVar1 - (int)pbVar6) >> 3) + -1;
    iVar5 = 0;
    while (__s = argv[2], iVar5 <= iVar2) {
      iVar8 = iVar5 + iVar2 >> 1;
      pbVar1 = pbVar6 + iVar8;
      iVar4 = strcmp(pbVar1->name,__s);
      if (iVar4 < 0) {
        iVar5 = iVar8 + 1;
      }
      else {
        if (iVar4 == 0) {
          *pbVar1->level = bVar7;
          bl_printk("set %s = %d\r\n",pbVar1->name,(uint)*pbVar1->level);
          return;
        }
        iVar2 = iVar8 + -1;
      }
    }
    format = "input name = %s not find.\r\n";
  }
  else {
    iVar2 = strcmp(argv[1],"debug");
    bVar7 = BLOG_LEVEL_DEBUG;
    if (iVar2 == 0) goto LAB_2302ac30;
    iVar2 = strcmp(argv[1],"info");
    bVar7 = BLOG_LEVEL_INFO;
    if (iVar2 == 0) goto LAB_2302ac30;
    iVar2 = strcmp(argv[1],"warn");
    bVar7 = BLOG_LEVEL_WARN;
    if (iVar2 == 0) goto LAB_2302ac30;
    iVar2 = strcmp(argv[1],"error");
    bVar7 = BLOG_LEVEL_ERROR;
    if (iVar2 == 0) goto LAB_2302ac30;
    iVar2 = strcmp(argv[1],"assert");
    bVar7 = BLOG_LEVEL_ASSERT;
    if (iVar2 == 0) goto LAB_2302ac30;
    iVar2 = strcmp(argv[1],"never");
    bVar7 = BLOG_LEVEL_NEVER;
    if (iVar2 == 0) goto LAB_2302ac30;
    __s = argv[1];
    format = "input level = %s not support.\r\n";
  }
LAB_2302ac28:
  bl_printk(format,__s);
LAB_2302ab82:
  bl_printk("set blog error.\r\n");
  return;
}



void blog_init(void)

{
  blog_level_t **ppbVar1;
  undefined *puVar2;
  blog_info_t *pbVar3;
  undefined4 *puVar4;
  
  bl_printk("\r\nblog init set power on level %d, %d, %d.\r\n",2,2);
  pbVar3 = &_fsymc_info_bloop;
  while (pbVar3 < &_fsymf_info_bloopbloop_base) {
    ppbVar1 = &pbVar3->level;
    pbVar3 = pbVar3 + 1;
    **ppbVar1 = BLOG_LEVEL_INFO;
  }
  pbVar3 = &_fsymf_info_bloopbloop_base;
  while (pbVar3 < (blog_info_t *)&_bl_static_blogfile_code_end) {
    ppbVar1 = &pbVar3->level;
    pbVar3 = pbVar3 + 1;
    **ppbVar1 = BLOG_LEVEL_INFO;
  }
  puVar4 = (undefined4 *)&_bl_static_blogfile_code_end;
  while (puVar4 < &_bl_static_blogfile_code_end) {
    puVar2 = (undefined *)*puVar4;
    puVar4 = puVar4 + 2;
    *puVar2 = 2;
  }
  return;
}



int ota_dump_cmd(void)

{
  _dump_partition();
  return 0;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

void ota_tcp_cmd(char **argv)

{
  int iVar1;
  uint32_t uVar2;
  uint8_t uVar3;
  hostent *phVar4;
  char *__s;
  int s;
  uchar *input;
  undefined3 extraout_var;
  int iVar5;
  ssize_t sVar6;
  uint addr;
  int iVar7;
  uint ilen;
  int iVar8;
  bl_mtd_handle_t local_150;
  bl_mtd_handle_t handle;
  uint32_t address;
  uint32_t bin_size;
  sockaddr_in dest;
  uint8_t sha256_result [32];
  uint8_t sha256_img [32];
  char str [33];
  byte bStack206;
  HALPartition_Entry_Config ptEntry;
  iot_sha256_context ctx;
  
  phVar4 = lwip_gethostbyname(argv[1]);
  if (phVar4 == (hostent *)0x0) {
    __s = "gethostbyname Failed\r\n";
  }
  else {
    s = bl_mtd_open("FW",&local_150,1);
    if (s == 0) {
      s = lwip_socket(2,1,0);
      if (s < 0) {
        printf("Error in socket\r\n");
      }
      else {
        memset(&bin_size,0,0x10);
        bin_size._1_1_ = '\x02';
        bin_size._2_2_ = lwip_htons(0xd05);
        handle = (bl_mtd_handle_t)((ip4_addr_t *)((ip4_addr_t *)phVar4->h_addr_list)->addr)->addr;
        dest._0_4_ = (ip4_addr_t)handle;
        __s = ip4addr_ntoa((ip4_addr_t *)&handle);
        input = (uchar *)pvPortMalloc(0x200);
        uVar3 = hal_boot2_get_active_partition();
        printf("Starting OTA test. OTA bin addr is %p\r\n",input);
        printf("[OTA] [TEST] activeID is %u\r\n",CONCAT31(extraout_var,uVar3));
        iVar5 = hal_boot2_get_active_entries(0,(HALPartition_Entry_Config *)(str + 0x20));
        if (iVar5 == 0) {
          address = *(uint32_t *)(&ptEntry.type + ((uint)(bStack206 == 0) + 4) * 4);
          iVar7 = *(int *)(ptEntry.name + (uint)(bStack206 == 0) * 4 + 5);
          printf("Starting OTA test. OTA size is %lu\r\n");
          printf("[OTA] [TEST] activeIndex is %u, use OTA address=%08x\r\n",(uint)bStack206,iVar7);
          printf("[OTA] [TEST] Erase flash with size %lu...",address);
          bl_mtd_erase_all(local_150);
          printf("Done\r\n");
          printf("Server ip Address : %s\r\n",__s);
          iVar5 = lwip_connect(s,(sockaddr *)&bin_size,0x10);
          if (iVar5 == 0) {
            utils_sha256_init((iot_sha256_context *)&ptEntry.age);
            utils_sha256_starts((iot_sha256_context *)&ptEntry.age);
            memset(dest.sin_zero + 4,0,0x20);
            iVar5 = 0;
            uVar2 = 0;
            addr = 0;
            ilen = 0;
LAB_2302af8e:
            while (sVar6 = lwip_read(s,input + ilen,0x200 - ilen), -1 < sVar6) {
              uVar2 = uVar2 + sVar6;
              if (sVar6 == 0) {
                printf("[OTA] [TEST] seems ota file ends unexpectedly, already transfer %u\r\n",
                       uVar2);
                goto LAB_2302afbc;
              }
              printf("total = %d, ret = %d\n\r",uVar2,sVar6);
              ilen = ilen + sVar6;
              if (iVar5 != 0) {
                if (address != uVar2) goto code_r0x2302b164;
                goto LAB_2302b180;
              }
              if (0x1ff < ilen) {
                if (ilen != 0x200) {
                  printf("[OTA] [TCP] Assert for unexpected error %d\r\n",ilen);
                  do {
                    // WARNING: Do nothing block with infinite loop
                  } while( true );
                }
                memcpy(sha256_img + 0x1c,input,0x10);
                str[12] = '\0';
                puts("[OTA] [HEADER] ota header is ");
                puts((char *)(sha256_img + 0x1c));
                puts("\r\n");
                memcpy(sha256_img + 0x1c,input + 0x10,4);
                str[0] = '\0';
                puts("[OTA] [HEADER] file type is ");
                puts((char *)(sha256_img + 0x1c));
                puts("\r\n");
                __s = strstr((char *)(sha256_img + 0x1c),"XZ");
                memcpy(&address,input + 0x14,4);
                printf("[OTA] [HEADER] file length (exclude ota header) is %lu\r\n",address);
                memcpy(sha256_img + 0x1c,input + 0x20,0x10);
                str[12] = '\0';
                puts("[OTA] [HEADER] ver_hardware is ");
                puts((char *)(sha256_img + 0x1c));
                puts("\r\n");
                memcpy(sha256_img + 0x1c,input + 0x30,0x10);
                str[12] = '\0';
                puts("[OTA] [HEADER] ver_software is ");
                puts((char *)(sha256_img + 0x1c));
                puts("\r\n");
                memcpy(sha256_img + 0x1c,input + 0x40,0x20);
                str[28] = '\0';
                puts("[OTA] [HEADER] sha256 is ");
                do {
                  iVar8 = iVar5 + 0x1c;
                  iVar5 = iVar5 + 1;
                  printf("%02X",(uint)sha256_img[iVar8]);
                } while (iVar5 != 0x20);
                puts("\r\n");
                memcpy(sha256_result + 0x1c,input + 0x40,0x20);
                iVar5 = -0x2f0;
                if (__s == (char *)0x0) {
                  iVar5 = -0x2ec;
                }
                uVar2 = uVar2 - 0x200;
                printf("[OTA] [TCP] Update bin_size to %lu, file status %s\r\n",address,
                       iVar5 + 0x23081000);
                ilen = 0;
                iVar5 = 1;
              }
            }
            printf("ret = %d, err = %d\n\r",sVar6,errno);
LAB_2302afbc:
            lwip_close(s);
            vPortFree(input);
            utils_sha256_free((iot_sha256_context *)&ptEntry.age);
            goto LAB_2302ae54;
          }
          printf("Error in connect\r\n");
          lwip_close(s);
        }
        else {
          printf("PtTable_Get_Active_Entries fail\r\n");
        }
        vPortFree(input);
      }
LAB_2302ae54:
      bl_mtd_close(local_150);
      return;
    }
    __s = "Open Default FW partition failed\r\n";
  }
  puts(__s);
  return;
code_r0x2302b164:
  if (0x1ff < ilen) {
    if (ilen != 0x200) {
      printf("[OTA] [TCP] Assert for unexpected error %d\r\n",ilen);
      do {
                    // WARNING: Do nothing block with infinite loop
      } while( true );
    }
LAB_2302b180:
    printf("Will Write %u to %08X from %p\r\n",ilen,iVar7 + addr,input);
    utils_sha256_update((iot_sha256_context *)&ptEntry.age,input,ilen);
    bl_mtd_write(local_150,addr,ilen,input);
    addr = addr + ilen;
    ilen = 0;
    if (uVar2 == address) {
      utils_sha256_finish((iot_sha256_context *)&ptEntry.age,(uint8_t *)(dest.sin_zero + 4));
      puts("\r\nCalculated SHA256 Checksum:");
      do {
        iVar8 = ilen + 4;
        ilen = ilen + 1;
        printf("%02X",(uint)(byte)dest.sin_zero[iVar8]);
      } while (ilen != 0x20);
      puts("\r\nHeader SET SHA256 Checksum:");
      iVar8 = 0;
      do {
        iVar1 = iVar8 + 0x1c;
        iVar8 = iVar8 + 1;
        printf("%02X",(uint)sha256_result[iVar1]);
      } while (iVar8 != 0x20);
      puts("\r\n");
      iVar8 = memcmp(sha256_result + 0x1c,dest.sin_zero + 4,0x20);
      if (iVar8 != 0) {
        printf("[OTA] [TCP] SHA256 NOT Correct\r\n");
        goto LAB_2302afbc;
      }
      printf("[OTA] [TCP] prepare OTA partition info\r\n");
      ptEntry.maxLen[1] = address;
      printf("[OTA] [TCP] Update PARTITION, partition len is %lu\r\n");
      hal_boot2_update_ptable((HALPartition_Entry_Config *)(str + 0x20));
      printf("[OTA] [TCP] Rebooting\r\n");
      hal_reboot();
      ilen = 0;
    }
  }
  goto LAB_2302af8e;
}



void ota_tcp_cmd(char *buf,int len,int argc,char **argv)

{
  if (argc != 2) {
    printf("Usage: %s IP\r\n",*argv);
    return;
  }
  ota_tcp_cmd(argv);
  return;
}



