pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_sys_ota_cli_init(void)

{
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

void cmd_sys_time_now(char *buf,int len,int argc,char **argv)

{
  UDItype UVar1;
  undefined4 local_30;
  uint64_t epoch_ms;
  undefined auStack36 [4];
  utils_time_date_t date;
  
  local_30 = 0;
  epoch_ms._0_4_ = 0;
  puts("BL SYS TIME time is\r\n");
  bl_sys_time_get((uint64_t *)&local_30);
  UVar1 = __udivdi3();
  utils_time_date_from_epoch(auStack36,(int)UVar1);
  return;
}



int bl_sys_time_cli_init(void)

{
  return 0;
}



void bl_sys_time_update(undefined4 param_1,undefined4 param_2)

{
  time_synced._0_4_ = xTaskGetTickCount();
  epoch_time._0_4_ = param_1;
  epoch_time._4_4_ = param_2;
  time_synced._4_4_ = 0;
  return;
}



int bl_sys_time_get(uint64_t *epoch)

{
  TickType_t TVar1;
  int iVar2;
  uint uVar3;
  uint uVar4;
  
  if (((uint)epoch_time | epoch_time._4_4_) == 0) {
    iVar2 = -1;
  }
  else {
    TVar1 = xTaskGetTickCount();
    uVar4 = TVar1 - (int)time_synced;
    uVar3 = (uint)epoch_time + uVar4;
    iVar2 = ((int)uVar4 >> 0x1f) + epoch_time._4_4_;
    *(uint *)epoch = uVar3;
    *(int *)((int)epoch + 4) = (uint)(uVar3 < uVar4) + iVar2;
    iVar2 = 0;
  }
  return iVar2;
}



int bl_sys_time_sync_state(uint32_t *xTicksToJump)

{
  bool bVar1;
  TickType_t TVar2;
  TickType_t TVar3;
  uint uVar4;
  uint64_t uVar5;
  
  if (sync_init != 0) {
    vTaskEnterCritical();
    TVar2 = xTaskGetTickCount();
    TVar3 = TVar2;
    uVar5 = bl_rtc_get_timestamp_ms();
    vTaskExitCritical((int)uVar5);
    uVar4 = TVar3 - init_tick_rtc;
    bVar1 = TVar2 - init_tick_rtos < uVar4;
    if (bVar1) {
      *xTicksToJump = (init_tick_rtos - TVar2) + uVar4;
    }
    return (uint)bVar1;
  }
  return -1;
}



cli_command * cli_command_get(int idx,int *is_static_cmd)

{
  cli_st *pcVar1;
  cli_command *pcVar2;
  
  pcVar1 = cli;
  pcVar2 = (cli_command *)0xffffffff;
  if (-1 < idx) {
    pcVar2 = (cli_command *)0xffffffff;
    if ((uint)idx < cli->num_static_cmds + 8) {
      if ((uint)idx < cli->num_static_cmds) {
        if (is_static_cmd != (int *)0x0) {
          *is_static_cmd = 1;
        }
        pcVar2 = pcVar1->static_cmds + idx;
      }
      else {
        if (is_static_cmd != (int *)0x0) {
          *is_static_cmd = 0;
        }
        pcVar2 = pcVar1->dynamic_cmds[idx - pcVar1->num_static_cmds];
      }
    }
  }
  return pcVar2;
}



void exit_cmd(char *buf,int len,int argc,char **argv)

{
  cliexit = 1;
  return;
}



int cb_idnoe(void *arg,inode_t *node)

{
  uint8_t uVar1;
  char *pcVar2;
  undefined4 uVar3;
  
  if (*(int *)arg == 0) {
    *(undefined4 *)arg = 1;
    printf("\tSize\t\t\t\t\t Name\t\t\tFiletype\r\n");
    printf("----------------------------------------------------------------------------------\r\n")
    ;
  }
  uVar1 = node->type;
  uVar3 = 0x1c;
  if ((1 < (byte)(uVar1 - 1)) && (uVar3 = 0x50, uVar1 != '\x03')) {
    uVar3 = 0;
  }
  if (uVar1 == '\x01') {
    pcVar2 = "Char Device";
  }
  else {
    if (uVar1 == '\x02') {
      pcVar2 = "Block Device";
    }
    else {
      if (uVar1 == '\x03') {
        pcVar2 = "File System";
      }
      else {
        pcVar2 = "Unknown";
      }
    }
  }
  printf("%10d\t\t%30s\t\t\t%s\r\n",uVar3,node->i_name,pcVar2);
  return 0;
}



void ota_cmd(char *buf,int len,int argc,char **argv)

{
  aos_task_new("LOCAL OTA",tftp_ota_thread,(void *)0x0,0x1000);
  return;
}



void tftp_ota_thread(void *arg)

{
  aos_task_exit(0);
  return;
}



void cat_cmd(char *buf,int len,int argc,char **argv)

{
  int fd;
  ssize_t sVar1;
  byte local_11 [4];
  char ch;
  
  if (argc != 2) {
    printf("invalid parameter!\r\n");
  }
  fd = aos_open(argv[1],0);
  if (fd < 0) {
    printf("open %s failed!\r\n",argv[1]);
  }
  else {
    while (sVar1 = aos_read(fd,local_11,1), sVar1 == 1) {
      printf("%c",(uint)local_11[0]);
    }
    printf("\r\n");
    aos_close(fd);
  }
  return;
}



void hexdump_cmd(char *buf,int len,int argc,char **argv)

{
  int fd;
  void *local_18;
  romfs_filebuf_t filebuf;
  
  if (argc != 2) {
    printf("invalid parameter!\r\n");
  }
  fd = aos_open(argv[1],0);
  if (fd < 0) {
    printf("open %s failed!\r\n",argv[1]);
  }
  else {
    memset(&local_18,0,8);
    aos_ioctl(fd,1,(ulong)&local_18);
    printf("Found file %s. XIP Addr %p, len %lu\r\n",argv[1],local_18,filebuf.buf);
    utils_hexdump(local_18,(uint)filebuf.buf);
    aos_close(fd);
  }
  return;
}



int aos_cli_init(int use_thread)

{
  cli_st *pcVar1;
  int iVar2;
  
  cli = (cli_st *)aos_malloc(0x244);
  iVar2 = 0xc;
  if (cli != (cli_st *)0x0) {
    memset(cli,0,0x244);
    pcVar1 = cli;
    cli->static_cmds = cmds_user;
    pcVar1->echo_disabled = 0;
    pcVar1->num_static_cmds = 0x6c;
    pcVar1->num_commands = 0x6c;
    pcVar1->initialized = 1;
    iVar2 = 0;
  }
  return iVar2;
}



void * aos_cli_event_cb_read_get(void)

{
  return console_cb_read;
}



int cli_putstr(char *msg)

{
  int iVar1;
  size_t sVar2;
  ssize_t sVar3;
  
  sVar2 = strlen(msg);
  iVar1 = 0;
  while ((iVar1 < (int)sVar2 &&
         (sVar3 = aos_write(fd_console,msg + iVar1,sVar2 - iVar1), -1 < sVar3))) {
    iVar1 = iVar1 + sVar3;
  }
  return 0;
}



void ps_cmd(char *buf,int len,int argc,char **argv)

{
  char *__dest;
  char *__dest_00;
  size_t sVar1;
  int iVar2;
  
  __dest_00 = (char *)pvPortMalloc(0x600);
  if (__dest_00 != (char *)0x0) {
    strcpy(__dest_00,"Task");
    sVar1 = strlen(__dest_00);
    __dest = __dest_00 + sVar1;
    sVar1 = strlen("Task");
    iVar2 = sVar1 - (int)__dest;
    while ((int)(__dest + iVar2) < 0xd) {
      *__dest = ' ';
      __dest = __dest + 1;
      *__dest = '\0';
    }
    strcpy(__dest,
           "State   Priority  Stack    #          Base\r\n********************************************************\r\n"
          );
    sVar1 = strlen(
                  "State   Priority  Stack    #          Base\r\n********************************************************\r\n"
                  );
    vTaskList(__dest + sVar1);
    cli_putstr(__dest_00);
    vPortFree(__dest_00);
    return;
  }
  return;
}



int aos_cli_printf(char *msg,...)

{
  size_t sVar1;
  int iVar2;
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list ap;
  char message [256];
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack28 = in_a1;
  uStack24 = in_a2;
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  memset(&ap,0,0x100);
  sVar1 = 0;
  if (esc_tag_len != '\0') {
    strcpy((char *)&ap,esc_tag);
    sVar1 = strlen(esc_tag);
  }
  iVar2 = vsnprintf((char *)((int)&ap + sVar1),0x100 - sVar1,msg,&uStack28);
  if (0 < iVar2) {
    cli_putstr((char *)&ap);
  }
  return 0;
}



int proc_onecmd(int argc,char **argv)

{
  cli_st *pcVar1;
  cli_st *pcVar2;
  char *__s1;
  cli_command *pcVar3;
  int iVar4;
  uint idx;
  uint uVar5;
  char *__n;
  char *__s2;
  
