pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (argc < 1) {
    return 0;
  }
  if (cli->echo_disabled == 0) {
    printf("\r\n");
  }
  __n = (char *)0x0;
  __s1 = strchr(*argv,0x2e);
  __s2 = *argv;
  if (__s1 != (char *)0x0) {
    __n = __s1 + -(int)__s2;
  }
  idx = 0;
  uVar5 = 0;
  while( true ) {
    if (cli->num_static_cmds + 8 <= idx) {
      return 1;
    }
    if (cli->num_commands <= uVar5) break;
    pcVar3 = cli_command_get(idx,(int *)0x0);
    __s1 = pcVar3->name;
    if (__s1 != (char *)0x0) {
      if (__n == (char *)0x0) {
        iVar4 = strcmp(__s1,__s2);
      }
      else {
        iVar4 = strncmp(__s1,__s2,(size_t)__n);
      }
      pcVar1 = cli;
      if (iVar4 == 0) {
        __s1 = (char *)aos_malloc(0x200);
        pcVar2 = cli;
        pcVar1->outbuf = __s1;
        if (pcVar2->outbuf == (char *)0x0) {
          aos_cli_printf("Error! cli alloc mem fail!\r\n");
          return 1;
        }
        memset(pcVar2->outbuf,0,0x200);
        (*pcVar3->function)(cli->outbuf,0x200,argc,argv);
        aos_cli_printf("%s",cli->outbuf);
        aos_free(cli->outbuf);
        cli->outbuf = (char *)0x0;
        return 0;
      }
      uVar5 = uVar5 + 1;
    }
    idx = idx + 1;
  }
  return 1;
}



void ls_cmd(char *buf,int len,int argc,char **argv)

{
  stat *st;
  int iVar1;
  aos_dir_t *dir;
  aos_dirent_t *paVar2;
  char *msg;
  size_t __n;
  size_t sVar3;
  undefined4 uStack180;
  int env;
  char path_name [128];
  
  uStack180 = 0;
  st = (stat *)pvPortMalloc(0x58);
  memset(stat,0,0x58);
  memset(&env,0,0x80);
  if (argc == 2) {
    iVar1 = strcmp(argv[1],"/sdcard");
    if (iVar1 == 0) {
      dir = aos_opendir("/sdcard");
      if (dir == (aos_dir_t *)0x0) {
        msg = "can not open sdcard\r\n";
LAB_2302b970:
        printf(msg);
        goto LAB_2302b94a;
      }
      printf("\tSize\t\t\t\t\t Name\t\t\tFiletype\r\n");
      printf(
            "----------------------------------------------------------------------------------\r\n"
            );
      while (paVar2 = aos_readdir(dir), paVar2 != (aos_dirent_t *)0x0) {
        snprintf((char *)&env,0x7f,"/sdcard/%s",&paVar2->field_0x5);
        iVar1 = aos_stat((char *)&env,st);
        if (iVar1 == 0) {
          iVar1 = 0x450;
          if (-1 < (int)(st->st_mode << 0x11)) {
            iVar1 = 0x46c;
          }
          printf("\r\nCalculated SHA256 Checksum:" + iVar1 + 0x18,st->st_size,&paVar2->field_0x5);
        }
      }
    }
    else {
      msg = argv[1];
      __n = strlen("/romfs");
      iVar1 = memcmp(msg,"/romfs",__n);
      if (iVar1 != 0) {
        iVar1 = strcmp(argv[1],"/");
        if (iVar1 != 0) {
          msg = "un-supported direcotry!\r\n";
          goto LAB_2302ba96;
        }
        goto LAB_2302ba7e;
      }
      dir = aos_opendir(argv[1]);
      if (dir == (aos_dir_t *)0x0) {
        msg = "can not open romfs\r\n";
        goto LAB_2302b970;
      }
      printf("\tSize\t\t\t\t\t Name\t\t\tFiletype\r\n");
      printf(
            "----------------------------------------------------------------------------------\r\n"
            );
      while (paVar2 = aos_readdir(dir), paVar2 != (aos_dirent_t *)0x0) {
        memset(&env,0,0x80);
        snprintf((char *)&env,0x7f,"%s",argv[1]);
        __n = strlen((char *)&env);
        if (*(char *)((int)&uStack180 + __n + 3) != '/') {
          __n = strlen((char *)&env);
          *(undefined *)((int)&env + __n) = 0x2f;
        }
        __n = strlen((char *)&env);
        sVar3 = strlen((char *)&env);
        snprintf((char *)((int)&env + __n),0x7f - sVar3,"%s",&paVar2->field_0x5);
        iVar1 = aos_stat((char *)&env,st);
        if (iVar1 == 0) {
          iVar1 = 0x450;
          if (-1 < (int)(st->st_mode << 0x11)) {
            iVar1 = 0x46c;
          }
          printf("\r\nCalculated SHA256 Checksum:" + iVar1 + 0x18,st->st_size,&paVar2->field_0x5);
        }
      }
    }
    aos_closedir(dir);
  }
  else {
    if (argc != 1) {
      msg = "invalid parameter!\r\n";
LAB_2302ba96:
      aos_cli_printf(msg);
      goto LAB_2302b94a;
    }
LAB_2302ba7e:
    inode_forearch_name(cb_idnoe,&uStack180);
  }
LAB_2302b94a:
  vPortFree(st);
  return;
}



void uptime_cmd(char *buf,int len,int argc,char **argv)

{
  char *pcVar1;
  char *pcVar2;
  int iVar3;
  int iVar4;
  longlong lVar5;
  DItype DVar6;
  
  lVar5 = aos_now_ms();
  aos_cli_printf("UP time in ms %llu\r\n",buf,len,(int)lVar5);
  pcVar1 = buf;
  iVar3 = len;
  __divdi3();
  __moddi3();
  pcVar2 = buf;
  iVar4 = len;
  __divdi3();
  __moddi3();
  __divdi3();
  __divdi3();
  DVar6 = __moddi3();
  aos_cli_printf("UP time in %llu days, %llu hours, %llu minutes, %llu seconds\r\n",buf,len,pcVar2,
                 iVar4,pcVar1,iVar3,(int)DVar6);
  return;
}



void reset_cmd(char *buf,int len,int argc,char **argv)

{
  aos_cli_printf("system reset\r\n");
  hal_sys_reset();
  return;
}



void poweroff_cmd(char *buf,int len,int argc,char **argv)

{
  aos_cli_printf("poweroff\r\n");
  hal_poweroff();
  return;
}



void reboot_cmd(char *buf,int len,int argc,char **argv)

{
  aos_cli_printf("reboot\r\n");
  hal_reboot();
  return;
}



// WARNING: Variable defined which should be unmapped: desc

void version_cmd(char *buf,int len,int argc,char **argv)

{
  int iVar1;
  size_t sVar2;
  int iStack76;
  int num;
  uint addr [4];
  uint size [4];
  char desc [4] [6];
  
  iStack76 = 4;
  aos_cli_printf("kernel version :posix\r\n");
  aos_cli_printf("release_bl_iot_sdk_1.6.11-1-g66bb28da-dirty");
  aos_cli_printf("\r\n");
  iVar1 = bl_chip_memory_ram(&iStack76,(uint *)&num,addr + 3,(char (*) [6])(size + 3));
  if (iVar1 == 0) {
    aos_cli_printf("Memory Configuration on %d banks:\r\n",iStack76);
    while (iVar1 < iStack76) {
      aos_cli_printf("    [%d]%6s %6u Kbytes @ %p\r\n",iVar1,(int)size + iVar1 * 6 + 0xc,
                     addr[iVar1 + 3] >> 10,(&num)[iVar1]);
      iVar1 = iVar1 + 1;
    }
  }
  sVar2 = xPortGetFreeHeapSize();
  aos_cli_printf("Heap left: %d Bytes\r\n",sVar2);
  return;
}



void devname_cmd(char *buf,int len,int argc,char **argv)

{
  aos_cli_printf("device name: %s\r\n",&UNK_23081328);
  return;
}



void echo_cmd(char *buf,int len,int argc,char **argv)

{
  int iVar1;
  char *pcVar2;
  
  if (argc == 1) {
    if (cli->echo_disabled == 0) {
      pcVar2 = "Enabled";
    }
    else {
      pcVar2 = "Disabled";
    }
    aos_cli_printf("Usage: echo on/off. Echo is currently %s\r\n",pcVar2);
    return;
  }
  iVar1 = strcmp(argv[1],"on");
  if (iVar1 == 0) {
    aos_cli_printf("Enable echo\r\n");
    cli->echo_disabled = 0;
  }
  else {
    iVar1 = strcmp(argv[1],"off");
    if (iVar1 == 0) {
      aos_cli_printf("Disable echo\r\n");
      cli->echo_disabled = 1;
    }
  }
  return;
}



void mmem_cmd(char *buf,int len,int argc,char **argv)

{
  uint uVar1;
  int iVar2;
  uint uVar3;
  
  if (argc == 3) {
    iVar2 = 4;
LAB_2302bd2e:
    uVar1 = strtol(argv[2],(char **)0x0,0);
  }
  else {
    if (argc == 4) {
      iVar2 = strtol(argv[3],(char **)0x0,0);
      goto LAB_2302bd2e;
    }
    if (argc != 2) goto LAB_2302bd4c;
    uVar1 = 0;
    iVar2 = 4;
  }
  len = strtol(argv[1],(char **)0x0,0);
  if ((uint *)len != (uint *)0x0) {
    if (iVar2 == 1) {
      uVar3 = (uint)*(byte *)len;
      *(byte *)len = (byte)uVar1;
      uVar1 = (uint)*(byte *)len;
    }
    else {
      if (iVar2 == 2) {
        uVar3 = (uint)*(ushort *)len;
        *(ushort *)len = (ushort)uVar1;
        uVar1 = (uint)*(ushort *)len;
      }
      else {
        uVar3 = *(uint *)len;
        *(uint *)len = uVar1;
        uVar1 = *(uint *)len;
      }
    }
    aos_cli_printf("value on 0x%x change from 0x%x to 0x%x.\r\n",len,uVar3,uVar1);
    return;
  }
LAB_2302bd4c:
  aos_cli_printf(
                 "m <addr> <value> <width>\r\naddr  : address to modify\r\nvalue : new value (default is 0)\r\nwidth : width of unit, 1/2/4 (default is 4)\r\n"
                 ,len);
  return;
}



void pmem_cmd(char *buf,int len,int argc,char **argv)

{
  ushort uVar1;
  undefined4 *puVar2;
  int iVar3;
  undefined4 uVar4;
  long lVar5;
  uint uVar6;
  char *pcStack52;
  char *pos;
  
  pcStack52 = (char *)0x0;
  if (argc == 3) {
    lVar5 = 4;
LAB_2302be3e:
    iVar3 = strtol(argv[2],(char **)0x0,0);
    if (0x400 < iVar3) {
      iVar3 = 0x400;
    }
  }
  else {
    if (argc == 4) {
      lVar5 = strtol(argv[3],(char **)0x0,0);
      goto LAB_2302be3e;
    }
    lVar5 = 4;
    iVar3 = 0x10;
    puVar2 = (undefined4 *)0x0;
    if (argc != 2) goto LAB_2302be02;
  }
  puVar2 = (undefined4 *)strtol(argv[1],&pcStack52,0);
LAB_2302be02:
  if ((pcStack52 == (char *)0x0) || (pcStack52 == argv[1])) {
    aos_cli_printf(
                  "p <addr> <nunits> <width>\r\naddr  : address to display\r\nnunits: number of units to display (default is 16)\r\nwidth : width of unit, 1/2/4 (default is 4)\r\n"
                  );
  }
  else {
    if (lVar5 == 1) {
      uVar6 = 0;
      while ((int)uVar6 < iVar3) {
        if ((uVar6 & 0xf) == 0) {
          aos_cli_printf("0x%08x:",(byte *)((int)puVar2 + uVar6));
        }
        aos_cli_printf(" %02x",(uint)*(byte *)((int)puVar2 + uVar6));
        if ((uVar6 & 0xf) == 0xf) {
          aos_cli_printf("\r\n");
        }
        uVar6 = uVar6 + 1;
      }
    }
    else {
      if (lVar5 == 2) {
        uVar6 = 0;
        while ((int)uVar6 < iVar3) {
          if ((uVar6 & 7) == 0) {
            aos_cli_printf("0x%08x:",puVar2);
          }
          uVar1 = *(ushort *)puVar2;
          puVar2 = (undefined4 *)((int)puVar2 + 2);
          aos_cli_printf(" %04x",(uint)uVar1);
          if ((uVar6 & 7) == 7) {
            aos_cli_printf("\r\n");
          }
          uVar6 = uVar6 + 1;
        }
      }
      else {
        uVar6 = 0;
        while ((int)uVar6 < iVar3) {
          if ((uVar6 & 3) == 0) {
            aos_cli_printf("0x%08x:",puVar2);
          }
          uVar4 = *puVar2;
          puVar2 = puVar2 + 1;
          aos_cli_printf(" %08x",uVar4);
          if ((uVar6 & 3) == 3) {
            aos_cli_printf("\r\n");
          }
          uVar6 = uVar6 + 1;
        }
      }
    }
  }
  return;
}



void help_cmd(char *buf,int len,int argc,char **argv)

{
  cli_command *pcVar1;
  uint idx;
  char *pcVar2;
  uint uVar3;
  
  aos_cli_printf("====Build-in Commands====\r\n");
  pcVar1 = built_ins;
  aos_cli_printf("====Support %d cmds once, seperate by ; ====\r\n",4);
  do {
    if (pcVar1->name != (char *)0x0) {
      pcVar2 = pcVar1->help;
      if (pcVar1->help == (char *)0x0) {
        pcVar2 = "";
      }
      aos_cli_printf("%-25s: %s\r\n",pcVar2);
    }
    pcVar1 = pcVar1 + 1;
  } while (pcVar1 != cmds_user);
  aos_cli_printf("\r\n");
  aos_cli_printf("====User Commands====\r\n");
  uVar3 = 0x10;
  idx = 0;
  while ((idx < cli->num_static_cmds + 8 && (uVar3 < cli->num_commands))) {
    pcVar1 = cli_command_get(idx,(int *)0x0);
    if (((pcVar1 < built_ins) || ((cli_command *)((int)&built_ins[0xf].function + 3U) < pcVar1)) &&
       (pcVar1->name != (char *)0x0)) {
      pcVar2 = pcVar1->help;
      if (pcVar1->help == (char *)0x0) {
        pcVar2 = "";
      }
      aos_cli_printf("%-25s: %s\r\n",pcVar2);
      uVar3 = uVar3 + 1;
    }
    idx = idx + 1;
  }
  return;
}



