pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

int cli_getchar(char *inbuf)

{
  int32_t iVar1;
  uint uVar2;
  uint32_t local_50;
  uint32_t recv_size;
  uart_dev_t uart_stdio;
  
  local_50 = 0;
  memset(&recv_size,0,0x3c);
  recv_size._0_1_ = '\0';
  iVar1 = hal_uart_recv_II((uart_dev_t *)&recv_size,inbuf,1,&local_50,0xffffffff);
  if (iVar1 == 0) {
    uVar2 = (uint)(local_50 == 1);
  }
  else {
    uVar2 = 0;
  }
  return uVar2;
}



// WARNING: Could not reconcile some variable overlaps

void cli_main_input(char *buffer,int count)

{
  byte bVar1;
  char cVar2;
  cli_st *pcVar3;
  cli_st *pcVar4;
  uint8_t uVar5;
  anon_struct *paVar6;
  undefined1 *argv;
  size_t __n;
  cli_command *pcVar7;
  uint uVar8;
  char *__s1;
  char *__s;
  anon_struct aVar9;
  int iVar10;
  byte *__src;
  char *__s_00;
  uint idx;
  int iVar11;
  size_t __n_00;
  int iVar12;
  uint uStack84;
  anon_struct stat;
  char c;
  
  pcVar3 = cli;
  __s1 = cli->inbuf;
  if (__s1 == (char *)0x0) {
    __s1 = "inbuf_null\r\n";
LAB_2302c170:
    aos_cli_printf(__s1);
    return;
  }
  iVar11 = 0;
  uVar5 = esc_tag_len;
LAB_2302c092:
  esc_tag_len = uVar5;
  if (buffer == (char *)0x0) {
    iVar12 = cli_getchar((char *)&stat);
    if (iVar12 != 1) {
      return;
    }
  }
  else {
    if (count <= iVar11) {
      return;
    }
    __src = (byte *)(buffer + iVar11);
    iVar11 = iVar11 + 1;
    stat = (anon_struct)((uint)stat & 0xffffff00 | (uint)*__src);
  }
  pcVar4 = cli;
  cVar2 = key1_4391;
  if ((stat._0_1_ != '\n') && (stat._0_1_ != '\r')) {
    uVar5 = esc_tag_len;
    if (stat._0_1_ == '\x1b') {
      esc_4390 = '\x01';
      key1_4391 = -1;
      key2_4392 = -1;
    }
    else {
      if (esc_4390 != '\0') {
        if (key1_4391 < '\0') {
          __s = (char *)(int)stat._0_1_;
          key1_4391 = stat._0_1_;
          if (__s == (char *)0x5b) goto LAB_2302c092;
          __s1[pcVar3->bp] = '\x1b';
          idx = pcVar3->bp + 1;
          pcVar3->bp = idx;
          __s1[idx] = stat._0_1_;
          pcVar3->bp = pcVar3->bp + 1;
          if (cli->echo_disabled == 0) {
            __s_00 = "\x1b%c";
LAB_2302c1fa:
            printf(__s_00,__s);
          }
        }
        else {
          if ((key2_4392 < '\0') && (key2_4392 = stat._0_1_, stat._0_1_ == 't')) {
            esc_tag[0] = '\x1b';
            esc_tag[1] = key1_4391;
            esc_tag_len = '\x02';
          }
          idx = SEXT14(key2_4392);
          if (((idx & 0xff) - 0x41 & 0xff) < 2) {
            __s_00 = __s1;
            if (idx == 0x41) {
              iVar10 = cli->his_idx;
              iVar12 = iVar10;
              do {
                iVar12 = (iVar12 + 0xff) % 0x100;
                if (cli->history[iVar12] != '\0') {
                  if (iVar10 != iVar12) {
                    do {
                      iVar12 = (iVar12 + 0xff) % 0x100;
                    } while (cli->history[iVar12] != '\0');
                    iVar12 = (iVar12 + 1) % 0x100;
                  }
                  break;
                }
              } while (iVar10 != iVar12);
              cli->his_idx = iVar12;
              while (pcVar4->history[iVar10] != '\0') {
                *__s_00 = pcVar4->history[iVar10];
                iVar10 = (iVar10 + 1) % 0x100;
                __s_00 = __s_00 + 1;
              }
            }
            else {
              iVar10 = cli->his_idx;
              iVar12 = iVar10;
              while (cli->history[iVar12] != '\0') {
                iVar12 = (iVar12 + 1) % 0x100;
              }
              if (iVar10 != iVar12) {
                do {
                  iVar12 = (iVar12 + 1) % 0x100;
                } while (cli->history[iVar12] == '\0');
              }
              cli->his_idx = iVar12;
              while (pcVar4->history[iVar10] != '\0') {
                *__s_00 = pcVar4->history[iVar10];
                iVar10 = (iVar10 + 1) % 0x100;
                __s_00 = __s_00 + 1;
              }
            }
            *__s_00 = '\0';
            printf("\r\n# %s",__s1);
            __n = strlen(__s1);
            pcVar3->bp = __n;
            esc_tag[0] = '\0';
            esc_tag_len = '\0';
          }
          else {
            if (idx == 0x74) {
              if (0x3f < esc_tag_len) {
                esc_tag[0] = '\0';
                esc_tag_len = '\0';
                esc_4390 = '\0';
                printf("Error: esc_tag buffer overflow\r\n");
                uVar5 = esc_tag_len;
                goto LAB_2302c092;
              }
              idx = (uint)esc_tag_len + 1 & 0xff;
              esc_tag[(uint)esc_tag_len] = stat._0_1_;
              pcVar4 = cli;
              uVar5 = (uint8_t)idx;
              if (stat._0_1_ != 'm') goto LAB_2302c092;
              esc_tag[idx] = '\0';
              esc_tag_len = esc_tag_len + '\x02';
              if (pcVar4->echo_disabled == 0) {
                __s = esc_tag;
                __s_00 = "%s";
                goto LAB_2302c1fa;
              }
            }
            else {
              __s1[pcVar3->bp] = '\x1b';
              uVar8 = pcVar3->bp + 1;
              pcVar3->bp = uVar8;
              __s1[uVar8] = cVar2;
              uVar8 = pcVar3->bp + 1;
              pcVar3->bp = uVar8;
              __s1[uVar8] = (char)(idx & 0xff);
              pcVar3->bp = pcVar3->bp + 1;
              if (cli->echo_disabled == 0) {
                printf("\x1b%c%c");
              }
              esc_tag[0] = '\0';
              esc_tag_len = '\0';
            }
          }
        }
        esc_4390 = '\0';
        uVar5 = esc_tag_len;
        goto LAB_2302c092;
      }
      __s1[pcVar3->bp] = stat._0_1_;
      if ((stat._0_1_ == '\b') || (stat._0_1_ == '\x7f')) {
        uVar5 = esc_tag_len;
        if ((pcVar3->bp != 0) &&
           (pcVar3->bp = pcVar3->bp - 1, uVar5 = esc_tag_len, cli->echo_disabled == 0)) {
          printf("%c %c",8,8);
          uVar5 = esc_tag_len;
        }
      }
      else {
        if (stat._0_1_ == '\t') {
          __s1[pcVar3->bp] = '\0';
          aos_cli_printf("\r\n");
          iVar12 = 0;
          uVar8 = 0;
          idx = 0;
          __s_00 = (char *)0x0;
          while ((idx < cli->num_static_cmds + 8 && (uVar8 < cli->num_commands))) {
            pcVar7 = cli_command_get(idx,(int *)0x0);
            __s = __s_00;
            if (pcVar7->name != (char *)0x0) {
              iVar10 = strncmp(__s1,pcVar7->name,pcVar3->bp);
              if (iVar10 == 0) {
                iVar12 = iVar12 + 1;
                __s = pcVar7->name;
                if (iVar12 != 1) {
                  if (iVar12 == 2) {
                    aos_cli_printf("%s %s ",__s_00);
                    __s = __s_00;
                  }
                  else {
                    aos_cli_printf("%s ",__s);
                    __s = __s_00;
                  }
                }
              }
              uVar8 = uVar8 + 1;
            }
            idx = idx + 1;
            __s_00 = __s;
          }
          if (iVar12 == 1) {
            if ((__s_00 != (char *)0x0) && (__n = strlen(__s_00), __n < 0x100)) {
              idx = pcVar3->bp;
              memcpy(__s1 + idx,__s_00 + idx,__n - idx);
              iVar12 = (__n - idx) + pcVar3->bp;
              pcVar3->bp = iVar12 + 1;
              __s1[iVar12] = ' ';
              __s1[pcVar3->bp] = '\0';
            }
          }
          else {
            if (1 < iVar12) {
              aos_cli_printf("\r\n");
            }
          }
          aos_cli_printf("%s%s",&DAT_230812a4,__s1);
          uVar5 = esc_tag_len;
        }
        else {
          if (cli->echo_disabled == 0) {
            printf("%c",(uint)stat & 0xff);
          }
          idx = pcVar3->bp + 1;
          pcVar3->bp = idx;
          uVar5 = esc_tag_len;
          if (0xff < idx) {
            aos_cli_printf("Error: input buffer overflow\r\n");
            aos_cli_printf("# ");
            pcVar3->bp = 0;
            return;
          }
        }
      }
    }
    goto LAB_2302c092;
  }
  __s1[pcVar3->bp] = '\0';
  __s1 = pcVar4->inbuf;
  pcVar3->bp = 0;
  __n = strlen(__s1);
  if (__n != 0) {
    __s = cli->inbuf;
    __n = strlen(__s);
    pcVar3 = cli;
    __n = __n + 1;
    iVar11 = cli->his_cur;
    __n_00 = 0x100 - iVar11;
    cli->his_idx = iVar11;
    __s_00 = pcVar3->history + iVar11;
    iVar12 = iVar11 + __n + -1;
    if ((int)__n_00 < (int)__n) {
      iVar12 = iVar12 % 0x100;
      cVar2 = pcVar3->history[iVar12];
      strncpy(__s_00,__s,__n_00);
      __n = __n - __n_00;
      __s = __s + __n_00;
      __s_00 = cli->history;
    }
    else {
      cVar2 = pcVar3->history[iVar11 + __n + -1];
    }
    strncpy(__s_00,__s,__n);
    pcVar3 = cli;
    iVar11 = (iVar12 + 1) % 0x100;
    cli->his_cur = iVar11;
    if (cVar2 != '\0') {
      while (iVar12 = (int)&pcVar3->initialized + iVar11, *(char *)(iVar12 + 0x144) != '\0') {
        *(undefined *)(iVar12 + 0x144) = 0;
        iVar11 = (iVar11 + 1) % 0x100;
      }
    }
  }
  stat = (anon_struct)0x0;
  memset(argvall_4313,0,0x100);
  memset(&stat,0,0x10);
  memset(&uStack84,0,4);
  iVar11 = 0;
  paVar6 = &stat;
  iVar12 = 0;
  do {
    __src = (byte *)(__s1 + iVar11);
    bVar1 = *__src;
    if (bVar1 != 0x20) {
      if (0x20 < bVar1) {
        if (bVar1 == 0x22) {
          if (((iVar11 == 0) || (__s_00 = __s1 + iVar11 + -1, *__s_00 != '\\')) ||
             ((uStack84 & 1) == 0)) {
            idx = uStack84 & 3;
            if (idx != 1) {
              if (idx == 2) goto LAB_2302c80a;
              if (idx == 0) {
                aVar9 = *paVar6;
                uStack84 = uStack84 & 0xfffffffc | 3;
                *(int *)paVar6 = (int)aVar9 + 1;
                *(char **)(argvall_4313 + (iVar12 * 0x10 + (int)aVar9) * 4) = __s1 + iVar11 + 1;
              }
              else {
                if (idx == 3) {
                  uStack84._0_1_ = (byte)uStack84 & 0xfc;
                  goto LAB_2302c7d0;
                }
              }
            }
          }
          else {
LAB_2302c76c:
            iVar11 = iVar11 + -1;
            __n = strlen((char *)__src);
            memcpy(__s_00,__src,__n + 1);
          }
        }
        else {
          if (bVar1 != 0x3b) goto LAB_2302c13a;
          if (((iVar11 != 0) && (__s_00 = __s1 + iVar11 + -1, *__s_00 == '\\')) &&
             ((uStack84 & 1) != 0)) goto LAB_2302c76c;
          if ((uStack84 & 2) != 0) goto LAB_2302c80a;
          if ((uStack84 & 3) == 1) {
            uStack84 = uStack84 & 0xfffffffe;
            *__src = 0;
            if ((*paVar6 != (anon_struct)0x0) && (iVar12 = iVar12 + 1, iVar12 < 4)) {
              paVar6 = &stat + iVar12;
            }
          }
        }
        goto LAB_2302c6c4;
      }
      if (bVar1 != 0) {
LAB_2302c13a:
        if ((uStack84 & 1) == 0) {
          aVar9 = *paVar6;
          uStack84 = uStack84 | 1;
          *(int *)paVar6 = (int)aVar9 + 1;
          *(byte **)(argvall_4313 + (iVar12 * 0x10 + (int)aVar9) * 4) = __src;
        }
        goto LAB_2302c6c4;
      }
      if ((uStack84 & 2) == 0) {
        uStack84 = uStack84 | 4;
        goto LAB_2302c6c4;
      }
LAB_2302c80a:
      aos_cli_printf("syntax error\r\n");
      goto LAB_2302c72c;
    }
    if (((iVar11 != 0) && (__s_00 = __s1 + iVar11 + -1, *__s_00 == '\\')) && ((uStack84 & 1) != 0))
    goto LAB_2302c76c;
    if ((uStack84 & 3) == 1) {
      uStack84._0_1_ = (byte)uStack84 & 0xfe;
LAB_2302c7d0:
      uStack84 = uStack84 & 0xffffff00 | (uint)(byte)uStack84;
      *__src = 0;
    }
LAB_2302c6c4:
  } while ((((uStack84 & 4) == 0) && (iVar11 = iVar11 + 1, iVar11 < 0x100)) &&
          ((iVar12 < 4 && ((int)*paVar6 < 0x10))));
  if ((uStack84 & 2) != 0) goto LAB_2302c80a;
  paVar6 = &stat;
  argv = argvall_4313;
  idx = 0;
  iVar11 = 0;
  do {
    iVar11 = iVar11 + 1;
    uVar8 = proc_onecmd((int)*paVar6,(char **)argv);
    idx = idx | uVar8;
    if (iVar12 < iVar11) break;
    paVar6 = paVar6 + 1;
    argv = (undefined1 *)((char **)argv + 0x10);
  } while (iVar11 != 4);
  if (idx == 1) {
    if (__s1 != (char *)0x0) {
      aos_cli_printf("command \'%s\' not found\r\n",__s1);
    }
  }
  else {
    if (idx == 2) goto LAB_2302c80a;
  }
LAB_2302c72c:
  aos_cli_printf("\r\n");
  esc_tag[0] = '\0';
  esc_tag_len = '\0';
  __s1 = "# ";
  goto LAB_2302c170;
}



void console_cb_read(int fd,void *param)

{
  ssize_t count;
  char acStack32 [4];
  char buffer [16];
  
  count = aos_read(fd,acStack32,0x10);
  if (0 < count) {
    if (count < 0x11) {
      fd_console = fd;
      cli_main_input(acStack32,count);
    }
    else {
      printf("-------------BUG from aos_read for ret\r\n");
    }
  }
  return;
}



// WARNING: Variable defined which should be unmapped: qry
// WARNING: Could not reconcile some variable overlaps

void get_dns_request(void *arg,udp_pcb *upcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  u16_t uVar1;
  int iVar2;
  pbuf *buf;
  uint uVar3;
  char *dataptr;
  char *pcVar4;
  uint uVar5;
  uint local_50;
  int len;
  dns_ans_hdr hdr;
  dns_ans_hdr hdr_1;
  dns_ans_ans qry;
  
  *(udp_pcb **)((int)arg + 0x108) = upcb;
  *(ip_addr_t **)((int)arg + 0x10c) = addr;
  *(u16_t *)((int)arg + 0x110) = port;
  if (0xb < p->tot_len) {
    pbuf_copy_partial(p,&len,0xc,0);
    uVar1 = lwip_htons((u16_t)len);
    *(u16_t *)((int)arg + 0x100) = uVar1;
    uVar1 = lwip_htons(hdr.id);
    *(u16_t *)((int)arg + 0x102) = uVar1;
    local_50 = (uint)p->tot_len;
    if (0xff < p->tot_len) {
      local_50 = 0xff;
    }
    pbuf_copy_partial(p,arg,(u16_t)local_50,0xc);
    iVar2 = utils_dns_domain_get((uint8_t *)arg,(uint8_t *)arg,(int *)&local_50);
    if (iVar2 == 0) {
      if ((0 < (int)local_50) && (*(char *)((int)arg + (local_50 - 1)) == '.')) {
        local_50 = local_50 - 1;
      }
      *(undefined *)(local_50 + (int)arg) = 0;
    }
  }
  pbuf_free(p);
  buf = pbuf_alloc(PBUF_TRANSPORT,0x200,PBUF_RAM);
  if (buf != (pbuf *)0x0) {
    memset(&hdr.numauthrr,0,0xc);
    pcVar4 = (char *)((int)arg + -1);
    uVar3 = 0xc;
    hdr.numauthrr = lwip_htons(*(u16_t *)((int)arg + 0x100));
    hdr.numextrarr = lwip_htons(0x8180);
    hdr_1.id = lwip_htons(1);
    hdr_1.flag = lwip_htons(1);
    hdr_1.numquestions = lwip_htons(0);
    hdr_1.numanswers = lwip_htons(0);
    pbuf_take(buf,&hdr.numauthrr,0xc);
    do {
      dataptr = pcVar4 + 1;
      uVar5 = 0;
      pcVar4 = dataptr;
      while ((*pcVar4 != '.' && (*pcVar4 != '\0'))) {
        uVar5 = uVar5 + 1 & 0xff;
        pcVar4 = pcVar4 + 1;
      }
      pbuf_put_at(buf,(u16_t)uVar3,(u8_t)uVar5);
      pbuf_take_at(buf,dataptr,(u16_t)((uint)((int)(pcVar4 + -(int)dataptr) * 0x10000) >> 0x10),
                   (u16_t)((uVar3 + 1) * 0x10000 >> 0x10));
      uVar5 = uVar3 + uVar5 & 0xffff;
      uVar3 = uVar5 + 1 & 0xffff;
    } while (*pcVar4 != '\0');
    pbuf_put_at(buf,(u16_t)((uVar5 + 1) * 0x10000 >> 0x10),'\0');
    hdr_1.numauthrr = lwip_htons(1);
    hdr_1.numextrarr = lwip_htons(1);
    lwip_htons(0xc00c);
    lwip_htons(1);
    lwip_htons(1);
    lwip_htons(0);
    lwip_htonl(0x3c0004);
    lwip_htonl(0xc0a8a901);
    pbuf_take_at(buf,&hdr_1.numauthrr,0x14,(u16_t)((uVar5 + 2) * 0x10000 >> 0x10));
    pbuf_realloc(buf,(u16_t)((uVar5 + 0x16) * 0x10000 >> 0x10));
    udp_sendto(*(udp_pcb **)((int)arg + 0x108),buf,*(ip_addr_t **)((int)arg + 0x10c),
               *(u16_t *)((int)arg + 0x110));
    pbuf_free(buf);
  }
  return;
}



void dns_server_init(void)

{
  err_t eVar1;
  udp_pcb *pcb;
  undefined3 extraout_var;
  void *__s;
  
  pcb = udp_new();
  if (pcb == (udp_pcb *)0x0) {
    return;
  }
  eVar1 = udp_bind(pcb,&ip_addr_any,0x35);
  if ((CONCAT31(extraout_var,eVar1) == 0) && (__s = pvPortMalloc(0x114), __s != (void *)0x0)) {
    memset(__s,0,4);
    udp_recv(pcb,get_dns_request,__s);
    return;
  }
  udp_remove(pcb);
  return;
}



