pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
EfErrCode easyflash_init(void)

{
  EfErrCode EVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  char *format;
  size_t local_18;
  size_t default_env_set_size;
  ef_env *default_env_set;
  
  local_18 = 0;
  EVar1 = ef_port_init((ef_env **)&default_env_set_size,&local_18);
  if ((CONCAT31(extraout_var,EVar1) == 0) &&
     (EVar1 = ef_env_init((ef_env *)default_env_set_size,local_18),
     CONCAT31(extraout_var_00,EVar1) == 0)) {
    format = "EasyFlash V%s is initialize success.\r\n";
  }
  else {
    format = "EasyFlash V%s is initialize fail.\r\n";
  }
  ef_log_info(format,&UNK_23081918);
  ef_log_info("You can get the latest version on https://github.com/armink/EasyFlash .\r\n");
  return EVar1;
}



size_t get_status(uint8_t *status_table,size_t status_num)

{
  size_t sVar1;
  size_t sVar2;
  
  sVar2 = status_num - 1;
  do {
    sVar1 = sVar2;
    sVar2 = sVar1 - 1;
    if (sVar2 == 0xffffffff) {
      return sVar1;
    }
  } while (status_table[sVar2] != '\0');
  return sVar1;
}



void update_sector_cache(uint32_t sec_addr,uint32_t empty_addr)

{
  sector_cache_node *psVar1;
  int iVar2;
  int iVar3;
  uint32_t uVar4;
  
  psVar1 = sector_cache_table;
  iVar2 = 4;
  iVar3 = 0;
  do {
    uVar4 = psVar1->addr;
    if ((sec_addr < empty_addr) && (empty_addr < sec_addr + 0x1000)) {
      if (sec_addr == uVar4) {
        psVar1 = sector_cache_table + iVar3;
        goto LAB_2302cb84;
      }
      if ((uVar4 == 0xffffffff) && (iVar2 == 4)) {
        iVar2 = iVar3;
      }
    }
    else {
      if (sec_addr == uVar4) {
        sector_cache_table[iVar3].addr = 0xffffffff;
        return;
      }
    }
    iVar3 = iVar3 + 1;
    psVar1 = psVar1 + 1;
  } while (iVar3 != 4);
  if (iVar2 != 4) {
    psVar1 = sector_cache_table + iVar2;
    psVar1->addr = sec_addr;
LAB_2302cb84:
    psVar1->empty_addr = empty_addr;
  }
  return;
}



uint32_t get_next_sector_addr(sector_meta_data_t pre_sec)

{
  uint uVar1;
  int iVar2;
  
  uVar1 = env_start_addr;
  if (pre_sec->addr != 0xffffffff) {
    if (pre_sec->combined == 0xffffffff) {
      iVar2 = 0x1000;
    }
    else {
      iVar2 = pre_sec->combined << 0xc;
    }
    uVar1 = iVar2 + pre_sec->addr;
    if (env_start_addr + 0x8000 <= uVar1) {
      return 0xffffffff;
    }
  }
  return uVar1;
}



_Bool gc_check_cb(sector_meta_data_t sector,void *arg1,void *arg2)

{
  if (sector->check_ok != false) {
    *(int *)arg1 = *(int *)arg1 + 1;
  }
  return false;
}



void update_env_cache(char *name,size_t name_len,uint32_t addr)

{
  uint32_t uVar1;
  int iVar2;
  env_cache_node *peVar3;
  int iVar4;
  int iVar5;
  ushort uVar6;
  
  uVar1 = ef_calc_crc32(0,name,name_len);
  peVar3 = env_cache_table;
  uVar6 = 0xffff;
  iVar5 = 0x10;
  iVar2 = 0x10;
  iVar4 = 0;
  do {
    if (addr == 0xffffffff) {
      if ((uint)peVar3->name_crc == uVar1 >> 0x10) {
        peVar3 = env_cache_table + iVar4;
        env_cache_table[iVar4].addr = 0xffffffff;
        goto LAB_2302cc82;
      }
    }
    else {
      if ((uint)peVar3->name_crc == uVar1 >> 0x10) {
        env_cache_table[iVar4].addr = addr;
        return;
      }
      if (peVar3->addr == 0xffffffff) {
        if (iVar2 == 0x10) {
          iVar2 = iVar4;
        }
      }
      else {
        if (peVar3->active != 0) {
          peVar3->active = peVar3->active - 1;
        }
        if (peVar3->active < uVar6) {
          iVar5 = iVar4;
          uVar6 = peVar3->active;
        }
      }
    }
    iVar4 = iVar4 + 1;
    peVar3 = peVar3 + 1;
  } while (iVar4 != 0x10);
  if ((iVar2 != 0x10) || (iVar2 = iVar5, iVar5 != 0x10)) {
    peVar3 = env_cache_table + iVar2;
    env_cache_table[iVar2].addr = addr;
    peVar3->name_crc = (uint16_t)(uVar1 >> 0x10);
LAB_2302cc82:
    peVar3->active = 0;
  }
  return;
}



_Bool find_env_cb(env_node_obj_t env,void *arg1,void *arg2)

{
  _Bool _Var1;
  size_t sVar2;
  int iVar3;
  
  sVar2 = strlen((char *)arg1);
  if (((((uint)env->name_len == sVar2) && (_Var1 = env->crc_is_ok, _Var1 != false)) &&
      (env->status == ENV_WRITE)) &&
     (iVar3 = strncmp(env->name,(char *)arg1,(uint)env->name_len), iVar3 == 0)) {
    *(undefined *)arg2 = 1;
  }
  else {
    _Var1 = false;
  }
  return _Var1;
}



_Bool sector_statistics_cb(sector_meta_data_t sector,void *arg1,void *arg2)

{
  sector_store_status_t sVar1;
  
  if (sector->check_ok != false) {
    sVar1 = (sector->status).store;
    if (sVar1 == SECTOR_STORE_EMPTY) {
      *(int *)arg1 = *(int *)arg1 + 1;
    }
    else {
      if (sVar1 == SECTOR_STORE_USING) {
        *(int *)arg2 = *(int *)arg2 + 1;
      }
    }
  }
  return false;
}



_Bool alloc_env_cb(sector_meta_data_t sector,void *arg1,void *arg2)

{
  sector_dirty_status_t sVar1;
  _Bool _Var2;
  
  _Var2 = sector->check_ok;
  if (_Var2 != false) {
    if ((*(uint *)arg1 < sector->remain) &&
       ((sVar1 = (sector->status).dirty, sVar1 == SECTOR_DIRTY_FALSE ||
        ((sVar1 == SECTOR_DIRTY_TRUE && (gc_request == false)))))) {
      *(uint32_t *)arg2 = sector->empty_env;
    }
    else {
      _Var2 = false;
    }
  }
  return _Var2;
}



EfErrCode write_status(uint32_t addr,uint8_t *status_table,size_t status_num,size_t status_index)

{
  EfErrCode EVar1;
  
  if (status_num <= status_index) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x111,
                 "(%s) has assert failed at %s.\r\n","status_index < status_num","write_status");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  if (status_table == (uint8_t *)0x0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x112,
                 "(%s) has assert failed at %s.\r\n","status_table","write_status");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  memset(status_table,0xff,status_num * 8 - 1 >> 3);
  status_table[status_index - 1] = 0;
  EVar1 = ef_port_write(addr + (status_index - 1),(uint32_t *)(status_table + (status_index - 1)),1)
  ;
  return EVar1;
}



