pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

EfErrCode read_env(env_node_obj_t env)

{
  char "read_env" [9];
  uint uVar1;
  uint32_t crc;
  size_t size;
  uint uVar2;
  uint32_t uStack92;
  env_hdr_data env_hdr;
  uint8_t buf [32];
  
  ef_port_read((env->addr).start,&uStack92,0x1c);
  size = get_status((uint8_t *)&uStack92,6);
  env->status = (env_status_t)(size & 0xff);
  env->len = env_hdr.magic;
  uVar2 = env_hdr.magic - 0x14;
  if (uVar2 < 0x7fed) {
    if (env_hdr.magic - 0xfed < 0x7013) {
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x223
                   ,"(%s) has assert failed at %s.\r\n",0x23076768,"read_env");
      do {
                    // WARNING: Do nothing block with infinite loop
      } while( true );
    }
    uVar1 = 0;
    crc = 0;
    while (uVar1 < uVar2) {
      size = 0x20;
      if (uVar2 <= uVar1 + 0x20) {
        size = uVar2 - uVar1;
      }
      ef_port_read((env->addr).start + 0x14 + uVar1,&env_hdr.value_len,size);
      crc = ef_calc_crc32(crc,&env_hdr.value_len,size);
      uVar1 = uVar1 + size;
    }
    if (env_hdr.len == crc) {
      crc = (env->addr).start + 0x1c;
      env->crc_is_ok = true;
      ef_port_read(crc,(uint32_t *)env->name,(uint)(byte)env_hdr.crc32);
      (env->addr).value = crc + (byte)env_hdr.crc32;
      env->value_len = env_hdr._20_4_;
      env->name_len = (byte)env_hdr.crc32;
      return EF_NO_ERR;
    }
  }
  else {
    env->len = 0x1c;
    if ((size & 0xff) != 5) {
      env->status = ENV_ERR_HDR;
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x21c
                   ,"Error: The ENV @0x%08X length has an error.\r\n",(env->addr).start);
      write_status((env->addr).start,(uint8_t *)&uStack92,6,5);
    }
  }
  env->crc_is_ok = false;
  return EF_READ_ERR;
}



// WARNING: Variable defined which should be unmapped: status_table

EfErrCode update_sec_status(sector_meta_data_t sector,size_t new_env_len,_Bool *is_full)

{
  sector_store_status_t sVar1;
  EfErrCode EVar2;
  uint8_t auStack20 [4];
  uint8_t status_table [3];
  
  sVar1 = (sector->status).store;
  if (sVar1 == SECTOR_STORE_EMPTY) {
    EVar2 = write_status(sector->addr,auStack20,4,2);
  }
  else {
    EVar2 = EF_NO_ERR;
    if (sVar1 == SECTOR_STORE_USING) {
      if ((sector->remain < 0x5c) || (sector->remain - new_env_len < 0x5c)) {
        EVar2 = write_status(sector->addr,auStack20,4,3);
        update_sector_cache(sector->addr,sector->addr + 0x1000);
        if (is_full != (_Bool *)0x0) {
          *is_full = true;
        }
      }
      else {
        if (is_full != (_Bool *)0x0) {
          *is_full = false;
        }
      }
    }
  }
  return EVar2;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

EfErrCode format_sector(uint32_t addr)

{
  EfErrCode EVar1;
  undefined3 extraout_var;
  undefined uStack36;
  undefined uStack33;
  sector_hdr_data sec_hdr;
  
  if ((addr & 0xfff) != 0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x3b5,
                 "(%s) has assert failed at %s.\r\n","addr % SECTOR_SIZE == 0","format_sector");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  EVar1 = ef_port_erase(addr,0x1000);
  if (CONCAT31(extraout_var,EVar1) == 0) {
    memset(&uStack36,0xff,0x14);
    memset(&uStack36,0xff,3);
    uStack36 = 0;
    memset(&uStack36 + 3,0xff,3);
    sec_hdr._4_4_ = 0x30344645;
    uStack33 = 0;
    sec_hdr.magic = 0xffffffff;
    sec_hdr.combined = 0xffffffff;
    EVar1 = ef_port_write(addr,&uStack36,0x14);
    update_sector_cache(addr,addr + 0x1000);
  }
  return EVar1;
}



_Bool check_sec_hdr_cb(sector_meta_data_t sector,void *arg1,void *arg2)

{
  if (sector->check_ok == false) {
    ef_log_info("Warning: Sector header check failed. Format this sector (0x%08x).\r\n",sector->addr
               );
    *(int *)arg1 = *(int *)arg1 + 1;
    format_sector(sector->addr);
    return false;
  }
  return false;
}



_Bool print_env_cb(env_node_obj_t env,void *arg1,void *arg2)

{
  _Bool _Var1;
  uint uVar2;
  uint uVar3;
  size_t sVar4;
  size_t size;
  int iVar5;
  _Bool _Var6;
  uint32_t local_50;
  uint8_t buf [32];
  
  _Var1 = env->crc_is_ok;
  if ((_Var1 != false) && (*(uint32_t *)arg1 = *(int *)arg1 + env->len, env->status == ENV_WRITE)) {
    ef_print("%.*s=",(uint)env->name_len,env->name);
    if (env->value_len < 0xf8c) {
      iVar5 = 2;
      _Var6 = false;
      while( true ) {
        uVar2 = 0;
        while (uVar3 = env->value_len, uVar2 < uVar3) {
          size = 0x20;
          if (uVar3 <= uVar2 + 0x20) {
            size = uVar3 - uVar2;
          }
          ef_port_read((env->addr).value + uVar2,&local_50,size);
          sVar4 = 0;
          if (_Var6 == false) {
            while (size != sVar4) {
              if (0x5e < (uint)*(byte *)((int)&local_50 + sVar4) - 0x20) goto LAB_2302d108;
              sVar4 = sVar4 + 1;
            }
          }
          else {
            ef_print("%.*s",size,&local_50);
          }
          uVar2 = uVar2 + size;
        }
        if (iVar5 == 1) break;
        iVar5 = 1;
        _Var6 = _Var1;
      }
    }
    else {
LAB_2302d108:
      ef_print("blob @0x%08X %dbytes",(env->addr).value,env->value_len);
    }
    ef_print("\r\n");
  }
  return false;
}



// WARNING: Variable defined which should be unmapped: buf

uint32_t get_next_env_addr(sector_meta_data_t sector,env_node_obj_t pre_env)

{
  uint uVar1;
  uint32_t uVar2;
  sector_cache_node *psVar3;
  uint addr;
  int iVar4;
  uint32_t *puVar5;
  uint32_t uVar6;
  uint32_t local_40;
  uint8_t buf [32];
  
  if ((sector->status).store != SECTOR_STORE_EMPTY) {
    addr = (pre_env->addr).start;
    uVar6 = sector->addr;
    if (addr == 0xffffffff) {
      return uVar6 + 0x14;
    }
    if (addr <= uVar6 + 0x1000) {
      uVar1 = addr + 1;
      if (pre_env->crc_is_ok != false) {
        uVar1 = pre_env->len + addr;
      }
      psVar3 = sector_cache_table;
      iVar4 = 0;
      do {
        if ((uVar1 & 0xfffff000) == psVar3->addr) {
          if (uVar1 == sector_cache_table[iVar4].empty_addr) goto LAB_2302d1b4;
          break;
        }
        iVar4 = iVar4 + 1;
        psVar3 = psVar3 + 1;
      } while (iVar4 != 4);
      addr = uVar1;
      while (addr < uVar6 + 0xfec) {
        ef_port_read(addr,&local_40,0x20);
        uVar2 = addr - 8;
        puVar5 = &local_40;
        do {
          if (uVar6 + 0xfe4 == uVar2) break;
          if ((*puVar5 == 0x3034564b) && (uVar1 <= uVar2)) goto LAB_2302d1b6;
          uVar2 = uVar2 + 1;
          puVar5 = (uint32_t *)((int)puVar5 + 1);
        } while (addr + 0x14 != uVar2);
        addr = addr + 0x1c;
      }
LAB_2302d1b4:
      uVar2 = 0xffffffff;
LAB_2302d1b6:
      if ((sector->addr + 0x1000 < uVar2) || (pre_env->len == 0)) {
        uVar2 = 0xffffffff;
      }
      return uVar2;
    }
  }
  return 0xffffffff;
}



