pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

EfErrCode read_sector_meta_data(uint32_t addr,sector_meta_data_t sector,_Bool traversal)

{
  char cVar1;
  EfErrCode EVar2;
  uint uVar3;
  size_t size;
  undefined3 in_register_00002031;
  sector_cache_node *psVar4;
  int iVar5;
  uint32_t uVar6;
  uint32_t uVar7;
  size_t sVar8;
  uint addr_00;
  char cVar9;
  uint32_t uVar10;
  undefined4 uStack188;
  sector_hdr_data sec_hdr;
  uint8_t buf [32];
  env_node_obj env_meta;
  
  if ((addr & 0xfff) != 0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x24a,
                 "(%s) has assert failed at %s.\r\n","addr % SECTOR_SIZE == 0",
                 "read_sector_meta_data");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  ef_port_read(addr,&uStack188,0x14);
  sector->addr = addr;
  sector->magic = sec_hdr._4_4_;
  if (sec_hdr._4_4_ == 0x30344645) {
    sector->combined = sec_hdr.magic;
    sector->check_ok = true;
    size = get_status((uint8_t *)&uStack188,4);
    uVar3 = size & 0xff;
    EVar2 = (EfErrCode)uVar3;
    (sector->status).store = EVar2;
    size = get_status((uint8_t *)((int)&uStack188 + 3),4);
    (sector->status).dirty = (sector_dirty_status_t)size;
    if (CONCAT31(in_register_00002031,traversal) != 0) {
      sector->remain = 0;
      sector->empty_env = addr + 0x14;
      if (uVar3 == 1) {
        sector->remain = 0xfec;
      }
      else {
        if (uVar3 == 2) {
          psVar4 = sector_cache_table;
          iVar5 = 0;
          do {
            if (addr == psVar4->addr) {
              uVar6 = sector_cache_table[iVar5].empty_addr;
              sector->empty_env = uVar6;
              sector->remain = (addr + 0x1000) - uVar6;
              goto LAB_2302d302;
            }
            iVar5 = iVar5 + 1;
            psVar4 = psVar4 + 1;
          } while (iVar5 != 4);
          sector->remain = 0xfec;
          do {
            uVar6 = get_next_env_addr(sector,(env_node_obj_t)(buf + 0x1c));
            if (uVar6 == 0xffffffff) {
              EVar2 = EF_NO_ERR;
LAB_2302d3a0:
              uVar7 = sector->addr;
              uVar6 = sector->empty_env;
              uVar3 = uVar7 + 0x1000;
              cVar9 = '\0';
              uVar10 = uVar6;
              while (addr_00 = uVar10, addr_00 < uVar3) {
                uVar10 = addr_00 + 0x20;
                size = 0x20;
                if (uVar3 <= uVar10) {
                  size = (uVar7 + 0x1020) - uVar10;
                }
                ef_port_read(addr_00,&sec_hdr.reserved,size);
                sVar8 = 0;
                while (size != sVar8) {
                  cVar1 = *(char *)((int)&sec_hdr.reserved + sVar8);
                  if ((cVar9 != -1) && (cVar1 == -1)) {
                    uVar6 = addr_00 + sVar8;
                  }
                  sVar8 = sVar8 + 1;
                  cVar9 = cVar1;
                }
              }
              if (cVar9 != -1) {
                uVar6 = uVar3;
              }
              if (sector->empty_env != uVar6) {
                sector->empty_env = uVar6;
                sector->remain = (sector->addr + 0x1000) - uVar6;
              }
              update_sector_cache(sector->addr,sector->empty_env);
              return EVar2;
            }
            read_env((env_node_obj_t)(buf + 0x1c));
            if ((buf[29] == '\0') && ((buf[28] & 0xfb) != 1)) {
              ef_log_info("Error: The ENV (@0x%08X) CRC32 check failed!\r\n",uVar6);
              sector->remain = 0;
              goto LAB_2302d3a0;
            }
            sector->empty_env = sector->empty_env + env_meta.magic;
            sector->remain = sector->remain - env_meta.magic;
          } while( true );
        }
      }
    }
LAB_2302d302:
    EVar2 = EF_NO_ERR;
  }
  else {
    sector->check_ok = false;
    sector->combined = 0xffffffff;
    EVar2 = EF_ENV_INIT_FAILED;
  }
  return EVar2;
}



void sector_iterator(sector_meta_data_t sector,sector_store_status_t status,void *arg1,void *arg2,
                    anon_subr__Bool_sector_meta_data_t_void_ptr_void_ptr *callback,
                    _Bool traversal_env)

{
  _Bool _Var1;
  uint32_t addr;
  undefined3 extraout_var;
  undefined3 in_register_0000202d;
  undefined3 in_register_0000203d;
  
  sector->addr = 0xffffffff;
  do {
    do {
      addr = get_next_sector_addr(sector);
      if (addr == 0xffffffff) {
        return;
      }
      read_sector_meta_data(addr,sector,false);
    } while ((CONCAT31(in_register_0000202d,status) != 0) &&
            ((uint)(sector->status).store != CONCAT31(in_register_0000202d,status)));
    if (CONCAT31(in_register_0000203d,traversal_env) != 0) {
      read_sector_meta_data(addr,sector,true);
    }
    _Var1 = (*callback)(sector,arg1,arg2);
  } while (CONCAT31(extraout_var,_Var1) == 0);
  return;
}



// WARNING: Variable defined which should be unmapped: using_sector

uint32_t alloc_env(sector_meta_data_t sector,size_t env_size)

{
  size_t asStack36 [2];
  uint32_t local_1c;
  uint32_t empty_env;
  size_t empty_sector;
  size_t using_sector;
  
  local_1c = 0xffffffff;
  empty_env = 0;
  empty_sector = 0;
  asStack36[0] = env_size;
  sector_iterator(sector,SECTOR_STORE_UNUSED,&empty_env,&empty_sector,sector_statistics_cb,false);
  if (empty_sector != 0) {
    sector_iterator(sector,SECTOR_STORE_USING,asStack36,&local_1c,alloc_env_cb,true);
  }
  if ((empty_env != 0) && (local_1c == 0xffffffff)) {
    if ((empty_env < 2) && (gc_request == false)) {
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x42d
                   ,"Trigger a GC check after alloc ENV failed.\r\n");
      gc_request = true;
    }
    else {
      sector_iterator(sector,SECTOR_STORE_EMPTY,asStack36,&local_1c,alloc_env_cb,true);
    }
  }
  return local_1c;
}



