pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void gc_collect(void)

{
  uint uStack44;
  size_t empty_sec;
  sector_meta_data sector;
  
  uStack44 = 0;
  sector_iterator((sector_meta_data_t)&empty_sec,SECTOR_STORE_EMPTY,&uStack44,(void *)0x0,
                  gc_check_cb,false);
  ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x4fa,
               "The remain empty sector is %d, GC threshold is %d.\r\n",uStack44,1);
  if (uStack44 < 2) {
    sector_iterator((sector_meta_data_t)&empty_sec,SECTOR_STORE_UNUSED,(void *)0x0,(void *)0x0,do_gc
                    ,false);
  }
  gc_request = false;
  return;
}



uint32_t new_env(sector_meta_data_t sector,size_t env_size)

{
  uint32_t uVar1;
  
  uVar1 = alloc_env(sector,env_size);
  if ((uVar1 == 0xffffffff) && (gc_request != false)) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x4b6,
                 "Warning: Alloc an ENV (size %d) failed when new ENV. Now will GC then retry.\r\n",
                 env_size);
    gc_collect();
    uVar1 = alloc_env(sector,env_size);
  }
  return uVar1;
}



_Bool check_and_recovery_gc_cb(sector_meta_data_t sector,void *arg1,void *arg2)

{
  if ((sector->check_ok != false) && ((sector->status).dirty == SECTOR_DIRTY_GC)) {
    gc_request = true;
    gc_collect();
    return false;
  }
  return false;
}



// WARNING: Could not reconcile some variable overlaps

void env_iterator(env_node_obj_t env,void *arg1,void *arg2,
                 anon_subr__Bool_env_node_obj_t_void_ptr_void_ptr *callback)

{
  EfErrCode EVar1;
  _Bool _Var2;
  uint32_t addr;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined uStack56;
  sector_store_status_t sStack55;
  sector_meta_data sector;
  
  sector._0_4_ = 0xffffffff;
  do {
    do {
      addr = get_next_sector_addr((sector_meta_data_t)&uStack56);
      if (addr == 0xffffffff) {
        return;
      }
      EVar1 = read_sector_meta_data(addr,(sector_meta_data_t)&uStack56,false);
    } while ((CONCAT31(extraout_var,EVar1) != 0) || (1 < (byte)(sStack55 + ~SECTOR_STORE_EMPTY)));
    (env->addr).start = 0xffffffff;
    while( true ) {
      addr = get_next_env_addr((sector_meta_data_t)&uStack56,env);
      (env->addr).start = addr;
      if (addr == 0xffffffff) break;
      read_env(env);
      _Var2 = (*callback)(env,arg1,arg2);
      if (CONCAT31(extraout_var_00,_Var2) != 0) {
        return;
      }
    }
  } while( true );
}



_Bool find_env(char *key,env_node_obj_t env)

{
  char cVar1;
  int iVar2;
  size_t size;
  uint32_t uVar3;
  int iVar4;
  uint16_t uVar5;
  env_cache_node *peVar6;
  char local_70;
  char saved_name [64];
  
  size = strlen(key);
  uVar3 = ef_calc_crc32(0,key,size);
  peVar6 = env_cache_table;
  iVar2 = 0;
  do {
    if ((peVar6->addr != 0xffffffff) && ((uint)peVar6->name_crc == uVar3 >> 0x10)) {
      ef_port_read(peVar6->addr + 0x1c,&local_70,0x40);
      iVar4 = strncmp(key,(char *)&local_70,size);
      if (iVar4 == 0) {
        (env->addr).start = env_cache_table[iVar2].addr;
        uVar5 = 0xffff;
        if (env_cache_table[iVar2].active < 0xffef) {
          uVar5 = env_cache_table[iVar2].active + 0x10;
        }
        env_cache_table[iVar2].active = uVar5;
        read_env(env);
        return true;
      }
    }
    iVar2 = iVar2 + 1;
    peVar6 = peVar6 + 1;
  } while (iVar2 != 0x10);
  local_70 = '\0';
  env_iterator(env,key,&local_70,find_env_cb);
  cVar1 = local_70;
  if (local_70 != '\0') {
    update_env_cache(key,size,(env->addr).start);
  }
  return (_Bool)cVar1;
}



EfErrCode del_env(char *key,env_node_obj_t old_env,_Bool complete_del)

{
  _Bool last_is_complete_del;
  int iVar1;
  _Bool _Var2;
  EfErrCode EVar3;
  undefined3 extraout_var;
  uint32_t addr;
  undefined3 extraout_var_00;
  size_t sVar4;
  undefined3 extraout_var_01;
  size_t name_len;
  undefined3 in_register_00002031;
  uint32_t uStack128;
  uint8_t status_table [5];
  env_node_obj env;
  
  if (old_env == (env_node_obj_t)0x0) {
    _Var2 = find_env(key,(env_node_obj_t)(status_table + 4));
    if (CONCAT31(extraout_var,_Var2) == 0) {
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x447
                   ,"Not found \'%s\' in ENV.\r\n",key);
      return EF_ENV_NAME_ERR;
    }
    old_env = (env_node_obj_t)(status_table + 4);
  }
  addr = (old_env->addr).start;
  if (CONCAT31(in_register_00002031,complete_del) == 0) {
    EVar3 = write_status(addr,(uint8_t *)&uStack128,6,3);
    iVar1 = CONCAT31(extraout_var_00,EVar3);
    last_is_complete_del = true;
  }
  else {
    EVar3 = write_status(addr,(uint8_t *)&uStack128,6,4);
    iVar1 = CONCAT31(extraout_var_01,EVar3);
    if ((last_is_complete_del == false) && (iVar1 == 0)) {
      if (key == (char *)0x0) {
        name_len = (size_t)old_env->name_len;
        key = old_env->name;
      }
      else {
        name_len = strlen(key);
      }
      update_env_cache(key,name_len,0xffffffff);
    }
    last_is_complete_del = false;
  }
  EVar3 = (EfErrCode)iVar1;
  if (iVar1 == 0) {
    addr = ((old_env->addr).start & 0xfffff000) + 3;
    ef_port_read(addr,&uStack128,3);
    sVar4 = get_status((uint8_t *)&uStack128,4);
    if (sVar4 == 1) {
      EVar3 = write_status(addr,(uint8_t *)&uStack128,4,2);
    }
  }
  return EVar3;
}



EfErrCode move_env(env_node_obj_t env)

{
  EfErrCode EVar1;
  uint32_t addr;
  uint uVar2;
  size_t new_env_len;
  uint uVar3;
  char *__src;
  char cStack229;
  undefined auStack228 [3];
  _Bool find_ok;
  sector_meta_data sector;
  uint8_t status_table [5];
  undefined auStack136 [4];
  env_node_obj env_bak;
  
  if (env->status == ENV_WRITE) {
    del_env((char *)0x0,env,false);
  }
  addr = alloc_env((sector_meta_data_t)auStack228,env->len);
  if (addr == 0xffffffff) {
    return EF_ENV_FULL;
  }
  __src = env->name;
  if (in_recovery_check != false) {
    memset(&sector.empty_env,0,0x41);
    strncpy((char *)&sector.empty_env,__src,(uint)env->name_len);
    cStack229 = '\0';
    env_iterator((env_node_obj_t)auStack136,&sector.empty_env,&cStack229,find_env_cb);
    EVar1 = EF_NO_ERR;
    if (cStack229 != '\0') goto __exit;
  }
  new_env_len = env->len;
  update_sec_status((sector_meta_data_t)auStack228,new_env_len,(_Bool *)0x0);
  write_status(addr,(uint8_t *)&sector.empty_env,6,1);
  uVar3 = new_env_len - 8;
  uVar2 = 0;
  EVar1 = EF_NO_ERR;
  while (uVar2 < uVar3) {
    new_env_len = 0x20;
    if (uVar3 <= uVar2 + 0x20) {
      new_env_len = uVar3 - uVar2;
    }
    ef_port_read((env->addr).start + 8 + uVar2,(uint32_t *)auStack136,new_env_len);
    EVar1 = ef_port_write(addr + 8 + uVar2,(uint32_t *)auStack136,new_env_len);
    uVar2 = uVar2 + new_env_len;
  }
  write_status(addr,(uint8_t *)&sector.empty_env,6,2);
  update_sector_cache(addr & 0xfffff000,env->value_len + 0x1c + (uint)env->name_len + addr);
  update_env_cache(__src,(uint)env->name_len,addr);
  ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x4a6,
               "Moved the ENV (%.*s) from 0x%08X to 0x%08X.\r\n",(uint)env->name_len,__src,
               (env->addr).start,addr);
__exit:
  del_env((char *)0x0,env,true);
  return EVar1;
}



_Bool check_and_recovery_env_cb(env_node_obj_t env,void *arg1,void *arg2)

{
  _Bool _Var1;
  EfErrCode EVar2;
  undefined3 extraout_var;
  uint8_t auStack24 [4];
  uint8_t status_table [5];
  
  _Var1 = env->crc_is_ok;
  if ((_Var1 == false) || (env->status != ENV_PRE_DELETE)) {
    _Var1 = false;
    if (env->status == ENV_PRE_WRITE) {
      write_status((env->addr).start,auStack24,6,5);
      _Var1 = true;
    }
  }
  else {
    ef_log_info("Found an ENV (%.*s) which has changed value failed. Now will recovery it.\r\n",
                (uint)env->name_len,env->name);
    EVar2 = move_env(env);
    if (CONCAT31(extraout_var,EVar2) == 0) {
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x6d5
                   ,"Recovery the ENV successful.\r\n");
      _Var1 = false;
    }
    else {
      ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x6d7
                   ,
                   "Warning: Moved an ENV (size %d) failed when recovery. Now will GC then retry.\r\n"
                   ,env->len);
    }
  }
  return _Var1;
}



