pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

_Bool do_gc(sector_meta_data_t sector,void *arg1,void *arg2)

{
  EfErrCode EVar1;
  undefined3 extraout_var;
  uint8_t auStack124 [4];
  uint8_t status_table [3];
  env_node_obj env;
  
  if ((sector->check_ok != false) && ((byte)((sector->status).dirty + ~SECTOR_DIRTY_FALSE) < 2)) {
    write_status(sector->addr + 3,auStack124,4,3);
    env.name._60_4_ = 0xffffffff;
    while( true ) {
      env.name._60_4_ = get_next_env_addr(sector,(env_node_obj_t)status_table);
      if (env.name._60_4_ == 0xffffffff) break;
      read_env((env_node_obj_t)status_table);
      if ((((_Bool)status_table[1] != false) && ((byte)(status_table[0] + ~ENV_PRE_WRITE) < 2)) &&
         (EVar1 = move_env((env_node_obj_t)status_table), CONCAT31(extraout_var,EVar1) != 0)) {
        ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",
                     0x4e1,"Error: Moved the ENV (%.*s) for GC failed.\r\n",(uint)status_table[2],
                     &env.value_len);
      }
    }
    format_sector(sector->addr);
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x4e6,
                 "Collect a sector @0x%08X\r\n",sector->addr);
    return false;
  }
  return false;
}



// WARNING: Could not reconcile some variable overlaps

EfErrCode create_env_blob(sector_meta_data_t sector,char *key,void *value,size_t len)

{
  size_t size;
  uint size_00;
  uint32_t addr;
  EfErrCode EVar1;
  size_t sVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined auStack64 [3];
  _Bool _Stack61;
  uint8_t align_data [1];
  _Bool is_full;
  env_hdr_data env_hdr;
  
  addr = sector->empty_env;
  _Stack61 = false;
  sVar2 = strlen(key);
  if (sVar2 < 0x41) {
    memset(align_data,0xff,0x1c);
    env_hdr._4_4_ = 0x3034564b;
    sVar2 = strlen(key);
    env_hdr.crc32._0_1_ = (byte)sVar2;
    env_hdr.magic = len + 0x1c + (sVar2 & 0xff);
    env_hdr._20_4_ = len;
    if (env_hdr.magic < 0xfed) {
      if ((addr == 0xffffffff) && (addr = new_env(sector,env_hdr.magic), addr == 0xffffffff)) {
        return EF_ENV_FULL;
      }
      EVar1 = update_sec_status(sector,env_hdr.magic,&_Stack61);
      if (CONCAT31(extraout_var,EVar1) == 0) {
        env_hdr.len = ef_calc_crc32(0,&env_hdr.crc32,8);
        env_hdr.len = ef_calc_crc32(env_hdr.len,key,(uint)(byte)env_hdr.crc32);
        env_hdr.len = ef_calc_crc32(env_hdr.len,value,env_hdr._20_4_);
        EVar1 = write_status(addr,align_data,6,1);
        if ((CONCAT31(extraout_var_00,EVar1) == 0) &&
           (EVar1 = ef_port_write(addr + 8,(uint32_t *)(env_hdr.status_table + 4),0x14),
           CONCAT31(extraout_var_01,EVar1) == 0)) {
          size_00 = (uint)(byte)env_hdr.crc32;
          memset(auStack64,0xff,1);
          EVar1 = ef_port_write(addr + 0x1c,(uint32_t *)key,size_00);
          if (_Stack61 == false) {
            update_sector_cache(sector->addr,
                                env_hdr._20_4_ + 0x1c + (uint)(byte)env_hdr.crc32 + addr);
          }
          update_env_cache(key,(uint)(byte)env_hdr.crc32,addr);
          size = env_hdr._20_4_;
          if (CONCAT31(extraout_var_02,EVar1) == 0) {
            size_00 = (uint)(byte)env_hdr.crc32;
            memset(auStack64,0xff,1);
            EVar1 = ef_port_write(size_00 + 0x1c + addr,(uint32_t *)value,size);
            if (((CONCAT31(extraout_var_03,EVar1) == 0) &&
                (EVar1 = write_status(addr,align_data,6,2), CONCAT31(extraout_var_04,EVar1) == 0))
               && (_Stack61 != false)) {
              ef_log_debug(
                           "/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c"
                           ,0x562,"Trigger a GC check after created ENV.\r\n");
              gc_request = true;
            }
          }
        }
      }
    }
    else {
      ef_log_info("Error: The ENV size is too big\r\n");
      EVar1 = EF_ENV_FULL;
    }
  }
  else {
    ef_log_info("Error: The ENV name length is more than %d\r\n",0x40);
    EVar1 = EF_ENV_NAME_ERR;
  }
  return EVar1;
}



size_t ef_get_env_blob(char *key,void *value_buf,size_t buf_len,size_t *saved_value_len)

{
  size_t sVar1;
  _Bool _Var2;
  TickType_t TVar3;
  char *format;
  size_t sVar4;
  undefined3 extraout_var;
  undefined4 uVar5;
  undefined auStack120 [4];
  env_node_obj env;
  
  if (init_ok == false) {
    ef_log_info("ENV isn\'t initialize OK.\r\n");
    sVar1 = 0;
  }
  else {
    if ((key == (char *)0x0) || (value_buf == (void *)0x0)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      uVar5 = 0x34c;
      format = "[%10u][%s: %s:%4d] key = %p, value_buf = %p\r\n";
    }
    else {
      sVar4 = strlen(key);
      if (sVar4 < 0x41) {
        ef_port_env_lock();
        _Var2 = find_env(key,(env_node_obj_t)auStack120);
        sVar1 = 0;
        if (CONCAT31(extraout_var,_Var2) != 0) {
          if (saved_value_len != (size_t *)0x0) {
            *saved_value_len = env.len;
          }
          if (env.len < buf_len) {
            buf_len = env.len;
          }
          ef_port_read(env.addr.start,(uint32_t *)value_buf,buf_len);
          sVar1 = buf_len;
        }
        ef_port_env_unlock();
        return sVar1;
      }
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      key = (char *)strlen(key);
      value_buf = (void *)0x40;
      uVar5 = 0x351;
      format = "[%10u][%s: %s:%4d] key err. %d > %d\r\n";
    }
    bl_printk(format,TVar3,&DAT_23081ce8,&UNK_23081cdc,uVar5,key,value_buf);
    sVar1 = 8;
  }
  return sVar1;
}



EfErrCode ef_del_env(char *key)

{
  EfErrCode EVar1;
  TickType_t TVar2;
  size_t sVar3;
  EfErrCode result;
  
