pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (init_ok == false) {
    ef_log_info("Error: ENV isn\'t initialize OK.\r\n");
    EVar1 = EF_ENV_INIT_FAILED;
  }
  else {
    if ((key == (char *)0x0) || (sVar3 = strlen(key), 0x40 < sVar3)) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] key = %p\r\n",TVar2,&DAT_23081ce8,&UNK_23081cdc,0x57d,key);
      EVar1 = EF_NO_ERR;
    }
    else {
      ef_port_env_lock();
      EVar1 = del_env(key,(env_node_obj_t)0x0,true);
      ef_port_env_unlock();
    }
  }
  return EVar1;
}



EfErrCode ef_set_env_blob(char *key,void *value_buf,size_t buf_len)

{
  _Bool _Var1;
  EfErrCode EVar2;
  TickType_t TVar3;
  char *format;
  size_t sVar4;
  uint32_t uVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined4 uVar6;
  
  if (init_ok == false) {
    ef_log_info("ENV isn\'t initialize OK.\r\n");
    return EF_ENV_INIT_FAILED;
  }
  if ((key == (char *)0x0) || (value_buf == (void *)0x0)) {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar6 = 0x5d4;
    format = "[%10u][%s: %s:%4d] key = %p, value_buf = %p\r\n";
  }
  else {
    sVar4 = strlen(key);
    if (sVar4 < 0x41) {
      if (buf_len < 0xf8d) {
        ef_port_env_lock();
        sVar4 = strlen(key);
        uVar5 = new_env((sector_meta_data_t)sector_3152,buf_len + 0x1c + sVar4);
        EVar2 = EF_ENV_FULL;
        if (uVar5 != 0xffffffff) {
          _Var1 = find_env(key,(env_node_obj_t)env_3151);
          if ((CONCAT31(extraout_var,_Var1) == 0) ||
             (EVar2 = del_env(key,(env_node_obj_t)env_3151,false),
             CONCAT31(extraout_var_01,EVar2) == 0)) {
            EVar2 = create_env_blob((sector_meta_data_t)sector_3152,key,value_buf,buf_len);
            if ((CONCAT31(extraout_var,_Var1) != 0) && (CONCAT31(extraout_var_00,EVar2) == 0)) {
              EVar2 = del_env(key,(env_node_obj_t)env_3151,true);
            }
          }
          if (gc_request != false) {
            gc_collect();
          }
        }
        ef_port_env_unlock();
        return EVar2;
      }
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      value_buf = (void *)0xf8c;
      uVar6 = 0x5de;
      format = "[%10u][%s: %s:%4d] buf_len err. %d > %d\r\n";
      key = (char *)buf_len;
    }
    else {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      key = (char *)strlen(key);
      value_buf = (void *)0x40;
      uVar6 = 0x5d9;
      format = "[%10u][%s: %s:%4d] key err. %d > %d\r\n";
    }
  }
  bl_printk(format,TVar3,&DAT_23081ce8,&UNK_23081cdc,uVar6,key,value_buf);
  return EF_ENV_ARG_ERR;
}



EfErrCode ef_set_env(char *key,char *value)

{
  EfErrCode EVar1;
  size_t buf_len;
  
  buf_len = strlen(value);
  EVar1 = ef_set_env_blob(key,value,buf_len);
  return EVar1;
}



EfErrCode ef_save_env(void)

{
  return EF_NO_ERR;
}



EfErrCode ef_env_set_default(void)

{
  uint uVar1;
  uint32_t addr;
  EfErrCode EVar2;
  undefined3 extraout_var;
  size_t len;
  ef_env *peVar3;
  undefined auStack56 [4];
  sector_meta_data sector;
  
  if (default_env_set == (ef_env *)0x0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x621,
                 "(%s) has assert failed at %s.\r\n","default_env_set","ef_env_set_default");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  if (default_env_set_size == 0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x622,
                 "(%s) has assert failed at %s.\r\n","default_env_set_size","ef_env_set_default");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  ef_port_env_lock();
  addr = env_start_addr;
  while (addr < env_start_addr + 0x8000) {
    EVar2 = format_sector(addr);
    if (CONCAT31(extraout_var,EVar2) != 0) goto __exit;
    addr = addr + 0x1000;
  }
  uVar1 = 0;
  while (uVar1 < default_env_set_size) {
    len = default_env_set[uVar1].value_len;
    if (len == 0) {
      len = strlen((char *)default_env_set[uVar1].value);
    }
    sector.remain = 0xffffffff;
    peVar3 = default_env_set + uVar1;
    uVar1 = uVar1 + 1;
    create_env_blob((sector_meta_data_t)auStack56,peVar3->key,peVar3->value,len);
  }
  EVar2 = EF_NO_ERR;
__exit:
  ef_port_env_unlock();
  return EVar2;
}



void ef_print_env(void)

{
  int local_6c;
  size_t using_size;
  env_node_obj env;
  
  local_6c = 0;
  if (init_ok == false) {
    ef_log_info("ENV isn\'t initialize OK.\r\n");
  }
  else {
    ef_port_env_lock();
    env_iterator((env_node_obj_t)&using_size,&local_6c,(void *)0x0,print_env_cb);
    ef_print("\r\nmode: next generation\r\n");
    ef_print("size: %lu/%lu bytes.\r\n",local_6c + 0x8c,0x7000);
    ef_port_env_unlock();
  }
  return;
}



// WARNING: Variable defined which should be unmapped: env

EfErrCode ef_load_env(void)

{
  int iStack132;
  size_t check_failed_count;
  sector_meta_data sector;
  env_node_obj env;
  
  in_recovery_check = true;
  iStack132 = 0;
  sector_iterator((sector_meta_data_t)&check_failed_count,SECTOR_STORE_UNUSED,&iStack132,(void *)0x0
                  ,check_sec_hdr_cb,false);
  if (iStack132 == 8) {
    ef_log_info("Warning: All sector header check failed. Set it to default.\r\n");
    ef_env_set_default();
  }
  ef_port_env_lock();
  sector_iterator((sector_meta_data_t)&check_failed_count,SECTOR_STORE_UNUSED,(void *)0x0,
                  (void *)0x0,check_and_recovery_gc_cb,false);
  while( true ) {
    env_iterator((env_node_obj_t)&sector.empty_env,(void *)0x0,(void *)0x0,check_and_recovery_env_cb
                );
    if (gc_request == false) break;
    gc_collect();
  }
  in_recovery_check = false;
  ef_port_env_unlock();
  return EF_NO_ERR;
}



EfErrCode ef_env_init(ef_env *default_env,size_t default_env_size)

{
  char "ef_env_init" [12];
  EfErrCode EVar1;
  undefined3 extraout_var;
  env_cache_node *peVar2;
  
  if (default_env == (ef_env *)0x0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x71e,
                 "(%s) has assert failed at %s.\r\n","default_env","ef_env_init");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  EVar1 = EF_NO_ERR;
  if (init_ok == false) {
    sector_cache_table[0].addr = 0xffffffff;
    sector_cache_table[1].addr = 0xffffffff;
    sector_cache_table[2].addr = 0xffffffff;
    sector_cache_table[3].addr = 0xffffffff;
    peVar2 = env_cache_table;
    do {
      peVar2->addr = 0xffffffff;
      peVar2 = peVar2 + 1;
    } while (peVar2 != (env_cache_node *)sector_3152);
    env_start_addr = 0;
    default_env_set = default_env;
    default_env_set_size = default_env_size;
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x738,
                 "ENV start address is 0x%08X, size is %d bytes.\r\n",0,0x8000);
    EVar1 = ef_load_env();
    if (CONCAT31(extraout_var,EVar1) == 0) {
      init_ok = true;
    }
  }
  return EVar1;
}



EfErrCode ef_port_read(uint32_t addr,uint32_t *buf,size_t size)

{
  int iVar1;
  
  iVar1 = bl_mtd_read(handle,addr,size,(uint8_t *)buf);
  return (EfErrCode)((iVar1 < 0) << 1);
}



EfErrCode ef_port_write(uint32_t addr,uint32_t *buf,size_t size)

{
  EfErrCode EVar1;
  int iVar2;
  
  iVar2 = bl_mtd_write(handle,addr,size,(uint8_t *)buf);
  if (iVar2 < 0) {
    EVar1 = EF_WRITE_ERR;
  }
  else {
    EVar1 = EF_NO_ERR;
  }
  return EVar1;
}



void ef_port_env_lock(void)

{
  xQueueSemaphoreTake((QueueHandle_t)env_cache_lock,0xffffffff);
  return;
}



void ef_port_env_unlock(void)

{
  xQueueGenericSend((QueueHandle_t)env_cache_lock,(void *)0x0,0,0);
  return;
}



void ef_log_debug(char *file,long line,char *format,...)

{
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list args;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  vprint(format,&uStack20);
  return;
}



EfErrCode ef_port_erase(uint32_t addr,size_t size)

{
  char "ef_port_erase" [14];
  int iVar1;
  
