pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if ((addr & 0xfff) != 0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_port.c",0x77,
                 "(%s) has assert failed at %s.\r\n","addr % EF_ERASE_MIN_SIZE == 0","ef_port_erase"
                );
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  iVar1 = bl_mtd_erase(handle,addr,size);
  return (EfErrCode)((uint)iVar1 >> 0x1f);
}



void ef_log_info(char *format,...)

{
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list args;
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack28 = in_a1;
  uStack24 = in_a2;
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  vprint(format,&uStack28);
  return;
}



// WARNING: Variable defined which should be unmapped: info
// WARNING: Could not reconcile some variable overlaps

EfErrCode ef_port_init(ef_env **default_env,size_t *default_env_size)

{
  int iVar1;
  undefined auStack44 [4];
  bl_mtd_info_t info;
  
  iVar1 = bl_mtd_open("PSM",&handle,2);
  if (iVar1 < 0) {
    ef_log_info("[EF] [PART] [XIP] error when get PSM partition %d\r\n",iVar1);
    puts("[EF] [PART] [XIP] Dead Loop. Reason: no Valid PSM partition found\r\n");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  memset(auStack44,0,0x1c);
  bl_mtd_info(handle,(bl_mtd_info_t *)auStack44);
  ef_log_info("[EF] Found Valid PSM partition, XIP Addr %08x, flash addr %08x\r\n",info.size,
              info.name._12_4_);
  *default_env = default_env_set;
  *default_env_size = 1;
  printf("*default_env_size = 0x%08x\r\n",1);
  env_cache_lock = (SemaphoreHandle_t)xQueueCreateMutex('\x01');
  return EF_NO_ERR;
}



void ef_print(char *format,...)

{
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list args;
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack28 = in_a1;
  uStack24 = in_a2;
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  vprint(format,&uStack28);
  return;
}



uint32_t ef_calc_crc32(uint32_t crc,void *buf,size_t size)

{
  uint uVar1;
  byte *pbVar2;
  
  uVar1 = ~crc;
  pbVar2 = (byte *)buf;
  while (pbVar2 != (byte *)(size + (int)buf)) {
    uVar1 = uVar1 >> 8 ^ crc32_table[(*pbVar2 ^ uVar1) & 0xff];
    pbVar2 = pbVar2 + 1;
  }
  return ~uVar1;
}



void psm_get_cmd(char *buf,int len,int argc,char **argv)

{
  return;
}



void psm_test_cmd(void)

{
  size_t *psVar1;
  EfErrCode EVar2;
  void *__s;
  void *__s_00;
  undefined3 extraout_var;
  size_t __n;
  char *format;
  int iVar3;
  undefined *puVar4;
  undefined4 uVar5;
  size_t xWantedSize;
  size_t sVar6;
  size_t sStack92;
  size_t local_58 [6];
  size_t asStack64 [3];
  
  psVar1 = local_58;
  memcpy(local_58,&DAT_23082570,0x18);
  do {
    sVar6 = *psVar1;
    sStack92 = 0;
    xWantedSize = sVar6 + 1;
    __s = pvPortMalloc(xWantedSize);
    __s_00 = pvPortMalloc(xWantedSize);
    if ((__s == (void *)0x0) || (__s_00 == (void *)0x0)) {
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] kvbin malloc %d byte error\r\n",&DAT_2307f16c,"easyflash_cli.c",
                0x3d);
      if (__s != (void *)0x0) goto LAB_2302e4c6;
    }
    else {
      memset(__s,0,xWantedSize);
      memset(__s_00,0,xWantedSize);
      xWantedSize = 0;
      while (xWantedSize != sVar6) {
        *(undefined *)((int)__s + xWantedSize) = 0x76;
        xWantedSize = xWantedSize + 1;
      }
      EVar2 = ef_set_env_blob("1234567890123456789012345678901234567890123456789012345678901234",__s
                              ,xWantedSize);
      iVar3 = CONCAT31(extraout_var,EVar2);
      __n = ef_get_env_blob("1234567890123456789012345678901234567890123456789012345678901234",
                            __s_00,xWantedSize,&sStack92);
      if ((iVar3 == 0) && (xWantedSize == __n)) {
        iVar3 = memcmp(__s_00,__s,__n);
        if (iVar3 == 0) {
          if (TrapNetCounter == 0) {
            xTaskGetTickCount();
          }
          else {
            xTaskGetTickCountFromISR();
          }
          bl_printk(
                    "[%10u][%s: %s:%4d] kvbin set %ld byte bin -> read %ld byte -> memcmp success.\r\n"
                    ,&DAT_2307f16c,"easyflash_cli.c",0x56,__n,__n);
          goto LAB_2302e4c6;
        }
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        iVar3 = 0;
        uVar5 = 0x52;
        puVar4 = &DAT_23072bcc;
        format = 
        "[%10u][%s: %s:%4d] kvbin set/get %ld byte , res1 = %ld, res2 = %d. memcmp error\r\n";
        sVar6 = __n;
      }
      else {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        uVar5 = 0x4d;
        puVar4 = &DAT_23081ce8;
        format = "[%10u][%s: %s:%4d] kvbin set/get %ld byte error, res1 = %ld, res2 = %d.\r\n";
      }
      bl_printk(format,puVar4,"easyflash_cli.c",uVar5,sVar6,iVar3,__n);
LAB_2302e4c6:
      vPortFree(__s);
    }
    if (__s_00 != (void *)0x0) {
      vPortFree(__s_00);
    }
    psVar1 = psVar1 + 1;
    if (psVar1 == asStack64) {
      ef_del_env("1234567890123456789012345678901234567890123456789012345678901234");
      return;
    }
  } while( true );
}



