pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
EfErrCode psm_erase_cmd(void)

{
  uint uVar1;
  uint32_t addr;
  EfErrCode EVar2;
  undefined3 extraout_var;
  size_t len;
  ef_env *peVar3;
  sector_meta_data sStack56;
  
  if (default_env_set == (ef_env *)0x0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x621,
                 "(%s) has assert failed at %s.\r\n","default_env_set","ef_env_set_default");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  if (default_env_set_size == 0) {
    ef_log_debug("/home/yangff/Projects/bl_iot_sdk/components/stage/easyflash4/src/ef_env.c",0x622,
                 "(%s) has assert failed at %s.\r\n","default_env_set_size","ef_env_set_default");
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  ef_port_env_lock();
  addr = env_start_addr;
  while (addr < env_start_addr + 0x8000) {
    EVar2 = format_sector(addr);
    if (CONCAT31(extraout_var,EVar2) != 0) goto __exit;
    addr = addr + 0x1000;
  }
  uVar1 = 0;
  while (uVar1 < default_env_set_size) {
    len = default_env_set[uVar1].value_len;
    if (len == 0) {
      len = strlen((char *)default_env_set[uVar1].value);
    }
    sStack56.empty_env = 0xffffffff;
    peVar3 = default_env_set + uVar1;
    uVar1 = uVar1 + 1;
    create_env_blob((sector_meta_data_t)&sStack56,peVar3->key,peVar3->value,len);
  }
  EVar2 = EF_NO_ERR;
__exit:
  ef_port_env_unlock();
  return EVar2;
}



void psm_dump_cmd(void)

{
  int iStack108;
  env_node_obj eStack104;
  
  iStack108 = 0;
  if (init_ok == false) {
    ef_log_info("ENV isn\'t initialize OK.\r\n");
  }
  else {
    ef_port_env_lock();
    env_iterator((env_node_obj_t)&eStack104,&iStack108,(void *)0x0,print_env_cb);
    ef_print("\r\nmode: next generation\r\n");
    ef_print("size: %lu/%lu bytes.\r\n",iStack108 + 0x8c,0x7000);
    ef_port_env_unlock();
  }
  return;
}



void psm_unset_cmd(char *buf,int len,int argc,char **argv)

{
  if (argc != 2) {
    printf("usage: psm_unset [key]\r\n");
    return;
  }
  ef_del_env(argv[1]);
  ef_save_env();
  return;
}



void psm_set_cmd(char *buf,int len,int argc,char **argv)

{
  if (argc != 3) {
    printf("usage: psm_set [key] [value]\r\n");
    return;
  }
  ef_set_env(argv[1],argv[2]);
  ef_save_env();
  return;
}



int easyflash_cli_init(void)

{
  return 0;
}



// WARNING: Removing unreachable block (ram,0x2302e680)
// WARNING: Removing unreachable block (ram,0x2302e696)

EventGroupHandle_t xEventGroupCreateStatic(StaticEventGroup_t *pxEventGroupBuffer)

{
  size_t xSize;
  
  if (pxEventGroupBuffer == (StaticEventGroup_t *)0x0) {
    vAssertCalled();
  }
  else {
    pxEventGroupBuffer->xDummy1 = 0;
    vListInitialise((List_t *)&pxEventGroupBuffer->xDummy2);
    pxEventGroupBuffer->ucDummy4 = '\x01';
  }
  return (EventGroupHandle_t)pxEventGroupBuffer;
}



EventBits_t
xEventGroupWaitBits(EventGroupHandle_t xEventGroup,EventBits_t uxBitsToWaitFor,
                   BaseType_t xClearOnExit,BaseType_t xWaitForAllBits,TickType_t xTicksToWait)

{
  uint uVar1;
  BaseType_t BVar2;
  uint uVar3;
  
  if (xEventGroup == (EventGroupHandle_t)0x0) {
    vAssertCalled();
  }
  if (((uxBitsToWaitFor & 0xff000000) == 0) && (uxBitsToWaitFor != 0)) {
    BVar2 = xTaskGetSchedulerState();
    if (BVar2 != 0) goto LAB_2302e6c8;
LAB_2302e748:
    if (xTicksToWait == 0) goto LAB_2302e6c8;
    vAssertCalled();
    vTaskSuspendAll();
    uVar1 = xEventGroup->uxEventBits;
    uVar3 = uxBitsToWaitFor & uVar1;
    if (xWaitForAllBits != 0) goto LAB_2302e70c;
LAB_2302e6d8:
    if (uVar3 == 0) {
LAB_2302e710:
      if (xTicksToWait == 0) goto LAB_2302e762;
      uVar1 = (uint)(xClearOnExit != 0) << 0x18;
      if (xWaitForAllBits != 0) {
        uVar1 = uVar1 | 0x4000000;
      }
      vTaskPlaceOnUnorderedEventList
                (&xEventGroup->xTasksWaitingForBits,uVar1 | uxBitsToWaitFor,xTicksToWait);
      BVar2 = xTaskResumeAll();
      if (BVar2 == 0) {
        ecall();
      }
      uVar1 = uxTaskResetEventItemValue();
      if ((int)(uVar1 << 6) < 0) goto LAB_2302e740;
      vTaskEnterCritical();
      uVar1 = xEventGroup->uxEventBits;
      if (xWaitForAllBits == 0) {
        if ((uxBitsToWaitFor & uVar1) != 0) {
LAB_2302e788:
          if (xClearOnExit != 0) {
            xEventGroup->uxEventBits = ~uxBitsToWaitFor & uVar1;
          }
        }
      }
      else {
        if (uxBitsToWaitFor == (uxBitsToWaitFor & uVar1)) goto LAB_2302e788;
      }
      vTaskExitCritical();
LAB_2302e740:
      return uVar1 & 0xffffff;
    }
  }
  else {
    vAssertCalled();
    BVar2 = xTaskGetSchedulerState();
    if (BVar2 == 0) goto LAB_2302e748;
LAB_2302e6c8:
    vTaskSuspendAll();
    uVar1 = xEventGroup->uxEventBits;
    uVar3 = uxBitsToWaitFor & uVar1;
    if (xWaitForAllBits == 0) goto LAB_2302e6d8;
LAB_2302e70c:
    if (uxBitsToWaitFor != uVar3) goto LAB_2302e710;
  }
  if (xClearOnExit != 0) {
    xEventGroup->uxEventBits = ~uxBitsToWaitFor & uVar1;
    xTaskResumeAll();
    return uVar1;
  }
LAB_2302e762:
  xTaskResumeAll();
  return uVar1;
}



EventBits_t xEventGroupSetBits(EventGroupHandle_t xEventGroup,EventBits_t uxBitsToSet)

{
  xLIST_ITEM *pxEventListItem;
  xLIST_ITEM *pxVar1;
  uint uVar2;
  uint uVar3;
  xLIST_ITEM *pxVar4;
  uint uVar5;
  
  if (xEventGroup == (EventGroupHandle_t)0x0) {
    vAssertCalled();
  }
  if ((uxBitsToSet & 0xff000000) != 0) {
    vAssertCalled();
  }
  vTaskSuspendAll();
  pxEventListItem = (xEventGroup->xTasksWaitingForBits).xListEnd.pxNext;
  pxVar4 = (xLIST_ITEM *)&(xEventGroup->xTasksWaitingForBits).xListEnd;
  uxBitsToSet = uxBitsToSet | xEventGroup->uxEventBits;
  xEventGroup->uxEventBits = uxBitsToSet;
  if (pxVar4 != pxEventListItem) {
    uVar5 = 0;
    do {
      while( true ) {
        uVar3 = ((ListItem_t *)pxEventListItem)->xItemValue;
        uVar2 = uVar3 & 0xffffff;
        pxVar1 = ((ListItem_t *)pxEventListItem)->pxNext;
        if ((int)(uVar3 << 5) < 0) break;
        if ((uVar2 & uxBitsToSet) != 0) {
LAB_2302e806:
          if ((int)(uVar3 << 7) < 0) {
            uVar5 = uVar5 | uVar2;
          }
          vTaskRemoveFromUnorderedEventList((ListItem_t *)pxEventListItem,uxBitsToSet | 0x2000000);
          uxBitsToSet = xEventGroup->uxEventBits;
        }
        pxEventListItem = pxVar1;
        if (pxVar4 == pxVar1) goto LAB_2302e81c;
      }
      if (uVar2 == (uVar2 & uxBitsToSet)) goto LAB_2302e806;
      pxEventListItem = pxVar1;
    } while (pxVar4 != pxVar1);
LAB_2302e81c:
    uxBitsToSet = uxBitsToSet & ~uVar5;
  }
  xEventGroup->uxEventBits = uxBitsToSet;
  xTaskResumeAll();
  return xEventGroup->uxEventBits;
}



void vEventGroupDelete(EventGroupHandle_t xEventGroup)

{
  ListItem_t *pxEventListItem;
  UBaseType_t UVar1;
  
  vTaskSuspendAll();
  UVar1 = (xEventGroup->xTasksWaitingForBits).uxNumberOfItems;
  while (UVar1 != 0) {
    while (pxEventListItem = (ListItem_t *)(xEventGroup->xTasksWaitingForBits).xListEnd.pxNext,
          pxEventListItem != (ListItem_t *)&(xEventGroup->xTasksWaitingForBits).xListEnd) {
      vTaskRemoveFromUnorderedEventList(pxEventListItem,0x2000000);
      if ((xEventGroup->xTasksWaitingForBits).uxNumberOfItems == 0) goto LAB_2302e890;
    }
    vAssertCalled();
    vTaskRemoveFromUnorderedEventList
              ((ListItem_t *)(xEventGroup->xTasksWaitingForBits).xListEnd.pxNext,0x2000000);
    UVar1 = (xEventGroup->xTasksWaitingForBits).uxNumberOfItems;
  }
LAB_2302e890:
  if (xEventGroup->ucStaticallyAllocated != '\0') {
    xTaskResumeAll();
    return;
  }
  vPortFree(xEventGroup);
  xTaskResumeAll();
  return;
}



void vListInitialise(List_t *pxList)

{
  ListItem_t *pLVar1;
  
