pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  pLVar1 = (ListItem_t *)&pxList->xListEnd;
  pxList->pxIndex = pLVar1;
  (pxList->xListEnd).xItemValue = 0xffffffff;
  *(ListItem_t **)&(pxList->xListEnd).pxNext = pLVar1;
  *(ListItem_t **)&(pxList->xListEnd).pxPrevious = pLVar1;
  pxList->uxNumberOfItems = 0;
  return;
}



void vListInitialiseItem(ListItem_t *pxItem)

{
  pxItem->pvContainer = (xLIST *)0x0;
  return;
}



void vListInsertEnd(List_t *pxList,ListItem_t *pxNewListItem)

{
  xLIST_ITEM *pxVar1;
  ListItem_t *pLVar2;
  
  pLVar2 = pxList->pxIndex;
  *(ListItem_t **)&pxNewListItem->pxNext = pLVar2;
  pxVar1 = pLVar2->pxPrevious;
  pxNewListItem->pxPrevious = pxVar1;
  *(ListItem_t **)&pxVar1->pxNext = pxNewListItem;
  *(ListItem_t **)&pLVar2->pxPrevious = pxNewListItem;
  *(List_t **)&pxNewListItem->pvContainer = pxList;
  pxList->uxNumberOfItems = pxList->uxNumberOfItems + 1;
  return;
}



void vListInsert(List_t *pxList,ListItem_t *pxNewListItem)

{
  xLIST_ITEM *pxVar1;
  xLIST_ITEM *pxVar2;
  
  pxVar2 = (xLIST_ITEM *)&pxList->xListEnd;
  if (pxNewListItem->xItemValue == 0xffffffff) {
    pxVar1 = (pxList->xListEnd).pxPrevious;
    pxVar2 = pxVar1->pxNext;
  }
  else {
    do {
      pxVar1 = pxVar2;
      pxVar2 = pxVar1->pxNext;
    } while (pxVar2->xItemValue <= pxNewListItem->xItemValue);
  }
  pxNewListItem->pxNext = pxVar2;
  *(ListItem_t **)&pxVar2->pxPrevious = pxNewListItem;
  pxNewListItem->pxPrevious = pxVar1;
  *(ListItem_t **)&pxVar1->pxNext = pxNewListItem;
  *(List_t **)&pxNewListItem->pvContainer = pxList;
  pxList->uxNumberOfItems = pxList->uxNumberOfItems + 1;
  return;
}



UBaseType_t uxListRemove(ListItem_t *pxItemToRemove)

{
  xLIST_ITEM *pxVar1;
  xLIST *pxVar2;
  
  pxVar1 = pxItemToRemove->pxPrevious;
  pxVar2 = pxItemToRemove->pvContainer;
  pxItemToRemove->pxNext->pxPrevious = pxVar1;
  pxVar1->pxNext = pxItemToRemove->pxNext;
  if (pxVar2->pxIndex != pxItemToRemove) {
    pxItemToRemove->pvContainer = (xLIST *)0x0;
    pxVar2->uxNumberOfItems = pxVar2->uxNumberOfItems - 1;
    return pxVar2->uxNumberOfItems;
  }
  pxVar2->pxIndex = (ListItem_t *)pxItemToRemove->pxPrevious;
  pxItemToRemove->pvContainer = (xLIST *)0x0;
  pxVar2->uxNumberOfItems = pxVar2->uxNumberOfItems - 1;
  return pxVar2->uxNumberOfItems;
}



BaseType_t prvCopyDataToQueue(Queue_t *pxQueue,void *pvItemToQueue,BaseType_t xPosition)

{
  UBaseType_t UVar1;
  BaseType_t BVar2;
  UBaseType_t UVar3;
  size_t __n;
  int8_t *piVar4;
  int8_t *piVar5;
  
  __n = pxQueue->uxItemSize;
  UVar1 = pxQueue->uxMessagesWaiting;
  if (__n == 0) {
    UVar1 = UVar1 + 1;
    BVar2 = 0;
    if (pxQueue->pcHead == (int8_t *)0x0) {
      BVar2 = xTaskPriorityDisinherit(*(TaskHandle_t *)&pxQueue->u);
      *(undefined4 *)&pxQueue->u = 0;
    }
  }
  else {
    if (xPosition == 0) {
      UVar1 = UVar1 + 1;
      memcpy(pxQueue->pcWriteTo,pvItemToQueue,__n);
      piVar4 = pxQueue->pcWriteTo;
      BVar2 = 0;
      pxQueue->pcWriteTo = piVar4 + pxQueue->uxItemSize;
      if (*(int8_t **)&pxQueue->u <= piVar4 + pxQueue->uxItemSize) {
        pxQueue->uxMessagesWaiting = UVar1;
        pxQueue->pcWriteTo = pxQueue->pcHead;
        return 0;
      }
    }
    else {
      memcpy(*(void **)((int)&pxQueue->u + 4),pvItemToQueue,__n);
      UVar3 = pxQueue->uxItemSize;
      piVar4 = pxQueue->pcHead;
      piVar5 = (int8_t *)(*(int *)((int)&pxQueue->u + 4) + -UVar3);
      *(int8_t **)((int)&pxQueue->u + 4) = piVar5;
      if (piVar5 < piVar4) {
        *(int *)((int)&pxQueue->u + 4) = -UVar3 + *(int *)&pxQueue->u;
      }
      if (xPosition != 2) {
        pxQueue->uxMessagesWaiting = UVar1 + 1;
        return 0;
      }
      BVar2 = 0;
      if (UVar1 == 0) {
        UVar1 = 1;
      }
    }
  }
  pxQueue->uxMessagesWaiting = UVar1;
  return BVar2;
}



void prvCopyDataFromQueue(Queue_t *pxQueue,void *pvBuffer)

{
  int8_t *__src;
  size_t __n;
  int8_t *piVar1;
  
  __n = pxQueue->uxItemSize;
  if (__n != 0) {
    piVar1 = *(int8_t **)&pxQueue->u;
    __src = (int8_t *)(*(int *)((int)&pxQueue->u + 4) + __n);
    *(int8_t **)((int)&pxQueue->u + 4) = __src;
    if (piVar1 <= __src) {
      __src = pxQueue->pcHead;
      *(int8_t **)((int)&pxQueue->u + 4) = __src;
    }
    memcpy(pvBuffer,__src,__n);
    return;
  }
  return;
}



void prvUnlockQueue(Queue_t *pxQueue)

{
  char cVar1;
  int iVar2;
  BaseType_t BVar3;
  uint uVar4;
  
  vTaskEnterCritical();
  iVar2 = (int)pxQueue->cTxLock;
  if ((0 < iVar2) && ((pxQueue->xTasksWaitingToReceive).uxNumberOfItems != 0)) {
    do {
      BVar3 = xTaskRemoveFromEventList(&pxQueue->xTasksWaitingToReceive);
      if (BVar3 == 0) {
        uVar4 = iVar2 - 1U & 0xff;
        cVar1 = (char)uVar4;
      }
      else {
        vTaskMissedYield();
        uVar4 = iVar2 - 1U & 0xff;
        cVar1 = (char)uVar4;
      }
    } while ((uVar4 != 0) &&
            (iVar2 = (int)cVar1, (pxQueue->xTasksWaitingToReceive).uxNumberOfItems != 0));
  }
  pxQueue->cTxLock = -1;
  vTaskExitCritical();
  vTaskEnterCritical();
  iVar2 = (int)pxQueue->cRxLock;
  if ((0 < iVar2) && ((pxQueue->xTasksWaitingToSend).uxNumberOfItems != 0)) {
    do {
      BVar3 = xTaskRemoveFromEventList(&pxQueue->xTasksWaitingToSend);
      if (BVar3 == 0) {
        uVar4 = iVar2 - 1U & 0xff;
        cVar1 = (char)uVar4;
      }
      else {
        vTaskMissedYield();
        uVar4 = iVar2 - 1U & 0xff;
        cVar1 = (char)uVar4;
      }
    } while ((uVar4 != 0) &&
            (iVar2 = (int)cVar1, (pxQueue->xTasksWaitingToSend).uxNumberOfItems != 0));
  }
  pxQueue->cRxLock = -1;
  vTaskExitCritical();
  return;
}



BaseType_t xQueueGenericReset(QueueHandle_t xQueue,BaseType_t xNewQueue)

{
  BaseType_t BVar1;
  int8_t *piVar2;
  int iVar3;
  
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  piVar2 = xQueue->pcHead;
  xQueue->uxMessagesWaiting = 0;
  iVar3 = xQueue->uxItemSize * xQueue->uxLength;
  xQueue->cRxLock = -1;
  xQueue->pcWriteTo = piVar2;
  xQueue->cTxLock = -1;
  *(int8_t **)&xQueue->u = piVar2 + iVar3;
  *(int8_t **)((int)&xQueue->u + 4) = piVar2 + (iVar3 - xQueue->uxItemSize);
  if (xNewQueue == 0) {
    if (((xQueue->xTasksWaitingToSend).uxNumberOfItems != 0) &&
       (BVar1 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToSend), BVar1 != 0)) {
      ecall();
      vTaskExitCritical();
      return 1;
    }
    vTaskExitCritical();
    return 1;
  }
  vListInitialise(&xQueue->xTasksWaitingToSend);
  vListInitialise(&xQueue->xTasksWaitingToReceive);
  vTaskExitCritical();
  return 1;
}



// WARNING: Removing unreachable block (ram,0x2302eb7e)

QueueHandle_t
xQueueGenericCreateStatic
          (UBaseType_t uxQueueLength,UBaseType_t uxItemSize,uint8_t *pucQueueStorage,
          StaticQueue_t *pxStaticQueue,uint8_t ucQueueType)

{
  size_t xSize;
  
