pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (uxQueueLength == 0) {
    vAssertCalled();
  }
  if (pxStaticQueue == (StaticQueue_t *)0x0) {
    vAssertCalled();
  }
  if (pucQueueStorage == (uint8_t *)0x0) {
    if (uxItemSize == 0) goto LAB_2302eb82;
  }
  else {
    if (uxItemSize != 0) goto LAB_2302eb82;
  }
  vAssertCalled();
LAB_2302eb82:
  if (pxStaticQueue != (StaticQueue_t *)0x0) {
    pxStaticQueue->ucDummy6 = '\x01';
    if (uxItemSize == 0) {
      pucQueueStorage = (uint8_t *)pxStaticQueue;
    }
    *(uint8_t **)pxStaticQueue->pvDummy1 = pucQueueStorage;
    pxStaticQueue->uxDummy4[1] = uxQueueLength;
    pxStaticQueue->uxDummy4[2] = uxItemSize;
    xQueueGenericReset((QueueHandle_t)pxStaticQueue,1);
    pxStaticQueue->ucDummy9 = ucQueueType;
  }
  return (QueueHandle_t)pxStaticQueue;
}



QueueHandle_t
xQueueGenericCreate(UBaseType_t uxQueueLength,UBaseType_t uxItemSize,uint8_t ucQueueType)

{
  QueueHandle_t xQueue;
  
  if (uxQueueLength == 0) {
    vAssertCalled();
  }
  if (uxItemSize == 0) {
    xQueue = (QueueHandle_t)pvPortMalloc(0x50);
    if (xQueue == (QueueHandle_t)0x0) {
      return (QueueHandle_t)0x0;
    }
    xQueue->ucStaticallyAllocated = '\0';
    *(QueueHandle_t *)&xQueue->pcHead = xQueue;
  }
  else {
    xQueue = (QueueHandle_t)pvPortMalloc(uxQueueLength * uxItemSize + 0x50);
    if (xQueue == (QueueHandle_t)0x0) {
      return (QueueHandle_t)0x0;
    }
    xQueue->ucStaticallyAllocated = '\0';
    *(QueueHandle_t *)&xQueue->pcHead = xQueue + 1;
  }
  xQueue->uxLength = uxQueueLength;
  xQueue->uxItemSize = uxItemSize;
  xQueueGenericReset(xQueue,1);
  xQueue->ucQueueType = ucQueueType;
  return xQueue;
}



QueueHandle_t xQueueCreateCountingSemaphore(UBaseType_t uxMaxCount,UBaseType_t uxInitialCount)

{
  bool bVar1;
  QueueHandle_t pQVar2;
  
  if (uxMaxCount == 0) {
    vAssertCalled();
    bVar1 = uxInitialCount == 0;
  }
  else {
    bVar1 = uxInitialCount <= uxMaxCount;
  }
  if (!bVar1) {
    vAssertCalled();
  }
  pQVar2 = xQueueGenericCreate(uxMaxCount,0,'\x02');
  if (pQVar2 != (QueueHandle_t)0x0) {
    pQVar2->uxMessagesWaiting = uxInitialCount;
  }
  return pQVar2;
}



// WARNING: Variable defined which should be unmapped: xTimeOut

BaseType_t
xQueueGenericSend(QueueHandle_t xQueue,void *pvItemToQueue,TickType_t xTicksToWait,
                 BaseType_t xCopyPosition)

{
  bool bVar1;
  BaseType_t BVar2;
  int iVar3;
  TickType_t local_34 [3];
  undefined auStack40 [4];
  TimeOut_t xTimeOut;
  
  local_34[0] = xTicksToWait;
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  if ((pvItemToQueue == (void *)0x0) && (xQueue->uxItemSize != 0)) {
    vAssertCalled();
  }
  if ((xCopyPosition == 2) && (xQueue->uxLength != 1)) {
    vAssertCalled();
  }
  BVar2 = xTaskGetSchedulerState();
  if ((BVar2 == 0) && (local_34[0] != 0)) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  bVar1 = false;
  if (xQueue->uxLength <= xQueue->uxMessagesWaiting) {
    do {
      if (xCopyPosition == 2) break;
      if (local_34[0] == 0) {
        vTaskExitCritical();
        return 0;
      }
      if (!bVar1) {
        vTaskInternalSetTimeOutState((TimeOut_t *)auStack40);
      }
      vTaskExitCritical();
      vTaskSuspendAll();
      vTaskEnterCritical();
      if (xQueue->cRxLock == -1) {
        xQueue->cRxLock = '\0';
      }
      if (xQueue->cTxLock == -1) {
        xQueue->cTxLock = '\0';
      }
      vTaskExitCritical();
      BVar2 = xTaskCheckForTimeOut((TimeOut_t *)auStack40,local_34);
      if (BVar2 != 0) {
        prvUnlockQueue((Queue_t *)xQueue);
        xTaskResumeAll();
        return 0;
      }
      vTaskEnterCritical();
      if (xQueue->uxMessagesWaiting == xQueue->uxLength) {
        vTaskExitCritical();
        vTaskPlaceOnEventList(&xQueue->xTasksWaitingToSend,local_34[0]);
        prvUnlockQueue((Queue_t *)xQueue);
        BVar2 = xTaskResumeAll();
        if (BVar2 == 0) {
          ecall();
        }
      }
      else {
        vTaskExitCritical();
        prvUnlockQueue((Queue_t *)xQueue);
        xTaskResumeAll();
      }
      bVar1 = true;
      vTaskEnterCritical();
    } while (xQueue->uxLength <= xQueue->uxMessagesWaiting);
  }
  iVar3 = prvCopyDataToQueue((Queue_t *)xQueue,pvItemToQueue,xCopyPosition);
  if ((xQueue->xTasksWaitingToReceive).uxNumberOfItems != 0) {
    iVar3 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToReceive);
  }
  if (iVar3 != 0) {
    ecall();
  }
  vTaskExitCritical();
  return 1;
}



QueueHandle_t xQueueCreateMutexStatic(uint8_t ucQueueType,StaticQueue_t *pxStaticQueue)

{
  QueueHandle_t xQueue;
  
  xQueue = xQueueGenericCreateStatic(1,0,(uint8_t *)0x0,pxStaticQueue,ucQueueType);
  if (xQueue != (QueueHandle_t)0x0) {
    *(undefined4 *)&xQueue->u = 0;
    xQueue->pcHead = (int8_t *)0x0;
    *(undefined4 *)((int)&xQueue->u + 4) = 0;
    xQueueGenericSend(xQueue,(void *)0x0,0,0);
  }
  return xQueue;
}



BaseType_t xQueueGiveMutexRecursive(QueueHandle_t xMutex)

{
  BaseType_t BVar1;
  TaskHandle_t ptVar2;
  int iVar3;
  TaskHandle_t ptVar4;
  
  if (xMutex == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  ptVar4 = *(TaskHandle_t *)&xMutex->u;
  ptVar2 = xTaskGetCurrentTaskHandle();
  BVar1 = 0;
  if (ptVar4 == ptVar2) {
    iVar3 = *(int *)((int)&xMutex->u + 4) + -1;
    *(int *)((int)&xMutex->u + 4) = iVar3;
    BVar1 = 1;
    if (iVar3 == 0) {
      xQueueGenericSend(xMutex,(void *)0x0,0,0);
      BVar1 = 1;
    }
  }
  return BVar1;
}



QueueHandle_t xQueueCreateMutex(uint8_t ucQueueType)

{
  QueueHandle_t xQueue;
  
  xQueue = xQueueGenericCreate(1,0,ucQueueType);
  if (xQueue != (QueueHandle_t)0x0) {
    *(undefined4 *)&xQueue->u = 0;
    xQueue->pcHead = (int8_t *)0x0;
    *(undefined4 *)((int)&xQueue->u + 4) = 0;
    xQueueGenericSend(xQueue,(void *)0x0,0,0);
  }
  return xQueue;
}



BaseType_t
xQueueGenericSendFromISR
          (QueueHandle_t xQueue,void *pvItemToQueue,BaseType_t *pxHigherPriorityTaskWoken,
          BaseType_t xCopyPosition)

{
  byte bVar1;
  BaseType_t BVar2;
  
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  if ((pvItemToQueue == (void *)0x0) && (xQueue->uxItemSize != 0)) {
    vAssertCalled();
  }
  if (xCopyPosition == 2) {
    if (xQueue->uxLength != 1) {
      vAssertCalled();
    }
  }
  else {
    if (xQueue->uxLength <= xQueue->uxMessagesWaiting) {
      return 0;
    }
  }
  bVar1 = xQueue->cTxLock;
  prvCopyDataToQueue((Queue_t *)xQueue,pvItemToQueue,xCopyPosition);
  if (bVar1 == 0xff) {
    if ((((xQueue->xTasksWaitingToReceive).uxNumberOfItems != 0) &&
        (BVar2 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToReceive), BVar2 != 0)) &&
       (pxHigherPriorityTaskWoken != (BaseType_t *)0x0)) {
      *pxHigherPriorityTaskWoken = 1;
    }
    return 1;
  }
  xQueue->cTxLock = (int8_t)(((uint)bVar1 + 1) * 0x1000000 >> 0x18);
  return 1;
}



BaseType_t xQueueGiveFromISR(QueueHandle_t xQueue,BaseType_t *pxHigherPriorityTaskWoken)

{
  BaseType_t BVar1;
  int8_t *piVar2;
  
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  if (xQueue->uxItemSize == 0) {
    piVar2 = xQueue->pcHead;
  }
  else {
    vAssertCalled();
    piVar2 = xQueue->pcHead;
  }
  if ((piVar2 == (int8_t *)0x0) && (*(int *)&xQueue->u != 0)) {
    vAssertCalled();
  }
  BVar1 = 0;
  if (xQueue->uxMessagesWaiting < xQueue->uxLength) {
    xQueue->uxMessagesWaiting = xQueue->uxMessagesWaiting + 1;
    if (xQueue->cTxLock == 0xff) {
      if ((((xQueue->xTasksWaitingToReceive).uxNumberOfItems != 0) &&
          (BVar1 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToReceive), BVar1 != 0)) &&
         (pxHigherPriorityTaskWoken != (BaseType_t *)0x0)) {
        *pxHigherPriorityTaskWoken = 1;
        return 1;
      }
    }
    else {
      xQueue->cTxLock = (int8_t)(((uint)(byte)xQueue->cTxLock + 1) * 0x1000000 >> 0x18);
    }
    BVar1 = 1;
  }
  return BVar1;
}



BaseType_t xQueueReceive(QueueHandle_t xQueue,void *pvBuffer,TickType_t xTicksToWait)

{
  BaseType_t BVar1;
  UBaseType_t UVar2;
  TickType_t local_34 [3];
  undefined auStack40 [4];
  TimeOut_t xTimeOut;
  
  local_34[0] = xTicksToWait;
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  if ((pvBuffer == (void *)0x0) && (xQueue->uxItemSize != 0)) {
    vAssertCalled();
  }
  BVar1 = xTaskGetSchedulerState();
  if ((BVar1 == 0) && (local_34[0] != 0)) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  UVar2 = xQueue->uxMessagesWaiting;
  if (UVar2 != 0) {
LAB_2302f0a0:
    prvCopyDataFromQueue((Queue_t *)xQueue,pvBuffer);
    xQueue->uxMessagesWaiting = UVar2 - 1;
    if (((xQueue->xTasksWaitingToSend).uxNumberOfItems != 0) &&
       (BVar1 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToSend), BVar1 != 0)) {
      ecall();
    }
    vTaskExitCritical();
    return 1;
  }
  if (local_34[0] != 0) {
    vTaskInternalSetTimeOutState((TimeOut_t *)auStack40);
    do {
      vTaskExitCritical();
      vTaskSuspendAll();
      vTaskEnterCritical();
      if (xQueue->cRxLock == -1) {
        xQueue->cRxLock = '\0';
      }
      if (xQueue->cTxLock == -1) {
        xQueue->cTxLock = '\0';
      }
      vTaskExitCritical();
      BVar1 = xTaskCheckForTimeOut((TimeOut_t *)auStack40,local_34);
      if (BVar1 == 0) {
        vTaskEnterCritical();
        if (xQueue->uxMessagesWaiting == 0) {
          vTaskExitCritical();
          vTaskPlaceOnEventList(&xQueue->xTasksWaitingToReceive,local_34[0]);
          prvUnlockQueue((Queue_t *)xQueue);
          BVar1 = xTaskResumeAll();
          if (BVar1 == 0) {
            ecall();
          }
          goto LAB_2302f094;
        }
        vTaskExitCritical();
        prvUnlockQueue((Queue_t *)xQueue);
        xTaskResumeAll();
        vTaskEnterCritical();
        UVar2 = xQueue->uxMessagesWaiting;
      }
      else {
        prvUnlockQueue((Queue_t *)xQueue);
        xTaskResumeAll();
        vTaskEnterCritical();
        if (xQueue->uxMessagesWaiting == 0) break;
        vTaskExitCritical();
LAB_2302f094:
        vTaskEnterCritical();
        UVar2 = xQueue->uxMessagesWaiting;
      }
      if (UVar2 != 0) goto LAB_2302f0a0;
    } while (local_34[0] != 0);
  }
  vTaskExitCritical();
  return 0;
}



// WARNING: Type propagation algorithm not settling

BaseType_t xQueueSemaphoreTake(QueueHandle_t xQueue,TickType_t xTicksToWait)

{
  bool bVar1;
  BaseType_t BVar2;
  TaskHandle_t ptVar3;
  UBaseType_t uxHighestPriorityWaitingTask;
  int iVar4;
  TickType_t local_34 [3];
  undefined auStack40 [4];
  TimeOut_t xTimeOut;
  
  local_34[0] = xTicksToWait;
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  if (xQueue->uxItemSize != 0) {
    vAssertCalled();
  }
  BVar2 = xTaskGetSchedulerState();
  if ((BVar2 == 0) && (local_34[0] != 0)) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  uxHighestPriorityWaitingTask = xQueue->uxMessagesWaiting;
  iVar4 = 0;
  bVar1 = false;
  while( true ) {
    if (uxHighestPriorityWaitingTask != 0) {
      xQueue->uxMessagesWaiting = uxHighestPriorityWaitingTask - 1;
      if (xQueue->pcHead == (int8_t *)0x0) {
        ptVar3 = pvTaskIncrementMutexHeldCount();
        *(TaskHandle_t *)&xQueue->u = ptVar3;
      }
      if (((xQueue->xTasksWaitingToSend).uxNumberOfItems != 0) &&
         (BVar2 = xTaskRemoveFromEventList(&xQueue->xTasksWaitingToSend), BVar2 != 0)) {
        ecall();
      }
      vTaskExitCritical();
      return 1;
    }
    if (local_34[0] == 0) break;
    if (!bVar1) {
      vTaskInternalSetTimeOutState((TimeOut_t *)auStack40);
    }
    vTaskExitCritical();
    vTaskSuspendAll();
    vTaskEnterCritical();
    if (xQueue->cRxLock == -1) {
      xQueue->cRxLock = '\0';
    }
    if (xQueue->cTxLock == -1) {
      xQueue->cTxLock = '\0';
    }
    vTaskExitCritical();
    BVar2 = xTaskCheckForTimeOut((TimeOut_t *)auStack40,local_34);
    if (BVar2 == 0) {
      vTaskEnterCritical();
      if (xQueue->uxMessagesWaiting == 0) {
        vTaskExitCritical();
        if (xQueue->pcHead == (int8_t *)0x0) {
          vTaskEnterCritical();
          iVar4 = xTaskPriorityInherit(*(TaskHandle_t *)&xQueue->u);
          vTaskExitCritical();
        }
        vTaskPlaceOnEventList(&xQueue->xTasksWaitingToReceive,local_34[0]);
        prvUnlockQueue((Queue_t *)xQueue);
        BVar2 = xTaskResumeAll();
        if (BVar2 == 0) {
          ecall();
        }
      }
      else {
        vTaskExitCritical();
        prvUnlockQueue((Queue_t *)xQueue);
        xTaskResumeAll();
      }
    }
    else {
      prvUnlockQueue((Queue_t *)xQueue);
      xTaskResumeAll();
      vTaskEnterCritical();
      if (xQueue->uxMessagesWaiting == 0) {
        vTaskExitCritical();
        if (iVar4 == 0) {
          return 0;
        }
        vTaskEnterCritical();
        uxHighestPriorityWaitingTask = (xQueue->xTasksWaitingToReceive).uxNumberOfItems;
        if (uxHighestPriorityWaitingTask != 0) {
          uxHighestPriorityWaitingTask =
               0x20 - ((xQueue->xTasksWaitingToReceive).xListEnd.pxNext)->xItemValue;
        }
        vTaskPriorityDisinheritAfterTimeout
                  (*(TaskHandle_t *)&xQueue->u,uxHighestPriorityWaitingTask);
        vTaskExitCritical();
        return 0;
      }
      vTaskExitCritical();
    }
    bVar1 = true;
    vTaskEnterCritical();
    uxHighestPriorityWaitingTask = xQueue->uxMessagesWaiting;
  }
  if (iVar4 != 0) {
    vAssertCalled();
  }
  vTaskExitCritical();
  return 0;
}



