pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
BaseType_t xQueueTakeMutexRecursive(QueueHandle_t xMutex,TickType_t xTicksToWait)

{
  TaskHandle_t ptVar1;
  TaskHandle_t ptVar2;
  BaseType_t BVar3;
  
  if (xMutex == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  ptVar1 = *(TaskHandle_t *)&xMutex->u;
  ptVar2 = xTaskGetCurrentTaskHandle();
  if (ptVar1 != ptVar2) {
    BVar3 = xQueueSemaphoreTake(xMutex,xTicksToWait);
    if (BVar3 != 0) {
      *(int *)((int)&xMutex->u + 4) = *(int *)((int)&xMutex->u + 4) + 1;
    }
    return BVar3;
  }
  *(int *)((int)&xMutex->u + 4) = *(int *)((int)&xMutex->u + 4) + 1;
  return 1;
}



UBaseType_t uxQueueMessagesWaiting(QueueHandle_t xQueue)

{
  UBaseType_t UVar1;
  
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  UVar1 = xQueue->uxMessagesWaiting;
  vTaskExitCritical();
  return UVar1;
}



void vQueueDelete(QueueHandle_t xQueue)

{
  QueueHandle_t *ppQVar1;
  int iVar2;
  QueueRegistryItem_t *pQVar3;
  
  if (xQueue == (QueueHandle_t)0x0) {
    vAssertCalled();
    iVar2 = 0;
    pQVar3 = xQueueRegistry;
    do {
      ppQVar1 = &pQVar3->xHandle;
      pQVar3 = pQVar3 + 1;
      if (*ppQVar1 == (QueueHandle_t)0x0) {
        xQueueRegistry[iVar2].pcQueueName = (char *)0x0;
        xQueueRegistry[iVar2].xHandle = (QueueHandle_t)0x0;
        break;
      }
      iVar2 = iVar2 + 1;
    } while (iVar2 != 8);
    if (cRam00000046 != '\0') {
      return;
    }
    vPortFree((void *)0x0);
    return;
  }
  iVar2 = 0;
  pQVar3 = xQueueRegistry;
  do {
    ppQVar1 = &pQVar3->xHandle;
    pQVar3 = pQVar3 + 1;
    if (xQueue == *ppQVar1) {
      xQueueRegistry[iVar2].pcQueueName = (char *)0x0;
      xQueueRegistry[iVar2].xHandle = (QueueHandle_t)0x0;
      break;
    }
    iVar2 = iVar2 + 1;
  } while (iVar2 != 8);
  if (xQueue->ucStaticallyAllocated != '\0') {
    return;
  }
  vPortFree(xQueue);
  return;
}



void vQueueAddToRegistry(QueueHandle_t xQueue,char *pcQueueName)

{
  char **ppcVar1;
  int iVar2;
  QueueRegistryItem_t *pQVar3;
  
  iVar2 = 0;
  pQVar3 = xQueueRegistry;
  do {
    ppcVar1 = &pQVar3->pcQueueName;
    pQVar3 = pQVar3 + 1;
    if (*ppcVar1 == (char *)0x0) {
      xQueueRegistry[iVar2].pcQueueName = pcQueueName;
      xQueueRegistry[iVar2].xHandle = xQueue;
      return;
    }
    iVar2 = iVar2 + 1;
  } while (iVar2 != 8);
  return;
}



void vQueueWaitForMessageRestricted
               (QueueHandle_t xQueue,TickType_t xTicksToWait,BaseType_t xWaitIndefinitely)

{
  vTaskEnterCritical();
  if (xQueue->cRxLock == -1) {
    xQueue->cRxLock = '\0';
  }
  if (xQueue->cTxLock == -1) {
    xQueue->cTxLock = '\0';
  }
  vTaskExitCritical();
  if (xQueue->uxMessagesWaiting != 0) {
    prvUnlockQueue((Queue_t *)xQueue);
    return;
  }
  vTaskPlaceOnEventListRestricted(&xQueue->xTasksWaitingToReceive,xTicksToWait,xWaitIndefinitely);
  prvUnlockQueue((Queue_t *)xQueue);
  return;
}



void prvInitialiseNewStreamBuffer
               (StreamBuffer_t *pxStreamBuffer,uint8_t *pucBuffer,size_t xBufferSizeBytes,
               size_t xTriggerLevelBytes,uint8_t ucFlags)

{
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)memset(pucBuffer,0x55,xBufferSizeBytes);
  if (pucBuffer != puVar1) {
    vAssertCalled();
  }
  memset(pxStreamBuffer,0,0x24);
  pxStreamBuffer->pucBuffer = pucBuffer;
  pxStreamBuffer->xLength = xBufferSizeBytes;
  pxStreamBuffer->xTriggerLevelBytes = xTriggerLevelBytes;
  pxStreamBuffer->ucFlags = ucFlags;
  return;
}



size_t prvWriteBytesToBuffer(StreamBuffer_t *pxStreamBuffer,uint8_t *pucData,size_t xCount)

{
  uint uVar1;
  uint __n;
  size_t __n_00;
  
  if (xCount == 0) {
    vAssertCalled();
    uVar1 = pxStreamBuffer->xHead;
    if (pxStreamBuffer->xLength < uVar1) {
      __n_00 = 0;
      goto LAB_2302f4f8;
    }
    memcpy(pxStreamBuffer->pucBuffer + uVar1,pucData,0);
    __n = pxStreamBuffer->xLength;
    if (uVar1 < __n) goto LAB_2302f4d6;
  }
  else {
    uVar1 = pxStreamBuffer->xHead;
    __n_00 = pxStreamBuffer->xLength - uVar1;
    if (xCount < __n_00) {
      __n = uVar1 + xCount;
      __n_00 = xCount;
    }
    else {
      __n = uVar1 + __n_00;
    }
    if (pxStreamBuffer->xLength < __n) {
LAB_2302f4f8:
      vAssertCalled();
    }
    memcpy(pxStreamBuffer->pucBuffer + uVar1,pucData,__n_00);
    if (__n_00 < xCount) {
      __n = xCount - __n_00;
      if (pxStreamBuffer->xLength < __n) {
        vAssertCalled();
        memcpy(pxStreamBuffer->pucBuffer,pucData + __n_00,__n);
      }
      else {
        memcpy(pxStreamBuffer->pucBuffer,pucData + __n_00,__n);
      }
    }
    __n = pxStreamBuffer->xLength;
    uVar1 = uVar1 + xCount;
    if (uVar1 < __n) goto LAB_2302f4d6;
  }
  uVar1 = uVar1 - __n;
LAB_2302f4d6:
  pxStreamBuffer->xHead = uVar1;
  return xCount;
}



size_t prvReadBytesFromBuffer
                 (StreamBuffer_t *pxStreamBuffer,uint8_t *pucData,size_t xMaxCount,
                 size_t xBytesAvailable)

{
  size_t sVar1;
  uint __n;
  
  if (xMaxCount <= xBytesAvailable) {
    xBytesAvailable = xMaxCount;
  }
  if (xBytesAvailable == 0) {
    return 0;
  }
  sVar1 = pxStreamBuffer->xTail;
  __n = pxStreamBuffer->xLength - sVar1;
  if (xBytesAvailable < __n) {
    __n = xBytesAvailable;
    if (xBytesAvailable <= xMaxCount) goto LAB_2302f566;
LAB_2302f5c0:
    vAssertCalled();
    if (sVar1 + __n <= pxStreamBuffer->xLength) goto LAB_2302f56e;
  }
  else {
    if (xMaxCount < __n) goto LAB_2302f5c0;
LAB_2302f566:
    if (sVar1 + __n <= pxStreamBuffer->xLength) goto LAB_2302f56e;
  }
  vAssertCalled();
LAB_2302f56e:
  memcpy(pucData,pxStreamBuffer->pucBuffer + sVar1,__n);
  if (__n < xBytesAvailable) {
    if (xMaxCount < xBytesAvailable) {
      vAssertCalled();
    }
    memcpy(pucData + __n,pxStreamBuffer->pucBuffer,xBytesAvailable - __n);
  }
  sVar1 = sVar1 + xBytesAvailable;
  if (pxStreamBuffer->xLength <= sVar1) {
    sVar1 = sVar1 - pxStreamBuffer->xLength;
  }
  pxStreamBuffer->xTail = sVar1;
  return xBytesAvailable;
}



StreamBufferHandle_t
xStreamBufferGenericCreate
          (size_t xBufferSizeBytes,size_t xTriggerLevelBytes,BaseType_t xIsMessageBuffer)

{
  uint8_t uVar1;
  StreamBuffer_t *pxStreamBuffer;
  uint8_t ucFlags;
  
  ucFlags = (uint8_t)xBufferSizeBytes;
  if (xIsMessageBuffer == 1) {
    uVar1 = '\x01';
    if (xBufferSizeBytes < 5) {
      vAssertCalled();
      uVar1 = '\x01';
    }
joined_r0x2302f64a:
    ucFlags = uVar1;
    if (xTriggerLevelBytes <= xBufferSizeBytes) goto joined_r0x2302f5f8;
  }
  else {
    uVar1 = '\0';
    if (xBufferSizeBytes != 0) goto joined_r0x2302f64a;
    vAssertCalled();
    if (xTriggerLevelBytes == 0) goto joined_r0x2302f5f8;
  }
  vAssertCalled();
joined_r0x2302f5f8:
  if (xTriggerLevelBytes == 0) {
    xTriggerLevelBytes = 1;
  }
  pxStreamBuffer = (StreamBuffer_t *)pvPortMalloc(xBufferSizeBytes + 0x25);
  if (pxStreamBuffer != (StreamBuffer_t *)0x0) {
    prvInitialiseNewStreamBuffer
              (pxStreamBuffer,(uint8_t *)(pxStreamBuffer + 1),xBufferSizeBytes + 1,
               xTriggerLevelBytes,ucFlags);
  }
  return (StreamBufferHandle_t)pxStreamBuffer;
}



// WARNING: Removing unreachable block (ram,0x2302f6dc)

StreamBufferHandle_t
xStreamBufferGenericCreateStatic
          (size_t xBufferSizeBytes,size_t xTriggerLevelBytes,BaseType_t xIsMessageBuffer,
          uint8_t *pucStreamBufferStorageArea,StaticStreamBuffer_t *pxStaticStreamBuffer)

{
  size_t xSize;
  
  if (pucStreamBufferStorageArea == (uint8_t *)0x0) {
    vAssertCalled();
  }
  if (pxStaticStreamBuffer == (StaticStreamBuffer_t *)0x0) {
    vAssertCalled();
  }
  if (xBufferSizeBytes < xTriggerLevelBytes) {
    vAssertCalled();
  }
  if (xTriggerLevelBytes == 0) {
    xTriggerLevelBytes = 1;
  }
  if (xBufferSizeBytes < 5) {
    vAssertCalled();
  }
  if (pucStreamBufferStorageArea == (uint8_t *)0x0) {
    pxStaticStreamBuffer = (StaticStreamBuffer_t *)0x0;
  }
  else {
    if (pxStaticStreamBuffer != (StaticStreamBuffer_t *)0x0) {
      prvInitialiseNewStreamBuffer
                ((StreamBuffer_t *)pxStaticStreamBuffer,pucStreamBufferStorageArea,xBufferSizeBytes,
                 xTriggerLevelBytes,(xIsMessageBuffer != 0) + '\x02');
      pxStaticStreamBuffer->ucDummy3 = pxStaticStreamBuffer->ucDummy3 | 2;
    }
  }
  return (StreamBufferHandle_t)pxStaticStreamBuffer;
}



void vStreamBufferDelete(StreamBufferHandle_t xStreamBuffer)

{
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
    if ((bRam0000001c & 2) == 0) {
      vPortFree((void *)0x0);
      return;
    }
    memset((void *)0x0,0,0x24);
    return;
  }
  if ((xStreamBuffer->ucFlags & 2) == 0) {
    vPortFree(xStreamBuffer);
    return;
  }
  memset(xStreamBuffer,0,0x24);
  return;
}



