pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

size_t xStreamBufferSpacesAvailable(StreamBufferHandle_t xStreamBuffer)

{
  uint uVar1;
  size_t sVar2;
  uint uVar3;
  
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
    sVar2 = (_DAT_00000008 + ___EM_SIZE + -1) - _DAT_00000004;
    if (_DAT_00000008 <= sVar2) {
      sVar2 = sVar2 - _DAT_00000008;
    }
    return sVar2;
  }
  uVar3 = xStreamBuffer->xLength;
  uVar1 = (uVar3 + xStreamBuffer->xTail + -1) - xStreamBuffer->xHead;
  if (uVar3 <= uVar1) {
    return uVar1 - uVar3;
  }
  return uVar1;
}



size_t xStreamBufferSend(StreamBufferHandle_t xStreamBuffer,void *pvTxData,size_t xDataLengthBytes,
                        TickType_t xTicksToWait)

{
  TaskHandle_t ptVar1;
  BaseType_t BVar2;
  uint uVar3;
  uint uVar4;
  size_t sVar5;
  TickType_t aTStack52 [2];
  size_t sStack44;
  undefined auStack40 [4];
  TimeOut_t xTimeOut;
  
  aTStack52[0] = xTicksToWait;
  if (pvTxData == (void *)0x0) {
    vAssertCalled();
  }
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
  }
  sVar5 = xDataLengthBytes;
  if (((xStreamBuffer->ucFlags & 1) == 0) ||
     (sVar5 = xDataLengthBytes + 4, xDataLengthBytes < sVar5)) {
    if (aTStack52[0] != 0) goto LAB_2302f7ba;
LAB_2302f85c:
    uVar3 = xStreamBufferSpacesAvailable(xStreamBuffer);
    if (uVar3 != 0) goto LAB_2302f80c;
LAB_2302f868:
    sVar5 = 0;
  }
  else {
    vAssertCalled();
    if (aTStack52[0] == 0) goto LAB_2302f85c;
LAB_2302f7ba:
    vTaskSetTimeOutState((TimeOut_t *)auStack40);
    do {
      vTaskEnterCritical();
      uVar3 = xStreamBufferSpacesAvailable(xStreamBuffer);
      if (sVar5 <= uVar3) {
        vTaskExitCritical();
        break;
      }
      xTaskNotifyStateClear((TaskHandle_t)0x0);
      if (xStreamBuffer->xTaskWaitingToSend != (TaskHandle_t)0x0) {
        vAssertCalled();
      }
      ptVar1 = xTaskGetCurrentTaskHandle();
      xStreamBuffer->xTaskWaitingToSend = ptVar1;
      vTaskExitCritical();
      xTaskNotifyWait(0,0,(uint32_t *)0x0,aTStack52[0]);
      xStreamBuffer->xTaskWaitingToSend = (TaskHandle_t)0x0;
      BVar2 = xTaskCheckForTimeOut((TimeOut_t *)auStack40,aTStack52);
    } while (BVar2 == 0);
    if (uVar3 == 0) goto LAB_2302f85c;
LAB_2302f80c:
    if ((xStreamBuffer->ucFlags & 1) == 0) {
      sStack44 = xDataLengthBytes;
      if (uVar3 < xDataLengthBytes) {
        sStack44 = uVar3;
      }
    }
    else {
      if (uVar3 < sVar5) goto LAB_2302f868;
      sStack44 = xDataLengthBytes;
      prvWriteBytesToBuffer((StreamBuffer_t *)xStreamBuffer,(uint8_t *)&sStack44,4);
    }
    sVar5 = prvWriteBytesToBuffer((StreamBuffer_t *)xStreamBuffer,(uint8_t *)pvTxData,sStack44);
    if (sVar5 != 0) {
      uVar3 = xStreamBuffer->xLength;
      uVar4 = (xStreamBuffer->xHead + uVar3) - xStreamBuffer->xTail;
      if (uVar3 <= uVar4) {
        uVar4 = uVar4 - uVar3;
      }
      if (xStreamBuffer->xTriggerLevelBytes <= uVar4) {
        vTaskSuspendAll();
        if (xStreamBuffer->xTaskWaitingToReceive != (TaskHandle_t)0x0) {
          xTaskGenericNotify(xStreamBuffer->xTaskWaitingToReceive,0,eNoAction,(uint32_t *)0x0);
          xStreamBuffer->xTaskWaitingToReceive = (TaskHandle_t)0x0;
        }
        xTaskResumeAll();
      }
    }
  }
  return sVar5;
}



size_t xStreamBufferSendFromISR
                 (StreamBufferHandle_t xStreamBuffer,void *pvTxData,size_t xDataLengthBytes,
                 BaseType_t *pxHigherPriorityTaskWoken)

{
  size_t sVar1;
  uint uVar2;
  uint uVar3;
  size_t sVar4;
  size_t asStack36 [3];
  
  if (pvTxData == (void *)0x0) {
    vAssertCalled();
  }
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
  }
  sVar4 = xDataLengthBytes;
  if ((xStreamBuffer->ucFlags & 1) != 0) {
    sVar4 = xDataLengthBytes + 4;
  }
  sVar1 = xStreamBufferSpacesAvailable(xStreamBuffer);
  if (sVar1 == 0) {
LAB_2302f8de:
    sVar4 = 0;
  }
  else {
    if ((xStreamBuffer->ucFlags & 1) == 0) {
      asStack36[0] = xDataLengthBytes;
      if (sVar1 < xDataLengthBytes) {
        asStack36[0] = sVar1;
      }
    }
    else {
      if (sVar1 < sVar4) goto LAB_2302f8de;
      asStack36[0] = xDataLengthBytes;
      prvWriteBytesToBuffer((StreamBuffer_t *)xStreamBuffer,(uint8_t *)asStack36,4);
    }
    sVar4 = prvWriteBytesToBuffer((StreamBuffer_t *)xStreamBuffer,(uint8_t *)pvTxData,asStack36[0]);
    if (sVar4 != 0) {
      uVar2 = xStreamBuffer->xLength;
      uVar3 = (xStreamBuffer->xHead + uVar2) - xStreamBuffer->xTail;
      if (uVar2 <= uVar3) {
        uVar3 = uVar3 - uVar2;
      }
      if ((xStreamBuffer->xTriggerLevelBytes <= uVar3) &&
         (xStreamBuffer->xTaskWaitingToReceive != (TaskHandle_t)0x0)) {
        xTaskGenericNotifyFromISR
                  (xStreamBuffer->xTaskWaitingToReceive,0,eNoAction,(uint32_t *)0x0,
                   pxHigherPriorityTaskWoken);
        xStreamBuffer->xTaskWaitingToReceive = (TaskHandle_t)0x0;
      }
    }
  }
  return sVar4;
}



size_t xStreamBufferReceive
                 (StreamBufferHandle_t xStreamBuffer,void *pvRxData,size_t xBufferLengthBytes,
                 TickType_t xTicksToWait)

{
  bool bVar1;
  byte bVar2;
  size_t xBytesAvailable;
  TaskHandle_t ptVar3;
  uint uVar4;
  uint uVar5;
  uint xMaxCount;
  size_t sVar6;
  uint uStack36;
  size_t xTempNextMessageLength;
  
  if (pvRxData == (void *)0x0) {
    vAssertCalled();
  }
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
  }
  bVar2 = xStreamBuffer->ucFlags;
  uVar5 = (uint)bVar2 & 1;
  xMaxCount = uVar5 * 4;
  if (xTicksToWait != 0) {
    vTaskEnterCritical();
    uVar4 = xStreamBuffer->xLength;
    xBytesAvailable = (xStreamBuffer->xHead + uVar4) - xStreamBuffer->xTail;
    if (uVar4 <= xBytesAvailable) {
      xBytesAvailable = xBytesAvailable - uVar4;
    }
    if (xMaxCount < xBytesAvailable) {
      vTaskExitCritical();
      goto LAB_2302f9ce;
    }
    xTaskNotifyStateClear((TaskHandle_t)0x0);
    if (xStreamBuffer->xTaskWaitingToReceive != (TaskHandle_t)0x0) {
      vAssertCalled();
    }
    ptVar3 = xTaskGetCurrentTaskHandle();
    xStreamBuffer->xTaskWaitingToReceive = ptVar3;
    vTaskExitCritical();
    xTaskNotifyWait(0,0,(uint32_t *)0x0,xTicksToWait);
    xStreamBuffer->xTaskWaitingToReceive = (TaskHandle_t)0x0;
  }
  uVar4 = xStreamBuffer->xLength;
  xBytesAvailable = (xStreamBuffer->xHead + uVar4) - xStreamBuffer->xTail;
  if (uVar4 <= xBytesAvailable) {
    xBytesAvailable = xBytesAvailable - uVar4;
  }
  if (xBytesAvailable <= xMaxCount) {
    return 0;
  }
LAB_2302f9ce:
  if ((bVar2 & 1) != 0) {
    sVar6 = xStreamBuffer->xTail;
    prvReadBytesFromBuffer
              ((StreamBuffer_t *)xStreamBuffer,(uint8_t *)&uStack36,xMaxCount,xBytesAvailable);
    xBytesAvailable = xBytesAvailable + uVar5 * -4;
    bVar1 = xBufferLengthBytes < uStack36;
    xBufferLengthBytes = uStack36;
    if (bVar1) {
      xStreamBuffer->xTail = sVar6;
      xBufferLengthBytes = 0;
    }
  }
  xBytesAvailable =
       prvReadBytesFromBuffer
                 ((StreamBuffer_t *)xStreamBuffer,(uint8_t *)pvRxData,xBufferLengthBytes,
                  xBytesAvailable);
  if (xBytesAvailable == 0) {
    return 0;
  }
  vTaskSuspendAll();
  if (xStreamBuffer->xTaskWaitingToSend != (TaskHandle_t)0x0) {
    xTaskGenericNotify(xStreamBuffer->xTaskWaitingToSend,0,eNoAction,(uint32_t *)0x0);
    xStreamBuffer->xTaskWaitingToSend = (TaskHandle_t)0x0;
  }
  xTaskResumeAll();
  return xBytesAvailable;
}



// WARNING: Variable defined which should be unmapped: xTempNextMessageLength

size_t xStreamBufferReceiveFromISR
                 (StreamBufferHandle_t xStreamBuffer,void *pvRxData,size_t xBufferLengthBytes,
                 BaseType_t *pxHigherPriorityTaskWoken)

{
  bool bVar1;
  size_t xBytesAvailable;
  uint uVar2;
  uint uVar3;
  uint xMaxCount;
  size_t sVar4;
  uint uStack36;
  size_t xTempNextMessageLength;
  
  if (pvRxData == (void *)0x0) {
    vAssertCalled();
  }
  if (xStreamBuffer == (StreamBufferHandle_t)0x0) {
    vAssertCalled();
  }
  uVar2 = xStreamBuffer->xLength;
  uVar3 = (uint)xStreamBuffer->ucFlags & 1;
  xBytesAvailable = (xStreamBuffer->xHead + uVar2) - xStreamBuffer->xTail;
  xMaxCount = uVar3 * 4;
  if (uVar2 <= xBytesAvailable) {
    xBytesAvailable = xBytesAvailable - uVar2;
  }
  if (xMaxCount < xBytesAvailable) {
    if ((xStreamBuffer->ucFlags & 1) != 0) {
      sVar4 = xStreamBuffer->xTail;
      prvReadBytesFromBuffer
                ((StreamBuffer_t *)xStreamBuffer,(uint8_t *)&uStack36,xMaxCount,xBytesAvailable);
      xBytesAvailable = xBytesAvailable + uVar3 * -4;
      bVar1 = xBufferLengthBytes < uStack36;
      xBufferLengthBytes = uStack36;
      if (bVar1) {
        xStreamBuffer->xTail = sVar4;
        xBufferLengthBytes = 0;
      }
    }
    xBytesAvailable =
         prvReadBytesFromBuffer
                   ((StreamBuffer_t *)xStreamBuffer,(uint8_t *)pvRxData,xBufferLengthBytes,
                    xBytesAvailable);
    if (xBytesAvailable != 0) {
      if (xStreamBuffer->xTaskWaitingToSend == (TaskHandle_t)0x0) {
        return xBytesAvailable;
      }
      xTaskGenericNotifyFromISR
                (xStreamBuffer->xTaskWaitingToSend,0,eNoAction,(uint32_t *)0x0,
                 pxHigherPriorityTaskWoken);
      xStreamBuffer->xTaskWaitingToSend = (TaskHandle_t)0x0;
      return xBytesAvailable;
    }
  }
  return 0;
}



