pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BaseType_t xStreamBufferIsEmpty(StreamBufferHandle_t xStreamBuffer)

{
  if (xStreamBuffer != (StreamBufferHandle_t)0x0) {
    return (uint)(xStreamBuffer->xHead == xStreamBuffer->xTail);
  }
  vAssertCalled();
  return (uint)(_DAT_00000004 == ___EM_SIZE);
}



void prvResetNextTaskUnblockTime(void)

{
  xNextTaskUnblockTime = *(TickType_t *)((int)((pxDelayedTaskList->xListEnd).pxNext)->pvOwner + 4);
  return;
}



void prvInitialiseNewTask
               (TaskFunction_t *pxTaskCode,char *pcName,uint32_t ulStackDepth,void *pvParameters,
               UBaseType_t uxPriority,TaskHandle_t *pxCreatedTask,TCB_t *pxNewTCB)

{
  char cVar1;
  char *pcVar2;
  char *pcVar3;
  StackType_t *pSVar4;
  
  memset(pxNewTCB->pxStack,0xa5,ulStackDepth * 4);
  pSVar4 = pxNewTCB->pxStack;
  if (pcName == (char *)0x0) {
    pxNewTCB->pcTaskName[0] = '\0';
  }
  else {
    pcVar2 = pcName + 0x10;
    pcVar3 = pxNewTCB->pcTaskName;
    do {
      cVar1 = *pcName;
      pcName = pcName + 1;
      *pcVar3 = cVar1;
      if (cVar1 == '\0') break;
      pcVar3 = pcVar3 + 1;
    } while (pcName != pcVar2);
    pxNewTCB->pcTaskName[0xf] = '\0';
  }
  if (0x1f < uxPriority) {
    uxPriority = 0x1f;
  }
  pxNewTCB->uxPriority = uxPriority;
  pxNewTCB->uxBasePriority = uxPriority;
  pxNewTCB->uxMutexesHeld = 0;
  vListInitialiseItem(&pxNewTCB->xStateListItem);
  vListInitialiseItem(&pxNewTCB->xEventListItem);
  pxNewTCB->ulNotifiedValue = 0;
  *(TCB_t **)&(pxNewTCB->xStateListItem).pvOwner = pxNewTCB;
  (pxNewTCB->xEventListItem).xItemValue = 0x20 - uxPriority;
  *(TCB_t **)&(pxNewTCB->xEventListItem).pvOwner = pxNewTCB;
  pxNewTCB->uxCriticalNesting = 0;
  pxNewTCB->ucNotifyState = '\0';
  pSVar4 = (StackType_t *)
           pxPortInitialiseStack
                     ((uint)(pSVar4 + (ulStackDepth - 1)) & 0xfffffff8,pxTaskCode,pvParameters);
  pxNewTCB->pxTopOfStack = pSVar4;
  if (pxCreatedTask != (TaskHandle_t *)0x0) {
    *(TCB_t **)pxCreatedTask = pxNewTCB;
  }
  return;
}



void prvDeleteTCB(TCB_t *pxTCB)

{
  uint8_t uVar1;
  
  uVar1 = pxTCB->ucStaticallyAllocated;
  if (uVar1 == '\0') {
    vPortFree(pxTCB->pxStack);
    vPortFree(pxTCB);
    return;
  }
  if (uVar1 != '\x01') {
    if (uVar1 == '\x02') {
      return;
    }
    vAssertCalled();
    return;
  }
  vPortFree(pxTCB);
  return;
}



void prvAddCurrentTaskToDelayedList(TickType_t xTicksToWait,BaseType_t xCanBlockIndefinitely)

{
  TickType_t TVar1;
  uint uVar2;
  UBaseType_t UVar3;
  
  TVar1 = xTickCount;
  UVar3 = uxListRemove(&pxCurrentTCB->xStateListItem);
  if (UVar3 == 0) {
    uxTopReadyPriority = ~(1 << (pxCurrentTCB->uxPriority & 0x1f)) & uxTopReadyPriority;
  }
  if ((xTicksToWait == 0xffffffff) && (xCanBlockIndefinitely != 0)) {
    vListInsertEnd(&xSuspendedTaskList,&pxCurrentTCB->xStateListItem);
    return;
  }
  uVar2 = xTicksToWait + TVar1;
  (pxCurrentTCB->xStateListItem).xItemValue = uVar2;
  if (TVar1 <= uVar2) {
    vListInsert(pxDelayedTaskList,&pxCurrentTCB->xStateListItem);
    if (uVar2 < xNextTaskUnblockTime) {
      xNextTaskUnblockTime = uVar2;
    }
    return;
  }
  vListInsert(pxOverflowDelayedTaskList,&pxCurrentTCB->xStateListItem);
  return;
}



void vTaskEnterCritical(void)

{
  pxCurrentTCB->uxCriticalNesting = pxCurrentTCB->uxCriticalNesting + 1;
  return;
}



void vTaskExitCritical(void)

{
  pxCurrentTCB->uxCriticalNesting = pxCurrentTCB->uxCriticalNesting - 1;
  return;
}



void prvAddNewTaskToReadyList(TCB_t *pxNewTCB)

{
  uint uVar1;
  List_t *pxList;
  List_t *pLVar2;
  
  if (xSchedulerRunning != 0) {
    vTaskEnterCritical();
  }
  uxCurrentNumberOfTasks = uxCurrentNumberOfTasks + 1;
  if (pxCurrentTCB == (TCB_t *)0x0) {
    if (uxCurrentNumberOfTasks == 1) {
      pxList = pxReadyTasksLists;
      pxCurrentTCB = pxNewTCB;
      do {
        pLVar2 = pxList + 1;
        vListInitialise(pxList);
        pxList = pLVar2;
      } while (pLVar2 != &xDelayedTaskList1);
      vListInitialise(&xDelayedTaskList1);
      vListInitialise(&xDelayedTaskList2);
      vListInitialise(&xPendingReadyList);
      vListInitialise(&xTasksWaitingTermination);
      vListInitialise(&xSuspendedTaskList);
      pxDelayedTaskList = &xDelayedTaskList1;
      pxOverflowDelayedTaskList = &xDelayedTaskList2;
      uVar1 = pxNewTCB->uxPriority;
    }
    else {
      uVar1 = pxNewTCB->uxPriority;
      pxCurrentTCB = pxNewTCB;
    }
  }
  else {
    uVar1 = pxNewTCB->uxPriority;
    if ((xSchedulerRunning == 0) && (pxCurrentTCB->uxPriority <= uVar1)) {
      pxCurrentTCB = pxNewTCB;
    }
  }
  uxTaskNumber = uxTaskNumber + 1;
  uxTopReadyPriority = 1 << (uVar1 & 0x1f) | uxTopReadyPriority;
  pxNewTCB->uxTCBNumber = uxTaskNumber;
  vListInsertEnd(pxReadyTasksLists + uVar1,&pxNewTCB->xStateListItem);
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxCriticalNesting != 0)) {
    vTaskExitCritical();
  }
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxPriority < pxNewTCB->uxPriority)) {
    ecall();
  }
  return;
}


/*
Unable to decompile 'prvIdleTask'
Cause: Exception while decompiling 2302fea6: Decompiler process died

*/


// WARNING: Removing unreachable block (ram,0x2302ff8e)
// WARNING: Removing unreachable block (ram,0x2302ffd4)

TaskHandle_t
xTaskCreateStatic(TaskFunction_t *pxTaskCode,char *pcName,uint32_t ulStackDepth,void *pvParameters,
                 UBaseType_t uxPriority,StackType_t *puxStackBuffer,StaticTask_t *pxTaskBuffer)

{
  TaskHandle_t ptVar1;
  size_t xSize;
  TaskHandle_t xReturn;
  
  ptVar1 = (TaskHandle_t)xSize;
  if (puxStackBuffer == (StackType_t *)0x0) {
    vAssertCalled();
    ptVar1 = (TaskHandle_t)xSize;
  }
  if (pxTaskBuffer == (StaticTask_t *)0x0) {
    vAssertCalled();
    return (TaskHandle_t)0x0;
  }
  xSize = 0;
  if (puxStackBuffer != (StackType_t *)0x0) {
    pxTaskBuffer->uxDummy20 = '\x02';
    *(StackType_t **)&pxTaskBuffer->pxDummy6 = puxStackBuffer;
    xSize = (size_t)ptVar1;
    prvInitialiseNewTask
              (pxTaskCode,pcName,ulStackDepth,pvParameters,uxPriority,(TaskHandle_t *)&xSize,
               (TCB_t *)pxTaskBuffer);
    prvAddNewTaskToReadyList((TCB_t *)pxTaskBuffer);
  }
  return (TaskHandle_t)xSize;
}



BaseType_t
xTaskCreate(TaskFunction_t *pxTaskCode,char *pcName,uint16_t usStackDepth,void *pvParameters,
           UBaseType_t uxPriority,TaskHandle_t *pxCreatedTask)

{
  StackType_t *pv;
  TCB_t *pxNewTCB;
  BaseType_t BVar1;
  undefined2 in_register_00002032;
  
