pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  pv = (StackType_t *)pvPortMalloc(CONCAT22(in_register_00002032,usStackDepth) << 2);
  if (pv == (StackType_t *)0x0) {
    BVar1 = -1;
  }
  else {
    pxNewTCB = (TCB_t *)pvPortMalloc(0x60);
    if (pxNewTCB == (TCB_t *)0x0) {
      vPortFree(pv);
      BVar1 = -1;
    }
    else {
      pxNewTCB->pxStack = pv;
      pxNewTCB->ucStaticallyAllocated = '\0';
      prvInitialiseNewTask
                (pxTaskCode,pcName,CONCAT22(in_register_00002032,usStackDepth),pvParameters,
                 uxPriority,pxCreatedTask,pxNewTCB);
      prvAddNewTaskToReadyList(pxNewTCB);
      BVar1 = 1;
    }
  }
  return BVar1;
}



void vTaskDelete(TaskHandle_t xTaskToDelete)

{
  UBaseType_t UVar1;
  
  if (xSchedulerRunning != 0) {
    vTaskEnterCritical();
  }
  if (xTaskToDelete == (TaskHandle_t)0x0) {
    xTaskToDelete = (TaskHandle_t)pxCurrentTCB;
  }
  UVar1 = uxListRemove(&((TCB_t *)xTaskToDelete)->xStateListItem);
  if ((UVar1 == 0) && (pxReadyTasksLists[((TCB_t *)xTaskToDelete)->uxPriority].uxNumberOfItems == 0)
     ) {
    uxTopReadyPriority = ~(1 << (((TCB_t *)xTaskToDelete)->uxPriority & 0x1f)) & uxTopReadyPriority;
  }
  if ((((TCB_t *)xTaskToDelete)->xEventListItem).pvContainer != (xLIST *)0x0) {
    uxListRemove(&((TCB_t *)xTaskToDelete)->xEventListItem);
  }
  uxTaskNumber = uxTaskNumber + 1;
  if (pxCurrentTCB == (TCB_t *)xTaskToDelete) {
    vListInsertEnd(&xTasksWaitingTermination,&((TCB_t *)xTaskToDelete)->xStateListItem);
    uxDeletedTasksWaitingCleanUp = uxDeletedTasksWaitingCleanUp + 1;
  }
  else {
    uxCurrentNumberOfTasks = uxCurrentNumberOfTasks - 1;
    prvDeleteTCB((TCB_t *)xTaskToDelete);
    if (pxDelayedTaskList->uxNumberOfItems == 0) {
      xNextTaskUnblockTime = 0xffffffff;
    }
    else {
      prvResetNextTaskUnblockTime();
    }
  }
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxCriticalNesting != 0)) {
    vTaskExitCritical();
  }
  if ((xSchedulerRunning != 0) && (pxCurrentTCB == (TCB_t *)xTaskToDelete)) {
    if (uxSchedulerSuspended == 0) {
      ecall();
    }
    else {
      vAssertCalled();
      ecall();
    }
    return;
  }
  return;
}


/*
Unable to decompile 'eTaskGetState'
Cause: Exception while decompiling 23030196: Decompiler process died

*/

/*
Unable to decompile 'vTaskStartScheduler'
Cause: Exception while decompiling 23030264: Decompiler process died

*/


void vTaskSuspendAll(void)

{
  uxSchedulerSuspended = uxSchedulerSuspended + 1;
  return;
}



TickType_t xTaskGetTickCount(void)

{
  return xTickCount;
}



BaseType_t xTaskGetTickCount2(TickType_t *ticks,BaseType_t *overflow)

{
  BaseType_t BVar1;
  
  BVar1 = xNumOfOverflows;
  *ticks = xTickCount;
  *overflow = BVar1;
  return 1;
}



TickType_t xTaskGetTickCountFromISR(void)

{
  return xTickCount;
}



char * pcTaskGetName(TaskHandle_t xTaskToQuery)

{
  if ((xTaskToQuery == (TaskHandle_t)0x0) &&
     (xTaskToQuery = (TaskHandle_t)pxCurrentTCB, pxCurrentTCB == (TCB_t *)0x0)) {
    vAssertCalled();
    return (char *)0x34;
  }
  return ((TCB_t *)xTaskToQuery)->pcTaskName;
}



BaseType_t xTaskIncrementTick(void)

{
  List_t *pLVar1;
  List_t *pLVar2;
  TickType_t TVar3;
  void *pvVar4;
  int iVar5;
  int iVar6;
  uint uVar7;
  uint32_t uStack52;
  uint32_t tmp;
  
  iVar6 = bl_sys_time_sync_state(&uStack52);
  if (iVar6 != 0) {
    if (uxSchedulerSuspended == 0) {
      uVar7 = xTickCount + 1;
      xTickCount = uVar7;
      if (uVar7 == 0) {
        if (pxDelayedTaskList->uxNumberOfItems != 0) {
          vAssertCalled();
        }
        pLVar2 = pxOverflowDelayedTaskList;
        pLVar1 = pxDelayedTaskList;
        pxDelayedTaskList = pxOverflowDelayedTaskList;
        pxOverflowDelayedTaskList = pLVar1;
        xNumOfOverflows = xNumOfOverflows + 1;
        if (pLVar2->uxNumberOfItems == 0) {
          xNextTaskUnblockTime = 0xffffffff;
        }
        else {
          prvResetNextTaskUnblockTime();
        }
      }
      if (uVar7 < xNextTaskUnblockTime) {
        iVar6 = 0;
        TVar3 = xNextTaskUnblockTime;
      }
      else {
        iVar6 = 0;
        while (iVar5 = iVar6, pxDelayedTaskList->uxNumberOfItems != 0) {
          while( true ) {
            pvVar4 = ((pxDelayedTaskList->xListEnd).pxNext)->pvOwner;
            TVar3 = *(uint *)((int)pvVar4 + 4);
            if (uVar7 < *(uint *)((int)pvVar4 + 4)) goto LAB_230304b2;
            uxListRemove((ListItem_t *)((int)pvVar4 + 4));
            if (*(int *)((int)pvVar4 + 0x28) != 0) {
              uxListRemove((ListItem_t *)((int)pvVar4 + 0x18));
            }
            uxTopReadyPriority = 1 << (*(uint *)((int)pvVar4 + 0x2c) & 0x1f) | uxTopReadyPriority;
            vListInsertEnd(pxReadyTasksLists + *(uint *)((int)pvVar4 + 0x2c),
                           (ListItem_t *)((int)pvVar4 + 4));
            if (*(uint *)((int)pvVar4 + 0x2c) < pxCurrentTCB->uxPriority) break;
            iVar6 = 1;
            iVar5 = 1;
            if (pxDelayedTaskList->uxNumberOfItems == 0) goto LAB_23030498;
          }
        }
LAB_23030498:
        xNextTaskUnblockTime = 0xffffffff;
        iVar6 = iVar5;
        TVar3 = xNextTaskUnblockTime;
      }
LAB_230304b2:
      xNextTaskUnblockTime = TVar3;
      if (1 < pxReadyTasksLists[pxCurrentTCB->uxPriority].uxNumberOfItems) {
        iVar6 = 1;
      }
    }
    else {
      iVar6 = 0;
      uxPendedTicks = uxPendedTicks + 1;
    }
    if (xYieldPending != 0) {
      iVar6 = 1;
    }
  }
  return iVar6;
}


/*
Unable to decompile 'xTaskResumeAll'
Cause: Exception while decompiling 230304dc: Decompiler process died

*/


void vTaskDelay(TickType_t xTicksToDelay)

{
  BaseType_t BVar1;
  
  if (xTicksToDelay == 0) {
    ecall();
    return;
  }
  if (uxSchedulerSuspended != 0) {
    vAssertCalled();
  }
  uxSchedulerSuspended = uxSchedulerSuspended + 1;
  prvAddCurrentTaskToDelayedList(xTicksToDelay,0);
  BVar1 = xTaskResumeAll();
  if (BVar1 == 0) {
    ecall();
  }
  return;
}



void vTaskSwitchContext(void)

{
  int iVar1;
  StackType_t *pSVar2;
  xLIST_ITEM *pxVar3;
  
