pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (uxSchedulerSuspended == 0) {
    xYieldPending = 0;
    pSVar2 = pxCurrentTCB->pxStack;
    if ((((*pSVar2 != 0xa5a5a5a5) || (pSVar2[1] != 0xa5a5a5a5)) || (pSVar2[2] != 0xa5a5a5a5)) ||
       (pSVar2[3] != 0xa5a5a5a5)) {
      vApplicationStackOverflowHook((TaskHandle_t)pxCurrentTCB,pxCurrentTCB->pcTaskName);
    }
    iVar1 = __clzsi2(uxTopReadyPriority);
    iVar1 = 0x1f - iVar1;
    if (pxReadyTasksLists[iVar1].uxNumberOfItems == 0) {
      vAssertCalled();
    }
    pxVar3 = (pxReadyTasksLists[iVar1].pxIndex)->pxNext;
    *(xLIST_ITEM **)&pxReadyTasksLists[iVar1].pxIndex = pxVar3;
    if (pxVar3 == (xLIST_ITEM *)(iVar1 * 0x14 + 0x42012544)) {
      pxVar3 = pxVar3->pxNext;
      *(xLIST_ITEM **)&pxReadyTasksLists[iVar1].pxIndex = pxVar3;
    }
    pxCurrentTCB = (TCB_t *)pxVar3->pvOwner;
    return;
  }
  xYieldPending = 1;
  return;
}



void vTaskPlaceOnEventList(List_t *pxEventList,TickType_t xTicksToWait)

{
  if (pxEventList == (List_t *)0x0) {
    vAssertCalled();
  }
  vListInsert(pxEventList,&pxCurrentTCB->xEventListItem);
  prvAddCurrentTaskToDelayedList(xTicksToWait,1);
  return;
}



void vTaskPlaceOnUnorderedEventList
               (List_t *pxEventList,TickType_t xItemValue,TickType_t xTicksToWait)

{
  ListItem_t *pxNewListItem;
  
  if (pxEventList == (List_t *)0x0) {
    vAssertCalled();
  }
  if (uxSchedulerSuspended == 0) {
    vAssertCalled();
  }
  pxNewListItem = &pxCurrentTCB->xEventListItem;
  (pxCurrentTCB->xEventListItem).xItemValue = xItemValue | 0x80000000;
  vListInsertEnd(pxEventList,pxNewListItem);
  prvAddCurrentTaskToDelayedList(xTicksToWait,1);
  return;
}



void vTaskPlaceOnEventListRestricted
               (List_t *pxEventList,TickType_t xTicksToWait,BaseType_t xWaitIndefinitely)

{
  if (pxEventList == (List_t *)0x0) {
    vAssertCalled();
  }
  vListInsertEnd(pxEventList,&pxCurrentTCB->xEventListItem);
  if (xWaitIndefinitely != 0) {
    xTicksToWait = 0xffffffff;
  }
  prvAddCurrentTaskToDelayedList(xTicksToWait,xWaitIndefinitely);
  return;
}



BaseType_t xTaskRemoveFromEventList(List_t *pxEventList)

{
  bool bVar1;
  void *pvVar2;
  
  pvVar2 = ((pxEventList->xListEnd).pxNext)->pvOwner;
  if (pvVar2 == (void *)0x0) {
    vAssertCalled();
  }
  uxListRemove((ListItem_t *)((int)pvVar2 + 0x18));
  if (uxSchedulerSuspended == 0) {
    uxListRemove((ListItem_t *)((int)pvVar2 + 4));
    uxTopReadyPriority = 1 << (*(uint *)((int)pvVar2 + 0x2c) & 0x1f) | uxTopReadyPriority;
    vListInsertEnd(pxReadyTasksLists + *(uint *)((int)pvVar2 + 0x2c),(ListItem_t *)((int)pvVar2 + 4)
                  );
  }
  else {
    vListInsertEnd(&xPendingReadyList,(ListItem_t *)((int)pvVar2 + 0x18));
  }
  bVar1 = pxCurrentTCB->uxPriority < *(uint *)((int)pvVar2 + 0x2c);
  if (bVar1) {
    xYieldPending = 1;
  }
  return (uint)bVar1;
}



void vTaskRemoveFromUnorderedEventList(ListItem_t *pxEventListItem,TickType_t xItemValue)

{
  void *pvVar1;
  
  if (uxSchedulerSuspended == 0) {
    vAssertCalled();
    pvVar1 = pxEventListItem->pvOwner;
    pxEventListItem->xItemValue = xItemValue | 0x80000000;
  }
  else {
    pvVar1 = pxEventListItem->pvOwner;
    pxEventListItem->xItemValue = xItemValue | 0x80000000;
  }
  if (pvVar1 == (void *)0x0) {
    vAssertCalled();
  }
  uxListRemove(pxEventListItem);
  uxListRemove((ListItem_t *)((int)pvVar1 + 4));
  uxTopReadyPriority = 1 << (*(uint *)((int)pvVar1 + 0x2c) & 0x1f) | uxTopReadyPriority;
  vListInsertEnd(pxReadyTasksLists + *(uint *)((int)pvVar1 + 0x2c),(ListItem_t *)((int)pvVar1 + 4));
  if (pxCurrentTCB->uxPriority < *(uint *)((int)pvVar1 + 0x2c)) {
    xYieldPending = 1;
  }
  return;
}


/*
Unable to decompile 'vTaskSetTimeOutState'
Cause: Exception while decompiling 23030936: Decompiler process died

*/


void vTaskInternalSetTimeOutState(TimeOut_t *pxTimeOut)

{
  TickType_t TVar1;
  
  TVar1 = xTickCount;
  pxTimeOut->xOverflowCount = xNumOfOverflows;
  pxTimeOut->xTimeOnEntering = TVar1;
  return;
}


/*
Unable to decompile 'xTaskCheckForTimeOut'
Cause: Exception while decompiling 230309ac: Decompiler process died

*/


void vTaskMissedYield(void)

{
  xYieldPending = 1;
  return;
}



void vTaskGetInfo(TaskHandle_t xTask,TaskStatus_t *pxTaskStatus,BaseType_t xGetFreeStackSpace,
                 eTaskState eState)

{
  eTaskState eVar1;
  undefined3 in_register_00002035;
  UBaseType_t UVar2;
  uint uVar3;
  
  if (xTask == (TaskHandle_t)0x0) {
    xTask = (TaskHandle_t)pxCurrentTCB;
  }
  pxTaskStatus->pcTaskName = xTask->pcTaskName;
  pxTaskStatus->xHandle = xTask;
  pxTaskStatus->uxCurrentPriority = xTask->uxPriority;
  pxTaskStatus->pxStackBase = xTask->pxStack;
  pxTaskStatus->xTaskNumber = xTask->uxTCBNumber;
  UVar2 = xTask->uxBasePriority;
  pxTaskStatus->ulRunTimeCounter = 0;
  pxTaskStatus->uxBasePriority = UVar2;
  if (CONCAT31(in_register_00002035,eState) == 5) {
    eVar1 = eTaskGetState(xTask);
    pxTaskStatus->eCurrentState = eVar1;
  }
  else {
    if (pxCurrentTCB == (TCB_t *)xTask) {
      pxTaskStatus->eCurrentState = eRunning;
    }
    else {
      pxTaskStatus->eCurrentState = eState;
      if (CONCAT31(in_register_00002035,eState) == 3) {
        uxSchedulerSuspended = uxSchedulerSuspended + 1;
        if ((xTask->xEventListItem).pvContainer != (xLIST *)0x0) {
          pxTaskStatus->eCurrentState = eBlocked;
        }
        xTaskResumeAll();
      }
    }
  }
  if (xGetFreeStackSpace != 0) {
    if (*(char *)xTask->pxStack == -0x5b) {
      uVar3 = 0;
      do {
        uVar3 = uVar3 + 1;
      } while (*(char *)((int)xTask->pxStack + uVar3) == -0x5b);
      pxTaskStatus->usStackHighWaterMark = (uint16_t)(uVar3 >> 2);
    }
    else {
      pxTaskStatus->usStackHighWaterMark = 0;
    }
    return;
  }
  pxTaskStatus->usStackHighWaterMark = 0;
  return;
}



UBaseType_t
prvListTasksWithinSingleList(TaskStatus_t *pxTaskStatusArray,List_t *pxList,eTaskState eState)

{
  TaskHandle_t xTask;
  xLIST_ITEM *pxVar1;
  int iVar2;
  TaskHandle_t ptVar3;
  
  pxVar1 = pxList->pxIndex->pxNext;
  *(xLIST_ITEM **)&pxList->pxIndex = pxVar1;
  if (pxVar1 == (xLIST_ITEM *)&pxList->xListEnd) {
    pxVar1 = (pxList->xListEnd).pxNext;
    *(xLIST_ITEM **)&pxList->pxIndex = pxVar1;
  }
  ptVar3 = (TaskHandle_t)pxVar1->pvOwner;
  iVar2 = 0;
  while( true ) {
    pxVar1 = pxVar1->pxNext;
    *(xLIST_ITEM **)&pxList->pxIndex = pxVar1;
    if ((xLIST_ITEM *)&pxList->xListEnd == pxVar1) {
      pxVar1 = (pxList->xListEnd).pxNext;
      *(xLIST_ITEM **)&pxList->pxIndex = pxVar1;
      xTask = (TaskHandle_t)pxVar1->pvOwner;
      vTaskGetInfo(xTask,pxTaskStatusArray,1,eState);
    }
    else {
      xTask = (TaskHandle_t)pxVar1->pvOwner;
      vTaskGetInfo(xTask,pxTaskStatusArray,1,eState);
    }
    if (ptVar3 == xTask) break;
    iVar2 = iVar2 + 1;
    pxTaskStatusArray = pxTaskStatusArray + 1;
    pxVar1 = (xLIST_ITEM *)pxList->pxIndex;
  }
  return iVar2 + 1;
}



UBaseType_t
uxTaskGetSystemState
          (TaskStatus_t *pxTaskStatusArray,UBaseType_t uxArraySize,uint32_t *pulTotalRunTime)

{
  int iVar1;
  UBaseType_t UVar2;
  int iVar3;
  TaskStatus_t *pxTaskStatusArray_00;
  UBaseType_t UVar4;
  List_t *pxList;
  
  uxSchedulerSuspended = uxSchedulerSuspended + 1;
  UVar4 = 0;
  if (uxCurrentNumberOfTasks <= uxArraySize) {
    pxList = pxReadyTasksLists + 0x1f;
    iVar1 = 0x20;
    UVar4 = 0;
    iVar3 = 0;
    do {
      iVar1 = iVar1 + -1;
      pxTaskStatusArray_00 = (TaskStatus_t *)(&pxTaskStatusArray->xHandle + iVar3 + UVar4);
      if (pxReadyTasksLists[iVar1].uxNumberOfItems != 0) {
        UVar2 = prvListTasksWithinSingleList(pxTaskStatusArray_00,pxList,eReady);
        UVar4 = UVar4 + UVar2;
        iVar3 = UVar4 * 8;
        pxTaskStatusArray_00 = pxTaskStatusArray + UVar4;
      }
      pxList = pxList + -1;
    } while (iVar1 != 0);
    if (pxDelayedTaskList->uxNumberOfItems != 0) {
      UVar2 = prvListTasksWithinSingleList(pxTaskStatusArray_00,pxDelayedTaskList,eBlocked);
      UVar4 = UVar4 + UVar2;
      pxTaskStatusArray_00 = pxTaskStatusArray + UVar4;
    }
    if (pxOverflowDelayedTaskList->uxNumberOfItems != 0) {
      UVar2 = prvListTasksWithinSingleList(pxTaskStatusArray_00,pxOverflowDelayedTaskList,eBlocked);
      UVar4 = UVar4 + UVar2;
      pxTaskStatusArray_00 = pxTaskStatusArray + UVar4;
    }
    if (xTasksWaitingTermination.uxNumberOfItems != 0) {
      UVar2 = prvListTasksWithinSingleList(pxTaskStatusArray_00,&xTasksWaitingTermination,eDeleted);
      UVar4 = UVar4 + UVar2;
      pxTaskStatusArray_00 = pxTaskStatusArray + UVar4;
    }
    if (xSuspendedTaskList.uxNumberOfItems != 0) {
      UVar2 = prvListTasksWithinSingleList(pxTaskStatusArray_00,&xSuspendedTaskList,eSuspended);
      UVar4 = UVar4 + UVar2;
    }
    if (pulTotalRunTime != (uint32_t *)0x0) {
      *pulTotalRunTime = 0;
    }
  }
  xTaskResumeAll();
  return UVar4;
}



UBaseType_t uxTaskGetStackHighWaterMark(TaskHandle_t xTask)

{
  char cVar1;
  uint uVar2;
  StackType_t *pSVar3;
  
  if (xTask == (TaskHandle_t)0x0) {
    pSVar3 = pxCurrentTCB->pxStack;
    cVar1 = *(char *)pSVar3;
  }
  else {
    pSVar3 = xTask->pxStack;
    cVar1 = *(char *)pSVar3;
  }
  if (cVar1 == -0x5b) {
    uVar2 = 0;
    do {
      uVar2 = uVar2 + 1;
    } while (*(char *)((int)pSVar3 + uVar2) == -0x5b);
    return uVar2 >> 2 & 0xffff;
  }
  return 0;
}



TaskHandle_t xTaskGetCurrentTaskHandle(void)

{
  return (TaskHandle_t)pxCurrentTCB;
}



