pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
BaseType_t xTaskGetSchedulerState(void)

{
  BaseType_t BVar1;
  
  BVar1 = 1;
  if (xSchedulerRunning != 0) {
    BVar1 = (uint)(uxSchedulerSuspended == 0) << 1;
  }
  return BVar1;
}



BaseType_t xTaskPriorityInherit(TaskHandle_t pxMutexHolder)

{
  UBaseType_t UVar1;
  uint uVar2;
  
  if (pxMutexHolder == (TaskHandle_t)0x0) {
    return 0;
  }
  uVar2 = pxMutexHolder->uxPriority;
  if (uVar2 < pxCurrentTCB->uxPriority) {
    if (-1 < (int)(pxMutexHolder->xEventListItem).xItemValue) {
      (pxMutexHolder->xEventListItem).xItemValue = 0x20 - pxCurrentTCB->uxPriority;
    }
    if ((List_t *)(pxMutexHolder->xStateListItem).pvContainer != pxReadyTasksLists + uVar2) {
      pxMutexHolder->uxPriority = pxCurrentTCB->uxPriority;
      return 1;
    }
    UVar1 = uxListRemove(&pxMutexHolder->xStateListItem);
    if ((UVar1 == 0) && (pxReadyTasksLists[pxMutexHolder->uxPriority].uxNumberOfItems == 0)) {
      uxTopReadyPriority = ~(1 << (pxMutexHolder->uxPriority & 0x1f)) & uxTopReadyPriority;
    }
    uVar2 = pxCurrentTCB->uxPriority;
    uxTopReadyPriority = 1 << (uVar2 & 0x1f) | uxTopReadyPriority;
    pxMutexHolder->uxPriority = uVar2;
    vListInsertEnd(pxReadyTasksLists + uVar2,&pxMutexHolder->xStateListItem);
    uVar2 = 1;
  }
  else {
    uVar2 = (uint)(pxMutexHolder->uxBasePriority < pxCurrentTCB->uxPriority);
  }
  return uVar2;
}



BaseType_t xTaskPriorityDisinherit(TaskHandle_t pxMutexHolder)

{
  uint uVar1;
  UBaseType_t UVar2;
  
  if (pxMutexHolder == (TaskHandle_t)0x0) {
    return 0;
  }
  if (pxCurrentTCB != (TCB_t *)pxMutexHolder) {
    vAssertCalled();
  }
  if (pxMutexHolder->uxMutexesHeld == 0) {
    vAssertCalled();
    UVar2 = pxMutexHolder->uxMutexesHeld - 1;
    pxMutexHolder->uxMutexesHeld = UVar2;
    if (pxMutexHolder->uxPriority == pxMutexHolder->uxBasePriority) {
      return 0;
    }
  }
  else {
    UVar2 = pxMutexHolder->uxMutexesHeld - 1;
    pxMutexHolder->uxMutexesHeld = UVar2;
    if (pxMutexHolder->uxPriority == pxMutexHolder->uxBasePriority) {
      return 0;
    }
  }
  if (UVar2 != 0) {
    return 0;
  }
  UVar2 = uxListRemove(&pxMutexHolder->xStateListItem);
  if ((UVar2 == 0) && (pxReadyTasksLists[pxMutexHolder->uxPriority].uxNumberOfItems == 0)) {
    uxTopReadyPriority = ~(1 << (pxMutexHolder->uxPriority & 0x1f)) & uxTopReadyPriority;
  }
  uVar1 = pxMutexHolder->uxBasePriority;
  uxTopReadyPriority = 1 << (uVar1 & 0x1f) | uxTopReadyPriority;
  pxMutexHolder->uxPriority = uVar1;
  (pxMutexHolder->xEventListItem).xItemValue = 0x20 - uVar1;
  vListInsertEnd(pxReadyTasksLists + uVar1,&pxMutexHolder->xStateListItem);
  return 1;
}



void vTaskPriorityDisinheritAfterTimeout
               (TaskHandle_t pxMutexHolder,UBaseType_t uxHighestPriorityWaitingTask)

{
  UBaseType_t UVar1;
  TickType_t TVar2;
  uint uVar3;
  int iVar4;
  uint uVar5;
  
  if (pxMutexHolder == (TaskHandle_t)0x0) {
    return;
  }
  if (pxMutexHolder->uxMutexesHeld == 0) {
    vAssertCalled();
    uVar5 = pxMutexHolder->uxBasePriority;
  }
  else {
    uVar5 = pxMutexHolder->uxBasePriority;
  }
  if (uVar5 < uxHighestPriorityWaitingTask) {
    uVar3 = pxMutexHolder->uxPriority;
    if (uVar3 == uxHighestPriorityWaitingTask) {
      return;
    }
  }
  else {
    uVar3 = pxMutexHolder->uxPriority;
    uxHighestPriorityWaitingTask = uVar5;
    if (uVar3 == uVar5) {
      return;
    }
  }
  if (pxMutexHolder->uxMutexesHeld == 1) {
    if (pxCurrentTCB == (TCB_t *)pxMutexHolder) {
      vAssertCalled();
      uVar3 = pxMutexHolder->uxPriority;
    }
    TVar2 = (pxMutexHolder->xEventListItem).xItemValue;
    pxMutexHolder->uxPriority = uxHighestPriorityWaitingTask;
    if (-1 < (int)TVar2) {
      (pxMutexHolder->xEventListItem).xItemValue = 0x20 - uxHighestPriorityWaitingTask;
    }
    if ((List_t *)(pxMutexHolder->xStateListItem).pvContainer == pxReadyTasksLists + uVar3) {
      UVar1 = uxListRemove(&pxMutexHolder->xStateListItem);
      if (UVar1 == 0) {
        uVar5 = pxMutexHolder->uxPriority;
        iVar4 = uVar5 * 4;
        uVar3 = 1 << (uVar5 & 0x1f);
        if (pxReadyTasksLists[uVar5].uxNumberOfItems == 0) {
          uxTopReadyPriority = ~uVar3 & uxTopReadyPriority;
        }
      }
      else {
        uVar5 = pxMutexHolder->uxPriority;
        uVar3 = 1 << (uVar5 & 0x1f);
        iVar4 = uVar5 << 2;
      }
      uxTopReadyPriority = uVar3 | uxTopReadyPriority;
      vListInsertEnd((List_t *)(&pxReadyTasksLists[0].uxNumberOfItems + iVar4 + uVar5),
                     &pxMutexHolder->xStateListItem);
      return;
    }
  }
  return;
}



void vTaskEnterCritical(void)

{
  if (xSchedulerRunning == 0) {
    return;
  }
  vTaskEnterCritical();
  return;
}



void vTaskExitCritical(void)

{
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxCriticalNesting != 0)) {
    vTaskExitCritical();
    return;
  }
  return;
}



void vTaskList(char *pcWriteBuffer)

{
  TaskStatus_t *pTVar1;
  TaskStatus_t *pxTaskStatusArray;
  UBaseType_t uxArraySize;
  size_t sVar2;
  char *pcVar3;
  uint uVar4;
  
  uxArraySize = uxCurrentNumberOfTasks;
  *pcWriteBuffer = '\0';
  pxTaskStatusArray = (TaskStatus_t *)pvPortMalloc(uxArraySize * 0x24);
  if (pxTaskStatusArray != (TaskStatus_t *)0x0) {
    uxArraySize = uxTaskGetSystemState(pxTaskStatusArray,uxArraySize,(uint32_t *)0x0);
    if (uxArraySize != 0) {
      pTVar1 = pxTaskStatusArray;
      do {
        uVar4 = 0;
        if (pTVar1->eCurrentState < eInvalid) {
          uVar4 = (uint)(byte)"XRBSD"[pTVar1->eCurrentState];
        }
        strcpy(pcWriteBuffer,pTVar1->pcTaskName);
        sVar2 = strlen(pcWriteBuffer);
        if (sVar2 < 0xf) {
          pcVar3 = pcWriteBuffer + sVar2;
          do {
            *pcVar3 = ' ';
            pcVar3 = pcVar3 + 1;
          } while (pcWriteBuffer + 0xf != pcVar3);
          sVar2 = 0xf;
        }
        pcWriteBuffer = pcWriteBuffer + sVar2;
        *pcWriteBuffer = '\0';
        sprintf(pcWriteBuffer,"\t%c\t%u\t%u\t%u\t%p\r\n",uVar4,pTVar1->uxCurrentPriority,
                (uint)pTVar1->usStackHighWaterMark,pTVar1->xTaskNumber,pTVar1->pxStackBase);
        sVar2 = strlen(pcWriteBuffer);
        pTVar1 = pTVar1 + 1;
        pcWriteBuffer = pcWriteBuffer + sVar2;
      } while (pTVar1 != pxTaskStatusArray + uxArraySize);
    }
    vPortFree(pxTaskStatusArray);
    return;
  }
  return;
}



TickType_t uxTaskResetEventItemValue(void)

{
  TickType_t TVar1;
  
  TVar1 = (pxCurrentTCB->xEventListItem).xItemValue;
  (pxCurrentTCB->xEventListItem).xItemValue = 0x20 - pxCurrentTCB->uxPriority;
  return TVar1;
}



