pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
TaskHandle_t pvTaskIncrementMutexHeldCount(void)

{
  if (pxCurrentTCB != (TCB_t *)0x0) {
    pxCurrentTCB->uxMutexesHeld = pxCurrentTCB->uxMutexesHeld + 1;
  }
  return (TaskHandle_t)pxCurrentTCB;
}


/*
Unable to decompile 'ulTaskNotifyTake'
Cause: Exception while decompiling 2303116c: Decompiler process died

*/

/*
Unable to decompile 'xTaskNotifyWait'
Cause: Exception while decompiling 23031212: Decompiler process died

*/

/*
Unable to decompile 'xTaskGenericNotify'
Cause: 
Low-level Error: Assignment to constant at r0x2303130c
*/


BaseType_t
xTaskGenericNotifyFromISR
          (TaskHandle_t xTaskToNotify,uint32_t ulValue,eNotifyAction eAction,
          uint32_t *pulPreviousNotificationValue,BaseType_t *pxHigherPriorityTaskWoken)

{
  uint8_t uVar1;
  undefined3 in_register_00002031;
  
  if (xTaskToNotify == (TaskHandle_t)0x0) {
    vAssertCalled();
  }
  if (pulPreviousNotificationValue != (uint32_t *)0x0) {
    *pulPreviousNotificationValue = xTaskToNotify->ulNotifiedValue;
  }
  uVar1 = xTaskToNotify->ucNotifyState;
  xTaskToNotify->ucNotifyState = '\x02';
  switch(CONCAT31(in_register_00002031,eAction)) {
  case 0:
    break;
  case 1:
    xTaskToNotify->ulNotifiedValue = ulValue | xTaskToNotify->ulNotifiedValue;
    break;
  case 2:
    xTaskToNotify->ulNotifiedValue = xTaskToNotify->ulNotifiedValue + 1;
    break;
  case 4:
    if (uVar1 == '\x02') {
      return 0;
    }
  case 3:
    xTaskToNotify->ulNotifiedValue = ulValue;
    break;
  default:
    if (xTaskToNotify->ulNotifiedValue != 0xffffffff) {
      vAssertCalled();
    }
  }
  if (uVar1 == '\x01') {
    if ((xTaskToNotify->xEventListItem).pvContainer != (xLIST *)0x0) {
      vAssertCalled();
    }
    if (uxSchedulerSuspended == 0) {
      uxListRemove(&xTaskToNotify->xStateListItem);
      uxTopReadyPriority = 1 << (xTaskToNotify->uxPriority & 0x1f) | uxTopReadyPriority;
      vListInsertEnd(pxReadyTasksLists + xTaskToNotify->uxPriority,&xTaskToNotify->xStateListItem);
    }
    else {
      vListInsertEnd(&xPendingReadyList,&xTaskToNotify->xEventListItem);
    }
    if (pxCurrentTCB->uxPriority < xTaskToNotify->uxPriority) {
      if (pxHigherPriorityTaskWoken != (BaseType_t *)0x0) {
        *pxHigherPriorityTaskWoken = 1;
      }
      xYieldPending = 1;
    }
  }
  return 1;
}



void vTaskNotifyGiveFromISR(TaskHandle_t xTaskToNotify,BaseType_t *pxHigherPriorityTaskWoken)

{
  uint8_t uVar1;
  
  if (xTaskToNotify == (TaskHandle_t)0x0) {
    vAssertCalled();
  }
  uVar1 = xTaskToNotify->ucNotifyState;
  xTaskToNotify->ucNotifyState = '\x02';
  xTaskToNotify->ulNotifiedValue = xTaskToNotify->ulNotifiedValue + 1;
  if (uVar1 == '\x01') {
    if ((xTaskToNotify->xEventListItem).pvContainer != (xLIST *)0x0) {
      vAssertCalled();
    }
    if (uxSchedulerSuspended == 0) {
      uxListRemove(&xTaskToNotify->xStateListItem);
      uxTopReadyPriority = 1 << (xTaskToNotify->uxPriority & 0x1f) | uxTopReadyPriority;
      vListInsertEnd(pxReadyTasksLists + xTaskToNotify->uxPriority,&xTaskToNotify->xStateListItem);
    }
    else {
      vListInsertEnd(&xPendingReadyList,&xTaskToNotify->xEventListItem);
    }
    if (pxCurrentTCB->uxPriority < xTaskToNotify->uxPriority) {
      if (pxHigherPriorityTaskWoken != (BaseType_t *)0x0) {
        *pxHigherPriorityTaskWoken = 1;
      }
      xYieldPending = 1;
      return;
    }
  }
  return;
}



BaseType_t xTaskNotifyStateClear(TaskHandle_t xTask)

{
  bool bVar1;
  
  if (xTask == (TaskHandle_t)0x0) {
    xTask = (TaskHandle_t)pxCurrentTCB;
  }
  if (xSchedulerRunning != 0) {
    vTaskEnterCritical();
  }
  bVar1 = ((TCB_t *)xTask)->ucNotifyState == '\x02';
  if (bVar1) {
    ((TCB_t *)xTask)->ucNotifyState = '\0';
  }
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxCriticalNesting != 0)) {
    vTaskExitCritical();
  }
  return (uint)bVar1;
}



void prvCheckForValidListAndQueue(void)

{
  uint8_t ucStaticTimerQueueStorage [64];
  StaticQueue_t xStaticTimerQueue;
  
  vTaskEnterCritical();
  if (xTimerQueue == (QueueHandle_t)0x0) {
    vListInitialise(&xActiveTimerList1);
    vListInitialise(&xActiveTimerList2);
    pxCurrentTimerList = &xActiveTimerList1;
    pxOverflowTimerList = &xActiveTimerList2;
    xTimerQueue = xQueueGenericCreateStatic
                            (4,0x10,ucStaticTimerQueueStorage,&xStaticTimerQueue,'\0');
    if (xTimerQueue != (QueueHandle_t)0x0) {
      vQueueAddToRegistry(xTimerQueue,"TmrQ");
    }
  }
  vTaskExitCritical();
  return;
}



BaseType_t
prvInsertTimerInActiveList
          (Timer_t *pxTimer,TickType_t xNextExpiryTime,TickType_t xTimeNow,TickType_t xCommandTime)

{
  (pxTimer->xTimerListItem).xItemValue = xNextExpiryTime;
  *(Timer_t **)&(pxTimer->xTimerListItem).pvOwner = pxTimer;
  if (xTimeNow < xNextExpiryTime) {
    if ((xCommandTime <= xTimeNow) || (xNextExpiryTime < xCommandTime)) {
      vListInsert(pxCurrentTimerList,&pxTimer->xTimerListItem);
      return 0;
    }
  }
  else {
    if (xTimeNow - xCommandTime < pxTimer->xTimerPeriodInTicks) {
      vListInsert(pxOverflowTimerList,&pxTimer->xTimerListItem);
      return 0;
    }
  }
  return 1;
}



BaseType_t xTimerCreateTimerTask(void)

{
  StaticTask_t *pSStack28;
  StaticTask_t *pxTimerTaskTCBBuffer;
  StackType_t *pxTimerTaskStackBuffer;
  uint32_t ulTimerTaskStackSize;
  
  prvCheckForValidListAndQueue();
  if (xTimerQueue != (QueueHandle_t)0x0) {
    pSStack28 = (StaticTask_t *)0x0;
    pxTimerTaskTCBBuffer = (StaticTask_t *)0x0;
    vApplicationGetTimerTaskMemory
              (&pSStack28,(StackType_t **)&pxTimerTaskTCBBuffer,(uint32_t *)&pxTimerTaskStackBuffer)
    ;
    xTimerTaskHandle =
         xTaskCreateStatic(prvTimerTask,"Tmr Svc",(uint32_t)pxTimerTaskStackBuffer,(void *)0x0,0x1f,
                           (StackType_t *)pxTimerTaskTCBBuffer,pSStack28);
    if (xTimerTaskHandle != (TaskHandle_t)0x0) {
      return 1;
    }
  }
  vAssertCalled();
  return 0;
}



// WARNING: Removing unreachable block (ram,0x230317ba)

