pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
TimerHandle_t
xTimerCreateStatic(char *pcTimerName,TickType_t xTimerPeriodInTicks,UBaseType_t uxAutoReload,
                  void *pvTimerID,TimerCallbackFunction_t *pxCallbackFunction,
                  StaticTimer_t *pxTimerBuffer)

{
  size_t xSize;
  
  if (pxTimerBuffer == (StaticTimer_t *)0x0) {
    vAssertCalled(0x2c);
  }
  else {
    pxTimerBuffer->ucDummy8 = '\x02';
    if (xTimerPeriodInTicks == 0) {
      vAssertCalled();
    }
    prvCheckForValidListAndQueue();
    *(char **)&pxTimerBuffer->pvDummy1 = pcTimerName;
    pxTimerBuffer->xDummy3 = xTimerPeriodInTicks;
    pxTimerBuffer->pvDummy5 = pvTimerID;
    *(TimerCallbackFunction_t **)&pxTimerBuffer->pvDummy6 = pxCallbackFunction;
    vListInitialiseItem((ListItem_t *)&pxTimerBuffer->xDummy2);
    if (uxAutoReload != 0) {
      pxTimerBuffer->ucDummy8 = pxTimerBuffer->ucDummy8 | 4;
    }
  }
  return (TimerHandle_t)pxTimerBuffer;
}



// WARNING: Could not reconcile some variable overlaps

BaseType_t
xTimerGenericCommand
          (TimerHandle_t xTimer,BaseType_t xCommandID,TickType_t xOptionalValue,
          BaseType_t *pxHigherPriorityTaskWoken,TickType_t xTicksToWait)

{
  BaseType_t BVar1;
  BaseType_t BStack48;
  DaemonTaskMessage_t xMessage;
  
  if (xTimer == (TimerHandle_t)0x0) {
    vAssertCalled();
  }
  BVar1 = 0;
  if (xTimerQueue != (QueueHandle_t)0x0) {
    BStack48 = xCommandID;
    xMessage.xMessageID = xOptionalValue;
    xMessage.u._0_4_ = xTimer;
    if (5 < xCommandID) {
      BVar1 = xQueueGenericSendFromISR(xTimerQueue,&BStack48,pxHigherPriorityTaskWoken,0);
      return BVar1;
    }
    BVar1 = xTaskGetSchedulerState();
    if (BVar1 == 2) {
      BVar1 = xQueueGenericSend(xTimerQueue,&BStack48,xTicksToWait,0);
      return BVar1;
    }
    BVar1 = xQueueGenericSend(xTimerQueue,&BStack48,0,0);
  }
  return BVar1;
}



void prvSwitchTimerLists(void)

{
  List_t *pxList;
  TimerHandle_t xTimer;
  BaseType_t BVar1;
  xLIST_ITEM *pxVar2;
  uint uVar3;
  uint xOptionalValue;
  
  while (pxList = pxCurrentTimerList, pxCurrentTimerList->uxNumberOfItems != 0) {
    pxVar2 = (pxCurrentTimerList->xListEnd).pxNext;
    xTimer = (TimerHandle_t)pxVar2->pvOwner;
    xOptionalValue = pxVar2->xItemValue;
    uxListRemove(&xTimer->xTimerListItem);
    (*xTimer->pxCallbackFunction)(xTimer);
    pxList = pxCurrentTimerList;
    if ((xTimer->ucStatus & 4) != 0) {
      uVar3 = xTimer->xTimerPeriodInTicks + xOptionalValue;
      if (xOptionalValue < uVar3) {
        (xTimer->xTimerListItem).xItemValue = uVar3;
        *(TimerHandle_t *)&(xTimer->xTimerListItem).pvOwner = xTimer;
        vListInsert(pxList,&xTimer->xTimerListItem);
      }
      else {
        BVar1 = xTimerGenericCommand(xTimer,0,xOptionalValue,(BaseType_t *)0x0,0);
        if (BVar1 == 0) {
          vAssertCalled();
        }
      }
    }
  }
  pxCurrentTimerList = pxOverflowTimerList;
  pxOverflowTimerList = pxList;
  return;
}



// WARNING: Could not reconcile some variable overlaps

void prvTimerTask(void *pvParameters)

{
  uint xTimeNow;
  BaseType_t BVar1;
  TickType_t xTimeNow_00;
  TickType_t TVar2;
  uint xWaitIndefinitely;
  UBaseType_t xCommandTime;
  Timer_t *pxTimer;
  uint uStack64;
  DaemonTaskMessage_t xMessage;
  
  do {
    xCommandTime = pxCurrentTimerList->uxNumberOfItems;
    if (xCommandTime == 0) {
      vTaskSuspendAll(pvParameters);
      xTimeNow = xTaskGetTickCount();
      if (xTimeNow < xLastTime_2297) goto LAB_23031aa2;
      xWaitIndefinitely = (uint)(pxOverflowTimerList->uxNumberOfItems == 0);
LAB_2303199c:
      xLastTime_2297 = xTimeNow;
      vQueueWaitForMessageRestricted(xTimerQueue,xCommandTime - xTimeNow,xWaitIndefinitely);
      BVar1 = xTaskResumeAll();
      if (BVar1 == 0) {
        ecall();
      }
    }
    else {
      xCommandTime = ((pxCurrentTimerList->xListEnd).pxNext)->xItemValue;
      vTaskSuspendAll(pvParameters);
      xTimeNow = xTaskGetTickCount();
      if (xTimeNow < xLastTime_2297) {
LAB_23031aa2:
        prvSwitchTimerLists();
        xLastTime_2297 = xTimeNow;
        xTaskResumeAll();
      }
      else {
        xWaitIndefinitely = 0;
        if (xTimeNow < xCommandTime) goto LAB_2303199c;
        xLastTime_2297 = xTimeNow;
        xTaskResumeAll();
        pxTimer = (Timer_t *)((pxCurrentTimerList->xListEnd).pxNext)->pvOwner;
        uxListRemove(&pxTimer->xTimerListItem);
        if ((pxTimer->ucStatus & 4) == 0) {
          pxTimer->ucStatus = pxTimer->ucStatus & 0xfe;
        }
        else {
          BVar1 = prvInsertTimerInActiveList
                            (pxTimer,pxTimer->xTimerPeriodInTicks + xCommandTime,xTimeNow,
                             xCommandTime);
          if ((BVar1 != 0) &&
             (BVar1 = xTimerGenericCommand
                                ((TimerHandle_t)pxTimer,0,xCommandTime,(BaseType_t *)0x0,0),
             BVar1 == 0)) {
            vAssertCalled();
          }
        }
        (*pxTimer->pxCallbackFunction)((TimerHandle_t)pxTimer);
      }
    }
    while (pvParameters = (void *)xQueueReceive(xTimerQueue,&uStack64,0),
          pvParameters != (void *)0x0) {
      if ((-1 < (int)uStack64) ||
         ((*(code *)xMessage.xMessageID)((Timer_t *)xMessage.u,xMessage.u._4_4_,xMessage.xMessageID)
         , -1 < (int)uStack64)) {
        pxTimer = (Timer_t *)xMessage.u;
        if ((((Timer_t *)xMessage.u)->xTimerListItem).pvContainer != (xLIST *)0x0) {
          uxListRemove(&((Timer_t *)xMessage.u)->xTimerListItem);
        }
        xTimeNow_00 = xTaskGetTickCount();
        if (xTimeNow_00 < xLastTime_2297) {
          prvSwitchTimerLists();
        }
        xLastTime_2297 = xTimeNow_00;
        switch(uStack64) {
        case 0:
        case 1:
        case 2:
        case 6:
        case 7:
          pxTimer->ucStatus = pxTimer->ucStatus | 1;
          BVar1 = prvInsertTimerInActiveList
                            (pxTimer,pxTimer->xTimerPeriodInTicks + xMessage.xMessageID,xTimeNow_00,
                             xMessage.xMessageID);
          if (((BVar1 != 0) &&
              ((*pxTimer->pxCallbackFunction)((TimerHandle_t)pxTimer), (pxTimer->ucStatus & 4) != 0)
              ) && (BVar1 = xTimerGenericCommand
                                      ((TimerHandle_t)pxTimer,0,
                                       xMessage.xMessageID + pxTimer->xTimerPeriodInTicks,
                                       (BaseType_t *)0x0,0), BVar1 == 0)) {
            vAssertCalled();
          }
          break;
        case 3:
        case 8:
          pxTimer->ucStatus = pxTimer->ucStatus & 0xfe;
          break;
        case 4:
        case 9:
          pxTimer->ucStatus = pxTimer->ucStatus | 1;
          pxTimer->xTimerPeriodInTicks = xMessage.xMessageID;
          TVar2 = xMessage.xMessageID;
          if (xMessage.xMessageID == 0) {
            vAssertCalled();
            TVar2 = pxTimer->xTimerPeriodInTicks;
          }
          prvInsertTimerInActiveList(pxTimer,TVar2 + xTimeNow_00,xTimeNow_00,xTimeNow_00);
          break;
        case 5:
          if ((pxTimer->ucStatus & 2) == 0) {
            vPortFree(pxTimer);
          }
          else {
            pxTimer->ucStatus = pxTimer->ucStatus & 0xfe;
          }
        }
      }
    }
  } while( true );
}



void * pvTimerGetTimerID(TimerHandle_t xTimer)

{
  void *pvVar1;
  
  if (xTimer == (TimerHandle_t)0x0) {
    vAssertCalled();
  }
  vTaskEnterCritical();
  pvVar1 = xTimer->pvTimerID;
  vTaskExitCritical();
  return pvVar1;
}



