pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void vPortSetupTimerInterrupt(void)

{
  _DAT_02004000 = _DAT_0200bff8 + 10000;
  _DAT_02004004 = (uint)(_DAT_0200bff8 + 10000 < _DAT_0200bff8) + _DAT_0200bffc;
  ullNextTime._0_4_ = _DAT_0200bff8 + 20000;
  ullNextTime._4_4_ = _DAT_0200bffc + (uint)(_DAT_0200bff8 + 20000 < _DAT_0200bff8);
  return;
}


/*
Unable to decompile 'xPortStartScheduler'
Cause: Exception while decompiling 23031b92: Decompiler process died

*/

/*
Unable to decompile 'xPortStartFirstTask'
Cause: Exception while decompiling 23031f00: Decompiler process died

*/


// WARNING: Removing unreachable block (ram,0x23032000)

void pxPortInitialiseStack(int param_1,undefined4 param_2,undefined4 param_3)

{
  int iVar1;
  undefined4 *puVar2;
  uint in_mstatus;
  
  *(uint *)(param_1 + -4) = in_mstatus & 0xfffffff7 | 0x1880;
  *(undefined4 *)(param_1 + -0x5c) = param_3;
  puVar2 = (undefined4 *)(param_1 + -0x74);
  *puVar2 = 0;
  iVar1 = 0x22;
  while (iVar1 != 0) {
    puVar2 = puVar2 + -1;
    *puVar2 = 0;
    iVar1 = iVar1 + -1;
  }
  puVar2[-1] = param_2;
  return;
}



void prvInsertBlockIntoFreeList(BlockLink_t *pxBlockToInsert)

{
  size_t sVar1;
  BlockLink_t *pBVar2;
  BlockLink_t *pBVar3;
  
  pBVar3 = &xStart;
  do {
    pBVar2 = pBVar3;
    pBVar3 = (BlockLink_t *)pBVar2->pxNextFreeBlock;
  } while (pBVar3 < pxBlockToInsert);
  sVar1 = pxBlockToInsert->xBlockSize;
  if (pxBlockToInsert == (BlockLink_t *)(pBVar2->xBlockSize + (int)&pBVar2->pxNextFreeBlock)) {
    sVar1 = pBVar2->xBlockSize + sVar1;
    pBVar2->xBlockSize = sVar1;
    pxBlockToInsert = pBVar2;
  }
  if ((pBVar3 == (BlockLink_t *)(sVar1 + (int)&pxBlockToInsert->pxNextFreeBlock)) &&
     (pBVar3 != pxEnd)) {
    pxBlockToInsert->xBlockSize = sVar1 + pBVar3->xBlockSize;
    pxBlockToInsert->pxNextFreeBlock = pBVar2->pxNextFreeBlock->pxNextFreeBlock;
  }
  else {
    *(BlockLink_t **)&pxBlockToInsert->pxNextFreeBlock = pBVar3;
  }
  if (pxBlockToInsert != pBVar2) {
    *(BlockLink_t **)&pBVar2->pxNextFreeBlock = pxBlockToInsert;
  }
  return;
}



void * pvPortMalloc(size_t xWantedSize)

{
  size_t sVar1;
  size_t sVar2;
  BlockLink_t *pBVar3;
  A_BLOCK_LINK *pAVar4;
  BlockLink_t *pxBlockToInsert;
  uint uVar5;
  uint uVar6;
  
  if (pxEnd == (BlockLink_t *)0x0) {
    vAssertCalled();
  }
  vTaskSuspendAll();
  sVar2 = xFreeBytesRemaining;
  sVar1 = xBlockAllocatedBit;
  if (((xBlockAllocatedBit & xWantedSize) == 0) && (xWantedSize != 0)) {
    uVar6 = xWantedSize + 8;
    if ((uVar6 & 7) != 0) {
      uVar6 = (uVar6 & 0xfffffff8) + 8;
    }
    if ((uVar6 != 0) && (uVar6 <= xFreeBytesRemaining)) {
      pAVar4 = xStart.pxNextFreeBlock;
      pBVar3 = &xStart;
      do {
        pxBlockToInsert = pBVar3;
        pBVar3 = (BlockLink_t *)pAVar4;
        if (uVar6 <= pBVar3->xBlockSize) break;
        pAVar4 = pBVar3->pxNextFreeBlock;
      } while (pBVar3->pxNextFreeBlock != (A_BLOCK_LINK *)0x0);
      if (pxEnd != pBVar3) {
        pAVar4 = pxBlockToInsert->pxNextFreeBlock;
        pxBlockToInsert->pxNextFreeBlock = pBVar3->pxNextFreeBlock;
        uVar5 = pBVar3->xBlockSize;
        pAVar4 = pAVar4 + 1;
        if (0x10 < uVar5 - uVar6) {
          pxBlockToInsert = (BlockLink_t *)((int)&pBVar3->pxNextFreeBlock + uVar6);
          pxBlockToInsert->xBlockSize = uVar5 - uVar6;
          pBVar3->xBlockSize = uVar6;
          prvInsertBlockIntoFreeList(pxBlockToInsert);
          uVar5 = pBVar3->xBlockSize;
        }
        xFreeBytesRemaining = sVar2 - uVar5;
        if (xFreeBytesRemaining < xMinimumEverFreeBytesRemaining) {
          xMinimumEverFreeBytesRemaining = xFreeBytesRemaining;
        }
        pBVar3->xBlockSize = sVar1 | uVar5;
        pBVar3->pxNextFreeBlock = (A_BLOCK_LINK *)0x0;
        xTaskResumeAll();
        if (pAVar4 != (A_BLOCK_LINK *)0x0) {
          return pAVar4;
        }
        goto LAB_230321be;
      }
    }
  }
  xTaskResumeAll();
LAB_230321be:
  vApplicationMallocFailedHook();
  return (void *)0x0;
}



void vPortFree(void *pv)

{
  uint uVar1;
  
  if (pv == (void *)0x0) {
    return;
  }
  uVar1 = *(uint *)((int)pv + -4);
  if ((uVar1 & xBlockAllocatedBit) == 0) {
    vAssertCalled();
    if (*(int *)((int)pv + -8) == 0) {
      uVar1 = *(uint *)((int)pv + -4);
      if ((uVar1 & xBlockAllocatedBit) == 0) {
        return;
      }
      goto LAB_230322ce;
    }
  }
  else {
    if (*(int *)((int)pv + -8) == 0) goto LAB_230322ce;
  }
  vAssertCalled();
  uVar1 = *(uint *)((int)pv + -4);
  if (((uVar1 & xBlockAllocatedBit) == 0) || (*(int *)((int)pv + -8) != 0)) {
    return;
  }
LAB_230322ce:
  *(uint *)((int)pv + -4) = ~xBlockAllocatedBit & uVar1;
  vTaskSuspendAll();
  xFreeBytesRemaining = *(int *)((int)pv + -4) + xFreeBytesRemaining;
  prvInsertBlockIntoFreeList((BlockLink_t *)((int)pv + -8));
  xTaskResumeAll();
  return;
}



size_t xPortGetFreeHeapSize(void)

{
  return xFreeBytesRemaining;
}



void vPortDefineHeapRegions(HeapRegion_t *pxHeapRegions)

{
  size_t sVar1;
  BlockLink_t *pBVar2;
  BlockLink_t *pBVar3;
  BlockLink_t *pBVar4;
  A_BLOCK_LINK *pAVar5;
  int iVar6;
  size_t sVar7;
  
  if (pxEnd == (BlockLink_t *)0x0) {
    sVar1 = pxHeapRegions->xSizeInBytes;
    pBVar4 = pxEnd;
  }
  else {
    vAssertCalled();
    sVar1 = pxHeapRegions->xSizeInBytes;
    pBVar4 = pxEnd;
  }
  pxEnd = pBVar4;
  if (sVar1 == 0) {
    xMinimumEverFreeBytesRemaining = 0;
  }
  else {
    iVar6 = 0;
    sVar7 = 0;
    do {
      pBVar3 = (BlockLink_t *)pxHeapRegions->pucStartAddress;
      pBVar2 = pBVar3;
      if (((uint)pBVar3 & 7) != 0) {
        pBVar2 = (BlockLink_t *)((int)&pBVar3->xBlockSize + 3U & 0xfffffff8);
        sVar1 = (int)pBVar3 + (sVar1 - (int)pBVar2);
      }
      if (iVar6 == 0) {
        xStart.xBlockSize = 0;
        pBVar3 = pBVar4;
        xStart.pxNextFreeBlock = (A_BLOCK_LINK *)pBVar2;
      }
      else {
        if (pBVar4 == (BlockLink_t *)0x0) {
          vAssertCalled();
          pBVar4 = pxEnd;
        }
        pBVar3 = pBVar4;
        if (pBVar2 <= pBVar4) {
          vAssertCalled();
          pBVar3 = pxEnd;
        }
      }
      pBVar4 = (BlockLink_t *)((int)&pBVar2[-1].pxNextFreeBlock + sVar1 & 0xfffffff8);
      ((A_BLOCK_LINK *)pBVar4)->xBlockSize = 0;
      ((A_BLOCK_LINK *)pBVar4)->pxNextFreeBlock = (A_BLOCK_LINK *)0x0;
      pAVar5 = (A_BLOCK_LINK *)((int)pBVar4 - (int)pBVar2);
      pxEnd = pBVar4;
      *(A_BLOCK_LINK **)&pBVar2->xBlockSize = pAVar5;
      *(BlockLink_t **)&pBVar2->pxNextFreeBlock = pBVar4;
      if (pBVar3 != (BlockLink_t *)0x0) {
        *(BlockLink_t **)&pBVar3->pxNextFreeBlock = pBVar2;
        pAVar5 = (A_BLOCK_LINK *)pBVar2->xBlockSize;
      }
      sVar1 = pxHeapRegions[1].xSizeInBytes;
      sVar7 = (int)&pAVar5->pxNextFreeBlock + sVar7;
      iVar6 = iVar6 + 1;
      pxHeapRegions = pxHeapRegions + 1;
    } while (sVar1 != 0);
    xMinimumEverFreeBytesRemaining = sVar7;
    if (sVar7 != 0) {
      xBlockAllocatedBit = 0x80000000;
      xFreeBytesRemaining = sVar7;
      return;
    }
  }
  xFreeBytesRemaining = xMinimumEverFreeBytesRemaining;
  vAssertCalled();
  xBlockAllocatedBit = 0x80000000;
  return;
}



void uart_generic_notify_handler(uint8_t id)

{
  uint uVar1;
  uint uVar2;
  undefined3 in_register_00002029;
  int iVar3;
  uint32_t uVar4;
  
  iVar3 = CONCAT31(in_register_00002029,id);
  uVar4 = uartAddr[iVar3];
  uVar2 = *(uint *)(uVar4 + 0x20);
  uVar1 = *(uint *)(uVar4 + 0x24);
  if (((uVar2 & 1) != 0) && ((uVar1 & 1) == 0)) {
    *(undefined4 *)(uVar4 + 0x28) = 1;
  }
  if (((uVar2 & 2) != 0) && ((uVar1 & 2) == 0)) {
    *(undefined4 *)(uVar4 + 0x28) = 2;
    if (g_uart_notify_arg[iVar3].rx_cb != (cb_uart_notify_t *)0x0) {
      (*g_uart_notify_arg[iVar3].rx_cb)(g_uart_notify_arg[iVar3].rx_cb_arg);
    }
  }
  if (((uVar2 & 4) != 0) && ((uVar1 & 4) == 0)) {
    if (g_uart_notify_arg[iVar3].tx_cb != (cb_uart_notify_t *)0x0) {
      (*g_uart_notify_arg[iVar3].tx_cb)(g_uart_notify_arg[iVar3].tx_cb_arg);
    }
  }
  if (((uVar2 & 8) != 0) && ((uVar1 & 8) == 0)) {
    if (g_uart_notify_arg[iVar3].rx_cb != (cb_uart_notify_t *)0x0) {
      (*g_uart_notify_arg[iVar3].rx_cb)(g_uart_notify_arg[iVar3].rx_cb_arg);
    }
  }
  if (((uVar2 & 0x10) != 0) && ((uVar1 & 0x10) == 0)) {
    *(undefined4 *)(uVar4 + 0x28) = 0x10;
    if (g_uart_notify_arg[iVar3].rx_cb != (cb_uart_notify_t *)0x0) {
      (*g_uart_notify_arg[iVar3].rx_cb)(g_uart_notify_arg[iVar3].rx_cb_arg);
    }
  }
  if (((uVar2 & 0x20) != 0) && ((uVar1 & 0x20) == 0)) {
    *(undefined4 *)(uVar4 + 0x28) = 0x20;
  }
  return;
}



void UART0_IRQHandler(void)

{
  uart_generic_notify_handler('\0');
  return;
}



