pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void UART1_IRQHandler(void)

{
  uart_generic_notify_handler('\x01');
  return;
}



// WARNING: Could not reconcile some variable overlaps

int bl_uart_init(uint8_t id,uint8_t tx_pin,uint8_t rx_pin,uint8_t cts_pin,uint8_t rts_pin,
                uint32_t baudrate)

{
  uint8_t uart_clk_init;
  GLB_UART_SIG_FUN_Type fun;
  undefined3 in_register_00002029;
  GLB_UART_SIG_FUN_Type fun_00;
  UART_FifoCfg_Type UStack60;
  UART_FifoCfg_Type fifoCfg;
  GLB_GPIO_Cfg_Type cfg;
  UART_CFG_Type uartCfg;
  
  memcpy(&cfg.drive,&DAT_23082820,0x10);
  UStack60 = DAT_4200d9c0;
  if (uart_clk_init == '\0') {
    GLB_Set_UART_CLK('\x01',HBN_UART_CLK_160M,'\x03');
    uart_clk_init = '\x01';
  }
  fifoCfg.rxFifoDmaThreshold = '\a';
  fifoCfg._2_2_ = 2;
  cfg._0_2_ = 0x101;
  fifoCfg.txFifoDmaThreshold = rx_pin;
  GLB_GPIO_Init((GLB_GPIO_Cfg_Type *)&fifoCfg);
  fifoCfg._2_2_ = 2;
  fifoCfg.txFifoDmaThreshold = tx_pin;
  GLB_GPIO_Init((GLB_GPIO_Cfg_Type *)&fifoCfg);
  if (CONCAT31(in_register_00002029,id) == 0) {
    fun = GLB_UART_SIG_FUN_UART0_RXD;
    fun_00 = GLB_UART_SIG_FUN_UART0_TXD;
  }
  else {
    fun = GLB_UART_SIG_FUN_UART1_RXD;
    fun_00 = GLB_UART_SIG_FUN_UART1_TXD;
  }
  GLB_UART_Fun_Sel(tx_pin & 7,fun_00);
  GLB_UART_Fun_Sel(rx_pin & 7,fun);
  stack0xffffffd0 = 40000000;
  UART_IntMask(id,UART_INT_ALL,MASK);
  UART_Disable(id,UART_TXRX);
  UART_Init(id,(UART_CFG_Type *)&cfg.drive);
  UART_TxFreeRun(id,ENABLE);
  UART_FifoConfig(id,&UStack60);
  UART_Enable(id,UART_TXRX);
  return 0;
}



int bl_uart_data_send(uint8_t id,uint8_t data)

{
  uint32_t uVar1;
  uint8_t uVar2;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  
  uVar1 = uartAddr[CONCAT31(in_register_00002029,id)];
  do {
    uVar2 = UART_GetTxFifoCount(id);
  } while (CONCAT31(extraout_var,uVar2) == 0);
  *(uint8_t *)(uVar1 + 0x88) = data;
  return 0;
}



int bl_uart_data_recv(uint8_t id)

{
  uint32_t uVar1;
  uint8_t uVar2;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  uint uVar3;
  
  uVar1 = uartAddr[CONCAT31(in_register_00002029,id)];
  uVar2 = UART_GetRxFifoCount(id);
  if (CONCAT31(extraout_var,uVar2) == 0) {
    uVar3 = 0xffffffff;
  }
  else {
    uVar3 = (uint)*(byte *)(uVar1 + 0x8c);
  }
  return uVar3;
}



int bl_uart_int_rx_enable(uint8_t id)

{
  UART_SetRxTimeoutValue(id,'\x18');
  UART_IntMask(id,UART_INT_RX_FIFO_REQ,UNMASK);
  UART_IntMask(id,UART_INT_RX_END,UNMASK);
  UART_IntMask(id,UART_INT_RTO,UNMASK);
  return 0;
}



int bl_uart_int_rx_disable(uint8_t id)

{
  UART_IntMask(id,UART_INT_RX_FIFO_REQ,MASK);
  UART_IntMask(id,UART_INT_RX_END,MASK);
  UART_IntMask(id,UART_INT_RTO,MASK);
  return 0;
}



int bl_uart_int_tx_enable(uint8_t id)

{
  UART_IntMask(id,UART_INT_TX_FIFO_REQ,UNMASK);
  return 0;
}



int bl_uart_int_tx_disable(uint8_t id)

{
  UART_IntMask(id,UART_INT_TX_FIFO_REQ,MASK);
  return 0;
}



int bl_uart_flush(uint8_t id)

{
  uint8_t uVar1;
  undefined3 extraout_var;
  
  do {
    uVar1 = UART_GetTxFifoCount(id);
  } while (CONCAT31(extraout_var,uVar1) != 0x20);
  return 0;
}



void bl_uart_getdefconfig(uint8_t id,uint8_t *parity)

{
  if (parity != (uint8_t *)0x0) {
    *parity = '\0';
  }
  return;
}



// WARNING: Variable defined which should be unmapped: UartCfg
// WARNING: Could not reconcile some variable overlaps

void bl_uart_setconfig(uint8_t id,uint32_t baudrate,UART_Parity_Type parity)

{
  undefined auStack32 [4];
  UART_CFG_Type UartCfg;
  
  memcpy(auStack32,&DAT_23082830,0x10);
  UartCfg.uartClk = baudrate;
  UartCfg.baudRate._2_1_ = parity;
  UART_Disable(id,UART_TXRX);
  UART_Init(id,(UART_CFG_Type *)auStack32);
  UART_TxFreeRun(id,ENABLE);
  UART_Enable(id,UART_TXRX);
  return;
}



void bl_uart_setbaud(uint8_t id,uint32_t baud)

{
  bl_uart_setconfig(id,baud,UART_PARITY_NONE);
  return;
}



int bl_uart_int_enable(uint8_t id)

{
  undefined3 in_register_00002029;
  uint source;
  
  if (CONCAT31(in_register_00002029,id) == 0) {
    bl_uart_int_rx_enable(id);
    bl_uart_int_tx_enable('\0');
    bl_irq_register(0x2d,UART0_IRQHandler);
    source = 0x2d;
  }
  else {
    if (CONCAT31(in_register_00002029,id) != 1) {
      return -1;
    }
    bl_uart_int_rx_enable(id);
    bl_uart_int_tx_enable('\x01');
    bl_irq_register(0x2e,UART1_IRQHandler);
    source = 0x2e;
  }
  bl_irq_enable(source);
  return 0;
}



int bl_uart_int_disable(uint8_t id)

{
  undefined3 in_register_00002029;
  uint source;
  
  if (CONCAT31(in_register_00002029,id) == 0) {
    bl_uart_int_rx_disable(id);
    bl_uart_int_tx_disable('\0');
    bl_irq_unregister(0x2d,UART0_IRQHandler);
    source = 0x2d;
  }
  else {
    if (CONCAT31(in_register_00002029,id) != 1) {
      return -1;
    }
    bl_uart_int_rx_disable(id);
    bl_uart_int_tx_disable('\x01');
    bl_irq_unregister(0x2e,UART1_IRQHandler);
    source = 0x2e;
  }
  bl_irq_disable(source);
  return 0;
}



int bl_uart_int_rx_notify_register(uint8_t id,cb_uart_notify_t *cb,void *arg)

{
  undefined3 in_register_00002029;
  uint uVar1;
  
  uVar1 = CONCAT31(in_register_00002029,id);
  if (uVar1 < 2) {
    g_uart_notify_arg[uVar1].rx_cb = cb;
    g_uart_notify_arg[uVar1].rx_cb_arg = arg;
    return 0;
  }
  return -1;
}



int bl_uart_int_tx_notify_register(uint8_t id,cb_uart_notify_t *cb,void *arg)

{
  undefined3 in_register_00002029;
  uint uVar1;
  
  uVar1 = CONCAT31(in_register_00002029,id);
  if (uVar1 < 2) {
    g_uart_notify_arg[uVar1].tx_cb = cb;
    g_uart_notify_arg[uVar1].tx_cb_arg = arg;
    return 0;
  }
  return -1;
}



// WARNING: Removing unreachable block (ram,0x23032876)

int bl_chip_info(char *info)

{
  char *pcVar1;
  undefined *__src;
  uint uVar2;
  uint in_register_90000c04;
  uint32_t misa;
  
  uVar2 = in_register_90000c04 >> 0x1e;
  if (uVar2 == 2) {
    memcpy(info,&DAT_23082b04,4);
    pcVar1 = info + 4;
  }
  else {
    if (uVar2 == 3) {
      memcpy(info,"RV128",5);
      pcVar1 = info + 5;
    }
    else {
      pcVar1 = info + 4;
      if (uVar2 == 1) {
        __src = &DAT_23082afc;
      }
      else {
        __src = &DAT_23082b14;
      }
      memcpy(info,__src,4);
    }
  }
  *pcVar1 = '-';
  pcVar1 = pcVar1 + 1;
  uVar2 = 0;
  do {
    if ((1 << (uVar2 & 0x1f) & in_register_90000c04) != 0) {
      *pcVar1 = (char)uVar2 + 'A';
      pcVar1 = pcVar1 + 1;
    }
    uVar2 = uVar2 + 1;
  } while (uVar2 != 0x1a);
  *pcVar1 = '\0';
  return 0;
}



