pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_chip_banner(char **banner)

{
  *banner = 
  "██████╗ ██╗      ██████╗  ██████╗ ██████╗\n\r██╔══██╗██║     ██╔════╝ ██╔═████╗╚════██╗\n\r██████╔╝██║     ███████╗ ██║██╔██║ █████╔╝\n\r██╔══██╗██║     ██╔═══██╗████╔╝██║██╔═══╝\n\r██████╔╝███████╗╚██████╔╝╚██████╔╝███████╗\n\r╚═════╝ ╚══════╝ ╚═════╝  ╚═════╝ ╚══════╝\n\r"
  ;
  return 0;
}



int bl_chip_memory_ram(int *num,uint *addr,uint *size,char (*desc) [6])

{
  if (2 < *num) {
    *num = 3;
    *addr = 0x23000000;
    *size = 0x400000;
    strcpy((char *)desc,"flash");
    addr[1] = 0x4200c000;
    size[1] = 0x36000;
    strcpy((char *)(desc + 1),"tcm");
    addr[2] = 0x42042000;
    size[2] = 0xa000;
    strcpy((char *)(desc + 2),"wifi");
    return 0;
  }
  return -1;
}



void _cb_cmd(void *arg)

{
  TickType_t TVar1;
  
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [DMA] [TEST] Callback is working, arg is %p\r\n",TVar1,
              &DAT_2307f16c,"bl_cks.c",0xe5,arg);
  }
  *(undefined4 *)((int)arg + 8) = 0;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

undefined4 bl_cks_test(void)

{
  ushort uVar1;
  TickType_t TVar2;
  char *format;
  undefined *puVar3;
  undefined4 uVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  undefined2 local_80;
  ushort uStack126;
  undefined4 uStack124;
  undefined4 uStack120;
  bl_dma_item bStack116;
  undefined auStack88 [4];
  undefined4 uStack84;
  undefined4 uStack80;
  undefined2 *puStack76;
  undefined *puStack72;
  undefined **ppuStack68;
  undefined4 uStack64;
  undefined auStack60 [4];
  undefined4 uStack56;
  undefined4 uStack52;
  undefined *puStack48;
  ushort *puStack44;
  undefined4 uStack40;
  undefined4 uStack36;
  
  puStack76 = &local_80;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] --->>> case1 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x137);
  }
  DAT_4000a700 = 1;
  iVar5 = 0;
  do {
    DAT_4000a704 = data_src1_2802[iVar5];
    iVar5 = iVar5 + 1;
  } while (iVar5 != 0x14);
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS result with LE is %04x, should be %02x%02x\r\n",TVar2,
              &DAT_2307f16c,"bl_cks.c",0x40,uVar6,0x61,0xb8);
  }
  DAT_4000a700 = 2;
  iVar5 = 0;
  do {
    DAT_4000a704 = data_src1_2802[iVar5];
    iVar5 = iVar5 + 1;
  } while (iVar5 != 0x14);
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS result with BE is %04x, should be %02x%02x\r\n",TVar2,
              &DAT_2307f16c,"bl_cks.c",0x48,uVar6,0x61,0xb8);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] --->>> case2 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x139);
    }
  }
  DAT_4000a700 = 1;
  DAT_4000a704 = 0x3f;
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0x61,uVar6,0xc0e0);
  }
  uVar1 = _DAT_4000a708;
  DAT_4000a700 = 2;
  DAT_4000a704 = 0x3f;
  uVar6 = (uint)_DAT_4000a708;
  if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
    if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
                0x73,uVar6,0xc0e0);
      if (uVar1 != 0xc0e0) goto LAB_2303332e;
      if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) || (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks)
         ) goto LAB_23032c88;
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar6 = 0xc0e0;
      uVar4 = 0x75;
      format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_23032c7a:
      bl_printk(format,TVar2,&DAT_2307f16c,"bl_cks.c",uVar4,uVar6);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)
         ) {
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] --->>> case3 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13b);
      }
    }
    else {
      if (_DAT_4000a708 != 0xc0e0) goto LAB_23033338;
    }
  }
  else {
    if (_DAT_4000a708 != 0xc0e0) {
LAB_2303332e:
      if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
LAB_23033338:
        if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN) {
          if (TrapNetCounter == 0) {
            TVar2 = xTaskGetTickCount();
          }
          else {
            TVar2 = xTaskGetTickCountFromISR();
          }
          uVar4 = 0x77;
          format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
          goto LAB_23032c7a;
        }
      }
    }
  }
LAB_23032c88:
  DAT_4000a700 = 1;
  iVar5 = 1000;
  do {
    DAT_4000a704 = 0x3f;
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  uVar6 = 0xf69118;
  while (uVar6 >> 0x10 != 0) {
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  }
  uVar7 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0x91,uVar7,~uVar6 & 0xffff);
  }
  DAT_4000a700 = 2;
  iVar5 = 1000;
  do {
    DAT_4000a704 = 0x3f;
    iVar5 = iVar5 + -1;
  } while (iVar5 != 0);
  uVar6 = 0xf69118;
  while (uVar6 >> 0x10 != 0) {
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  }
  uVar7 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xa3,uVar7,~uVar6 & 0xffff);
  }
  if (uVar7 == (~uVar6 & 0xffff)) {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar4 = 0xa5;
      puVar3 = &DAT_2307f16c;
      format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_230330f0:
      bl_printk(format,TVar2,puVar3,"bl_cks.c",uVar4,uVar7);
      goto LAB_230330f4;
    }
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar4 = 0xa7;
      puVar3 = &DAT_23072bcc;
      format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
      goto LAB_230330f0;
    }
LAB_230330f4:
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] --->>> case4 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13d);
    }
  }
  DAT_4000a700 = 1;
  DAT_4000a704 = 0xa1;
  uVar6 = (uint)_DAT_4000a708;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS LE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xc4,uVar6,0xc03f);
  }
  uVar1 = _DAT_4000a708;
  DAT_4000a700 = 2;
  DAT_4000a704 = 0xa1;
  uVar6 = (uint)_DAT_4000a708;
  if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks) {
      if (_DAT_4000a708 == 0xc03f) goto LAB_23032ef6;
      goto LAB_230332e4;
    }
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] CKS BE result is %04x, %04x\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",
              0xd8,uVar6,0xc03f);
    if (uVar1 != 0xc03f) goto LAB_230332da;
    if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) || (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks))
    goto LAB_23032ef6;
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    uVar6 = 0xc03f;
    uVar4 = 0xda;
    puVar3 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
LAB_230331c2:
    bl_printk(format,TVar2,puVar3,"bl_cks.c",uVar4,uVar6);
  }
  else {
    if (_DAT_4000a708 == 0xc03f) goto LAB_23032ef6;
LAB_230332da:
    if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
LAB_230332e4:
      if (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_ASSERT) {
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        uVar4 = 0xdc;
        puVar3 = &DAT_23072bcc;
        format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
        goto LAB_230331c2;
      }
    }
  }
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_cks < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] --->>> case5 test\r\n",TVar2,&DAT_2307f16c,"bl_cks.c",0x13f);
  }
LAB_23032ef6:
  bStack116.arg = &bStack116;
  local_80 = 0x3f1f;
  uStack124 = 1;
  uStack120 = 2;
  uStack126 = 0;
  memset(bStack116.arg,0,0x1c);
  memset(auStack88,0,0x1c);
  memset(auStack60,0,0x1c);
  bStack116.src = &uStack124;
  bStack116.dst = &DAT_4000a700;
  bStack116.next = &puStack76;
  bStack116.ctrl = 0x4480002;
  bStack116.cb = _cb_cmd;
  puStack72 = &DAT_4000a704;
  puStack48 = &DAT_4000a708;
  ppuStack68 = &puStack48;
  puStack44 = &uStack126;
  uStack64 = 0x403e8;
  uStack84 = 0;
  uStack80 = 0;
  uStack40 = 0;
  uStack36 = 0x80240001;
  uStack56 = 0;
  uStack52 = 0;
  bl_dma_copy(bStack116.arg);
  while (bStack116.arg != (bl_dma_item *)0x0) {
    vTaskDelay(2);
  }
  if (uStack126 == 0x6df1) {
    if (BLOG_LEVEL_INFO < _fsymc_level_hal_drv) {
      return 0;
    }
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_cks) {
      return 0;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar4 = 0x12f;
    puVar3 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %04X Checksum=====\r\n";
  }
  else {
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return 0;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_cks) {
      return 0;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar4 = 0x131;
    puVar3 = &DAT_23072bcc;
    format = "[%10u][%s: %s:%4d] ====== Failed %04X Checksum======\r\n";
  }
  bl_printk(format,puVar3,"bl_cks.c",uVar4,(uint)uStack126);
  return 0;
}



void _cb_cmd(void *arg)

{
  TickType_t TVar1;
  
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [DMA] [TEST] Callback is working, arg is %p\r\n",TVar1,
              &DAT_2307f16c,"bl_dma.c",0x19c,arg);
  }
  *(undefined4 *)((int)arg + 8) = 0;
  return;
}



