pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl_dma_int_process(void)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  int *piStack52;
  dma_ctx *pstctx;
  
  uVar1 = _DAT_4000c00c;
  uVar2 = _DAT_4000c004;
  uVar5 = 0;
  bl_irq_ctx_get(0x1f,&piStack52);
  do {
    uVar4 = 1 << (uVar5 & 0x1f);
    uVar7 = uVar4 & uVar2;
    uVar6 = uVar4 & uVar1;
    if (uVar7 == 0) {
      if (uVar6 != 0) {
LAB_23033424:
        uVar2 = _DAT_4000c010 | uVar4;
        _DAT_4000c010 = uVar2;
        goto LAB_2303342e;
      }
    }
    else {
      uVar2 = _DAT_4000c008 | uVar4;
      _DAT_4000c008 = uVar2;
      if (uVar6 != 0) goto LAB_23033424;
LAB_2303342e:
      iVar3 = *(int *)(*piStack52 + 4);
      while (iVar3 != *piStack52) {
        if (*(uint *)(iVar3 + 8) == uVar5) {
          if ((*(code **)(iVar3 + 0xc) != (code *)0x0) && (uVar7 != 0)) {
            (**(code **)(iVar3 + 0xc))();
          }
          if ((*(code **)(iVar3 + 0x10) != (code *)0x0) && (uVar6 != 0)) {
            (**(code **)(iVar3 + 0x10))();
          }
        }
        iVar3 = *(int *)(iVar3 + 4);
      }
    }
    uVar5 = uVar5 + 1;
    if (uVar5 == 4) {
      return;
    }
  } while( true );
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl_dma_int_clear(int ch)

{
  uint uVar1;
  
  uVar1 = 1 << (ch & 0x1fU);
  if ((_DAT_4000c004 & uVar1 & 0xff) != 0) {
    _DAT_4000c008 = _DAT_4000c008 | uVar1;
  }
  if ((_DAT_4000c00c & uVar1 & 0xff) != 0) {
    _DAT_4000c010 = uVar1 | _DAT_4000c010;
  }
  return 0;
}



void bl_dma_IRQHandler(void)

{
  utils_list_hdr *puVar1;
  TickType_t TVar2;
  
  bl_dma_int_clear(0);
  puVar1 = utils_list_pop_front(&dma_copy_list);
  if (puVar1 == (utils_list_hdr *)0x0) {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_WARN))
    {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] [INT] ASSERT here for empty chain\r\n",TVar2,&DAT_2307f16c,
                "bl_dma.c",0x9d);
    }
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  if (puVar1[1].next != (utils_list_hdr *)0x0) {
    (*(code *)puVar1[1].next)(puVar1[2].next);
  }
  if (dma_copy_list.first != (utils_list_hdr *)0x0) {
    DMA_LLI_Update('\0',(uint32_t)(dma_copy_list.first + 3));
    DMA_Channel_Enable('\0');
    return;
  }
  return;
}



void bl_dma_copy(bl_dma_item *first)

{
  vTaskEnterCritical();
  if (dma_copy_list.first == (utils_list_hdr *)0x0) {
    DMA_LLI_Update('\0',(uint32_t)&first->src);
    DMA_Channel_Enable('\0');
  }
  utils_list_push_back(&dma_copy_list,(utils_list_hdr *)first);
  vTaskExitCritical();
  return;
}



int bl_dma_irq_register(int channel,void *tc_handler,void *interr_handler,void *ctx)

{
  int iVar1;
  TickType_t TVar2;
  int *piVar3;
  int **ppiVar4;
  int *piStack36;
  dma_ctx *pstctx;
  
  if (((uint)channel < 5) && (tc_handler != (void *)0x0)) {
    bl_irq_ctx_get(0x1f,&piStack36);
    iVar1 = *(int *)(*piStack36 + 4);
    while (*piStack36 != iVar1) {
      if (channel == *(int *)(iVar1 + 8)) {
        if (BLOG_LEVEL_WARN < _fsymc_level_hal_drv) {
          return -1;
        }
        if (BLOG_LEVEL_WARN < _fsymf_level_hal_drvbl_dma) {
          return -1;
        }
        if (TrapNetCounter == 0) {
          TVar2 = xTaskGetTickCount();
        }
        else {
          TVar2 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] channel %d already register \r\n",TVar2,&DAT_23081ce8,
                  "bl_dma.c",0x124,*(undefined4 *)(iVar1 + 8));
        return -1;
      }
      iVar1 = *(int *)(iVar1 + 4);
    }
    piVar3 = (int *)pvPortMalloc(0x18);
    if (((piVar3 == (int *)0x0) && (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
       (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] malloc dma node failed. \r\n",TVar2,&DAT_23072bcc,"bl_dma.c",
                0x12a);
    }
    piVar3[2] = channel;
    *(void **)(piVar3 + 3) = tc_handler;
    *(void **)(piVar3 + 4) = interr_handler;
    *(void **)(piVar3 + 5) = ctx;
    iVar1 = *piStack36;
    ppiVar4 = *(int ***)(iVar1 + 4);
    *piVar3 = iVar1;
    *(int ***)(piVar3 + 1) = ppiVar4;
    *(int **)(iVar1 + 4) = piVar3;
    *ppiVar4 = piVar3;
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] not valid para \r\n",TVar2,&DAT_23072bcc,"bl_dma.c",0x11c);
    }
  }
  return -1;
}



void bl_dma_init(void)

{
  void **ctx;
  char *format;
  void *pvVar1;
  undefined4 uVar2;
  undefined2 uStack20;
  DMA_Periph_Req_Type DStack18;
  DMA_LLI_Cfg_Type lliCfg;
  
  uStack20 = 0;
  DStack18 = DMA_REQ_UART0_RX;
  utils_list_init(&dma_copy_list);
  ctx = (void **)pvPortMalloc(4);
  if (ctx == (void **)0x0) {
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_dma) {
      return;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar2 = 0x180;
    format = "[%10u][%s: %s:%4d] malloc dma ctx failed \r\n";
  }
  else {
    pvVar1 = pvPortMalloc(8);
    *ctx = pvVar1;
    if (pvVar1 != (void *)0x0) {
      *(void **)((int)pvVar1 + 4) = pvVar1;
      *(void **)pvVar1 = pvVar1;
      DMA_Enable();
      DMA_IntMask('\0',DMA_INT_ALL,MASK);
      DMA_IntMask('\0',DMA_INT_TCOMPLETED,UNMASK);
      DMA_IntMask('\0',DMA_INT_ERR,UNMASK);
      DMA_LLI_Init('\0',(DMA_LLI_Cfg_Type *)&uStack20);
      bl_irq_register_with_ctx(0x1f,bl_dma_int_process,ctx);
      bl_dma_irq_register(0,bl_dma_IRQHandler,(void *)0x0,(void *)0x0);
      bl_irq_enable(0x1f);
      return;
    }
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_dma) {
      return;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar2 = 0x187;
    format = "[%10u][%s: %s:%4d] malloc dma pstqueue failed \r\n";
  }
  bl_printk(format,&DAT_23072bcc,"bl_dma.c",uVar2);
  return;
}



