pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void bl_dma_test(void)

{
  bl_dma_item *first;
  void *__s;
  void *__s_00;
  TickType_t TVar1;
  
  first = (bl_dma_item *)pvPortMalloc(0x1c);
  __s = pvPortMalloc(0x44);
  __s_00 = pvPortMalloc(0x44);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_dma < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [TEST] [DMA] first %p, src %p, dst %p\r\n",TVar1,&DAT_2307f16c,
              "bl_dma.c",0x1af,first,__s,__s_00);
  }
  memset(first,0,0x1c);
  memset(__s,1,0x44);
  memset(__s_00,0xff,0x44);
  first->ctrl = 0x8c49b011;
  *(void **)&first->src = __s;
  *(void **)&first->dst = __s_00;
  first->next = 0;
  first->cb = _cb_cmd;
  *(bl_dma_item **)&first->arg = first;
  bl_dma_copy(first);
  while (first->arg != (void *)0x0) {
    vTaskDelay(2);
  }
  vPortFree((void *)first->src);
  vPortFree((void *)first->dst);
  vPortFree(first);
  return;
}



void _irq_num_check(int irqnum)

{
  TickType_t TVar1;
  
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) && (_fsymf_level_hal_drvbl_irq < BLOG_LEVEL_ASSERT)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] illegal irqnum %d\r\n",TVar1,&DAT_23072bcc,"bl_irq.c",0x70,irqnum)
    ;
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void bl_irq_enable(uint source)

{
  (&DAT_02800400)[source] = 1;
  return;
}



void bl_irq_disable(uint source)

{
  (&DAT_02800400)[source] = 0;
  return;
}



void bl_irq_exception_trigger(BL_IRQ_EXCEPTION_TYPE_T type,void *ptr)

{
  undefined3 in_register_00002029;
  uint uVar1;
  undefined4 uVar2;
  undefined auStack20 [4];
  uint32_t fun_val;
  
  uVar1 = CONCAT31(in_register_00002029,type);
  if (uVar1 < 3) {
    if (uVar1 == 0) {
      uVar2 = *(undefined4 *)ptr;
    }
    else {
      uVar2 = 0x12345678;
      *(undefined4 *)ptr = 0x12345678;
    }
  }
  else {
    uVar2 = 0x12345678;
    if (uVar1 == 3) {
      (*(code *)auStack20)(0x12345678,auStack20);
      uVar2 = 0x12345678;
    }
  }
  printf("Trigger exception val is %08lx\r\n",uVar2);
  return;
}



void bl_irq_register_with_ctx(int irqnum,void *handler,void *ctx)

{
  TickType_t TVar1;
  
  if (0x4f < (uint)irqnum) {
    _irq_num_check(irqnum);
  }
  if (handler_list[irqnum] == (anon_subr_void *)0x0) goto LAB_23033a6a;
  if (handler_list[irqnum] == (anon_subr_void *)handler) {
LAB_23033adc:
    handler_list[irqnum] = handler;
    if ((anon_subr_void *)ctx == (anon_subr_void *)0x0) {
      handler_list[irqnum + 0x50] = (anon_subr_void *)0x0;
    }
    else {
      handler_list[irqnum + 0x50] = ctx;
    }
  }
  else {
    if (_fsymc_level_hal_drv < BLOG_LEVEL_ERROR) {
      if (_fsymf_level_hal_drvbl_irq < BLOG_LEVEL_ERROR) {
        if (TrapNetCounter == 0) {
          TVar1 = xTaskGetTickCount();
        }
        else {
          TVar1 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] IRQ %d already registered with %p \r\n",TVar1,&DAT_23081ce8,
                  "bl_irq.c",0x7e,irqnum,handler_list[irqnum]);
        goto LAB_23033a6a;
      }
      if ((anon_subr_void *)handler != (anon_subr_void *)0x0) goto LAB_23033adc;
    }
    else {
LAB_23033a6a:
      if ((anon_subr_void *)handler != (anon_subr_void *)0x0) goto LAB_23033adc;
      if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
        return;
      }
    }
    if (_fsymf_level_hal_drvbl_irq < BLOG_LEVEL_ASSERT) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] handler is NULL pointer! \r\n",TVar1,&DAT_23072bcc,"bl_irq.c",
                0x82);
      return;
    }
  }
  return;
}



void bl_irq_ctx_get(int irqnum,void **ctx)

{
  if (0x4f < (uint)irqnum) {
    _irq_num_check(irqnum);
  }
  *(anon_subr_void **)ctx = handler_list[irqnum + 0x50];
  return;
}



void bl_irq_register(int irqnum,void *handler)

{
  bl_irq_register_with_ctx(irqnum,handler,(void *)0x0);
  return;
}



void bl_irq_unregister(int irqnum,void *handler)

{
  TickType_t TVar1;
  
  if (0x4f < (uint)irqnum) {
    _irq_num_check(irqnum);
  }
  if (((handler_list[irqnum] != (anon_subr_void *)handler) &&
      (_fsymc_level_hal_drv < BLOG_LEVEL_ERROR)) && (_fsymf_level_hal_drvbl_irq < BLOG_LEVEL_ERROR))
  {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] IRQ %d:%p Not match with registered %p\r\n",TVar1,&DAT_23081ce8,
              "bl_irq.c",0xa8,irqnum,handler,handler_list[irqnum]);
  }
  handler_list[irqnum] = handler;
  return;
}



// WARNING: Exceeded maximum restarts with more pending

void interrupt_entry(uint32_t mcause)

{
  anon_subr_void *UNRECOVERED_JUMPTABLE_00;
  uint uVar1;
  
  uVar1 = mcause & 0x7ffffff;
  if (uVar1 < 0x50) {
    UNRECOVERED_JUMPTABLE_00 = handler_list[uVar1];
    if (UNRECOVERED_JUMPTABLE_00 != (anon_subr_void *)0x0) {
      if (handler_list[uVar1 + 0x50] != (anon_subr_void *)0x0) {
                    // WARNING: Could not recover jumptable at 0x23033c02. Too many branches
                    // WARNING: Treating indirect jump as call
        (*UNRECOVERED_JUMPTABLE_00)();
        return;
      }
                    // WARNING: Could not recover jumptable at 0x23033c04. Too many branches
                    // WARNING: Treating indirect jump as call
      (*UNRECOVERED_JUMPTABLE_00)();
      return;
    }
  }
  printf("Cannot handle mcause 0x%lx:%lu, adjust to externel(0x%lx:%lu)\r\n",uVar1,uVar1 - 0x10);
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void exception_entry(uint32_t mcause,uint32_t mepc,uint32_t mtval,uintptr_t *regs)

{
  char *__s;
  
  if ((mcause & 0x3ff) == 4) {
    misaligned_load_trap(mcause,mepc);
    return;
  }
  if ((mcause & 0x3ff) != 6) {
    puts("Exception Entry--->>>\r\n");
    printf("mcause %08lx, mepc %08lx, mtval %08lx\r\n",mcause,mepc,mtval);
    printf("Exception code: %lu\r\n",mcause & 0xffff);
    switch(mcause & 0xffff) {
    case 0:
      __s = "  msg: Instruction address misaligned\r\n";
      break;
    case 1:
      __s = "  msg: Instruction access fault\r\n";
      break;
    case 2:
      __s = "  msg: Illegal instruction\r\n";
      break;
    case 3:
      __s = "  msg: Breakpoint\r\n";
      break;
    case 4:
      __s = "  msg: Load address misaligned\r\n";
      break;
    case 5:
      __s = "  msg: Load access fault\r\n";
      break;
    case 6:
      __s = "  msg: Store/AMO access misaligned\r\n";
      break;
    case 7:
      __s = "  msg: Store/AMO access fault\r\n";
      break;
    case 8:
      __s = "  msg: Environment call from U-mode\r\n";
      break;
    case 9:
      __s = "  msg: Environment call from S-mode\r\n";
      break;
    case 10:
    case 0xe:
      __s = "  msg: Reserved\r\n";
      break;
    case 0xb:
      __s = "  msg: Environment call from M-mode\r\n";
      break;
    case 0xc:
      __s = "  msg: Instruction page fault\r\n";
      break;
    case 0xd:
      __s = "  msg: Load page fault\r\n";
      break;
    case 0xf:
      __s = "  msg: Store/AMO page fault\r\n";
      break;
    default:
      __s = "  msg: Reserved default exception\r\n";
    }
    puts(__s);
    backtrace_riscv(printf,regs);
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  misaligned_store_trap(mcause,mepc);
  return;
}



void bl_irq_init(void)

{
  undefined *puVar1;
  
