pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  puts("[IRQ] Clearing and Disable all the pending IRQ...\r\n");
  puVar1 = &DAT_02800400;
  do {
    *puVar1 = 0;
    puVar1 = puVar1 + 1;
  } while (puVar1 != (undefined *)0x2800480);
  puVar1 = &DAT_02800000;
  do {
    *puVar1 = 0;
    puVar1 = puVar1 + 1;
  } while (puVar1 != (undefined *)0x2800080);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void _trng_trigger(void)

{
  if ((_DAT_40004200 & 1) == 0) {
    _DAT_40004200 = _DAT_40004200 | 0x606;
    _DAT_4000422c = trng_buffer[0];
    _DAT_40004230 = trng_buffer[1];
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void wait_trng4feed(void)

{
  do {
  } while ((_DAT_40004200 & 1) != 0);
  _DAT_40004200 = _DAT_40004200 & 0xfffffffd | 0x200;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) && (_fsymf_level_hal_drvbl_sec < BLOG_LEVEL_INFO)) {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] Feed random number is %08lx\r\n","DEBUG ","bl_sec.c",0x5b,
              trng_buffer[0]);
  }
  trng_buffer[0] = _DAT_40004208;
  trng_buffer[1] = _DAT_4000420c;
  trng_buffer[2] = _DAT_40004210;
  trng_buffer[3] = _DAT_40004214;
  trng_buffer[4] = _DAT_40004218;
  trng_buffer[5] = _DAT_4000421c;
  trng_buffer[6] = _DAT_40004220;
  trng_buffer[7] = _DAT_40004224;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void sec_trng_IRQHandler(uint param_1,int param_2)

{
  aos_now_ms();
  if ((param_2 < 1) && ((param_2 != 0 || (param_1 < 2000)))) {
    puts("[BL] [SEC] TRNG Handler\r\n");
  }
  _DAT_40004200 = _DAT_40004200 & 0xfffffffd | 0x200;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) && (_fsymf_level_hal_drvbl_sec < BLOG_LEVEL_INFO)) {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] random number is %08lx\r\n","DEBUG ","bl_sec.c",0xab,
              trng_buffer[0]);
  }
  trng_buffer[0] = _DAT_40004208;
  trng_buffer[1] = _DAT_4000420c;
  trng_buffer[2] = _DAT_40004210;
  trng_buffer[3] = _DAT_40004214;
  trng_buffer[4] = _DAT_40004218;
  trng_buffer[5] = _DAT_4000421c;
  trng_buffer[6] = _DAT_40004220;
  trng_buffer[7] = _DAT_40004224;
  return;
}



void bl_sec_pka_IRQHandler(void)

{
  puts("--->>> PKA IRQ\r\n");
  SEC_Eng_IntMask(SEC_ENG_INT_PKA,MASK);
  return;
}



uint32_t bl_sec_get_random_word(void)

{
  uint uVar1;
  
  uVar1 = trng_idx & 7;
  if (uVar1 == 0) {
    trng_idx = uVar1;
    _trng_trigger();
  }
  trng_idx = uVar1 + 1;
  return trng_buffer[uVar1];
}



void bl_rand_stream(uint8_t *buf,int len)

{
  size_t __n;
  int iVar1;
  
  if (trng_idx != 0) {
    _trng_trigger();
    wait_trng4feed();
    trng_idx = 0;
  }
  iVar1 = 0;
  while (0 < len) {
    if (trng_idx != 0) {
      _trng_trigger();
      wait_trng4feed();
      trng_idx = 0;
    }
    __n = len;
    if (0x20 < len) {
      __n = 0x20;
    }
    memcpy(buf + iVar1,trng_buffer,__n);
    iVar1 = iVar1 + __n;
    len = len - __n;
    trng_idx = 0x1f;
  }
  _trng_trigger();
  wait_trng4feed();
  trng_idx = 0;
  return;
}



int bl_rand(void)

{
  int iVar1;
  uint32_t uVar2;
  
  iVar1 = 0x13;
  do {
    uVar2 = bl_sec_get_random_word();
    iVar1 = iVar1 + -1;
    if (iVar1 == 0) {
      puts("[BL] [SEC] Failed after loop (17)\r\n");
      break;
    }
  } while (uVar2 == 0);
  return uVar2 >> 1;
}



int bl_sec_init(void)

{
  g_bl_sec_sha_mutex =
       (SemaphoreHandle_t)xQueueCreateMutexStatic('\x01',(StaticQueue_t *)&sha_mutex_buf);
  _trng_trigger();
  wait_trng4feed();
  _trng_trigger();
  wait_trng4feed();
  bl_irq_register(0x1c,sec_trng_IRQHandler);
  bl_irq_enable(0x1c);
  return 0;
}



int bl_sec_test(void)

{
  int iVar1;
  
  bl_printk("------------------TRNG TEST---------------------------------\r\n");
  iVar1 = bl_rand();
  bl_printk("**********TRNG TEST rand[%08x]**************\r\n",iVar1);
  iVar1 = bl_rand();
  bl_printk("**********TRNG TEST rand[%08x]**************\r\n",iVar1);
  bl_printk("------------------------------------------------------------\r\n");
  return 0;
}



void _dump_rsa_data(uint8_t *data,int size)

{
  uint uVar1;
  
  uVar1 = 0;
  do {
    if (size <= (int)uVar1) {
      return;
    }
    if ((uVar1 & 0xf) == 0) {
      bl_printk("[%04X]:",uVar1);
LAB_2303415a:
      bl_printk(" %02X",(uint)data[uVar1]);
    }
    else {
      if ((uVar1 & 0xf) != 0xf) goto LAB_2303415a;
      bl_printk(" %02X",(uint)data[uVar1]);
      puts("\r\n");
    }
    uVar1 = uVar1 + 1;
  } while( true );
}



void _pka_test_case_xgcd(void)

{
  uint8_t "" [256];
  uint8_t n [256];
  uint8_t "" [256];
  uint8_t uStack273;
  undefined auStack272 [3];
  uint8_t pka_a_eq_0;
  uint32_t result [64];
  
  uStack273 = '\0';
  Sec_Eng_PKA_Reset();
  Sec_Eng_PKA_BigEndian_Enable();
  Sec_Eng_PKA_Write_Data
            (SEC_ENG_PKA_REG_SIZE_256,'\x01',(uint32_t *)(uint8_t *)&ram0x230839c4,0x40,'\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x02','\0','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x03','\0','\x01');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\0',(uint32_t *)"",0x40,'\0');
  Sec_Eng_PKA_LMUL2N('\n','\x01','\b','\0',0x800,'\0');
  Sec_Eng_PKA_LDIV('\b','\0','\n','\x01','\b','\x01','\0');
  Sec_Eng_PKA_MREM('\b','\x04','\n','\x01','\b','\x01','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_512,'\x01','\0','\x01');
  Sec_Eng_PKA_Move_Data('\b','\x02','\b','\x01','\0');
  Sec_Eng_PKA_Move_Data('\b','\x01','\b','\x04','\x01');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\x04',(uint32_t *)"",0x40,'\0');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\x05',(uint32_t *)0x23083ac4,0x40,'\0');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\x06',(uint32_t *)0x23083ac4,0x40,'\0');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\a',(uint32_t *)0x2308341c,0x40,'\0');
  Sec_Eng_PKA_LMUL('\b','\b','\b','\0','\b','\x05','\0');
  Sec_Eng_PKA_LSUB('\b','\b','\b','\x04','\b','\b','\0');
  Sec_Eng_PKA_LMUL('\b','\t','\b','\0','\b','\a','\0');
  Sec_Eng_PKA_LSUB('\b','\t','\b','\x06','\b','\t','\0');
  Sec_Eng_PKA_Move_Data('\b','\x04','\b','\x05','\0');
  Sec_Eng_PKA_Move_Data('\b','\x05','\b','\b','\0');
  Sec_Eng_PKA_Move_Data('\b','\x06','\b','\a','\0');
  Sec_Eng_PKA_Move_Data('\b','\a','\b','\t','\x01');
  while (uStack273 == '\0') {
    Sec_Eng_PKA_LDIV('\b','\0','\b','\x02','\b','\x01','\0');
    Sec_Eng_PKA_MREM('\b','\x03','\b','\x02','\b','\x01','\0');
    Sec_Eng_PKA_LMUL('\b','\b','\b','\0','\b','\x05','\0');
    Sec_Eng_PKA_LSUB('\b','\b','\b','\x04','\b','\b','\0');
    Sec_Eng_PKA_LMUL('\b','\t','\b','\0','\b','\a','\0');
    Sec_Eng_PKA_LSUB('\b','\t','\b','\x06','\b','\t','\0');
    Sec_Eng_PKA_Move_Data('\b','\x02','\b','\x01','\0');
    Sec_Eng_PKA_Move_Data('\b','\x04','\b','\x05','\0');
    Sec_Eng_PKA_Move_Data('\b','\x05','\b','\b','\0');
    Sec_Eng_PKA_Move_Data('\b','\x06','\b','\a','\0');
    Sec_Eng_PKA_Move_Data('\b','\a','\b','\t','\x01');
    Sec_Eng_PKA_Move_Data('\b','\x01','\b','\x03','\x01');
    Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\n',(uint32_t *)0x23083ac4,0x40,'\0');
    Sec_Eng_PKA_LCMP(&uStack273,'\b','\x01','\b','\n');
  }
  Sec_Eng_PKA_Read_Data(SEC_ENG_PKA_REG_SIZE_256,'\x06',(uint32_t *)auStack272,'@');
  _dump_rsa_data(auStack272,0x100);
  return;
}



