pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void _pka_test_case2(uint8_t param_1)

{
  bool bVar1;
  uint8_t encrypted [256];
  uint8_t inv_r [256];
  uint8_t m [256];
  uint8_t n [256];
  uint8_t nprime [256];
  uint8_t "" [4];
  uint32_t *puVar2;
  uint8_t *puVar3;
  char *format;
  undefined *puVar4;
  undefined4 uVar5;
  int iVar6;
  uint32_t local_130;
  uint32_t result [64];
  
  Sec_Eng_PKA_Reset();
  Sec_Eng_PKA_BigEndian_Enable();
  Sec_Eng_PKA_Write_Data
            (SEC_ENG_PKA_REG_SIZE_256,'\0',(uint32_t *)(uint8_t *)&ram0x230838c4,0x40,'\0');
  Sec_Eng_PKA_Write_Data
            (SEC_ENG_PKA_REG_SIZE_256,'\x01',(uint32_t *)(uint8_t *)&ram0x23083bc4,0x40,'\0');
  Sec_Eng_PKA_Write_Data
            (SEC_ENG_PKA_REG_SIZE_256,'\x02',(uint32_t *)(uint8_t *)0x230837c4,0x40,'\0');
  Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_256,'\x03',(uint32_t *)"",1,'\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x04','\0','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x05','\0','\x01');
  Sec_Eng_PKA_LMUL2N('\n','\x02','\b','\x02',0x800,'\0');
  Sec_Eng_PKA_MREM('\b','\x02','\n','\x02','\b','\0','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_512,'\x02','\0','\x01');
  Sec_Eng_PKA_MEXP('\b','\x04','\b','\x02','\b','\x03','\b','\0',DAT_00000010);
  Sec_Eng_PKA_Move_Data('\b','\x02','\b','\x04','\x01');
  Sec_Eng_PKA_Write_Data
            (SEC_ENG_PKA_REG_SIZE_256,'\x01',(uint32_t *)(uint8_t *)&ram0x230836c4,0x40,'\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x04','\0','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_256,'\x05','\0','\x01');
  Sec_Eng_PKA_LMUL('\n','\x02','\b','\x02','\b','\x01','\0');
  Sec_Eng_PKA_MREM('\b','\x02','\n','\x02','\b','\0','\0');
  Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_512,'\x02','\0','\x01');
  Sec_Eng_PKA_Read_Data(SEC_ENG_PKA_REG_SIZE_256,'\x02',&local_130,'@');
  _dump_rsa_data((uint8_t *)&local_130,0x100);
  puVar2 = &local_130;
  puVar3 = &ram0x230835c4;
  bVar1 = false;
  iVar6 = 0;
  while (iVar6 != 0x100) {
    if (((*(uint8_t *)puVar2 != *puVar3) && (bVar1 = true, _fsymc_level_hal_drv < BLOG_LEVEL_WARN))
       && (_fsymf_level_hal_drvbl_sec < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      puVar4 = (undefined *)0x2307b100;
      if (*(uint8_t *)puVar2 != *puVar3) {
        puVar4 = &UNK_23083384;
      }
      bl_printk("[%10u][%s: %s:%4d] %s[%02d], %02x %02x\r\n",&DAT_2307f16c,"bl_sec.c",0xf9,puVar4,
                iVar6);
      bVar1 = true;
    }
    iVar6 = iVar6 + 1;
    puVar2 = (uint32_t *)((int)puVar2 + 1);
    puVar3 = puVar3 + 1;
  }
  if (bVar1) {
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_sec) {
      return;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar5 = 0xfd;
    puVar4 = &DAT_23072bcc;
    format = "[%10u][%s: %s:%4d] ====== Failed %lu Bytes======\r\n";
  }
  else {
    if (BLOG_LEVEL_INFO < _fsymc_level_hal_drv) {
      return;
    }
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_sec) {
      return;
    }
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    uVar5 = 0xff;
    puVar4 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %lu Bytes=====\r\n";
  }
  bl_printk(format,puVar4,"bl_sec.c",uVar5,0x100);
  return;
}



int bl_pka_test(void)

{
  bl_irq_register(0x1b,bl_sec_pka_IRQHandler);
  bl_irq_enable(0x1b);
  _pka_test_case2();
  _pka_test_case_xgcd();
  _pka_test_case2();
  return 0;
}



void int_timer_cb(void)

{
  BaseType_t BVar1;
  
  TIMER_ClearIntStatus(TIMER_CH1,TIMER_COMP_ID_0);
  BVar1 = xTaskIncrementTick();
  if (BVar1 != 0) {
    vTaskSwitchContext();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t bl_timer_now_us(void)

{
  uint32_t uVar1;
  
  uVar1 = _DAT_0200bff8;
  __udivdi3();
  return uVar1;
}



int bl_timer_tick_enable(void)

{
  TIMER_Chan_Type aTStack40 [4];
  TIMER_CFG_Type timerCh1Cfg;
  
  memcpy(aTStack40,&DAT_23083d64,0x18);
  TIMER_IntMask(TIMER_CH1,TIMER_INT_ALL,MASK);
  TIMER_Disable(aTStack40[0]);
  TIMER_Init((TIMER_CFG_Type *)aTStack40);
  TIMER_ClearIntStatus(aTStack40[0],TIMER_COMP_ID_0);
  TIMER_ClearIntStatus(aTStack40[0],TIMER_COMP_ID_1);
  TIMER_ClearIntStatus(aTStack40[0],TIMER_COMP_ID_2);
  TIMER_IntMask(aTStack40[0],TIMER_INT_COMP_0,UNMASK);
  TIMER_IntMask(aTStack40[0],TIMER_INT_COMP_1,MASK);
  TIMER_IntMask(aTStack40[0],TIMER_INT_COMP_2,MASK);
  TIMER_Enable(aTStack40[0]);
  bl_irq_enable(0x35);
  bl_irq_register(0x35,int_timer_cb);
  return 0;
}



// WARNING: Variable defined which should be unmapped: val

void cmd_gpio_get(char *buf,int len,int argc,char **argv)

{
  TickType_t TVar1;
  int iVar2;
  int iVar3;
  undefined *puVar4;
  uint8_t auStack17 [4];
  uint8_t val;
  
  if (argc == 2) {
    iVar2 = atoi(argv[1]);
    if (iVar2 < 0) {
      puts("Illegal arg\r\n");
    }
    else {
      iVar3 = bl_gpio_input_get((uint8_t)iVar2,auStack17);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar1 = xTaskGetTickCount();
        }
        else {
          TVar1 = xTaskGetTickCountFromISR();
        }
        if (iVar3 == 0) {
          if (auStack17[0] == '\0') {
            puVar4 = &UNK_23083e38;
          }
          else {
            puVar4 = &UNK_23083e30;
          }
        }
        else {
          puVar4 = &UNK_23083e2c;
        }
        bl_printk("[%10u][%s: %s:%4d] GPIO%d val is %s\r\n",TVar1,&DAT_2307f16c,"bl_gpio_cli.c",0x72
                  ,iVar2,puVar4);
      }
    }
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Usage: %s 24\r\n  get GPIO24 value\r\n",TVar1,&DAT_2307f16c,
                "bl_gpio_cli.c",0x66,*argv);
    }
  }
  return;
}



void cmd_gpio_set(char *buf,int len,int argc,char **argv)

{
  TickType_t TVar1;
  int iVar2;
  int iVar3;
  undefined *puVar4;
  
  if (argc == 3) {
    iVar2 = atoi(argv[1]);
    iVar3 = atoi(argv[2]);
    if ((-1 < iVar2) && (-1 < iVar3)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar1 = xTaskGetTickCount();
        }
        else {
          TVar1 = xTaskGetTickCountFromISR();
        }
        if (iVar3 == 0) {
          puVar4 = &UNK_23083ebc;
        }
        else {
          puVar4 = &UNK_23083e30;
        }
        bl_printk("[%10u][%s: %s:%4d] GPIO%d is set to %s\r\n",TVar1,&DAT_2307f16c,"bl_gpio_cli.c",
                  0x59,iVar2,puVar4);
      }
      bl_gpio_output_set((uint8_t)iVar2,iVar3 != 0);
      return;
    }
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Illegal arg\r\n",TVar1,&DAT_23072bcc,"bl_gpio_cli.c",0x53);
      return;
    }
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Usage: %s 24 1\r\n  set GPIO24 output to high\r\n",TVar1,
                &DAT_2307f16c,"bl_gpio_cli.c",0x4d,*argv);
      return;
    }
  }
  return;
}



