pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void cmd_gpio_func(char *buf,int len,int argc,char **argv)

{
  TickType_t TVar1;
  int iVar2;
  int iVar3;
  int iVar4;
  int iVar5;
  char *pcVar6;
  char *pcVar7;
  
  if (argc == 5) {
    iVar2 = atoi(argv[1]);
    iVar3 = atoi(argv[2]);
    iVar4 = atoi(argv[3]);
    iVar5 = atoi(argv[4]);
    if ((((-1 < iVar2) && (-1 < iVar3)) && (-1 < iVar4)) && (-1 < iVar5)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar1 = xTaskGetTickCount();
        }
        else {
          TVar1 = xTaskGetTickCountFromISR();
        }
        if (iVar3 == 0) {
          pcVar6 = "output";
        }
        else {
          pcVar6 = "input";
        }
        if (iVar4 == 0) {
          pcVar7 = "null";
        }
        else {
          pcVar7 = "Active";
        }
        bl_printk("[%10u][%s: %s:%4d] GPIO%d is set %s with %s pullup %s pulldown\r\n",TVar1,
                  &DAT_2307f16c,"bl_gpio_cli.c",0x3e,iVar2,pcVar6,pcVar7);
      }
      if (iVar3 != 0) {
        bl_gpio_enable_input((uint8_t)iVar2,iVar4 != 0,iVar5 != 0);
        return;
      }
      bl_gpio_enable_output((uint8_t)iVar2,iVar4 != 0,iVar5 != 0);
      return;
    }
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Illegal arg\r\n",TVar1,&DAT_23072bcc,"bl_gpio_cli.c",0x36);
      return;
    }
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvbl_gpio_cli < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar1 = xTaskGetTickCount();
      }
      else {
        TVar1 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Usage: %s 24 1 1 0\r\n  set GPIO24 to input with pullup\r\n",
                TVar1,&DAT_2307f16c,"bl_gpio_cli.c",0x2e,*argv);
      return;
    }
  }
  return;
}



int bl_gpio_cli_init(void)

{
  return 0;
}



int bl_efuse_read_mac(uint8_t *mac)

{
  EF_Ctrl_Read_MAC_Address(mac);
  return 0;
}



int bl_efuse_read_mac_factory(uint8_t *mac)

{
  int8_t iVar1;
  undefined3 extraout_var;
  
  iVar1 = mfg_media_read_macaddr(mac,'\x01');
  return -(uint)(CONCAT31(extraout_var,iVar1) != 0);
}



int bl_efuse_read_capcode(uint8_t *capcode)

{
  int8_t iVar1;
  undefined3 extraout_var;
  
  iVar1 = mfg_media_read_xtal_capcode(capcode,'\x01');
  return -(uint)(CONCAT31(extraout_var,iVar1) != 0);
}



int bl_efuse_read_pwroft(int8_t *poweroffset)

{
  int8_t iVar1;
  undefined3 extraout_var;
  
  iVar1 = mfg_media_read_poweroffset(poweroffset,'\x01');
  return -(uint)(CONCAT31(extraout_var,iVar1) != 0);
}



void Aes_Compare_Data(uint8_t *expected,uint8_t *input,uint32_t len)

{
  bool bVar1;
  uint32_t uVar2;
  TickType_t TVar3;
  char *format;
  undefined *puVar4;
  undefined4 uVar5;
  
  bVar1 = false;
  uVar2 = 0;
  while (uVar2 != len) {
    if (((input[uVar2] != expected[uVar2]) && (bVar1 = true, _fsymc_level_hal_drv < BLOG_LEVEL_WARN)
        ) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      puVar4 = (undefined *)0x2307b100;
      if (input[uVar2] != expected[uVar2]) {
        puVar4 = &UNK_23083384;
      }
      bl_printk("[%10u][%s: %s:%4d] %s[%02d], %02x %02x\r\n",TVar3,&DAT_2307f16c,"bl_sec_aes.c",0x3b
                ,puVar4,uVar2);
      bVar1 = true;
    }
    uVar2 = uVar2 + 1;
  }
  if (bVar1) {
    if ((BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) ||
       (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvbl_sec_aes)) {
      return;
    }
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar5 = 0x3f;
    puVar4 = &DAT_23072bcc;
    format = "[%10u][%s: %s:%4d] ====== Failed %lu Bytes======\r\n";
  }
  else {
    if (BLOG_LEVEL_INFO < _fsymc_level_hal_drv) {
      return;
    }
    if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvbl_sec_aes) {
      return;
    }
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar5 = 0x41;
    puVar4 = &DAT_2307f16c;
    format = "[%10u][%s: %s:%4d] ====== Success %lu Bytes=====\r\n";
  }
  bl_printk(format,TVar3,puVar4,"bl_sec_aes.c",uVar5,len);
  return;
}



void _dump_iv_status(SEC_Eng_AES_Link_Config_Type_conflict1 *linkCfg)

{
  byte bVar1;
  uint32_t *puVar2;
  
  puVar2 = &linkCfg->aesIV0;
  do {
    bVar1 = *(byte *)puVar2;
    puVar2 = (uint32_t *)((int)puVar2 + 1);
    bl_printk("%02x",(uint)bVar1);
  } while (puVar2 != &linkCfg->aesKey0);
  bl_printk("\r\n");
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl_sec_aes_IRQHandler(void)

{
  bl_printk("--->>> AES IRQ\r\n");
  _DAT_40004100 = _DAT_40004100 | 0x200;
  return;
}



// WARNING: Could not reconcile some variable overlaps

void Sec_Eng_AES_Link_Case_CBC_128(SEC_ENG_AES_ID_Type aesId)

{
  uint8_t aesResult_entrypted_cbc_128 [64];
  TickType_t TVar1;
  uint8_t auStack124 [4];
  uint8_t aesDstBuf [32];
  SEC_Eng_AES_Link_Config_Type_conflict1 linkCfg;
  
  memset(aesDstBuf + 0x1c,0,0x3c);
  aesDstBuf._28_4_ = 0x12400;
  Sec_Eng_AES_Enable_Link(aesId);
  puts("[CBC] AES-128-CBC case...\r\n");
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CBC] IV Status Initial, %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0x84,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data,0x20,auStack124);
  Aes_Compare_Data((uint8_t *)&ram0x23084198,(uint8_t *)linkCfg.aesSrcAddr,0x20);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CBC] IV Status After, %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0x88,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x20,0x10,auStack124);
  Aes_Compare_Data((uint8_t *)0x230841b8,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CBC] IV Status After %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0x8d,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x30,0x10,auStack124);
  Aes_Compare_Data((uint8_t *)0x230841c8,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CBC] IV Status After, %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0x92,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Disable_Link(aesId);
  return;
}



