pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

void Sec_Eng_AES_Link_Case_CTR_128(SEC_ENG_AES_ID_Type aesId)

{
  uint8_t aesResult_entrypted_ctr_128 [64];
  TickType_t TVar1;
  uint8_t auStack124 [4];
  uint8_t aesDstBuf [32];
  SEC_Eng_AES_Link_Config_Type_conflict1 linkCfg;
  
  memset(aesDstBuf + 0x1c,0,0x3c);
  aesDstBuf._28_4_ = 0x11400;
  Sec_Eng_AES_Enable_Link(aesId);
  puts("[CTR] AES-128-CTR case...\r\n");
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CTR] IV Status Initial, %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0xbe,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data,0x20,auStack124);
  Aes_Compare_Data((uint8_t *)&ram0x230841d8,(uint8_t *)linkCfg.aesSrcAddr,0x20);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CTR] IV Status After %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0xc4,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x20,0x10,auStack124);
  Aes_Compare_Data((uint8_t *)0x230841f8,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CTR] IV Status After %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0xc9,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x30,0x10,auStack124);
  Aes_Compare_Data((uint8_t *)0x23084208,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_sec_aes < BLOG_LEVEL_WARN)
     ) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [CTR] IV Status After, %08lx\r\n",TVar1,&DAT_2307f16c,
              "bl_sec_aes.c",0xce,linkCfg._0_4_);
  }
  _dump_iv_status((SEC_Eng_AES_Link_Config_Type_conflict1 *)(aesDstBuf + 0x1c));
  Sec_Eng_AES_Disable_Link(aesId);
  return;
}



// WARNING: Variable defined which should be unmapped: linkCfg
// WARNING: Could not reconcile some variable overlaps

void Sec_Eng_AES_Link_Case_ECB_128(SEC_ENG_AES_ID_Type aesId)

{
  uint8_t aesResult_entrypted_ecb_128 [64];
  uint8_t auStack108 [4];
  uint8_t aesDstBuf [32];
  SEC_Eng_AES_Link_Config_Type_conflict1 linkCfg;
  
  memset(aesDstBuf + 0x1c,0,0x3c);
  aesDstBuf._28_4_ = 0x10400;
  puts("[ECB] AES-128-ECB case...\r\n");
  Sec_Eng_AES_Enable_Link(aesId);
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data,0x20,auStack108);
  Aes_Compare_Data((uint8_t *)&ram0x23084218,(uint8_t *)linkCfg.aesSrcAddr,0x20);
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x20,0x10,auStack108);
  Aes_Compare_Data((uint8_t *)0x23084238,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  Sec_Eng_AES_Link_Work(aesId,(uint32_t)(aesDstBuf + 0x1c),aesSrcBuf_data + 0x30,0x10,auStack108);
  Aes_Compare_Data((uint8_t *)0x23084248,(uint8_t *)linkCfg.aesSrcAddr,0x10);
  Sec_Eng_AES_Disable_Link(aesId);
  return;
}



int bl_sec_aes_test(void)

{
  bl_irq_register(0x1d,bl_sec_aes_IRQHandler);
  bl_irq_enable(0x1d);
  bl_printk(
           "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n"
           );
  Sec_Eng_AES_Link_Case_CBC_128(SEC_ENG_AES_ID0);
  bl_printk(
           "####################################################################################\r\n"
           );
  Sec_Eng_AES_Link_Case_CTR_128(SEC_ENG_AES_ID0);
  bl_printk(
           "####################################################################################\r\n"
           );
  Sec_Eng_AES_Link_Case_ECB_128(SEC_ENG_AES_ID0);
  bl_printk(
           "------------------------------------------------------------------------------------\r\n"
           );
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl_sec_sha_IRQHandler(void)

{
  puts("--->>> SHA IRQ\r\n");
  _DAT_40004000 = _DAT_40004000 | 0x200;
  return;
}



int bl_sha_mutex_take(void)

{
  BaseType_t BVar1;
  TickType_t TVar2;
  int iVar3;
  
  BVar1 = xQueueSemaphoreTake((QueueHandle_t)g_bl_sec_sha_mutex,0xffffffff);
  iVar3 = 0;
  if (((BVar1 != 1) && (iVar3 = -1, _fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
     (_fsymf_level_hal_drvbl_sec_sha < BLOG_LEVEL_ASSERT)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] sha semphr take failed\r\n",TVar2,&DAT_23072bcc,"bl_sec_sha.c",
              0x36);
    iVar3 = -1;
  }
  return iVar3;
}



int bl_sha_mutex_give(void)

{
  BaseType_t BVar1;
  TickType_t TVar2;
  int iVar3;
  
  BVar1 = xQueueGenericSend((QueueHandle_t)g_bl_sec_sha_mutex,(void *)0x0,0,0);
  iVar3 = 0;
  if (((BVar1 != 1) && (iVar3 = -1, _fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
     (_fsymf_level_hal_drvbl_sec_sha < BLOG_LEVEL_ASSERT)) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] sha semphr give failed\\n",TVar2,&DAT_23072bcc,"bl_sec_sha.c",0x3f
             );
    iVar3 = -1;
  }
  return iVar3;
}



void bl_sha_init(bl_sha_ctx_t *ctx,bl_sha_type_t type)

{
  Sec_Eng_SHA256_Init((SEC_Eng_SHA256_Ctx *)ctx,SEC_ENG_SHA_ID0,type,ctx->tmp,ctx->pad);
  Sec_Eng_SHA_Start(SEC_ENG_SHA_ID0);
  return;
}



int bl_sha_update(bl_sha_ctx_t *ctx,uint8_t *input,uint32_t len)

{
  BL_Err_Type BVar1;
  undefined3 extraout_var;
  
