pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  BVar1 = Sec_Eng_SHA256_Update((SEC_Eng_SHA256_Ctx *)ctx,SEC_ENG_SHA_ID0,input,len);
  return CONCAT31(extraout_var,BVar1);
}



int bl_sha_finish(bl_sha_ctx_t *ctx,uint8_t *hash)

{
  BL_Err_Type BVar1;
  undefined3 extraout_var;
  
  BVar1 = Sec_Eng_SHA256_Finish((SEC_Eng_SHA256_Ctx *)ctx,SEC_ENG_SHA_ID0,hash);
  return CONCAT31(extraout_var,BVar1);
}



// WARNING: Could not reconcile some variable overlaps

void sha256_test_case0(void)

{
  uint8_t sha256_test_result [32];
  undefined *puVar1;
  int iVar2;
  char *format;
  bool bVar3;
  undefined auStack220 [4];
  sha256_link_item_t sha256_link;
  
  memset(auStack220,0,0xbc);
  sha256_link.ctx.linkAddr = 0x10400;
  sha256_link.linkCfg._0_4_ = 0x50020000;
  bl_irq_register(0x1e,bl_sec_sha_IRQHandler);
  bl_irq_enable(0x1e);
  Sec_Eng_SHA_Enable_Link(SEC_ENG_SHA_ID0);
  Sec_Eng_SHA256_Link_Init
            ((SEC_Eng_SHA256_Link_Ctx *)auStack220,SEC_ENG_SHA_ID0,
             (uint32_t)&sha256_link.ctx.linkAddr,sha256_link.linkCfg.result + 7,
             sha256_link.tmp + 0xf);
  Sec_Eng_SHA256_Link_Update
            ((SEC_Eng_SHA256_Link_Ctx *)auStack220,SEC_ENG_SHA_ID0,
             "1111111111111111111111111111111111111111111111111111111111111111hal_drv.bl_sec_sha",
             0x40);
  Sec_Eng_SHA256_Link_Finish
            ((SEC_Eng_SHA256_Link_Ctx *)auStack220,SEC_ENG_SHA_ID0,
             (uint8_t *)&sha256_link.linkCfg.shaSrcAddr);
  Sec_Eng_SHA_Disable_Link(SEC_ENG_SHA_ID0);
  puVar1 = auStack220;
  bVar3 = false;
  iVar2 = 0;
  do {
    if (((uint8_t *)&ram0x2308449c)[iVar2] != puVar1[0x1c]) {
      bl_printk("%s[%02d], %02x %02x\r\n",&UNK_23083384,iVar2);
      bVar3 = true;
    }
    iVar2 = iVar2 + 1;
    puVar1 = puVar1 + 1;
  } while (iVar2 != 0x20);
  if (bVar3) {
    format = "====== Failed %lu Bytes======\r\n";
  }
  else {
    format = "====== Success %lu Bytes=====\r\n";
  }
  bl_printk(format);
  return;
}



int bl_sec_sha_test(void)

{
  puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n");
  puts("^^^^^^^^^^^^^^^^^^^^^^^SHA256 TEST CASE^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n");
  sha256_test_case0();
  puts("------------------------------------------------------------------------------------\r\n");
  return 0;
}



int bl_wifi_clock_enable(void)

{
  int called;
  
  return 0;
}



int bl_wifi_enable_irq(void)

{
  bl_irq_register(0x46,mac_irq);
  bl_irq_register(0x4f,bl_irq_handler);
  bl_irq_enable(0x46);
  bl_irq_enable(0x4f);
  puts("Enable BMX IRQ\r\n");
  return 0;
}



int bl_wifi_sta_mac_addr_set(uint8_t *mac)

{
  memcpy(&wifi_env,mac,6);
  return 0;
}



int bl_wifi_ap_mac_addr_set(uint8_t *mac)

{
  memcpy(wifi_env.ap_mac_addr_board,mac,6);
  return 0;
}



int bl_wifi_mac_addr_get(uint8_t *mac)

{
  memcpy(mac,&wifi_env,6);
  return 0;
}



int bl_wifi_country_code_set(uint8_t country_code)

{
  wifi_env.country_code = country_code;
  return 0;
}



int bl_wifi_ap_info_set(uint8_t *ssid,uint8_t ssid_len,uint8_t *psk,uint8_t psk_len,uint8_t chan)

{
  undefined3 in_register_0000202d;
  undefined3 in_register_00002035;
  
  memset(&wifi_env.ap_info,0,99);
  memcpy(&wifi_env.ap_info,ssid,CONCAT31(in_register_0000202d,ssid_len));
  memcpy(wifi_env.ap_info.psk,psk,CONCAT31(in_register_00002035,psk_len));
  wifi_env.ap_info.chan = chan;
  wifi_env.ap_info_en = '\x01';
  return 0;
}



int bl_wifi_sta_info_set
              (uint8_t *ssid,uint8_t ssid_len,uint8_t *psk,uint8_t psk_len,int autoconnect)

{
  undefined3 in_register_0000202d;
  undefined3 in_register_00002035;
  
  memset(&wifi_env.sta_info,0,99);
  memcpy(&wifi_env.sta_info,ssid,CONCAT31(in_register_0000202d,ssid_len));
  memcpy(wifi_env.sta_info.psk,psk,CONCAT31(in_register_00002035,psk_len));
  wifi_env.sta_info_en = (uint8_t)autoconnect;
  return 0;
}



int bl_wifi_sta_info_get(bl_wifi_ap_info_t *sta_info)

{
  if (wifi_env.sta_info_en == '\x01') {
    memcpy(sta_info,&wifi_env.sta_info,99);
    return 0;
  }
  return -1;
}



int cmd_timer_start(void)

{
  TIMER_CFG_Type TStack40;
  
  memcpy(&TStack40,&DAT_23083d64,0x18);
  TIMER_IntMask(TIMER_CH1,TIMER_INT_ALL,MASK);
  TIMER_Disable(TStack40.timerCh);
  TIMER_Init(&TStack40);
  TIMER_ClearIntStatus(TStack40.timerCh,TIMER_COMP_ID_0);
  TIMER_ClearIntStatus(TStack40.timerCh,TIMER_COMP_ID_1);
  TIMER_ClearIntStatus(TStack40.timerCh,TIMER_COMP_ID_2);
  TIMER_IntMask(TStack40.timerCh,TIMER_INT_COMP_0,UNMASK);
  TIMER_IntMask(TStack40.timerCh,TIMER_INT_COMP_1,MASK);
  TIMER_IntMask(TStack40.timerCh,TIMER_INT_COMP_2,MASK);
  TIMER_Enable(TStack40.timerCh);
  bl_irq_enable(0x35);
  bl_irq_register(0x35,int_timer_cb);
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void cmd_wdt_disable(void)

{
  _DAT_4000a564 = _DAT_4000a564 & 0xfffffffe;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void cmd_wdt_feed(void)

{
  _DAT_4000a598 = _DAT_4000a598 | 1;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



void cmd_wdt_init(int param_1,undefined4 *param_2)

{
  int ms;
  
  if (param_1 != 2) {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] Usage: %s ms\r\n",&DAT_2307f16c,"bl_wdt_cli.c",0x2a,*param_2);
    return;
  }
  ms = atoi((char *)param_2[1]);
  if (TrapNetCounter == 0) {
    xTaskGetTickCount();
  }
  else {
    xTaskGetTickCountFromISR();
  }
  bl_printk("[%10u][%s: %s:%4d] Init WDT with %dms\r\n",&DAT_2307f16c,"bl_wdt_cli.c",0x2e,ms);
  if (0 < ms) {
    bl_wdt_init(ms);
    return;
  }
  return;
}



int bl_wdt_cli_init(void)

{
  return 0;
}



uint32_t fdt32_to_cpu(fdt32_t x)

{
  return (x >> 0x10 & 0xff) << 8 | x << 0x18 | x >> 0x18 | (x >> 8 & 0xff) << 0x10;
}



