pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int dev_uart_init(uint8_t id,char *path,uint32_t rx_buf_size,uint32_t tx_buf_size)

{
  uart_dev_t **ppuVar1;
  undefined3 in_register_00002029;
  uint uVar2;
  TickType_t TVar3;
  char *format;
  void *pvVar4;
  int iVar5;
  undefined4 uVar6;
  uart_dev_t *__s;
  
  uVar2 = CONCAT31(in_register_00002029,id);
  if ((uVar2 < 3) && (path != (char *)0x0)) {
    if (uVar2 == 0) {
      ppuVar1 = &dev_uart0;
      __s = dev_uart0;
    }
    else {
      if (uVar2 != 1) {
        if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
          return -1;
        }
        if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_uart) {
          return -1;
        }
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        uVar6 = 0x74;
        format = "[%10u][%s: %s:%4d] err.\r\n";
        goto LAB_23035abc;
      }
      ppuVar1 = &dev_uart1;
      __s = dev_uart1;
    }
    if (__s == (uart_dev_t *)0x0) {
      __s = (uart_dev_t *)pvPortMalloc(0x3c);
      *ppuVar1 = __s;
      if (__s == (uart_dev_t *)0x0) {
        if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
          return -1;
        }
        if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_uart) {
          return -1;
        }
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        uVar6 = 0x3c;
      }
      else {
        memset(__s,0,0x3c);
        (*ppuVar1)->read_block_flag = '\x02';
        (*ppuVar1)->priv = (void *)0x0;
        __s = *ppuVar1;
        pvVar4 = pvPortMalloc(4);
        __s->priv = pvVar4;
        if ((*ppuVar1)->priv != (void *)0x0) {
          memset((*ppuVar1)->priv,0,4);
          (*ppuVar1)->rx_buf_size = rx_buf_size;
          (*ppuVar1)->tx_buf_size = tx_buf_size;
          if (*ppuVar1 == (uart_dev_t *)0x0) {
            if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
               (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_ASSERT)) {
              if (TrapNetCounter == 0) {
                TVar3 = xTaskGetTickCount();
              }
              else {
                TVar3 = xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] mem err.\r\n",TVar3,&DAT_23072bcc,"hal_uart.c",0x50);
            }
          }
          else {
            (*ppuVar1)->port = id;
            (*ppuVar1)->read_block_flag = '\x02';
            ((*ppuVar1)->config).baud_rate = 0x1c200;
            ((*ppuVar1)->config).data_width = DATA_WIDTH_8BIT;
            ((*ppuVar1)->config).parity = NO_PARITY;
            ((*ppuVar1)->config).stop_bits = STOP_BITS_1;
            ((*ppuVar1)->config).flow_control = FLOW_CONTROL_DISABLED;
            ((*ppuVar1)->config).mode = MODE_TX_RX;
          }
          iVar5 = aos_register_driver(path,(file_ops_t *)&uart_ops,*ppuVar1);
          return iVar5;
        }
        if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
          return -1;
        }
        if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_uart) {
          return -1;
        }
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        uVar6 = 0x45;
      }
      format = "[%10u][%s: %s:%4d] mem err.\r\n";
      goto LAB_23035abc;
    }
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return -1;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_uart) {
      return -1;
    }
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar6 = 0x36;
  }
  else {
    if (BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) {
      return -1;
    }
    if (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_uart) {
      return -1;
    }
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar6 = 0x65;
  }
  format = "[%10u][%s: %s:%4d] arg err.\r\n";
LAB_23035abc:
  bl_printk(format,TVar3,&DAT_23072bcc,"hal_uart.c",uVar6);
  return -1;
}



int32_t hal_uart_send_trigger(uart_dev_t *uart)

{
  bl_uart_int_tx_enable(uart->port);
  return 0;
}



int32_t hal_uart_send_trigger_off(uart_dev_t *uart)

{
  bl_uart_int_tx_disable(uart->port);
  return 0;
}



int32_t hal_uart_init(uart_dev_t *uart)

{
  int iVar1;
  int iVar2;
  hal_uart_parity_t ahStack17 [4];
  uint8_t parity;
  
  iVar2 = aos_mutex_new((aos_mutex_t *)uart->priv);
  iVar1 = -1;
  if (iVar2 == 0) {
    bl_uart_getdefconfig(uart->port,ahStack17);
    if (ahStack17[0] == NO_PARITY) {
      (uart->config).parity = NO_PARITY;
    }
    else {
      if (ahStack17[0] != ODD_PARITY) {
        ahStack17[0] = EVEN_PARITY;
      }
      (uart->config).parity = ahStack17[0];
    }
    bl_uart_int_enable(uart->port);
    iVar1 = iVar2;
  }
  return iVar1;
}



int32_t hal_uart_recv_II(uart_dev_t *uart,void *data,uint32_t expect_size,uint32_t *recv_size,
                        uint32_t timeout)

{
  uint32_t uVar1;
  int iVar2;
  
  uVar1 = 0;
  while (uVar1 != expect_size) {
    iVar2 = bl_uart_data_recv(uart->port);
    if (iVar2 < 0) break;
    *(undefined *)((int)data + uVar1) = (char)iVar2;
    uVar1 = uVar1 + 1;
  }
  *recv_size = uVar1;
  return 0;
}



int32_t hal_uart_send(uart_dev_t *uart,void *data,uint32_t size,uint32_t timeout)

{
  uint8_t data_00;
  uint8_t *puVar1;
  
  puVar1 = (uint8_t *)((int)data + size);
  while ((uint8_t *)data != puVar1) {
    data_00 = *(uint8_t *)data;
    data = (uint8_t *)data + 1;
    bl_uart_data_send(uart->port,data_00);
  }
  return 0;
}



int32_t hal_uart_finalize(uart_dev_t *uart)

{
  aos_mutex_t *mutex;
  
  mutex = (aos_mutex_t *)uart->priv;
  bl_uart_int_disable(uart->port);
  aos_mutex_free(mutex);
  return 0;
}



