pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int32_t hal_uart_notify_register(uart_dev_t *uart,hal_uart_int_t type,anon_subr_void_void_ptr *cb)

{
  undefined3 in_register_0000202d;
  
  if (CONCAT31(in_register_0000202d,type) == 0) {
    bl_uart_int_tx_notify_register(uart->port,(cb_uart_notify_t *)cb,uart);
  }
  else {
    if (CONCAT31(in_register_0000202d,type) != 1) {
      return -1;
    }
    bl_uart_int_rx_notify_register(uart->port,(cb_uart_notify_t *)cb,uart);
  }
  return 0;
}



undefined4 vfs_uart_init(void *param_1,int param_2)

{
  int nodeoffset;
  char *property;
  int nodeoffset_00;
  TickType_t TVar1;
  fdt32_t *pfVar2;
  uint32_t baudrate;
  uint32_t uVar3;
  int iVar4;
  char *__s2;
  uint32_t uVar5;
  undefined4 uVar6;
  int iVar7;
  char *name;
  fdt32_t x;
  fdt32_t x_00;
  char **ppcVar8;
  uint32_t rx_buf_size;
  uint32_t tx_buf_size;
  fdt32_t x_01;
  uint8_t uStack152;
  char **ppcStack148;
  uint local_7c;
  char *pcStack120;
  char *pcStack116;
  char *local_70;
  undefined4 uStack108;
  byte bStack104;
  uint8_t uStack92;
  uint8_t uStack80;
  uint8_t uStack68;
  char *apcStack64 [3];
  
  if (inited == '\x01') {
    return 0;
  }
  pcStack120 = "uart@4000A000";
  pcStack116 = "uart@4000A100";
  local_7c = 0;
  memcpy(&local_70,&PTR_DAT_230845d0,0x30);
  ppcStack148 = &pcStack120;
  iVar7 = 0;
  do {
    name = *ppcStack148;
    nodeoffset = fdt_subnode_offset(param_1,param_2,name);
    if (nodeoffset < 1) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        uVar6 = 300;
        goto LAB_23035e5a;
      }
    }
    else {
      name = (char *)fdt_stringlist_count(param_1,nodeoffset,"status");
      if (name == (char *)0x1) {
        name = fdt_stringlist_get(param_1,nodeoffset,"status",0,(int *)&local_7c);
        if ((local_7c == 4) && (nodeoffset_00 = memcmp(&DAT_23084714,name,4), nodeoffset_00 == 0)) {
          name = (char *)fdt_stringlist_count(param_1,nodeoffset,"path");
          if (name == (char *)0x1) {
            name = fdt_stringlist_get(param_1,nodeoffset,"path",0,(int *)&local_7c);
            if (((0x20 < local_7c) && (_fsymc_level_hal_drv < BLOG_LEVEL_WARN)) &&
               (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
              if (TrapNetCounter == 0) {
                TVar1 = xTaskGetTickCount();
              }
              else {
                TVar1 = xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] uart[%d] path lentmp = %d\r\n",TVar1,&DAT_2307f16c,
                        "hal_uart.c",0x144,iVar7,local_7c);
            }
            pfVar2 = (fdt32_t *)fdt_getprop(param_1,nodeoffset,"baudrate",(int *)&local_7c);
            if (pfVar2 == (fdt32_t *)0x0) {
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                 (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                if (TrapNetCounter == 0) {
                  xTaskGetTickCount();
                }
                else {
                  xTaskGetTickCountFromISR();
                }
                uVar6 = 0x14b;
                name = "[%10u][%s: %s:%4d] uart[%d] baudrate NULL.\r\n";
LAB_23036086:
                bl_printk(name,&DAT_2307f16c,"hal_uart.c",uVar6,iVar7);
              }
            }
            else {
              x_00 = *pfVar2;
              pfVar2 = (fdt32_t *)fdt_getprop(param_1,nodeoffset,"id",(int *)&local_7c);
              if (pfVar2 == (fdt32_t *)0x0) {
                if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                   (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                  if (TrapNetCounter == 0) {
                    xTaskGetTickCount();
                  }
                  else {
                    xTaskGetTickCountFromISR();
                  }
                  uVar6 = 0x153;
                  name = "[%10u][%s: %s:%4d] uart[%d] id NULL.\r\n";
                  goto LAB_23036086;
                }
              }
              else {
                x = *pfVar2;
                nodeoffset_00 = fdt_subnode_offset(param_1,nodeoffset,"buf_size");
                if (nodeoffset_00 < 1) {
                  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                     (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                    if (TrapNetCounter == 0) {
                      TVar1 = xTaskGetTickCount();
                    }
                    else {
                      TVar1 = xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] uart[%d] buf_size NULL, will use default.\r\n",
                              TVar1,&DAT_2307f16c,"hal_uart.c",0x15b,iVar7);
                  }
                  tx_buf_size = 0x200;
                  rx_buf_size = 0x200;
LAB_2303620a:
                  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                     (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                    if (TrapNetCounter == 0) {
                      TVar1 = xTaskGetTickCount();
                    }
                    else {
                      TVar1 = xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] uart[%d] rx_buf_size %d, tx_buf_size %d\r\n",TVar1
                              ,&DAT_2307f16c,"hal_uart.c",0x16c,iVar7,rx_buf_size,tx_buf_size);
                  }
                  baudrate = fdt32_to_cpu(x_00);
                  uVar3 = fdt32_to_cpu(x);
                  ppcVar8 = &local_70;
                  do {
                    nodeoffset_00 = fdt_subnode_offset(param_1,nodeoffset,"feature");
                    if (nodeoffset_00 < 1) {
                      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                         (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                        if (TrapNetCounter == 0) {
                          TVar1 = xTaskGetTickCount();
                        }
                        else {
                          TVar1 = xTaskGetTickCountFromISR();
                        }
                        bl_printk("[%10u][%s: %s:%4d] uart[%d] feature NULL.\r\n",TVar1,
                                  &DAT_2307f16c,"hal_uart.c",0x171,iVar7);
                      }
                    }
                    else {
                      property = *ppcVar8;
                      iVar4 = fdt_stringlist_count(param_1,nodeoffset_00,property);
                      if (iVar4 == 1) {
                        __s2 = fdt_stringlist_get(param_1,nodeoffset_00,property,0,(int *)&local_7c)
                        ;
                        if ((local_7c == 4) &&
                           (nodeoffset_00 = memcmp(&DAT_23084714,__s2,4), nodeoffset_00 == 0)) {
                          nodeoffset_00 = fdt_subnode_offset(param_1,nodeoffset,"pin");
                          if (nodeoffset_00 < 1) {
                            if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) ||
                               (BLOG_LEVEL_INFO < _fsymf_level_hal_drvhal_uart)) goto LAB_230363c4;
                            if (TrapNetCounter == 0) {
                              TVar1 = xTaskGetTickCount();
                            }
                            else {
                              TVar1 = xTaskGetTickCountFromISR();
                            }
                            bl_printk("[%10u][%s: %s:%4d] uart[%d] pin NULL.\r\n",TVar1,
                                      &DAT_2307f16c,"hal_uart.c",0x182,iVar7);
                            break;
                          }
                          property = ppcVar8[1];
                          pfVar2 = (fdt32_t *)
                                   fdt_getprop(param_1,nodeoffset_00,property,(int *)&local_7c);
                          if (pfVar2 == (fdt32_t *)0x0) {
                            if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                               (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                              if (TrapNetCounter == 0) {
                                TVar1 = xTaskGetTickCount();
                              }
                              else {
                                TVar1 = xTaskGetTickCountFromISR();
                              }
                              bl_printk("[%10u][%s: %s:%4d] uart[%d] %s NULL.\r\n",TVar1,
                                        &DAT_2307f16c,"hal_uart.c",0x187,iVar7,property);
                            }
                          }
                          else {
                            uVar5 = fdt32_to_cpu(*pfVar2);
                            *(char *)(ppcVar8 + 2) = (char)uVar5;
                          }
                        }
                        else {
                          if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                             (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                            if (TrapNetCounter == 0) {
                              TVar1 = xTaskGetTickCount();
                            }
                            else {
                              TVar1 = xTaskGetTickCountFromISR();
                            }
                            bl_printk("[%10u][%s: %s:%4d] uart[%d] %s status = %s lentmp = %d\r\n",
                                      TVar1,&DAT_2307f16c,"hal_uart.c",0x17b,iVar7,property,__s2);
                          }
                        }
                      }
                      else {
                        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                           (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                          if (TrapNetCounter == 0) {
                            TVar1 = xTaskGetTickCount();
                          }
                          else {
                            TVar1 = xTaskGetTickCountFromISR();
                          }
                          bl_printk("[%10u][%s: %s:%4d] uart[%d] %s countindex = %d.\r\n",TVar1,
                                    &DAT_2307f16c,"hal_uart.c",0x176,iVar7,property,iVar4);
                        }
                      }
                    }
                    ppcVar8 = ppcVar8 + 3;
                  } while (apcStack64 != ppcVar8);
                  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                     (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                    if (TrapNetCounter == 0) {
                      TVar1 = xTaskGetTickCount();
                    }
                    else {
                      TVar1 = xTaskGetTickCountFromISR();
                    }
                    bl_printk(
                              "[%10u][%s: %s:%4d] id = %d, %s = %d, %s = %d, %s = %d, %s = %d baudrate = %ld.\r\n"
                              ,TVar1,&DAT_2307f16c,"hal_uart.c",0x192,uVar3 & 0xff,uStack108,
                              (uint)bStack104);
                  }
LAB_230363c4:
                  uStack152 = (uint8_t)uVar3;
                  bl_uart_flush(uStack152);
                  bl_uart_init(uStack152,bStack104,uStack92,uStack80,uStack68,baudrate);
                  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                     (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                    if (TrapNetCounter == 0) {
                      TVar1 = xTaskGetTickCount();
                    }
                    else {
                      TVar1 = xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] bl_uart_init %d ok.\r\n",TVar1,&DAT_2307f16c,
                              "hal_uart.c",0x19a,uVar3 & 0xff);
                    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                       (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                      if (TrapNetCounter == 0) {
                        TVar1 = xTaskGetTickCount();
                      }
                      else {
                        TVar1 = xTaskGetTickCountFromISR();
                      }
                      bl_printk("[%10u][%s: %s:%4d] bl_uart_init %d baudrate = %ld ok.\r\n",TVar1,
                                &DAT_2307f16c,"hal_uart.c",0x19b,uVar3 & 0xff,baudrate);
                    }
                  }
                  nodeoffset = dev_uart_init(uStack152,name,rx_buf_size,tx_buf_size);
                  if (((nodeoffset != 0) && (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
                     (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_ASSERT)) {
                    if (TrapNetCounter == 0) {
                      xTaskGetTickCount();
                    }
                    else {
                      xTaskGetTickCountFromISR();
                    }
                    bl_printk("[%10u][%s: %s:%4d] dev_uart_init err.\r\n",&DAT_23072bcc,"hal_uart.c"
                              ,0x19e);
                  }
                }
                else {
                  pfVar2 = (fdt32_t *)fdt_getprop(param_1,nodeoffset_00,"rx_size",(int *)&local_7c);
                  if (pfVar2 == (fdt32_t *)0x0) {
                    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                       (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                      if (TrapNetCounter == 0) {
                        xTaskGetTickCount();
                      }
                      else {
                        xTaskGetTickCountFromISR();
                      }
                      name = "rx_size";
                      uVar6 = 0x161;
LAB_23035e5a:
                      property = "[%10u][%s: %s:%4d] uart[%d] %s NULL.\r\n";
                      goto LAB_23035ece;
                    }
                  }
                  else {
                    x_01 = *pfVar2;
                    pfVar2 = (fdt32_t *)
                             fdt_getprop(param_1,nodeoffset_00,"tx_size",(int *)&local_7c);
                    if (pfVar2 != (fdt32_t *)0x0) {
                      rx_buf_size = fdt32_to_cpu(x_01);
                      tx_buf_size = fdt32_to_cpu(*pfVar2);
                      goto LAB_2303620a;
                    }
                    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                       (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
                      if (TrapNetCounter == 0) {
                        xTaskGetTickCount();
                      }
                      else {
                        xTaskGetTickCountFromISR();
                      }
                      name = "tx_size";
                      uVar6 = 0x167;
                      goto LAB_23035e5a;
                    }
                  }
                }
              }
            }
          }
          else {
            if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
               (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
              if (TrapNetCounter == 0) {
                xTaskGetTickCount();
              }
              else {
                xTaskGetTickCountFromISR();
              }
              uVar6 = 0x13e;
              property = "[%10u][%s: %s:%4d] uart[%d] path_countindex = %d NULL.\r\n";
              goto LAB_23035ece;
            }
          }
        }
        else {
          if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
             (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            uVar6 = 0x137;
            property = "[%10u][%s: %s:%4d] uart[%d] status = %s\r\n";
            goto LAB_23035ece;
          }
        }
      }
      else {
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
           (_fsymf_level_hal_drvhal_uart < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            xTaskGetTickCount();
          }
          else {
            xTaskGetTickCountFromISR();
          }
          uVar6 = 0x132;
          property = "[%10u][%s: %s:%4d] uart[%d] status_countindex = %d NULL.\r\n";
LAB_23035ece:
          bl_printk(property,&DAT_2307f16c,"hal_uart.c",uVar6,iVar7,name);
        }
      }
    }
    ppcStack148 = ppcStack148 + 1;
    if (iVar7 != 0) {
      inited = (int8_t)iVar7;
      return 0;
    }
    iVar7 = 1;
  } while( true );
}



int32_t hal_uart_send_flush(uart_dev_t *uart,uint32_t timeout)

{
  bl_uart_flush(uart->port);
  return 0;
}



void hal_uart_setbaud(uart_dev_t *uart,uint32_t baud)

{
  bl_uart_setbaud(uart->port,baud);
  return;
}



