pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void hal_uart_setconfig(uart_dev_t *uart,uint32_t baud,hal_uart_parity_t parity)

{
  bl_uart_setconfig(uart->port,baud,parity);
  return;
}



undefined4 hal_gpio_init_from_dts(void *param_1,int param_2)

{
  uint uVar1;
  uint *puVar2;
  int nodeoffset;
  char *format;
  TickType_t TVar3;
  int iVar4;
  char *format_00;
  undefined *puVar5;
  undefined4 uVar6;
  uint uVar7;
  int iVar8;
  int local_5c;
  char acStack88 [11];
  undefined uStack77;
  uint uStack76;
  char cStack72;
  byte bStack71;
  byte bStack70;
  undefined uStack69;
  uint uStack68;
  
  uStack76 = 0;
  puVar2 = (uint *)fdt_getprop(param_1,param_2,"max_num",(int *)&uStack76);
  uVar1 = 0xffffffff;
  if (puVar2 != (uint *)0x0) {
    uVar1 = *puVar2;
    uVar1 = uVar1 << 0x18 | uVar1 >> 0x18 | (uVar1 >> 8 & 0xff) << 0x10 |
            (uVar1 >> 0x10 & 0xff) << 8;
  }
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [HAL] [GPIO] Max num is %d\r\n",&DAT_2307f16c,"hal_gpio.c",0xb5,
              uVar1);
  }
  iVar8 = 0;
  do {
    if ((int)uVar1 <= iVar8) {
      return 0;
    }
    snprintf(acStack88,0xb,"gpio%u",iVar8);
    uStack77 = 0;
    local_5c = 0;
    nodeoffset = fdt_subnode_offset(param_1,param_2,acStack88);
    if (nodeoffset < 0) {
      if (BLOG_LEVEL_INFO < _fsymc_level_hal_drv) {
        return 0;
      }
      if (BLOG_LEVEL_INFO < _fsymf_level_hal_drvhal_gpio) {
        return 0;
      }
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] %s NOT found\r\n",&DAT_2307f16c,"hal_gpio.c",0x61,acStack88);
      return 0;
    }
    memset(&uStack76,0,0xc);
    cStack72 = '\0';
    format = fdt_stringlist_get(param_1,nodeoffset,"status",0,&local_5c);
    if ((local_5c == 4) && (iVar4 = memcmp(&DAT_23084714,format,4), iVar4 == 0)) {
      puVar2 = (uint *)fdt_getprop(param_1,nodeoffset,"pin",&local_5c);
      if (puVar2 == (uint *)0x0) {
        if ((BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) ||
           (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_gpio)) goto LAB_2303678a;
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        uVar6 = 0x70;
        format = "[%10u][%s: %s:%4d] no pin found for %s\r\n";
LAB_23036848:
        bl_printk(format,&DAT_23072bcc,"hal_gpio.c",uVar6,acStack88);
      }
      else {
        uVar7 = *puVar2;
        uStack76 = (uVar7 >> 0x10 & 0xff) << 8 |
                   uVar7 << 0x18 | uVar7 >> 0x18 | (uVar7 >> 8 & 0xff) << 0x10;
        format = fdt_stringlist_get(param_1,nodeoffset,"feature",0,&local_5c);
        if ((local_5c != 3) || (iVar4 = memcmp("led",format,3), iVar4 != 0)) {
          if ((BLOG_LEVEL_ERROR < _fsymc_level_hal_drv) ||
             (BLOG_LEVEL_ERROR < _fsymf_level_hal_drvhal_gpio)) goto LAB_2303678a;
          if (TrapNetCounter == 0) {
            xTaskGetTickCount();
          }
          else {
            xTaskGetTickCountFromISR();
          }
          uVar6 = 0x79;
LAB_230369ca:
          puVar5 = &DAT_23072bcc;
          format_00 = "[%10u][%s: %s:%4d] %s: unvalid GPIO config %3s\r\n";
          goto LAB_2303687e;
        }
        bStack71 = 0;
        format = fdt_stringlist_get(param_1,nodeoffset,"active",0,&local_5c);
        if (local_5c == 2) {
          iVar4 = memcmp(&DAT_23084b70,format,2);
          if (iVar4 == 0) {
            bStack70 = 1;
          }
          else {
            if ((local_5c != 2) || (iVar4 = memcmp(&DAT_23084b74,format,2), iVar4 != 0))
            goto LAB_23036a06;
            bStack70 = 0;
          }
          format = fdt_stringlist_get(param_1,nodeoffset,"mode",0,&local_5c);
          if ((local_5c == 5) && (iVar4 = memcmp("blink",format,5), iVar4 == 0)) {
            uStack69 = 0;
          }
          else {
            if ((local_5c != 9) || (iVar4 = memcmp("heartbeat",format,9), iVar4 != 0)) {
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
                 (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_ASSERT)) {
                if (TrapNetCounter == 0) {
                  xTaskGetTickCount();
                }
                else {
                  xTaskGetTickCountFromISR();
                }
                uVar6 = 0x8d;
                goto LAB_230369ca;
              }
              goto LAB_2303678a;
            }
            uStack69 = 1;
          }
          puVar2 = (uint *)fdt_getprop(param_1,nodeoffset,"time",&local_5c);
          if (puVar2 == (uint *)0x0) {
            if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
               (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_ASSERT)) {
              if (TrapNetCounter == 0) {
                xTaskGetTickCount();
              }
              else {
                xTaskGetTickCountFromISR();
              }
              uVar6 = 0x93;
              format = "[%10u][%s: %s:%4d] %s: unvalid GPIO config\r\n";
              goto LAB_23036848;
            }
          }
          else {
            uVar7 = *puVar2;
            uStack68 = (uVar7 >> 0x10 & 0xff) << 8 |
                       uVar7 << 0x18 | uVar7 >> 0x18 | (uVar7 >> 8 & 0xff) << 0x10;
            cStack72 = '\x01';
          }
        }
        else {
LAB_23036a06:
          if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
             (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_ASSERT)) {
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            uVar6 = 0x83;
            goto LAB_230369ca;
          }
        }
      }
    }
    else {
      if ((BLOG_LEVEL_INFO < _fsymc_level_hal_drv) ||
         (BLOG_LEVEL_INFO < _fsymf_level_hal_drvhal_gpio)) goto LAB_2303678a;
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      uVar6 = 0x6a;
      puVar5 = &DAT_2307f16c;
      format_00 = "[%10u][%s: %s:%4d] [%s] status = %s\r\n";
LAB_2303687e:
      bl_printk(format_00,puVar5,"hal_gpio.c",uVar6,acStack88,format);
    }
LAB_2303678a:
    if (cStack72 == '\x01') {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk(
                  "[%10u][%s: %s:%4d] New CONF: GPIO%02u: feature %u, active %u, mode %u, time %u\r\n"
                  ,TVar3,&DAT_2307f16c,"hal_gpio.c",0xa6,uStack76,(uint)bStack71,(uint)bStack70);
      }
      loopset_led_trigger(uStack76,uStack68);
    }
    else {
      if (((cStack72 == '\0') && (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
         (_fsymf_level_hal_drvhal_gpio < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] %s: unvalid GPIO config\r\n",&DAT_23072bcc,"hal_gpio.c",0xc3,
                  acStack88);
      }
    }
    iVar8 = iVar8 + 1;
  } while( true );
}



void _dump_partition(void)

{
  int iVar1;
  anon_struct_conflict371 *paVar2;
  
