pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  bl_printk("======= PtTable_Config @%p=======\r\n",0x4200d9cc);
  bl_printk("magicCode 0x%08X;",boot2_partition_table.table.ptTable.magicCode);
  bl_printk(" version 0x%04X;",(uint)boot2_partition_table.table.ptTable.version);
  bl_printk(" entryCnt %u;",(uint)boot2_partition_table.table.ptTable.entryCnt);
  bl_printk(" age %lu;",boot2_partition_table.table.ptTable.age);
  bl_printk(" crc32 0x%08X\r\n");
  bl_printk(
           "idx  type device activeIndex     name   Address[0]  Address[1]  Length[0]   Length[1]   age\r\n"
           );
  iVar1 = 0;
  paVar2 = &boot2_partition_table;
  while( true ) {
    if ((int)(uint)boot2_partition_table.table.ptTable.entryCnt <= iVar1) break;
    bl_printk("[%02d] ",iVar1);
    iVar1 = iVar1 + 1;
    bl_printk(" %02u",(uint)(paVar2->table).ptEntries[0].type);
    bl_printk("     %u",(uint)(paVar2->table).ptEntries[0].device);
    bl_printk("         %u",(uint)(paVar2->table).ptEntries[0].activeIndex);
    bl_printk("      %8s",(paVar2->table).ptEntries[0].name);
    bl_printk("  %p",(paVar2->table).ptEntries[0].Address[0]);
    bl_printk("  %p",(paVar2->table).ptEntries[0].Address[1]);
    bl_printk("  %p",(paVar2->table).ptEntries[0].maxLen[0]);
    bl_printk("  %p",(paVar2->table).ptEntries[0].maxLen[1]);
    bl_printk("  %lu\r\n");
    paVar2 = (anon_struct_conflict371 *)((paVar2->table).ptEntries[0].Address + 1);
  }
  return;
}



int hal_boot2_update_ptable(HALPartition_Entry_Config *ptEntry_hal)

{
  uint8_t uVar1;
  PtTable_Error_Type PVar2;
  undefined3 extraout_var;
  
  *(bool *)&ptEntry_hal->activeIndex = ptEntry_hal->activeIndex == '\0';
  uVar1 = boot2_partition_table.partition_active_idx;
  ptEntry_hal->age = ptEntry_hal->age + 1;
  PVar2 = PtTable_Update_Entry
                    ((SPI_Flash_Cfg_Type *)0x0,uVar1 == '\0',&boot2_partition_table.table,
                     (PtTable_Entry_Config *)ptEntry_hal);
  return CONCAT31(extraout_var,PVar2);
}



uint32_t hal_boot2_get_flash_addr(void)

{
  return (uint)boot2_partition_table.table.ptTable.entryCnt * 0x24 + 0x42049c18;
}



int hal_boot2_partition_bus_addr
              (char *name,uint32_t *addr0,uint32_t *addr1,uint32_t *size0,uint32_t *size1,
              int *active)

{
  byte bVar1;
  uint uVar2;
  uint uVar3;
  int iVar4;
  anon_struct_conflict371 *paVar5;
  uint uVar6;
  uint uVar7;
  anon_struct_conflict371 *paVar8;
  
  if (boot2_partition_table.table.ptTable.magicCode != 0x54504642) {
    return -5;
  }
  paVar8 = &boot2_partition_table;
  paVar5 = &boot2_partition_table;
  uVar2 = 0;
  while ((int)uVar2 < (int)(uint)boot2_partition_table.table.ptTable.entryCnt) {
    iVar4 = strcmp((char *)(paVar5->table).ptEntries[0].name,name);
    paVar5 = (anon_struct_conflict371 *)((paVar5->table).ptEntries[0].Address + 1);
    if (iVar4 == 0) break;
    uVar2 = uVar2 + 1;
  }
  iVar4 = -2;
  if (uVar2 != (uint)boot2_partition_table.table.ptTable.entryCnt) {
    uVar7 = boot2_partition_table.table.ptEntries[uVar2].Address[0];
    uVar6 = boot2_partition_table.table.ptEntries[uVar2].Address[1];
    *active = (uint)boot2_partition_table.table.ptEntries[uVar2].activeIndex;
    *size0 = boot2_partition_table.table.ptEntries[uVar2].maxLen[0];
    uVar3 = 0;
    *size1 = *(uint32_t *)((int)&boot2_partition_table.table.ptTable + (uVar2 + 1) * 0x24 + 4);
    while ((int)uVar3 < (int)(uint)boot2_partition_table.table.ptTable.entryCnt) {
      iVar4 = strcmp((char *)(paVar8->table).ptEntries[0].name,"FW");
      paVar8 = (anon_struct_conflict371 *)((paVar8->table).ptEntries[0].Address + 1);
      if (iVar4 == 0) break;
      uVar3 = uVar3 + 1;
    }
    iVar4 = -0x8c;
    if (uVar3 != (uint)boot2_partition_table.table.ptTable.entryCnt) {
      if (uVar7 != 0) {
        if (uVar7 < boot2_partition_table.table.ptEntries[uVar3].Address[0]) {
          return -0x16;
        }
        if (uVar7 < boot2_partition_table.table.ptEntries[uVar3].Address[1]) {
          return -0x16;
        }
      }
      if (uVar6 != 0) {
        if (uVar6 < boot2_partition_table.table.ptEntries[uVar3].Address[0]) {
          return -0x16;
        }
        if (uVar6 < boot2_partition_table.table.ptEntries[uVar3].Address[1]) {
          return -0x16;
        }
      }
      iVar4 = -0xe;
      bVar1 = boot2_partition_table.table.ptEntries[uVar3].activeIndex;
      if (bVar1 < 2) {
        iVar4 = 0;
        *addr0 = (uVar7 + 0x22fff000) -
                 (&boot2_partition_table.table.ptTable.crc32)[(uint)bVar1 + uVar3 * 9 + 4];
        *addr1 = (uVar6 + 0x22fff000) -
                 (&boot2_partition_table.table.ptTable.crc32)
                 [uVar3 * 9 + (uint)boot2_partition_table.table.ptEntries[uVar3].activeIndex + 4];
      }
    }
  }
  return iVar4;
}



int hal_boot2_partition_bus_addr_active(char *name,uint32_t *addr,uint32_t *size)

{
  int iVar1;
  uint32_t uStack36;
  uint32_t addr0;
  uint32_t addr1;
  uint32_t size0;
  uint32_t size1;
  int active;
  
  iVar1 = hal_boot2_partition_bus_addr(name,&uStack36,&addr0,&addr1,&size0,(int *)&size1);
  if (iVar1 == 0) {
    if (size1 != 0) {
      uStack36 = addr0;
    }
    *addr = uStack36;
    if (size1 != 0) {
      addr1 = size0;
    }
    *size = addr1;
  }
  return iVar1;
}



int hal_boot2_partition_bus_addr_inactive(char *name,uint32_t *addr,uint32_t *size)

{
  int iVar1;
  uint32_t uStack36;
  uint32_t addr0;
  uint32_t addr1;
  uint32_t size0;
  uint32_t size1;
  int active;
  
  iVar1 = hal_boot2_partition_bus_addr(name,&uStack36,&addr0,&addr1,&size0,(int *)&size1);
  if (iVar1 == 0) {
    if (size1 != 0) {
      addr0 = uStack36;
    }
    *addr = addr0;
    if (size1 != 0) {
      size0 = addr1;
    }
    *size = size0;
  }
  return iVar1;
}



int hal_boot2_partition_addr
              (char *name,uint32_t *addr0,uint32_t *addr1,uint32_t *size0,uint32_t *size1,
              int *active)

{
  uint uVar1;
  anon_struct_conflict371 *paVar2;
  int iVar3;
  
  if (boot2_partition_table.table.ptTable.magicCode == 0x54504642) {
    paVar2 = &boot2_partition_table;
    uVar1 = 0;
    while ((int)uVar1 < (int)(uint)boot2_partition_table.table.ptTable.entryCnt) {
      iVar3 = strcmp((char *)(paVar2->table).ptEntries[0].name,name);
      paVar2 = (anon_struct_conflict371 *)((paVar2->table).ptEntries[0].Address + 1);
      if (iVar3 == 0) break;
      uVar1 = uVar1 + 1;
    }
    iVar3 = -2;
    if (uVar1 != (uint)boot2_partition_table.table.ptTable.entryCnt) {
      *addr0 = boot2_partition_table.table.ptEntries[uVar1].Address[0];
      *addr1 = boot2_partition_table.table.ptEntries[uVar1].Address[1];
      *size0 = boot2_partition_table.table.ptEntries[uVar1].maxLen[0];
      *size1 = *(uint32_t *)((int)&boot2_partition_table.table.ptTable + (uVar1 + 1) * 0x24 + 4);
      iVar3 = 0;
      *active = (uint)boot2_partition_table.table.ptEntries[uVar1].activeIndex;
    }
  }
  else {
    iVar3 = -5;
  }
  return iVar3;
}



int hal_boot2_partition_addr_active(char *name,uint32_t *addr,uint32_t *size)

{
  int iVar1;
  uint32_t uStack36;
  uint32_t addr0;
  uint32_t addr1;
  uint32_t size0;
  uint32_t size1;
  int active;
  
  iVar1 = hal_boot2_partition_addr(name,&uStack36,&addr0,&addr1,&size0,(int *)&size1);
  if (iVar1 == 0) {
    if (size1 != 0) {
      uStack36 = addr0;
    }
    *addr = uStack36;
    if (size1 != 0) {
      addr1 = size0;
    }
    *size = addr1;
  }
  return iVar1;
}



int hal_boot2_partition_addr_inactive(char *name,uint32_t *addr,uint32_t *size)

{
  int iVar1;
  uint32_t uStack36;
  uint32_t addr0;
  uint32_t addr1;
  uint32_t size0;
  uint32_t size1;
  int active;
  
  iVar1 = hal_boot2_partition_addr(name,&uStack36,&addr0,&addr1,&size0,(int *)&size1);
  if (iVar1 == 0) {
    if (size1 != 0) {
      addr0 = uStack36;
    }
    *addr = addr0;
    if (size1 != 0) {
      size0 = addr1;
    }
    *size = size0;
  }
  return iVar1;
}



