pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint8_t hal_boot2_get_active_partition(void)

{
  return boot2_partition_table.partition_active_idx;
}



int hal_boot2_get_active_entries(int type,HALPartition_Entry_Config *ptEntry_hal)

{
  PtTable_Error_Type PVar1;
  undefined3 extraout_var;
  
  PVar1 = PtTable_Get_Active_Entries
                    (&boot2_partition_table.table,(PtTable_Entry_Type)type,
                     (PtTable_Entry_Config *)ptEntry_hal);
  return -(uint)(CONCAT31(extraout_var,PVar1) != 0);
}



int hal_boot2_dump(void)

{
  _dump_partition();
  return 0;
}



int hal_boot2_init(void)

{
  TickType_t TVar1;
  
  boot2_partition_table.partition_active_idx = ram_heap[7232];
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_boot2 < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [HAL] [BOOT2] Active Partition[%u] consumed %d Bytes\r\n",TVar1,
              &DAT_2307f16c,"hal_boot2.c",0x114,(uint)boot2_partition_table.partition_active_idx,
              0x254);
  }
  _dump_partition();
  bl_flash_config_update();
  return 0;
}



int hal_reboot(void)

{
  GLB_SW_POR_Reset();
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void hal_sys_reset(void)

{
  GLB_SW_System_Reset();
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void hal_poweroff(void)

{
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void hal_sys_capcode_update(uint8_t capin,uint8_t capout)

{
  uint8_t capin_static;
  uint8_t capout_static;
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  
  if ((CONCAT31(in_register_00002029,capin) != 0xff) &&
     (CONCAT31(in_register_0000202d,capout) != 0xff)) {
    (*_DAT_2101081c)();
    return;
  }
                    // WARNING: Could not recover jumptable at 0x230370ea. Too many branches
                    // WARNING: Treating indirect jump as call
  (*_DAT_2101081c)((uint)capin_static,(uint)capout_static);
  return;
}



uint8_t hal_sys_capcode_get(void)

{
  uint8_t uVar1;
  
  uVar1 = AON_Get_Xtal_CapCode();
  return uVar1;
}



uint32_t fdt32_to_cpu(fdt32_t x)

{
  return (x >> 0x10 & 0xff) << 8 | x << 0x18 | x >> 0x18 | (x >> 8 & 0xff) << 0x10;
}



uint32_t hal_board_get_factory_addr(void)

{
  return factory_addr;
}



// WARNING: Could not reconcile some variable overlaps

undefined4 hal_board_cfg(void)

{
  char cVar1;
  byte bVar2;
  uint32_t fdt;
  int parentoffset;
  TickType_t TVar3;
  int nodeoffset;
  int iVar4;
  char *format;
  size_t sVar5;
  uint32_t uVar6;
  uint32_t uVar7;
  void *__src;
  uint32_t autoconnect;
  fdt32_t x;
  int iVar8;
  int iVar9;
  char *pcVar10;
  uint8_t chan;
  undefined4 uVar11;
  size_t *psVar12;
  size_t *psVar13;
  byte *pbVar14;
  fdt32_t *pfVar15;
  uint8_t capin;
  uint8_t psk_len;
  fdt32_t *pfVar16;
  int iStack220;
  byte local_c4 [4];
  uint32_t uStack192;
  int iStack188;
  size_t sStack184;
  size_t local_b4;
  size_t local_b0 [4];
  size_t local_a0 [3];
  size_t asStack146 [4];
  undefined4 local_80;
  byte bStack124;
  byte bStack123;
  
  parentoffset = hal_boot2_partition_addr_active("factory",&factory_addr,&uStack192);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [MAIN] [BOARD] [FLASH] addr from partition is %08x, ret is %d\r\n"
              ,TVar3,&DAT_2307f16c,"hal_board.c",0x376,factory_addr,parentoffset);
  }
  if (factory_addr == 0) {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk(
                "[%10u][%s: %s:%4d] [MAIN] [BOARD] [FLASH] Dead loop. Reason: NO valid Param Parition found\r\n"
                ,TVar3,&DAT_23072bcc,"hal_board.c",0x378);
    }
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  parentoffset = hal_boot2_partition_bus_addr_active("factory",&factory_addr,&uStack192);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [MAIN] [BOARD] [XIP] addr from partition is %08x, ret is %d\r\n",
              TVar3,&DAT_2307f16c,"hal_board.c",0x37e,factory_addr,parentoffset);
  }
  fdt = factory_addr;
  if (factory_addr == 0) {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk(
                "[%10u][%s: %s:%4d] [MAIN] [BOARD] [XIP] Dead loop. Reason: NO valid Param Parition found\r\n"
                ,TVar3,&DAT_23072bcc,"hal_board.c",0x380);
    }
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  iStack188 = 0;
  parentoffset = fdt_subnode_offset((void *)factory_addr,0,"wifi");
  if (((parentoffset < 1) && (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
     (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] wifi NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c",0x242);
  }
  nodeoffset = fdt_subnode_offset((void *)fdt,parentoffset,"brd_rf");
  if (0 < nodeoffset) {
    local_a0[0] = 0;
    iVar4 = fdt_stringlist_count((void *)fdt,nodeoffset,"xtal_mode");
    if (iVar4 == 1) {
      format = fdt_stringlist_get((void *)fdt,nodeoffset,"xtal_mode",0,(int *)local_a0);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] xtal_mode length %d\r\n",TVar3,&DAT_2307f16c,"hal_board.c",
                  0x141,local_a0[0]);
      }
      if ((int)local_a0[0] < 3) {
        memcpy(local_b0,format,local_a0[0]);
        local_b0[0] = local_b0[0] & 0xff00ffff;
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
           (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] xtal_mode is %s\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x145
                    ,local_b0);
        }
        sVar5 = strlen((char *)local_b0);
        iVar4 = 0;
        while (iVar4 < (int)sVar5) {
          if (*(char *)((int)local_b0 + iVar4) == 'F') {
            local_80 = 0;
            pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,nodeoffset,"xtal",&local_80);
            if (local_80 == 0x14) {
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                 (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                autoconnect = fdt32_to_cpu(*pfVar15);
                uVar6 = fdt32_to_cpu(pfVar15[1]);
                uVar7 = fdt32_to_cpu(pfVar15[2]);
                fdt32_to_cpu(pfVar15[3]);
                fdt32_to_cpu(pfVar15[4]);
                bl_printk("[%10u][%s: %s:%4d] xtal dtb in DEC :%u %u %u %u %u\r\n",TVar3,
                          &DAT_2307f16c,"hal_board.c",0xf9,autoconnect & 0xff,uVar6 & 0xff,
                          uVar7 & 0xff);
              }
              autoconnect = fdt32_to_cpu(*pfVar15);
              capin = (uint8_t)autoconnect;
              autoconnect = fdt32_to_cpu(pfVar15[1]);
              local_80._0_1_ = (byte)autoconnect;
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
                 (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                bl_printk("[%10u][%s: %s:%4d] get xtal from F ready\r\n",TVar3,"DEBUG ",
                          "hal_board.c",0x114);
              }
              goto LAB_23037596;
            }
            if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
              if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                bl_printk("[%10u][%s: %s:%4d] xtal dtb NULL.",TVar3,&DAT_23072bcc,"hal_board.c",
                          0x100);
              }
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
                 (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                uVar11 = 0x117;
                format = "[%10u][%s: %s:%4d] get xtal from F failed\r\n";
                goto LAB_23037900;
              }
            }
          }
          else {
            if (*(char *)((int)local_b0 + iVar4) != 'M') {
              if (TrapNetCounter == 0) {
                TVar3 = xTaskGetTickCount();
              }
              else {
                TVar3 = xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] ASSERT: %s:%d\r\n",TVar3,&UNK_2307c064,"hal_board.c",
                        0x128,"hal_board.c",0x128);
              do {
                    // WARNING: Do nothing block with infinite loop
              } while( true );
            }
            local_80 = local_80 & 0xffffff00;
            iVar8 = bl_efuse_read_capcode((uint8_t *)&local_80);
            if (iVar8 == 0) {
              capin = (byte)local_80;
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
                 (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                bl_printk("[%10u][%s: %s:%4d] get xtal from M ready\r\n",TVar3,"DEBUG ",
                          "hal_board.c",0x11f);
              }
              goto LAB_23037596;
            }
            if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
               (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
              if (TrapNetCounter == 0) {
                TVar3 = xTaskGetTickCount();
              }
              else {
                TVar3 = xTaskGetTickCountFromISR();
              }
              uVar11 = 0x122;
              format = "[%10u][%s: %s:%4d] get xtal from M failed\r\n";
LAB_23037900:
              bl_printk(format,TVar3,"DEBUG ","hal_board.c",uVar11);
            }
          }
          iVar4 = iVar4 + 1;
          if (iVar4 == 2) break;
        }
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
           (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] Using Default xtal\r\n",TVar3,&DAT_2307f16c,"hal_board.c",
                    0x12e);
        }
        local_80._0_1_ = '2';
        capin = '2';
LAB_23037596:
        hal_sys_capcode_update(capin,(byte)local_80);
      }
    }
    __src = fdt_getprop((void *)fdt,nodeoffset,"channel_div_table",&iStack188);
    if (iStack188 == 0x3c) {
      iVar4 = 0;
      do {
        autoconnect = fdt32_to_cpu(*(fdt32_t *)((int)__src + iVar4));
        *(uint32_t *)((int)&local_80 + iVar4) = autoconnect;
        iVar4 = iVar4 + 4;
      } while (iVar4 != 0x3c);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] channel_div_table :\r\n",TVar3,&DAT_2307f16c,"hal_board.c",600
                 );
      }
      log_buf_out("hal_board.c",0x259,&local_80,0x3c,LOG_BUF_OUT_DATA_TYPE_HEX);
    }
    else {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] channel_div_table NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c"
                  ,0x25b);
      }
    }
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,nodeoffset,"channel_cnt_table",&iStack188);
    if (iStack188 == 0x38) {
      pfVar16 = pfVar15 + 0xe;
      psVar12 = local_a0;
      do {
        x = *pfVar15;
        pfVar15 = pfVar15 + 1;
        autoconnect = fdt32_to_cpu(x);
        *(short *)psVar12 = (short)autoconnect;
        psVar12 = (size_t *)((int)psVar12 + 2);
      } while (pfVar16 != pfVar15);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] channel_cnt_table :\r\n",TVar3,&DAT_2307f16c,"hal_board.c",
                  0x263);
      }
      log_buf_out("hal_board.c",0x264,local_a0,0x38,LOG_BUF_OUT_DATA_TYPE_HEX);
    }
    else {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] channel_cnt_table NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c"
                  ,0x266);
      }
    }
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,nodeoffset,"lo_fcal_div",&iStack188);
    if (iStack188 == 4) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        x = *pfVar15;
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        autoconnect = fdt32_to_cpu(x);
        bl_printk("[%10u][%s: %s:%4d] lo_fcal_div : %d\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x26c,
                  autoconnect & 0xffff);
      }
    }
    else {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] lo_fcal_div NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c",0x26e
                 );
      }
    }
  }
  nodeoffset = fdt_subnode_offset((void *)fdt,parentoffset,"mac");
  if (0 < nodeoffset) {
    local_b4 = 0;
    iVar4 = fdt_stringlist_count((void *)fdt,nodeoffset,"mode");
    if (iVar4 == 1) {
      format = fdt_stringlist_get((void *)fdt,nodeoffset,"mode",0,(int *)&local_b4);
      bl_printk("MAC address mode length %d\r\n",local_b4);
      if ((int)local_b4 < 4) {
        memcpy(local_b0,format,local_b4);
        local_b0[0] = local_b0[0] & 0xffffff;
        bl_printk("MAC address mode is %s\r\n",local_b0);
        sVar5 = strlen((char *)local_b0);
        iVar4 = 0;
        do {
          if ((int)sVar5 <= iVar4) break;
          cVar1 = *(char *)((int)local_b0 + iVar4);
          if (cVar1 == 'F') {
            __src = fdt_getprop((void *)fdt,nodeoffset,"sta_mac_addr",(int *)local_a0);
            if (local_a0[0] == 6) {
              memcpy(&local_80,__src,6);
              bl_wifi_sta_mac_addr_set((uint8_t *)&local_80);
              __src = fdt_getprop((void *)fdt,nodeoffset,"ap_mac_addr",(int *)local_a0);
              if (local_a0[0] == 6) {
                memcpy(&local_80,__src,6);
                bl_wifi_ap_mac_addr_set((uint8_t *)&local_80);
                if (BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) goto LAB_23037b5a;
                if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO) {
                  if (TrapNetCounter == 0) {
                    TVar3 = xTaskGetTickCount();
                  }
                  else {
                    TVar3 = xTaskGetTickCountFromISR();
                  }
                  uVar11 = 0x9b;
                  format = "[%10u][%s: %s:%4d] get MAC from F ready\r\n";
                  goto LAB_23037b56;
                }
                goto LAB_23037b64;
              }
              if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
                if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT) {
                  if (TrapNetCounter == 0) {
                    TVar3 = xTaskGetTickCount();
                  }
                  else {
                    TVar3 = xTaskGetTickCountFromISR();
                  }
                  uVar11 = 0x54;
                  format = "[%10u][%s: %s:%4d] ap_mac_addr NULL.\r\n";
                  goto LAB_23038094;
                }
                goto LAB_23038098;
              }
            }
            else {
              if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
                if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT) {
                  if (TrapNetCounter == 0) {
                    TVar3 = xTaskGetTickCount();
                  }
                  else {
                    TVar3 = xTaskGetTickCountFromISR();
                  }
                  uVar11 = 0x47;
                  format = "[%10u][%s: %s:%4d] sta_mac_addr NULL.\r\n";
LAB_23038094:
                  bl_printk(format,TVar3,&DAT_23072bcc,"hal_board.c",uVar11);
                }
LAB_23038098:
                if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
                   (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
                  if (TrapNetCounter == 0) {
                    TVar3 = xTaskGetTickCount();
                  }
                  else {
                    TVar3 = xTaskGetTickCountFromISR();
                  }
                  uVar11 = 0x9e;
                  format = "[%10u][%s: %s:%4d] get MAC from F failed\r\n";
                  goto LAB_2303786a;
                }
              }
            }
          }
          else {
            if (cVar1 == 'M') {
              iVar8 = bl_efuse_read_mac_factory((uint8_t *)&local_80);
              if (iVar8 == 0) {
                if (((byte)(bStack123 |
                           bStack124 |
                           local_80._3_1_ | local_80._2_1_ | (byte)local_80 | local_80._1_1_) != 0)
                   && (((byte)local_80 & local_80._1_1_ & local_80._2_1_ & local_80._3_1_ &
                        bStack124 & bStack123) != 1)) {
                  if (BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) goto LAB_23037b5a;
                  if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO) {
                    if (TrapNetCounter == 0) {
                      TVar3 = xTaskGetTickCount();
                    }
                    else {
                      TVar3 = xTaskGetTickCountFromISR();
                    }
                    uVar11 = 0xa6;
                    format = "[%10u][%s: %s:%4d] get MAC from M ready\r\n";
                    goto LAB_23037b56;
                  }
                  goto LAB_23037b64;
                }
              }
              if ((BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) ||
                 (BLOG_LEVEL_DEBUG < _fsymf_level_hal_drvhal_board)) goto LAB_2303786e;
              if (TrapNetCounter == 0) {
                TVar3 = xTaskGetTickCount();
              }
              else {
                TVar3 = xTaskGetTickCountFromISR();
              }
              uVar11 = 0xa9;
              format = "[%10u][%s: %s:%4d] get MAC from M failed\r\n";
            }
            else {
              if (cVar1 != 'B') {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                bl_printk("[%10u][%s: %s:%4d] ASSERT: %s:%d\r\n",TVar3,&UNK_2307c064,"hal_board.c",
                          0xaf,"hal_board.c",0xaf);
                do {
                    // WARNING: Do nothing block with infinite loop
                } while( true );
              }
              bl_efuse_read_mac((uint8_t *)&local_80);
              if (((byte)(bStack123 |
                         bStack124 |
                         local_80._3_1_ | local_80._2_1_ | (byte)local_80 | local_80._1_1_) != 0) &&
                 (((byte)local_80 & local_80._1_1_ & local_80._2_1_ & local_80._3_1_ & bStack124 &
                  bStack123) != 1)) {
                if (BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) goto LAB_23037b5a;
                if (BLOG_LEVEL_DEBUG < _fsymf_level_hal_drvhal_board) goto LAB_23037b64;
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                uVar11 = 0x90;
                format = "[%10u][%s: %s:%4d] get MAC from B ready\r\n";
LAB_23037b56:
                bl_printk(format,TVar3,"DEBUG ","hal_board.c",uVar11);
                goto LAB_23037b5a;
              }
              if ((BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) ||
                 (BLOG_LEVEL_DEBUG < _fsymf_level_hal_drvhal_board)) goto LAB_2303786e;
              if (TrapNetCounter == 0) {
                TVar3 = xTaskGetTickCount();
              }
              else {
                TVar3 = xTaskGetTickCountFromISR();
              }
              uVar11 = 0x93;
              format = "[%10u][%s: %s:%4d] get MAC from B failed\r\n";
            }
LAB_2303786a:
            bl_printk(format,TVar3,"DEBUG ","hal_board.c",uVar11);
          }
LAB_2303786e:
          iVar4 = iVar4 + 1;
        } while (iVar4 != 3);
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
