pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
           (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] Using Default MAC address\r\n",TVar3,&DAT_2307f16c,
                    "hal_board.c",0xb5);
        }
        memcpy(&local_80,&mac_default_3782,6);
LAB_23037b5a:
        if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
LAB_23037b64:
          if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN) {
            if (TrapNetCounter == 0) {
              TVar3 = xTaskGetTickCount();
            }
            else {
              TVar3 = xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] Set MAC addrress %02X:%02X:%02X:%02X:%02X:%02X\r\n",TVar3,
                      &DAT_2307f16c,"hal_board.c",0xc0,local_80 & 0xff,local_80 >> 8 & 0xff,
                      local_80 >> 0x10 & 0xff);
          }
        }
        bl_wifi_ap_mac_addr_set((uint8_t *)&local_80);
        bl_wifi_sta_mac_addr_set((uint8_t *)&local_80);
      }
    }
  }
  nodeoffset = fdt_subnode_offset((void *)fdt,parentoffset,"region");
  if (0 < nodeoffset) {
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,nodeoffset,"country_code",&iStack188);
    if (iStack188 == 4) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        autoconnect = fdt32_to_cpu(*pfVar15);
        bl_printk("[%10u][%s: %s:%4d] country_code : %d\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x27f
                  ,autoconnect & 0xff);
      }
      autoconnect = fdt32_to_cpu(*pfVar15);
      bl_wifi_country_code_set((uint8_t)autoconnect);
    }
    else {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] country_code NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c",
                  0x283);
      }
    }
  }
  nodeoffset = fdt_subnode_offset((void *)fdt,parentoffset,"brd_rf");
  if (nodeoffset < 1) goto LAB_23038860;
  __src = fdt_getprop((void *)fdt,nodeoffset,"pwr_table_11b",&iStack188);
  if (iStack188 == 0x10) {
    iVar4 = 0;
    do {
      autoconnect = fdt32_to_cpu(*(fdt32_t *)(iVar4 * 4 + (int)__src));
      *(undefined *)((int)&local_80 + iVar4) = (char)autoconnect;
      iVar4 = iVar4 + 1;
    } while (iVar4 != 4);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11b :%u %u %u %u\r\n",TVar3,&DAT_2307f16c,
                "hal_board.c",0x298,local_80 & 0xff,local_80 >> 8 & 0xff,local_80 >> 0x10 & 0xff);
    }
    bl_tpc_update_power_rate_11b((int8_t *)&local_80);
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11b NULL. lentmp = %d\r\n",TVar3,&DAT_23072bcc,
                "hal_board.c",0x29b,iStack188);
    }
  }
  __src = fdt_getprop((void *)fdt,nodeoffset,"pwr_table_11g",&iStack188);
  if (iStack188 == 0x20) {
    iVar4 = 0;
    do {
      autoconnect = fdt32_to_cpu(*(fdt32_t *)(iVar4 * 4 + (int)__src));
      *(undefined *)((int)&local_80 + iVar4) = (char)autoconnect;
      iVar4 = iVar4 + 1;
    } while (iVar4 != 8);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11g :%u %u %u %u %u %u %u %u\r\n",TVar3,&DAT_2307f16c,
                "hal_board.c",0x2ac,local_80 & 0xff,local_80 >> 8 & 0xff,local_80 >> 0x10 & 0xff);
    }
    bl_tpc_update_power_rate_11g((int8_t *)&local_80);
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11g NULL. lentmp = %d\r\n",TVar3,&DAT_23072bcc,
                "hal_board.c",0x2af,iStack188);
    }
  }
  __src = fdt_getprop((void *)fdt,nodeoffset,"pwr_table_11n",&iStack188);
  if (iStack188 == 0x20) {
    iVar4 = 0;
    do {
      autoconnect = fdt32_to_cpu(*(fdt32_t *)(iVar4 * 4 + (int)__src));
      *(undefined *)((int)&local_80 + iVar4) = (char)autoconnect;
      iVar4 = iVar4 + 1;
    } while (iVar4 != 8);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11n :%u %u %u %u %u %u %u %u\r\n",TVar3,&DAT_2307f16c,
                "hal_board.c",0x2c0,local_80 & 0xff,local_80 >> 8 & 0xff,local_80 >> 0x10 & 0xff);
    }
    bl_tpc_update_power_rate_11n((int8_t *)&local_80);
  }
  else {
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] pwr_table_11n NULL. lentmp = %d\r\n",TVar3,&DAT_23072bcc,
                "hal_board.c",0x2c3,iStack188);
    }
  }
  sStack184 = 0;
  iVar4 = fdt_stringlist_count((void *)fdt,nodeoffset,"pwr_mode");
  if (iVar4 != 1) goto LAB_23038860;
  format = fdt_stringlist_get((void *)fdt,nodeoffset,"pwr_mode",0,(int *)&sStack184);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] pwr_mode length %d\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x1c1,
              sStack184);
  }
  if (2 < (int)sStack184) goto LAB_23038860;
  memcpy(local_c4,format,sStack184);
  local_c4[2] = 0;
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] pwr_mode is %s\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x1c5,
              local_c4);
  }
  memset(local_b0,0,0xe);
  memset(local_a0,0,0xe);
  sVar5 = strlen((char *)local_c4);
  pbVar14 = local_c4;
  iStack220 = 0;
  iVar8 = 0;
  do {
    if ((int)sVar5 <= iVar8) break;
    bVar2 = *pbVar14;
    if (bVar2 == 0x46) {
LAB_230383fa:
      local_b4 = 0;
      __src = fdt_getprop((void *)fdt,nodeoffset,"pwr_offset",(int *)&local_b4);
      if (local_b4 != 0x38) {
        if (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) {
          if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT) {
            if (TrapNetCounter == 0) {
              TVar3 = xTaskGetTickCount();
            }
            else {
              TVar3 = xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] pwr_offset NULL. lentmp = %d\r\n",TVar3,&DAT_23072bcc,
                      "hal_board.c",0x15f,local_b4);
          }
          if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
             (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
            if (TrapNetCounter == 0) {
              TVar3 = xTaskGetTickCount();
            }
            else {
              TVar3 = xTaskGetTickCountFromISR();
            }
            uVar11 = 0x1a0;
            format = "[%10u][%s: %s:%4d] get pwr offset from F(f) failed\r\n";
            goto LAB_23038748;
          }
        }
        goto LAB_230386be;
      }
      nodeoffset = 0;
      do {
        autoconnect = fdt32_to_cpu(*(fdt32_t *)(nodeoffset * 4 + (int)__src));
        *(undefined *)((int)local_a0 + nodeoffset) = (char)autoconnect;
        nodeoffset = nodeoffset + 1;
      } while (nodeoffset != 0xe);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] pwr_offset from dtb:\r\n",TVar3,&DAT_2307f16c,"hal_board.c",
                  0x156);
      }
      log_buf_out("hal_board.c",0x157,local_a0,0xe,LOG_BUF_OUT_DATA_TYPE_HEX);
      psVar12 = local_a0;
      do {
        psVar13 = (size_t *)((int)psVar12 + 1);
        *(char *)psVar12 = *(char *)psVar12 + -10;
        psVar12 = psVar13;
      } while (asStack146 != psVar13);
      if (_fsymc_level_hal_drv < BLOG_LEVEL_WARN) {
        if (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] pwr_offset from dtb (rebase on %d):\r\n",TVar3,&DAT_2307f16c
                    ,"hal_board.c",0x15b,10);
        }
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
           (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] get pwr offset from F(f) ready\r\n",TVar3,"DEBUG ",
                    "hal_board.c",399);
        }
      }
      if (*pbVar14 == 0x42) {
        nodeoffset = 0;
        do {
          *(undefined *)((int)local_b0 + nodeoffset) = *(undefined *)((int)local_a0 + nodeoffset);
          nodeoffset = nodeoffset + 1;
        } while (nodeoffset != 0xe);
        if ((BLOG_LEVEL_DEBUG < _fsymc_level_hal_drv) ||
           (BLOG_LEVEL_DEBUG < _fsymf_level_hal_drvhal_board)) goto LAB_23038844;
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        uVar11 = 0x195;
        pcVar10 = "DEBUG ";
        format = "[%10u][%s: %s:%4d] Use pwr offset from F only\r\n";
        goto LAB_23038656;
      }
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] Use pwr offset from f in incremental mode\r\n",TVar3,"DEBUG ",
                  "hal_board.c",0x199);
      }
      nodeoffset = 0;
      psVar12 = local_b0;
      do {
        format = (char *)((int)local_a0 + nodeoffset);
        nodeoffset = nodeoffset + 1;
        *(char *)psVar12 = *format + *(char *)psVar12;
        psVar12 = (size_t *)((int)psVar12 + 1);
      } while (nodeoffset != 0xe);
      goto LAB_23038844;
    }
    if (bVar2 < 0x47) {
      if (bVar2 != 0x42) {
LAB_23037f9e:
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] ASSERT: %s:%d\r\n",TVar3,&UNK_2307c064,"hal_board.c",0x1a6,
                  "hal_board.c",0x1a6);
        do {
                    // WARNING: Do nothing block with infinite loop
        } while( true );
      }
    }
    else {
      if (bVar2 != 0x62) {
        if (bVar2 != 0x66) goto LAB_23037f9e;
        goto LAB_230383fa;
      }
    }
    iVar9 = bl_efuse_read_pwroft((int8_t *)local_a0);
    if (iVar9 != 0) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        uVar11 = 0x186;
        format = "[%10u][%s: %s:%4d] get pwr offset from B(b) failed\r\n";
LAB_23038748:
        bl_printk(format,TVar3,"DEBUG ","hal_board.c",uVar11);
      }
      goto LAB_230386be;
    }
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] get pwr offset from B(b) ready\r\n",TVar3,&DAT_2307f16c,
                "hal_board.c",0x175);
    }
    log_buf_out("hal_board.c",0x176,local_a0,0xe,LOG_BUF_OUT_DATA_TYPE_INT8);
    if (*pbVar14 == 0x42) goto LAB_23038602;
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO)) {
      if (TrapNetCounter == 0) {
        TVar3 = xTaskGetTickCount();
      }
      else {
        TVar3 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] Use pwr offset from b in incremental mode\r\n",TVar3,"DEBUG ",
                "hal_board.c",0x180);
    }
    psVar12 = local_b0;
    do {
      format = (char *)((int)local_a0 + iVar9);
      iVar9 = iVar9 + 1;
      *(char *)psVar12 = *format + *(char *)psVar12;
      psVar12 = (size_t *)((int)psVar12 + 1);
      iStack220 = iVar4;
    } while (iVar9 != 0xe);
LAB_230386be:
    iVar8 = iVar8 + 1;
    pbVar14 = pbVar14 + 1;
  } while (iVar8 != 2);
  if (((iStack220 == 0) && (_fsymc_level_hal_drv < BLOG_LEVEL_WARN)) &&
     (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar11 = 0x1ac;
    pcVar10 = "\x1b[32mINFO  \x1b[0m";
    format = "[%10u][%s: %s:%4d] Using Default pwr offset\r\n";
    goto LAB_23038656;
  }
LAB_23038844:
  log_buf_out("hal_board.c",0x1ae,local_b0,0xe,LOG_BUF_OUT_DATA_TYPE_INT8);
  phy_powroffset_set((int8_t *)local_b0);
LAB_23038860:
  local_b0[0] = 0;
  nodeoffset = fdt_subnode_offset((void *)fdt,parentoffset,"ap");
  if (0 < nodeoffset) {
    iVar4 = fdt_stringlist_count((void *)fdt,nodeoffset,"ssid");
    if ((iVar4 == 1) &&
       (format = fdt_stringlist_get((void *)fdt,nodeoffset,"ssid",0,(int *)local_b0),
       local_b0[0] - 1 < 0x1f)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] ap_ssid string[%d] = %s, ap_ssid_len = %d\r\n",TVar3,
                  &DAT_2307f16c,"hal_board.c",0x213,0,format,local_b0[0]);
      }
      memcpy(local_a0,format,local_b0[0]);
      *(undefined *)((int)local_a0 + local_b0[0]) = 0;
      capin = (uint8_t)local_b0[0];
    }
    else {
      capin = '\0';
    }
    iVar4 = fdt_stringlist_count((void *)fdt,nodeoffset,"pwd");
    if ((iVar4 == 1) &&
       (format = fdt_stringlist_get((void *)fdt,nodeoffset,"pwd",0,(int *)local_b0),
       local_b0[0] - 1 < 0x1f)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] ap_psk string[%d] = %s, ap_psk_len = %d\r\n",TVar3,
                  &DAT_2307f16c,"hal_board.c",0x21e,0,format,local_b0[0]);
      }
      memcpy(&local_80,format,local_b0[0]);
      *(undefined *)((int)&local_80 + local_b0[0]) = 0;
      psk_len = (uint8_t)local_b0[0];
    }
    else {
      psk_len = '\0';
    }
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,nodeoffset,"ap_channel",(int *)local_b0);
    if (pfVar15 == (fdt32_t *)0x0) {
      chan = '\0';
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT) &&
         (chan = '\0', _fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] ap_channel NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c",0x22b)
        ;
        chan = '\0';
      }
    }
    else {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        autoconnect = fdt32_to_cpu(*pfVar15);
        bl_printk("[%10u][%s: %s:%4d] ap_channel = %ld\r\n",TVar3,&DAT_2307f16c,"hal_board.c",0x227,
                  autoconnect);
      }
      autoconnect = fdt32_to_cpu(*pfVar15);
      chan = (uint8_t)autoconnect;
    }
    bl_wifi_ap_info_set((uint8_t *)local_a0,capin,(uint8_t *)&local_80,psk_len,chan);
  }
  local_b0[0] = 0;
  parentoffset = fdt_subnode_offset((void *)fdt,parentoffset,"sta");
  if (0 < parentoffset) {
    nodeoffset = fdt_stringlist_count((void *)fdt,parentoffset,"ssid");
    if ((nodeoffset == 1) &&
       (format = fdt_stringlist_get((void *)fdt,parentoffset,"ssid",0,(int *)local_b0),
       local_b0[0] - 1 < 0x1f)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] [STA] ap_ssid string[%d] = %s, ap_ssid_len = %d\r\n",TVar3,
                  &DAT_2307f16c,"hal_board.c",0x1df,0,format,local_b0[0]);
      }
      memcpy(local_a0,format,local_b0[0]);
      *(undefined *)((int)local_a0 + local_b0[0]) = 0;
      capin = (uint8_t)local_b0[0];
    }
    else {
      capin = '\0';
    }
    nodeoffset = fdt_stringlist_count((void *)fdt,parentoffset,"pwd");
    if ((nodeoffset == 1) &&
       (format = fdt_stringlist_get((void *)fdt,parentoffset,"pwd",0,(int *)local_b0),
       local_b0[0] - 1 < 0x1f)) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] [STA] ap_psk string[%d] = %s, ap_psk_len = %d\r\n",TVar3,
                  &DAT_2307f16c,"hal_board.c",0x1ea,0,format,local_b0[0]);
      }
      memcpy(&local_80,format,local_b0[0]);
      *(undefined *)((int)&local_80 + local_b0[0]) = 0;
      psk_len = (uint8_t)local_b0[0];
    }
    else {
      psk_len = '\0';
    }
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,parentoffset,"auto_connect_enable",(int *)local_b0)
    ;
    autoconnect = 0;
    if (pfVar15 != (fdt32_t *)0x0) {
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          TVar3 = xTaskGetTickCount();
        }
        else {
          TVar3 = xTaskGetTickCountFromISR();
        }
        autoconnect = fdt32_to_cpu(*pfVar15);
        bl_printk("[%10u][%s: %s:%4d] auto_connect_enable = %ld\r\n",TVar3,&DAT_2307f16c,
                  "hal_board.c",0x1f2,autoconnect);
      }
      autoconnect = fdt32_to_cpu(*pfVar15);
    }
    bl_wifi_sta_info_set((uint8_t *)local_a0,capin,(uint8_t *)&local_80,psk_len,autoconnect);
  }
  parentoffset = fdt_subnode_offset((void *)fdt,0,"bluetooth");
  if (((parentoffset < 1) && (_fsymc_level_hal_drv < BLOG_LEVEL_ASSERT)) &&
     (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_ASSERT)) {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] bt NULL.\r\n",TVar3,&DAT_23072bcc,"hal_board.c",0x2cd);
  }
  parentoffset = fdt_subnode_offset((void *)fdt,parentoffset,"brd_rf");
  if (0 < parentoffset) {
    pfVar15 = (fdt32_t *)fdt_getprop((void *)fdt,parentoffset,"pwr_table_ble",&iStack188);
    fdt = 0;
    if (pfVar15 != (fdt32_t *)0x0) {
      fdt = fdt32_to_cpu(*pfVar15);
    }
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
       (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_WARN)) {
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] set pwr_table_ble = %ld in dts\r\n",&DAT_2307f16c,"hal_board.c",
                0x2d9,fdt);
    }
  }
  return 0;
LAB_23038602:
  do {
    *(undefined *)((int)local_b0 + iVar9) = *(undefined *)((int)local_a0 + iVar9);
    iVar9 = iVar9 + 1;
  } while (iVar9 != 0xe);
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_INFO) && (_fsymf_level_hal_drvhal_board < BLOG_LEVEL_INFO))
  {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar11 = 0x17c;
    pcVar10 = "DEBUG ";
    format = "[%10u][%s: %s:%4d] Use pwr offset from B only\r\n";
LAB_23038656:
    bl_printk(format,TVar3,pcVar10,"hal_board.c",uVar11);
  }
  goto LAB_23038844;
}



