pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Control flow encountered bad instruction data

void bl_tsen_adc_get(void)

{
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



uint64_t bl_rtc_get_counter(void)

{
  uint64_t in_fa0;
  uint32_t uStack24;
  uint32_t valLow;
  uint32_t valHigh;
  
  HBN_Get_RTC_Timer_Val(&uStack24,&valLow);
  return in_fa0;
}



uint64_t bl_rtc_get_timestamp_ms(void)

{
  uint64_t uVar1;
  
  uVar1 = bl_rtc_get_counter();
  return uVar1;
}



int hal_wifi_start_firmware_task(void)

{
  StackType_t wifi_fw_stack [1536];
  StaticTask_t wifi_fw_task;
  
  xTaskCreateStatic(wifi_main,"fw",0x600,(void *)0x0,0x1e,(StackType_t *)&ram0x42012be8,
                    (StaticTask_t *)&ram0x420143e8);
  return 0;
}



int bl_sys_reset_por(void)

{
  GLB_SW_POR_Reset();
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



void bl_sys_reset_system(void)

{
  GLB_SW_System_Reset();
  do {
                    // WARNING: Do nothing block with infinite loop
  } while( true );
}



int bl_sys_isxipaddr(uint32_t addr)

{
  return (uint)(((addr & 0xff000000) + 0xdd000000 & 0xdf000000) == 0);
}



PtTable_Error_Type
PtTable_Update_Entry
          (SPI_Flash_Cfg_Type *pFlashCfg,PtTable_ID_Type targetTableID,PtTable_Stuff_Config *ptStuff
          ,PtTable_Entry_Config *ptEntry)

{
  uint uVar1;
  PtTable_Error_Type PVar2;
  uint32_t len;
  uint32_t uVar3;
  undefined3 in_register_0000202d;
  PtTable_Entry_Config *__dest;
  PtTable_Entry_Config *dataIn;
  uint32_t addr;
  
  if ((ptEntry == (PtTable_Entry_Config *)0x0) || (ptStuff == (PtTable_Stuff_Config *)0x0)) {
    return PT_ERROR_PARAMETER;
  }
  dataIn = ptStuff->ptEntries;
  PVar2 = PT_ERROR_TABLE_NOT_VALID;
  if (CONCAT31(in_register_0000202d,targetTableID) != 2) {
    addr = 0xe000;
    if (CONCAT31(in_register_0000202d,targetTableID) != 0) {
      addr = 0xf000;
    }
    uVar1 = 0;
    __dest = dataIn;
    while (uVar1 < (ptStuff->ptTable).entryCnt) {
      if (__dest->type == ptEntry->type) {
        memcpy(__dest,ptEntry,0x24);
        break;
      }
      uVar1 = uVar1 + 1;
      __dest = __dest + 1;
    }
    if ((uint)(ptStuff->ptTable).entryCnt == uVar1) {
      if (0xf < uVar1) {
        return PT_ERROR_ENTRY_UPDATE_FAIL;
      }
      memcpy(dataIn + uVar1,ptEntry,0x24);
      (ptStuff->ptTable).entryCnt = (ptStuff->ptTable).entryCnt + 1;
    }
    (ptStuff->ptTable).age = (ptStuff->ptTable).age + 1;
    len = BFLB_Soft_CRC32(ptStuff,0xc);
    uVar1 = (uint)(ptStuff->ptTable).entryCnt;
    (ptStuff->ptTable).crc32 = len;
    len = uVar1 * 0x24;
    uVar3 = BFLB_Soft_CRC32(dataIn,len);
    *(uint32_t *)(dataIn + uVar1) = uVar3;
    uVar1 = bl_flash_erase(addr,len + 0x14);
    if ((uVar1 & 0xff) == 0) {
      uVar1 = bl_flash_write(addr,(uint8_t *)ptStuff,0x254);
      if ((uVar1 & 0xff) == 0) {
        return (PtTable_Error_Type)(uVar1 & 0xff);
      }
    }
    PVar2 = PT_ERROR_FALSH_WRITE;
  }
  return PVar2;
}



PtTable_Error_Type
PtTable_Get_Active_Entries
          (PtTable_Stuff_Config *ptStuff,PtTable_Entry_Type type,PtTable_Entry_Config *ptEntry)

{
  undefined3 in_register_0000202d;
  PtTable_Entry_Config *pPVar1;
  uint uVar2;
  
  if (ptStuff == (PtTable_Stuff_Config *)0x0) {
    return PT_ERROR_PARAMETER;
  }
  if (ptEntry != (PtTable_Entry_Config *)0x0) {
    uVar2 = 0;
    pPVar1 = ptStuff->ptEntries;
    while( true ) {
      if ((ptStuff->ptTable).entryCnt <= uVar2) {
        return PT_ERROR_ENTRY_NOT_FOUND;
      }
      if ((uint)pPVar1->type == CONCAT31(in_register_0000202d,type)) break;
      uVar2 = uVar2 + 1;
      pPVar1 = pPVar1 + 1;
    }
    memcpy(ptEntry,ptStuff->ptEntries + uVar2,0x24);
    return PT_ERROR_SUCCESS;
  }
  return PT_ERROR_PARAMETER;
}



// WARNING: Could not reconcile some variable overlaps

int bl_gpio_enable_output(uint8_t pin,uint8_t pullup,uint8_t pulldown)

{
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  uint8_t uStack24;
  uint8_t uStack23;
  uint8_t uStack22;
  uint8_t uStack21;
  GLB_GPIO_Cfg_Type cfg;
  
  cfg._0_2_ = 0x100;
  uStack23 = '\v';
  uStack22 = '\x01';
  if (CONCAT31(in_register_0000202d,pullup) == 0) {
    uStack21 = '\x02';
  }
  else {
    uStack21 = '\0';
  }
  if (CONCAT31(in_register_00002031,pulldown) != 0) {
    uStack21 = '\x01';
  }
  uStack24 = pin;
  GLB_GPIO_Init((GLB_GPIO_Cfg_Type *)&uStack24);
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int bl_gpio_enable_input(uint8_t pin,uint8_t pullup,uint8_t pulldown)

{
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  uint8_t uStack24;
  uint8_t uStack23;
  uint8_t uStack22;
  uint8_t uStack21;
  GLB_GPIO_Cfg_Type cfg;
  
  cfg._0_2_ = 0x100;
  uStack23 = '\v';
  uStack22 = '\0';
  if (CONCAT31(in_register_0000202d,pullup) == 0) {
    uStack21 = '\x02';
  }
  else {
    uStack21 = '\0';
  }
  if (CONCAT31(in_register_00002031,pulldown) != 0) {
    uStack21 = '\x01';
  }
  uStack24 = pin;
  GLB_GPIO_Init((GLB_GPIO_Cfg_Type *)&uStack24);
  return 0;
}



int bl_gpio_output_set(uint8_t pin,uint8_t value)

{
  undefined3 in_register_0000202d;
  
  GLB_GPIO_Write(pin,(uint)(CONCAT31(in_register_0000202d,value) != 0));
  return 0;
}



int bl_gpio_input_get(uint8_t pin,uint8_t *value)

{
  uint32_t uVar1;
  
  uVar1 = GLB_GPIO_Read(pin);
  *value = (uint8_t)uVar1;
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl_flash_erase(uint32_t addr,int len)

{
  if (boot2_flashCfg.flashCfg.mid != '\0') {
    (*_DAT_21010ab0)(0x4200dc24,addr,len,_DAT_21010ab0);
    return 0;
  }
  return -1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl_flash_write(uint32_t addr,uint8_t *src,int len)

{
  if (boot2_flashCfg.flashCfg.mid != '\0') {
    (*_DAT_21010aac)(0x4200dc24,addr,src,len,_DAT_21010aac);
    return 0;
  }
  return -1;
}



