pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int bl_flash_read(uint32_t addr,uint8_t *dst,int len)

{
  if (boot2_flashCfg.flashCfg.mid != '\0') {
    (*_DAT_21010aa8)(0x4200dc24,addr,dst,len,_DAT_21010aa8);
    return 0;
  }
  return -1;
}



undefined4 bl_flash_config_update(void)

{
  if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN))
  {
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] ======= FlashCfg magiccode @%p, code 0x%08lX =======\r\n",
              &DAT_2307f16c,"bl_flash.c",0x60,0x42049c18,boot2_flashCfg.magic);
    if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) && (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)
       ) {
      if (TrapNetCounter == 0) {
        xTaskGetTickCount();
      }
      else {
        xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] mid \t\t0x%X\r\n",&DAT_2307f16c,"bl_flash.c",0x61,
                (uint)boot2_flashCfg.flashCfg.mid);
      if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
         (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)) {
        if (TrapNetCounter == 0) {
          xTaskGetTickCount();
        }
        else {
          xTaskGetTickCountFromISR();
        }
        bl_printk("[%10u][%s: %s:%4d] clkDelay \t0x%X\r\n",&DAT_2307f16c,"bl_flash.c",0x62,
                  (uint)boot2_flashCfg.flashCfg.clkDelay);
        if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
           (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            xTaskGetTickCount();
          }
          else {
            xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] clkInvert \t0x%X\r\n",&DAT_2307f16c,"bl_flash.c",99,
                    (uint)boot2_flashCfg.flashCfg.clkInvert);
          if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
             (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)) {
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] sector size\t%uKBytes\r\n",&DAT_2307f16c,"bl_flash.c",100,
                      (uint)boot2_flashCfg.flashCfg.sectorSize);
            if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
               (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)) {
              if (TrapNetCounter == 0) {
                xTaskGetTickCount();
              }
              else {
                xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] page size\t%uBytes\r\n",&DAT_2307f16c,"bl_flash.c",0x65,
                        (uint)boot2_flashCfg.flashCfg.pageSize);
              if ((_fsymc_level_hal_drv < BLOG_LEVEL_WARN) &&
                 (_fsymf_level_hal_drvbl_flash < BLOG_LEVEL_WARN)) {
                if (TrapNetCounter == 0) {
                  xTaskGetTickCount();
                }
                else {
                  xTaskGetTickCountFromISR();
                }
                bl_printk(
                          "[%10u][%s: %s:%4d] ---------------------------------------------------------------\r\n"
                          ,&DAT_2307f16c,"bl_flash.c",0x66);
              }
            }
          }
        }
      }
    }
  }
  return 0;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl_wdt_feed(void)

{
  _DAT_4000a598 = _DAT_4000a598 | 1;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void bl_wdt_disable(void)

{
  _DAT_4000a564 = _DAT_4000a564 & 0xfffffffe;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



int bl_wdt_init(int ms)

{
  if (ms < 0xfff) {
    WDT_Disable();
    WDT_Set_Clock(TIMER_CLKSRC_32K,'\x01');
    WDT_SetCompValue((uint16_t)((uint)(ms << 0x14) >> 0x10));
    WDT_ResetCounterValue();
    WDT_IntMask(WDT_INT,MASK);
    WDT_Enable();
    return 0;
  }
  return -1;
}



err_t httpc_tcp_sent(void *arg,altcp_pcb *pcb,u16_t len)

{
  return '\0';
}



err_t httpc_get_internal_addr(httpc_state_t *req,ip_addr_t *ipaddr)

{
  err_t eVar1;
  
  if (&req->remote_addr != ipaddr) {
    (req->remote_addr).addr = ipaddr->addr;
  }
  eVar1 = altcp_connect(req->pcb,&req->remote_addr,req->remote_port,httpc_tcp_connected);
  return eVar1;
}



err_t httpc_free_state(httpc_state_t *req)

{
  altcp_pcb *conn;
  err_t eVar1;
  undefined3 extraout_var;
  
  if (req->request != (pbuf *)0x0) {
    pbuf_free(req->request);
    req->request = (pbuf *)0x0;
  }
  if (req->rx_hdrs != (pbuf *)0x0) {
    pbuf_free(req->rx_hdrs);
    req->rx_hdrs = (pbuf *)0x0;
  }
  conn = req->pcb;
  mem_free(req);
  if (conn != (altcp_pcb *)0x0) {
    altcp_arg(conn,(void *)0x0);
    altcp_recv(conn,(altcp_recv_fn *)0x0);
    altcp_err(conn,(altcp_err_fn *)0x0);
    altcp_poll(conn,(altcp_poll_fn *)0x0,'\0');
    altcp_sent(conn,(altcp_sent_fn *)0x0);
    eVar1 = altcp_close(conn);
    if (CONCAT31(extraout_var,eVar1) != 0) {
      altcp_abort(conn);
      return -0xd;
    }
  }
  return '\0';
}



err_t httpc_close(httpc_state_t *req,httpc_result_t result,u32_t server_response,err_t err)

{
  err_t eVar1;
  httpc_result_fn *phVar2;
  
  if (req != (httpc_state_t *)0x0) {
    if ((req->conn_settings != (httpc_connection_t_conflict *)0x0) &&
       (phVar2 = req->conn_settings->result_fn, phVar2 != (httpc_result_fn *)0x0)) {
      (*phVar2)(req->callback_arg,result,req->rx_content_len,server_response,err);
    }
    eVar1 = httpc_free_state(req);
    return eVar1;
  }
  return '\0';
}



err_t httpc_tcp_recv(void *arg,altcp_pcb *pcb,pbuf *p,err_t r)

{
  ushort uVar1;
  uint uVar2;
  err_t err;
  u8_t uVar3;
  byte bVar4;
  u16_t len;
  u16_t start_offset;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  undefined2 extraout_var_03;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined2 extraout_var_04;
  undefined2 extraout_var_05;
  undefined2 extraout_var_06;
  undefined2 extraout_var_07;
  undefined2 extraout_var_08;
  undefined2 extraout_var_09;
  httpc_result_t result;
  u16_t start_offset_00;
  undefined3 in_register_00002035;
  code *pcVar5;
  int iVar6;
  pbuf *p_00;
  char acStack64 [4];
  char status_num [10];
  
  *(undefined4 *)((int)arg + 0xc) = 0x1e;
  if (p == (pbuf *)0x0) {
    result = HTTPC_RESULT_ERR_CLOSED;
    if (*(char *)((int)arg + 0x30) == '\x02') {
      result = HTTPC_RESULT_OK;
      if ((*(int *)((int)arg + 0x2c) != -1) &&
         (*(int *)((int)arg + 0x2c) != *(int *)((int)arg + 0x28))) {
        result = HTTPC_RESULT_ERR_CONTENT_LEN;
      }
    }
    uVar1 = *(ushort *)((int)arg + 0x1a);
    err = '\0';
    goto LAB_2303957c;
  }
  if (*(char *)((int)arg + 0x30) == '\x02') goto LAB_230395a8;
  if (*(pbuf **)((int)arg + 0x14) == (pbuf *)0x0) {
    *(pbuf **)((int)arg + 0x14) = p;
  }
  else {
    pbuf_cat(*(pbuf **)((int)arg + 0x14),p);
  }
  if (*(char *)((int)arg + 0x30) == '\0') {
    p_00 = *(pbuf **)((int)arg + 0x14);
    len = pbuf_memfind(p_00,"\r\n",2,0);
    if (CONCAT22(extraout_var_01,len) == 0xffff) goto LAB_23039782;
    start_offset = pbuf_memfind(p_00," ",1,0);
    iVar6 = CONCAT22(extraout_var_02,start_offset);
    if (((iVar6 == 0xffff) ||
        (start_offset = pbuf_memcmp(p_00,0,&DAT_23085d2c,5),
        CONCAT22(extraout_var_03,start_offset) != 0)) ||
       (uVar3 = pbuf_get_at(p_00,6), CONCAT31(extraout_var,uVar3) != 0x2e)) goto LAB_23039782;
    bVar4 = pbuf_get_at(p_00,5);
    uVar3 = pbuf_get_at(p_00,7);
    *(ushort *)((int)arg + 0x18) =
         (short)CONCAT31(extraout_var_00,uVar3) - 0x30U |
         (ushort)(((uint)bVar4 - 0x30 & 0xffff) << 8);
    start_offset_00 = (u16_t)((uint)((iVar6 + 1) * 0x10000) >> 0x10);
    start_offset = pbuf_memfind(p_00," ",1,start_offset_00);
    if (CONCAT22(extraout_var_04,start_offset) == 0xffff) {
      iVar6 = CONCAT22(extraout_var_01,len) - iVar6;
    }
    else {
      iVar6 = CONCAT22(extraout_var_04,start_offset) - iVar6;
    }
    memset(acStack64,0,10);
    len = pbuf_copy_partial(p_00,acStack64,(u16_t)((uint)((iVar6 + -1) * 0x10000) >> 0x10),
                            start_offset_00);
    if ((iVar6 + -1 != CONCAT22(extraout_var_05,len)) ||
       (iVar6 = atoi(acStack64), 0xfffe < iVar6 - 1U)) goto LAB_23039782;
    *(undefined2 *)((int)arg + 0x1a) = (short)iVar6;
    *(undefined *)((int)arg + 0x30) = 1;
LAB_230396b8:
    p_00 = *(pbuf **)((int)arg + 0x14);
    len = pbuf_memfind(p_00,&DAT_2307b07c,4,0);
    if (CONCAT22(extraout_var_06,len) < 0xfffd) {
      *(undefined4 *)((int)arg + 0x2c) = 0xffffffff;
      start_offset = pbuf_memfind(p_00,"Content-Length: ",0x10,0);
      iVar6 = CONCAT22(extraout_var_07,start_offset);
      if (iVar6 != 0xffff) {
        start_offset = pbuf_memfind(p_00,"\r\n",2,start_offset);
        if (CONCAT22(extraout_var_08,start_offset) != 0xffff) {
          memset(acStack64,0,0x10);
          uVar2 = (CONCAT22(extraout_var_08,start_offset) - iVar6) - 0x10;
          start_offset = pbuf_copy_partial(p_00,acStack64,(u16_t)(uVar2 * 0x10000 >> 0x10),
                                           (u16_t)((uint)((iVar6 + 0x10) * 0x10000) >> 0x10));
          if (((uVar2 & 0xffff) == CONCAT22(extraout_var_09,start_offset)) &&
             (iVar6 = atoi(acStack64), -1 < iVar6)) {
            *(int *)((int)arg + 0x2c) = iVar6;
          }
        }
      }
      uVar2 = CONCAT22(extraout_var_06,len) + 4;
      len = (u16_t)(uVar2 * 0x10000 >> 0x10);
      altcp_recved(pcb,len);
      if ((*(int *)((int)arg + 0x20) != 0) &&
         (pcVar5 = *(code **)(*(int *)((int)arg + 0x20) + 0x18), pcVar5 != (code *)0x0)) {
        iVar6 = (*pcVar5)(arg,*(undefined4 *)((int)arg + 0x24),*(undefined4 *)((int)arg + 0x14),
                          uVar2 & 0xffff,*(undefined4 *)((int)arg + 0x2c));
        err = (err_t)iVar6;
        if (iVar6 != 0) {
          uVar1 = *(ushort *)((int)arg + 0x1a);
          result = HTTPC_RESULT_LOCAL_ABORT;
LAB_2303957c:
          err = httpc_close((httpc_state_t *)arg,result,(uint)uVar1,err);
          return err;
        }
      }
      p = pbuf_free_header(*(pbuf **)((int)arg + 0x14),len);
      *(undefined4 *)((int)arg + 0x14) = 0;
      *(undefined *)((int)arg + 0x30) = 2;
      if (p == (pbuf *)0x0) {
        return '\0';
      }
      goto LAB_230395a8;
    }
  }
  else {
LAB_23039782:
    if (*(char *)((int)arg + 0x30) == '\x01') goto LAB_230396b8;
  }
  if (*(char *)((int)arg + 0x30) != '\x02') {
    return '\0';
  }
LAB_230395a8:
  *(int *)((int)arg + 0x28) = *(int *)((int)arg + 0x28) + (uint)p->tot_len;
  if (*(code **)((int)arg + 0x1c) == (code *)0x0) {
    altcp_recved(pcb,p->tot_len);
    pbuf_free(p);
    return '\0';
  }
  err = (**(code **)((int)arg + 0x1c))
                  (*(undefined4 *)((int)arg + 0x24),pcb,p,CONCAT31(in_register_00002035,r));
  return err;
}



