pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void httpc_dns_found(char *hostname,ip_addr_t *ipaddr,void *arg)

{
  err_t err;
  undefined3 extraout_var;
  httpc_result_t result;
  
  if (ipaddr == (ip_addr_t *)0x0) {
    result = HTTPC_RESULT_ERR_HOSTNAME;
    err = -0x10;
  }
  else {
    err = httpc_get_internal_addr((httpc_state_t *)arg,ipaddr);
    result = HTTPC_RESULT_ERR_CONNECT;
    if (CONCAT31(extraout_var,err) == 0) {
      return;
    }
  }
  httpc_close((httpc_state_t *)arg,result,0,err);
  return;
}



err_t httpc_tcp_poll(void *arg,altcp_pcb *pcb)

{
  err_t eVar1;
  int iVar2;
  
  if ((arg != (void *)0x0) &&
     ((*(int *)((int)arg + 0xc) == 0 ||
      (iVar2 = *(int *)((int)arg + 0xc) + -1, *(int *)((int)arg + 0xc) = iVar2, iVar2 == 0)))) {
    eVar1 = httpc_close((httpc_state_t *)arg,HTTPC_RESULT_ERR_TIMEOUT,0,'\0');
    return eVar1;
  }
  return '\0';
}



void httpc_tcp_err(void *arg,err_t err)

{
  if (arg != (void *)0x0) {
    *(undefined4 *)arg = 0;
    httpc_close((httpc_state_t *)arg,HTTPC_RESULT_ERR_CLOSED,0,err);
    return;
  }
  return;
}



err_t httpc_tcp_connected(void *arg,altcp_pcb *pcb,err_t err)

{
  err_t err_00;
  undefined3 extraout_var;
  
  err_00 = altcp_write(*(altcp_pcb **)arg,*(void **)(*(int *)((int)arg + 0x10) + 4),
                       (u16_t)(((uint)*(ushort *)(*(int *)((int)arg + 0x10) + 10) - 1) * 0x10000 >>
                              0x10),'\x01');
  if (CONCAT31(extraout_var,err_00) != 0) {
    err_00 = httpc_close((httpc_state_t *)arg,HTTPC_RESULT_ERR_MEM,0,err_00);
    return err_00;
  }
  pbuf_free(*(pbuf **)((int)arg + 0x10));
  *(undefined4 *)((int)arg + 0x10) = 0;
  altcp_output(*(altcp_pcb **)arg);
  return '\0';
}



int httpc_create_request_string
              (httpc_connection_t_conflict *settings,char *server_name,int server_port,char *uri,
              char *buffer,size_t buffer_size)

{
  int iVar1;
  size_t sVar2;
  char *pcVar3;
  
  if (settings->use_proxy == '\0') {
    if (settings->req_type == '\x01') {
      pcVar3 = (char *)0x0;
      if (settings->content_type < 4) {
        pcVar3 = g_cont_type[settings->content_type];
      }
      sVar2 = strlen((char *)settings->data);
      iVar1 = snprintf(buffer,buffer_size,
                                              
                       "POST %s HTTP/1.1\r\nContent-Type: %s\r\nContent-Length: %d\r\nUser-Agent: %s\r\nHost: %s\r\nAccept: */*\r\nConnection: Close\r\n\r\n%s"
                       ,uri,pcVar3,sVar2,&UNK_23085ba4,server_name);
      return iVar1;
    }
    iVar1 = snprintf(buffer,buffer_size,
                                          
                     "GET %s HTTP/1.1\r\nUser-Agent: %s\r\nAccept: */*\r\nHost: %s\r\nConnection: Close\r\n\r\n"
                     ,&UNK_23085ba4,server_name);
    return iVar1;
  }
  if (server_port != 0x50) {
    iVar1 = snprintf(buffer,buffer_size,
                                          
                     "GET http://%s:%d%s HTTP/1.1\r\nUser-Agent: %s\r\nAccept: */*\r\nHost: %s\r\nConnection: Close\r\n\r\n"
                     ,server_name,server_port,uri,&UNK_23085ba4);
    return iVar1;
  }
  iVar1 = snprintf(buffer,buffer_size,
                                      
                   "GET http://%s%s HTTP/1.1\r\nUser-Agent: %s\r\nAccept: */*\r\nHost: %s\r\nConnection: Close\r\n\r\n"
                   ,server_name,uri,&UNK_23085ba4,server_name);
  return iVar1;
}



err_t httpc_init_connection_common
                (httpc_state_t **connection,httpc_connection_t_conflict *settings,char *server_name,
                u16_t server_port,char *uri,altcp_recv_fn *recv_fn,void *callback_arg)

{
  uint uVar1;
  httpc_state_t *req;
  pbuf *ppVar2;
  altcp_pcb *conn;
  uint uVar3;
  undefined2 in_register_00002036;
  int server_port_00;
  err_t eVar4;
  
  server_port_00 = CONCAT22(in_register_00002036,server_port);
  uVar1 = httpc_create_request_string(settings,server_name,server_port_00,uri,(char *)0x0,0);
  if (uVar1 < 0xffff) {
    req = (httpc_state_t *)mem_malloc(0x34);
    if (req == (httpc_state_t *)0x0) {
      return -1;
    }
    memset(req,0,0x34);
    req->timeout_ticks = 0x1e;
    ppVar2 = pbuf_alloc(PBUF_RAW,(u16_t)((uVar1 + 1) * 0x10000 >> 0x10),PBUF_RAM);
    req->request = ppVar2;
    if ((ppVar2 != (pbuf *)0x0) && (ppVar2->next == (pbuf *)0x0)) {
      req->hdr_content_len = 0xffffffff;
      conn = altcp_new(settings->altcp_allocator);
      req->pcb = conn;
      if (conn != (altcp_pcb *)0x0) {
        if (settings->use_proxy != '\0') {
          server_port = settings->proxy_port;
        }
        req->remote_port = server_port;
        altcp_arg(conn,req);
        altcp_recv(req->pcb,httpc_tcp_recv);
        altcp_err(req->pcb,httpc_tcp_err);
        altcp_poll(req->pcb,httpc_tcp_poll,'\x01');
        altcp_sent(req->pcb,httpc_tcp_sent);
        uVar3 = httpc_create_request_string
                          (settings,server_name,server_port_00,uri,(char *)req->request->payload,
                           uVar1 + 1);
        if (uVar1 == uVar3) {
          req->recv_fn = recv_fn;
          req->conn_settings = settings;
          req->callback_arg = callback_arg;
          *connection = req;
          return '\0';
        }
        httpc_free_state(req);
        goto LAB_23039a74;
      }
    }
    httpc_free_state(req);
    eVar4 = -1;
  }
  else {
LAB_23039a74:
    eVar4 = -6;
  }
  return eVar4;
}



err_t httpc_get_file_dns(char *server_name,u16_t port,char *uri,
                        httpc_connection_t_conflict *settings,altcp_recv_fn *recv_fn,
                        void *callback_arg,httpc_state_t **connection)

{
  httpc_state_t *req_00;
  err_t eVar1;
  err_t eVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  httpc_state_t *phStack36;
  httpc_state_t *req;
  
  if (server_name == (char *)0x0) {
    return -0x10;
  }
  if (uri == (char *)0x0) {
    return -0x10;
  }
  if (recv_fn == (altcp_recv_fn *)0x0) {
    return -0x10;
  }
  eVar1 = httpc_init_connection_common
                    (&phStack36,settings,server_name,port,uri,recv_fn,callback_arg);
  req_00 = phStack36;
  if (CONCAT31(extraout_var,eVar1) != 0) {
    return eVar1;
  }
  if (settings->use_proxy == '\0') {
    settings = (httpc_connection_t_conflict *)&phStack36->remote_addr;
    eVar2 = dns_gethostbyname(server_name,(ip_addr_t *)settings,httpc_dns_found,phStack36);
    if (CONCAT31(extraout_var_01,eVar2) != 0) {
      if (CONCAT31(extraout_var_01,eVar2) == -5) goto LAB_23039b0a;
      goto LAB_23039ad0;
    }
  }
  eVar2 = httpc_get_internal_addr(req_00,(ip_addr_t *)settings);
  if (CONCAT31(extraout_var_00,eVar2) == 0) {
LAB_23039b0a:
    if (connection == (httpc_state_t **)0x0) {
      return eVar1;
    }
    *connection = phStack36;
    return eVar1;
  }
LAB_23039ad0:
  httpc_free_state(phStack36);
  return eVar2;
}



