pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void proc_entry_looprt(void *pvParameters)

{
  bloop_run(&looprt);
  do {
    puts("--->>> Error terminated looprt\r\n");
    vTaskDelay(1000);
  } while( true );
}



void looprt_evt_notify_async(uint task,uint32_t evt_map)

{
  bloop_evt_set_async(&looprt,task,evt_map);
  return;
}



void looprt_evt_status_dump(void)

{
  bloop_status_dump(&looprt);
  return;
}



void looprt_evt_schedule(int task,uint32_t evt_map,int delay_ms)

{
  loop_timer *timer;
  
  timer = (loop_timer *)pvPortMalloc(0x24);
  if (timer != (loop_timer *)0x0) {
    bloop_timer_init(timer,1);
    bloop_timer_configure
              (timer,delay_ms,(anon_subr_void_loop_ctx_ptr_loop_timer_ptr_void_ptr *)0x0,(void *)0x0
               ,task,evt_map);
    bloop_timer_register(&looprt,timer);
    return;
  }
  return;
}



int looprt_start(StackType_t *proc_stack_looprt,int stack_count,StaticTask_t *proc_task_looprt)

{
  bloop_init(&looprt);
  bloop_handler_register(&looprt,&bloop_handler_sys,0x1f);
  looprt_evt_status_dump();
  xTaskCreateStatic(proc_entry_looprt,"bloop_rt",stack_count,(void *)0x0,0x1a,proc_stack_looprt,
                    proc_task_looprt);
  bloop_wait_startup(&looprt);
  return 0;
}



int looprt_start_auto(void)

{
  bloop_init(&looprt);
  bloop_handler_register(&looprt,&bloop_handler_sys,0x1f);
  looprt_evt_status_dump();
  xTaskCreate(proc_entry_looprt,"bloop_rt",0x1000,(void *)0x0,0x1a,(TaskHandle_t *)0x0);
  bloop_wait_startup(&looprt);
  return 0;
}



int looprt_handler_register(loop_evt_handler *handler,int priority)

{
  int iVar1;
  
  if (looprt.looper != (TaskHandle_t)0x0) {
    iVar1 = bloop_handler_register(&looprt,handler,priority);
    return iVar1;
  }
  return -1;
}



int looprt_timer_register(loop_timer *timer)

{
  bloop_timer_register(&looprt,timer);
  return 0;
}



void cmd_looprt_test(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt test ======\r\n");
  printf("struct loop_ctx size is %d\r\n",0x4a0);
  printf("MSG size is %d\r\n",0x18);
  looprt_start_auto();
  return;
}



void cmd_looprt_test_status(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt test status ======\r\n");
  looprt_evt_status_dump();
  return;
}



void cmd_looprt_test_evt(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt EVT ======\r\n");
  looprt_evt_notify_async(0x1f,0);
  return;
}



void cmd_looprt_test_evt_dump(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt EVT status ======\r\n");
  looprt_evt_notify_async(0x1f,1);
  return;
}



void cmd_looprt_test_schedule_evt1(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt Schedule EVT1 ======\r\n");
  looprt_evt_schedule(0x1f,1,20000);
  return;
}



void cmd_looprt_test_schedule_evt2(char *buf,int len,int argc,char **argv)

{
  puts("====== looprt Schedule EVT2 ======\r\n");
  looprt_evt_schedule(0x1f,1,10000);
  return;
}



int looprt_test_cli_init(void)

{
  return 0;
}



void _cb_led_trigger(loop_ctx *loop,loop_timer *timer,void *arg)

{
  TickType_t TVar1;
  undefined *puVar2;
  
  bl_gpio_output_set(*(uint8_t *)((int)arg + 0x30),*(int *)((int)arg + 0x38) != 0);
  if ((_fsymc_level_loopset < BLOG_LEVEL_INFO) &&
     (_fsymf_level_loopsetloopset_led < BLOG_LEVEL_INFO)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    if (*(int *)((int)arg + 0x38) == 0) {
      puVar2 = &DAT_23084b74;
    }
    else {
      puVar2 = &DAT_23084b70;
    }
    bl_printk("[%10u][%s: %s:%4d] [LED] [CB] Set pin %d to %s\r\n",TVar1,"DEBUG ","loopset_led.c",
              0x95,*(undefined4 *)((int)arg + 0x30),puVar2);
  }
  *(uint *)((int)arg + 0x38) = (uint)(*(int *)((int)arg + 0x38) == 0);
  return;
}



int _led_bloop_msg(loop_ctx *loop,loop_evt_handler *handler,loop_msg *msg)

{
  TickType_t TVar1;
  
  if ((_fsymc_level_loopset < BLOG_LEVEL_INFO) &&
     (_fsymf_level_loopsetloopset_led < BLOG_LEVEL_INFO)) {
    if (TrapNetCounter == 0) {
      TVar1 = xTaskGetTickCount();
    }
    else {
      TVar1 = xTaskGetTickCountFromISR();
    }
    bl_printk(
              "[%10u][%s: %s:%4d] [LED] [MSG] called with msg info\r\n    priority %u\r\n    dst %u\r\n    msgid %u\r\n    src %u\r\n    arg1 %p\r\n    arg2 %p\r\n"
              ,TVar1,"DEBUG ","loopset_led.c",0x78,(uint)*(byte *)&msg->u,
              (uint)*(byte *)((int)&msg->u + 1),(uint)*(byte *)((int)&msg->u + 2));
    return 0;
  }
  return 0;
}



int _led_bloop_evt(loop_ctx *loop,loop_evt_handler *handler,uint32_t *bitmap_evt,
                  uint32_t *evt_type_map)

{
  char **ppcVar1;
  uint uVar2;
  TickType_t TVar3;
  char *pcVar4;
  undefined *puVar5;
  char *pcVar6;
  char **ppcVar7;
  char **ppcVar8;
  
  uVar2 = *evt_type_map;
  do {
    if ((uVar2 & 1) == 0) {
      if ((uVar2 & 2) == 0) {
        if (uVar2 != 0) {
          printf("[ASSERT] [ERR] %s:%d\r\n","loopset_led.c",0x5e);
          do {
                    // WARNING: Do nothing block with infinite loop
          } while( true );
        }
        break;
      }
      pcVar6 = handler[1].name;
      ppcVar7 = (char **)0x0;
      ppcVar1 = *(char ***)(pcVar6 + 0xc);
      if (ppcVar1 != (char **)0x0) {
        ppcVar7 = (char **)ppcVar1[1];
      }
      while (ppcVar8 = ppcVar7, ppcVar1 != (char **)(pcVar6 + 8)) {
        if ((_fsymc_level_loopset < BLOG_LEVEL_WARN) &&
           (_fsymf_level_loopsetloopset_led < BLOG_LEVEL_WARN)) {
          if (TrapNetCounter == 0) {
            TVar3 = xTaskGetTickCount();
          }
          else {
            TVar3 = xTaskGetTickCountFromISR(loop);
          }
          puVar5 = &DAT_23084b70;
          if (ppcVar1[0xd] == (char *)0x0) {
            puVar5 = &DAT_23084b74;
          }
          pcVar4 = "Hearbeat";
          if (ppcVar1[0xb] == (char *)0x0) {
            pcVar4 = "Blink";
          }
          bl_printk("[%10u][%s: %s:%4d] [LED] New Trigger: PIN %d, active level %s, type %s\r\n",
                    TVar3,&DAT_2307f16c,"loopset_led.c",0x4b,ppcVar1[0xc],puVar5,pcVar4);
        }
        loop = (loop_ctx *)looprt_timer_register((loop_timer *)(ppcVar1 + 2));
        ppcVar7 = (char **)ppcVar1[1];
        pcVar4 = *ppcVar1;
        *(char ***)(pcVar4 + 4) = ppcVar7;
        *ppcVar7 = pcVar4;
        ppcVar7 = *(char ***)(pcVar6 + 4);
        *ppcVar1 = pcVar6;
        *(char ***)(ppcVar1 + 1) = ppcVar7;
        *(char ***)(pcVar6 + 4) = ppcVar1;
        *(char ***)ppcVar7 = ppcVar1;
        ppcVar1 = ppcVar8;
        ppcVar7 = (char **)0x0;
        if (ppcVar8 != (char **)0x0) {
          ppcVar7 = (char **)ppcVar8[1];
        }
      }
      uVar2 = uVar2 & 0xfffffffd;
    }
    else {
      uVar2 = uVar2 & 0xfffffffe;
    }
  } while (uVar2 != 0);
  *evt_type_map = 0;
  return 0;
}



