pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int loopset_led_hook_on_looprt(void)

{
  loop_evt_handler_holder _led_bloop_handler_holder;
  int iVar1;
  
  led_ctx.trigger_queue.next = &led_ctx;
  led_ctx.trigger_queue.prev = &led_ctx;
  led_ctx.waiting_queue.next = (utils_dlist_s *)&led_ctx.waiting_queue;
  led_ctx.waiting_queue.prev = (utils_dlist_s *)&led_ctx.waiting_queue;
  iVar1 = looprt_handler_register((loop_evt_handler *)(loop_evt_handler_holder *)&ram0x23086060,1);
  return iVar1;
}



void loopset_led_trigger(int pin,uint timeon_ms)

{
  utils_dlist_s **ppuVar1;
  loop_timer *timer;
  utils_dlist_s *__s;
  TickType_t TVar2;
  
  __s = (utils_dlist_s *)pvPortMalloc(0x3c);
  if (__s == (utils_dlist_s *)0x0) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] ASSERT: %s:%d\r\n",TVar2,&UNK_2307c064,"loopset_led.c",0x9e,
              "loopset_led.c",0x9e);
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  memset(__s,0,0x3c);
  timer = (loop_timer *)(__s + 1);
  *(int *)&__s[6].prev = pin;
  bloop_timer_init(timer,0);
  bloop_timer_repeat_enable(timer);
  bloop_timer_configure(timer,timeon_ms,_cb_led_trigger,__s,1,1);
  bl_gpio_enable_output((uint8_t)pin,'\0','\0');
  vTaskEnterCritical();
  __s->prev = (utils_dlist_s *)0x420148f0;
  __s->next = led_ctx.waiting_queue.next;
  ppuVar1 = &(led_ctx.waiting_queue.next)->prev;
  led_ctx.waiting_queue.next = __s;
  *ppuVar1 = __s;
  vTaskExitCritical();
  looprt_evt_notify_async(1,2);
  return;
}



err_t sys_mbox_new(sys_mbox_t *mbox,int size)

{
  QueueHandle_t pQVar1;
  u16_t uVar2;
  
  pQVar1 = xQueueGenericCreate(0x32,4,'\0');
  *(QueueHandle_t *)mbox = pQVar1;
  uVar2 = (u16_t)(((uint)lwip_stats.sys.mbox.used + 1) * 0x10000 >> 0x10);
  if ((uint)lwip_stats.sys.mbox.max < ((uint)lwip_stats.sys.mbox.used + 1 & 0xffff)) {
    lwip_stats.sys.mbox.max = uVar2;
  }
  lwip_stats.sys.mbox.used = uVar2;
  return (err_t)-(*mbox == (sys_mbox_t)0x0);
}



void sys_mbox_free(sys_mbox_t *mbox)

{
  UBaseType_t UVar1;
  
  UVar1 = uxQueueMessagesWaiting((QueueHandle_t)*mbox);
  if (UVar1 != 0) {
    lwip_stats.sys.mbox.err = lwip_stats.sys.mbox.err + 1;
  }
  vQueueDelete((QueueHandle_t)*mbox);
  lwip_stats.sys.mbox.used = lwip_stats.sys.mbox.used - 1;
  return;
}



void sys_mbox_post(sys_mbox_t *mbox,void *data)

{
  BaseType_t BVar1;
  void *apvStack20 [2];
  
  apvStack20[0] = data;
  do {
    BVar1 = xQueueGenericSend((QueueHandle_t)*mbox,apvStack20,0xffffffff,0);
  } while (BVar1 != 1);
  return;
}



err_t sys_mbox_trypost(sys_mbox_t *mbox,void *msg)

{
  err_t eVar1;
  BaseType_t BVar2;
  void *apvStack20 [4];
  
  apvStack20[0] = msg;
  BVar2 = xQueueGenericSend((QueueHandle_t)*mbox,apvStack20,0,0);
  if (BVar2 == 1) {
    eVar1 = '\0';
  }
  else {
    eVar1 = -1;
    lwip_stats.sys.mbox.err = lwip_stats.sys.mbox.err + 1;
  }
  return eVar1;
}



u32_t sys_arch_mbox_fetch(sys_mbox_t *mbox,void **msg,u32_t timeout)

{
  TickType_t TVar1;
  BaseType_t BVar2;
  TickType_t TVar3;
  void *local_24;
  void *dummyptr;
  
  TVar1 = xTaskGetTickCount();
  if (msg == (void **)0x0) {
    msg = &local_24;
  }
  if (timeout == 0) {
    do {
      BVar2 = xQueueReceive((QueueHandle_t)*mbox,msg,0xffffffff);
    } while (BVar2 != 1);
  }
  else {
    BVar2 = xQueueReceive((QueueHandle_t)*mbox,msg,timeout);
    if (BVar2 != 1) {
      *msg = (void *)0x0;
      return 0xffffffff;
    }
  }
  TVar3 = xTaskGetTickCount();
  return TVar3 - TVar1;
}



u32_t sys_arch_mbox_tryfetch(sys_mbox_t *mbox,void **msg)

{
  BaseType_t BVar1;
  void *pvStack20;
  void *dummyptr;
  
  if (msg == (void **)0x0) {
    msg = &pvStack20;
  }
  BVar1 = xQueueReceive((QueueHandle_t)*mbox,msg,0);
  return -(uint)(BVar1 != 1);
}



uint sys_mbox_valid(int *param_1)

{
  return (uint)(*param_1 != 0);
}



void sys_mbox_set_invalid(undefined4 *param_1)

{
  *param_1 = 0;
  return;
}



err_t sys_sem_new(sys_sem_t *sem,u8_t count)

{
  err_t eVar1;
  QueueHandle_t xQueue;
  undefined3 in_register_0000202d;
  uint uVar2;
  
  xQueue = xQueueGenericCreate(1,0,'\x03');
  *(QueueHandle_t *)sem = xQueue;
  if (xQueue != (QueueHandle_t)0x0) {
    xQueueGenericSend(xQueue,(void *)0x0,0,0);
  }
  if ((QueueHandle_t)*sem == (QueueHandle_t)0x0) {
    lwip_stats.sys.sem.err = lwip_stats.sys.sem.err + 1;
    eVar1 = -1;
  }
  else {
    if (CONCAT31(in_register_0000202d,count) == 0) {
      xQueueSemaphoreTake((QueueHandle_t)*sem,1);
    }
    uVar2 = (uint)lwip_stats.sys.sem.used;
    lwip_stats.sys.sem.used = (u16_t)((uVar2 + 1) * 0x10000 >> 0x10);
    eVar1 = '\0';
    if ((uint)lwip_stats.sys.sem.max < (uVar2 + 1 & 0xffff)) {
      eVar1 = '\0';
      lwip_stats.sys.sem.max = lwip_stats.sys.sem.used;
    }
  }
  return eVar1;
}



u32_t sys_arch_sem_wait(sys_sem_t *sem,u32_t timeout)

{
  TickType_t TVar1;
  BaseType_t BVar2;
  TickType_t TVar3;
  
  TVar1 = xTaskGetTickCount();
  if (timeout == 0) {
    do {
      BVar2 = xQueueSemaphoreTake((QueueHandle_t)*sem,0xffffffff);
    } while (BVar2 != 1);
  }
  else {
    BVar2 = xQueueSemaphoreTake((QueueHandle_t)*sem,timeout);
    if (BVar2 != 1) {
      return 0xffffffff;
    }
  }
  TVar3 = xTaskGetTickCount();
  return TVar3 - TVar1;
}



void sys_sem_free(sys_sem_t *sem)

{
  lwip_stats.sys.sem.used = lwip_stats.sys.sem.used - 1;
  vQueueDelete((QueueHandle_t)*sem);
  return;
}



int sys_sem_valid(sys_sem_t *sem)

{
  return (uint)(*sem != (sys_sem_t)0x0);
}



void sys_sem_set_invalid(sys_sem_t *sem)

{
  *sem = (sys_sem_t)0x0;
  return;
}



void sys_init(void)

{
  s_nextthread = 0;
  return;
}



err_t sys_mutex_new(sys_mutex_t *mutex)

{
  err_t eVar1;
  QueueHandle_t pQVar2;
  uint uVar3;
  
