pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  pQVar2 = xQueueCreateMutex('\x01');
  *(QueueHandle_t *)mutex = pQVar2;
  if (pQVar2 == (QueueHandle_t)0x0) {
    lwip_stats.sys.mutex.err = lwip_stats.sys.mutex.err + 1;
    eVar1 = -1;
  }
  else {
    uVar3 = (uint)lwip_stats.sys.mutex.used;
    lwip_stats.sys.mutex.used = (u16_t)((uVar3 + 1) * 0x10000 >> 0x10);
    eVar1 = '\0';
    if ((uint)lwip_stats.sys.mutex.max < (uVar3 + 1 & 0xffff)) {
      eVar1 = '\0';
      lwip_stats.sys.mutex.max = lwip_stats.sys.mutex.used;
    }
  }
  return eVar1;
}



void sys_mutex_lock(sys_mutex_t *mutex)

{
  sys_arch_sem_wait((sys_sem_t *)mutex,0);
  return;
}



void sys_mutex_unlock(sys_mutex_t *mutex)

{
  xQueueGenericSend((QueueHandle_t)*mutex,(void *)0x0,0,0);
  return;
}



void sys_sem_signal(sys_mutex_t *mutex)

{
  xQueueGenericSend((QueueHandle_t)*mutex,(void *)0x0,0,0);
  return;
}



sys_thread_t sys_thread_new(char *name,lwip_thread_fn *thread,void *arg,int stacksize,int prio)

{
  BaseType_t BVar1;
  TaskHandle_t ptStack20;
  TaskHandle_t CreatedTask;
  
  if (s_nextthread < 6) {
    BVar1 = xTaskCreate((TaskFunction_t *)thread,name,(uint16_t)stacksize,arg,prio,&ptStack20);
    if (BVar1 != 1) {
      ptStack20 = (sys_thread_t)0x0;
    }
    return ptStack20;
  }
  return (sys_thread_t)0x0;
}



sys_prot_t sys_arch_protect(void)

{
  vTaskEnterCritical();
  return 1;
}



void sys_arch_unprotect(void)

{
  if ((xSchedulerRunning != 0) && (pxCurrentTCB->uxCriticalNesting != 0)) {
    vTaskExitCritical();
    return;
  }
  return;
}



TickType_t sys_now(void)

{
  return xTickCount;
}



// WARNING: Variable defined which should be unmapped: addr

hostent * lwip_gethostbyname(char *name)

{
  char *s_aliases;
  ip_addr_t s_hostent_addr;
  ip_addr_t *s_phostent_addr [2];
  hostent s_hostent;
  char s_hostname [257];
  err_t eVar1;
  undefined3 extraout_var;
  hostent *phVar2;
  ip_addr_t iStack20;
  ip_addr_t addr;
  
  eVar1 = netconn_gethostbyname(name,&iStack20);
  if (CONCAT31(extraout_var,eVar1) == 0) {
    s_hostent_addr = (u32_t)iStack20;
    s_phostent_addr[0] = (ip_addr_t *)0x4200ded8;
    s_phostent_addr[1] = (ip_addr_t *)0x0;
    strncpy((char *)0x4201490c,name,0x100);
    phVar2 = (hostent *)0x420148f8;
  }
  else {
    h_errno = 0xd2;
    phVar2 = (hostent *)0x0;
  }
  return phVar2;
}



void lwip_freeaddrinfo(addrinfo *ai)

{
  addrinfo *paVar1;
  
  if (ai != (addrinfo *)0x0) {
    do {
      paVar1 = ai->ai_next;
      memp_free(MEMP_NETDB,ai);
      ai = paVar1;
    } while (paVar1 != (addrinfo *)0x0);
    return;
  }
  return;
}



// WARNING: Variable defined which should be unmapped: addr
// WARNING: Type propagation algorithm not settling

int lwip_getaddrinfo(char *nodename,char *servname,addrinfo *hints,addrinfo **res)

{
  err_t eVar1;
  u16_t n;
  int iVar2;
  size_t __n;
  undefined3 extraout_var;
  addrinfo *__s;
  size_t __n_00;
  uint uVar3;
  ip_addr_t iStack36;
  ip_addr_t addr;
  
  if (res == (addrinfo **)0x0) {
    return 0xca;
  }
  *res = (addrinfo *)0x0;
  if (nodename != (char *)0x0) {
    if (hints != (addrinfo *)0x0) goto LAB_2303a49a;
    n = 0;
    if (servname != (char *)0x0) goto LAB_2303a4ac;
    goto LAB_2303a502;
  }
  if (servname == (char *)0x0) {
    return 200;
  }
  if (hints == (addrinfo *)0x0) {
LAB_2303a4ac:
    iVar2 = atoi(servname);
    n = (u16_t)iVar2;
    if (0xfffe < iVar2 - 1U) {
      return 0xc9;
    }
    if (nodename != (char *)0x0) {
      if (hints == (addrinfo *)0x0) {
LAB_2303a502:
        eVar1 = netconn_gethostbyname(nodename,&iStack36);
        if (CONCAT31(extraout_var,eVar1) != 0) {
          return 0xca;
        }
      }
      else {
LAB_2303a4ca:
        if ((hints->ai_flags & 4U) == 0) goto LAB_2303a502;
        iVar2 = ip4addr_aton(nodename,(ip4_addr_t *)&iStack36);
        if (iVar2 == 0) {
          return 200;
        }
      }
      __n = strlen(nodename);
      __n_00 = __n + 0x31;
      if (0x100 < __n) {
        return 0xca;
      }
      goto LAB_2303a53c;
    }
  }
  else {
LAB_2303a49a:
    uVar3 = hints->ai_family & 0xfffffffd;
    n = (u16_t)uVar3;
    if (uVar3 != 0) {
      return 0xcc;
    }
    if (servname != (char *)0x0) goto LAB_2303a4ac;
    if (nodename != (char *)0x0) goto LAB_2303a4ca;
  }
  if ((hints == (addrinfo *)0x0) || ((hints->ai_flags & 1U) == 0)) {
    iStack36 = (ip4_addr_t)0x100007f;
  }
  else {
    iStack36 = (ip4_addr_t)0x0;
  }
  __n = 0;
  __n_00 = 0x30;
LAB_2303a53c:
  __s = (addrinfo *)memp_malloc(MEMP_NETDB);
  iVar2 = 0xcb;
  if (__s != (addrinfo *)0x0) {
    memset(__s,0,__n_00);
    *(ip4_addr_t *)&((ip4_addr_t *)&__s[1].ai_family)->addr = iStack36;
    *(undefined2 *)&__s[1].ai_flags = 0x210;
    n = lwip_htons(n);
    *(u16_t *)((int)&__s[1].ai_flags + 2) = n;
    __s->ai_family = 2;
    if (hints != (addrinfo *)0x0) {
      __s->ai_socktype = hints->ai_socktype;
      __s->ai_protocol = hints->ai_protocol;
    }
    if (nodename != (char *)0x0) {
      *(socklen_t **)&__s->ai_canonname = &__s[1].ai_addrlen;
      memcpy(&__s[1].ai_addrlen,nodename,__n);
      __s->ai_canonname[__n] = '\0';
    }
    __s->ai_addrlen = 0x10;
    *(addrinfo **)&__s->ai_addr = __s + 1;
    *res = __s;
    iVar2 = 0;
  }
  return iVar2;
}



err_t netifapi_do_netif_add(tcpip_api_call_data *m)

{
  err_t eVar1;
  netif *pnVar2;
  
  pnVar2 = netif_add(*(netif **)(m + 1),(ip4_addr_t *)m[1].sem,*(ip4_addr_t **)(m + 2),
                     (ip4_addr_t *)m[2].sem,*(void **)(m + 3),(netif_init_fn_conflict *)m[3].sem,
                     *(netif_input_fn **)(m + 4));
  if (pnVar2 == (netif *)0x0) {
    eVar1 = -0xc;
  }
  else {
    eVar1 = '\0';
  }
  return eVar1;
}



err_t netifapi_do_netif_set_addr(tcpip_api_call_data *m)

{
  netif_set_addr(*(netif **)(m + 1),(ip4_addr_t *)m[1].sem,*(ip4_addr_t **)(m + 2),
                 (ip4_addr_t *)m[2].sem);
  return '\0';
}



err_t netifapi_do_netif_common(tcpip_api_call_data *m)

{
  err_t eVar1;
  
  if (*(code **)(m + 2) != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2303a5f4. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (**(code **)(m + 2))();
    return eVar1;
  }
  (*(code *)m[1].sem)(*(undefined4 *)(m + 1),m[1].sem);
  return '\0';
}



