pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

err_t netifapi_netif_add(netif *netif,ip4_addr_t *ipaddr,ip4_addr_t *netmask,ip4_addr_t *gw,
                        void *state,netif_init_fn init,netif_input_fn *input)

{
  err_t eVar1;
  undefined auStack52 [4];
  netifapi_msg msg;
  
  if (ipaddr == (ip4_addr_t *)0x0) {
    ipaddr = (ip4_addr_t *)&ip_addr_any;
  }
  if (netmask == (ip4_addr_t *)0x0) {
    netmask = (ip4_addr_t *)&ip_addr_any;
  }
  if (gw == (ip4_addr_t *)0x0) {
    gw = (ip4_addr_t *)&ip_addr_any;
  }
  msg.call.sem = (sys_sem_t)netif;
  msg.netif = (netif *)ipaddr;
  msg.msg._0_4_ = netmask;
  msg.msg._4_4_ = gw;
  msg.msg._8_4_ = state;
  msg.msg._12_4_ = init;
  msg.msg._16_4_ = input;
  eVar1 = tcpip_api_call(netifapi_do_netif_add,(tcpip_api_call_data *)auStack52);
  return eVar1;
}



// WARNING: Could not reconcile some variable overlaps

err_t netifapi_netif_set_addr(netif *netif,ip4_addr_t *ipaddr,ip4_addr_t *netmask,ip4_addr_t *gw)

{
  err_t eVar1;
  undefined auStack52 [4];
  netifapi_msg msg;
  
  if (ipaddr == (ip4_addr_t *)0x0) {
    ipaddr = (ip4_addr_t *)&ip_addr_any;
  }
  if (netmask == (ip4_addr_t *)0x0) {
    netmask = (ip4_addr_t *)&ip_addr_any;
  }
  if (gw == (ip4_addr_t *)0x0) {
    gw = (ip4_addr_t *)&ip_addr_any;
  }
  msg.call.sem = (sys_sem_t)netif;
  msg.netif = (netif *)ipaddr;
  msg.msg._0_4_ = netmask;
  msg.msg._4_4_ = gw;
  eVar1 = tcpip_api_call(netifapi_do_netif_set_addr,(tcpip_api_call_data *)auStack52);
  return eVar1;
}



// WARNING: Could not reconcile some variable overlaps

err_t netifapi_netif_common(netif *netif,netifapi_void_fn voidfunc,netifapi_errt_fn errtfunc)

{
  err_t eVar1;
  undefined auStack52 [4];
  netifapi_msg msg;
  
  msg.call.sem = (sys_sem_t)netif;
  msg.netif = (netif *)voidfunc;
  msg.msg._0_4_ = errtfunc;
  eVar1 = tcpip_api_call(netifapi_do_netif_common,(tcpip_api_call_data *)auStack52);
  return eVar1;
}



int alloc_socket(netconn *newconn,int accepted)

{
  int iVar1;
  u16_t uVar2;
  lwip_sock *plVar3;
  
  uVar2 = (u16_t)accepted;
  plVar3 = sockets;
  iVar1 = 0;
  do {
    sys_arch_protect();
    if (plVar3->conn == (netconn *)0x0) {
      sockets[iVar1].conn = newconn;
      sys_arch_unprotect();
      sockets[iVar1].lastdata = 0;
      sockets[iVar1].rcvevent = 0;
      if ((newconn->type & 0xf0) != NETCONN_TCP) {
        uVar2 = 1;
      }
      sockets[iVar1].sendevent = uVar2;
      sockets[iVar1].errevent = 0;
      return iVar1;
    }
    iVar1 = iVar1 + 1;
    sys_arch_unprotect();
    plVar3 = plVar3 + 1;
  } while (iVar1 != 0x15);
  return -1;
}



void lwip_link_select_cb(lwip_select_cb *select_cb)

{
  sys_arch_protect();
  select_cb->next = select_cb_list;
  if (select_cb_list != (lwip_select_cb *)0x0) {
    select_cb_list->prev = select_cb;
  }
  select_cb_ctr = select_cb_ctr + 1;
  select_cb_list = select_cb;
  sys_arch_unprotect();
  return;
}



void lwip_unlink_select_cb(lwip_select_cb *select_cb)

{
  lwip_select_cb **pplVar1;
  
  sys_arch_protect();
  if (select_cb->next != (lwip_select_cb *)0x0) {
    select_cb->next->prev = select_cb->prev;
  }
  pplVar1 = &select_cb_list;
  if (select_cb_list != select_cb) {
    pplVar1 = (lwip_select_cb **)select_cb->prev;
  }
  ((lwip_select_cb *)pplVar1)->next = select_cb->next;
  select_cb_ctr = select_cb_ctr + 1;
  sys_arch_unprotect();
  return;
}



int lwip_selscan(int maxfdp1,_types_fd_set *readset_in,_types_fd_set *writeset_in,
                _types_fd_set *exceptset_in,_types_fd_set *readset_out,_types_fd_set *writeset_out,
                _types_fd_set *exceptset_out)

{
  short sVar1;
  u16_t uVar2;
  u16_t uVar3;
  uint uVar4;
  uint uVar5;
  int iVar6;
  int iVar7;
  lwip_sock *plVar8;
  s16_t rcvevent;
  fd_mask local_58;
  _types_fd_set lreadset;
  _types_fd_set lwriteset;
  _types_fd_set lexceptset;
  
  iVar6 = 0;
  do {
    *(undefined *)((int)&local_58 + iVar6) = 0;
    iVar6 = iVar6 + 1;
  } while (iVar6 != 8);
  iVar6 = 0;
  do {
    *(undefined *)((int)lreadset.fds_bits + iVar6 + 4) = 0;
    iVar6 = iVar6 + 1;
  } while (iVar6 != 8);
  iVar6 = 0;
  do {
    *(undefined *)((int)lwriteset.fds_bits + iVar6 + 4) = 0;
    iVar6 = iVar6 + 1;
  } while (iVar6 != 8);
  plVar8 = sockets;
  iVar6 = 0;
  uVar4 = 0;
  do {
    if (maxfdp1 <= (int)uVar4) {
      readset_out->fds_bits[0] = local_58;
      readset_out->fds_bits[1] = lreadset.fds_bits[0];
      writeset_out->fds_bits[0] = lreadset.fds_bits[1];
      writeset_out->fds_bits[1] = lwriteset.fds_bits[0];
      exceptset_out->fds_bits[0] = lwriteset.fds_bits[1];
      exceptset_out->fds_bits[1] = lexceptset.fds_bits[0];
      return iVar6;
    }
    if ((((readset_in != (_types_fd_set *)0x0) &&
         ((1 << (uVar4 & 0x1f) & readset_in->fds_bits[uVar4 >> 5]) != 0)) ||
        ((writeset_in != (_types_fd_set *)0x0 &&
         ((1 << (uVar4 & 0x1f) & writeset_in->fds_bits[uVar4 >> 5]) != 0)))) ||
       ((exceptset_in != (_types_fd_set *)0x0 &&
        ((1 << (uVar4 & 0x1f) & exceptset_in->fds_bits[uVar4 >> 5]) != 0)))) {
      sys_arch_protect();
      if (0x14 < uVar4) {
        sys_arch_unprotect();
        return -1;
      }
      uVar2 = plVar8->sendevent;
      uVar3 = plVar8->errevent;
      iVar7 = plVar8->lastdata;
      sVar1 = plVar8->rcvevent;
      sys_arch_unprotect();
      if (((readset_in != (_types_fd_set *)0x0) &&
          (uVar5 = 1 << (uVar4 & 0x1f), (readset_in->fds_bits[0] & uVar5) != 0)) &&
         ((iVar7 != 0 || (0 < sVar1)))) {
        iVar6 = iVar6 + 1;
        local_58 = local_58 | uVar5;
      }
      if (((writeset_in != (_types_fd_set *)0x0) &&
          (uVar5 = 1 << (uVar4 & 0x1f), (writeset_in->fds_bits[0] & uVar5) != 0)) && (uVar2 != 0)) {
        iVar6 = iVar6 + 1;
        lreadset.fds_bits[1] = lreadset.fds_bits[1] | uVar5;
      }
      if (((exceptset_in != (_types_fd_set *)0x0) &&
          (uVar5 = 1 << (uVar4 & 0x1f), (exceptset_in->fds_bits[0] & uVar5) != 0)) && (uVar3 != 0))
      {
        iVar6 = iVar6 + 1;
        lwriteset.fds_bits[1] = lwriteset.fds_bits[1] | uVar5;
      }
    }
    uVar4 = uVar4 + 1;
    plVar8 = plVar8 + 1;
  } while( true );
}



ssize_t lwip_recv_tcp(lwip_sock *sock,void *mem,size_t len,int flags)

{
  size_t len_00;
  err_t err;
  pbuf *ppVar1;
  undefined3 extraout_var;
  int iVar2;
  void *dataptr;
  u8_t apiflags;
  uint uVar3;
  pbuf *ppStack52;
  pbuf *p;
  
  if ((int)len < 0) {
    len = 0x7fffffff;
  }
  apiflags = '\b';
  if ((flags & 8U) != 0) {
    apiflags = '\f';
  }
  len_00 = 0;
  do {
    ppVar1 = (pbuf *)sock->lastdata;
    if ((pbuf *)sock->lastdata == (pbuf *)0x0) {
      err = netconn_recv_tcp_pbuf_flags(sock->conn,&ppStack52,apiflags);
      if (CONCAT31(extraout_var,err) != 0) {
        if (len_00 == 0) {
          iVar2 = err_to_errno(err);
          if (iVar2 != 0) {
            errno = iVar2;
          }
          return -(uint)(CONCAT31(extraout_var,err) != -0xf);
        }
        if ((flags & 1U) != 0) {
          return len_00;
        }
        goto LAB_2303a9bc;
      }
      *(pbuf **)&sock->lastdata = ppStack52;
      ppVar1 = ppStack52;
    }
    ppStack52 = ppVar1;
    uVar3 = (uint)ppStack52->tot_len;
    if ((int)len <= (int)uVar3) {
      uVar3 = len & 0xffff;
    }
    dataptr = (void *)((int)mem + len_00);
    len_00 = uVar3 + len_00;
    pbuf_copy_partial(ppStack52,dataptr,(u16_t)uVar3,0);
    if ((flags & 1U) != 0) {
      if (len_00 != 0) {
        return len_00;
      }
      goto LAB_2303aa2c;
    }
    if ((int)(ppStack52->tot_len - uVar3) < 1) {
      sock->lastdata = 0;
      pbuf_free(ppStack52);
    }
    else {
      ppVar1 = pbuf_free_header(ppStack52,(u16_t)uVar3);
      *(pbuf **)&sock->lastdata = ppVar1;
    }
    len = len - uVar3;
    apiflags = '\x1c';
  } while (0 < (int)len);
  if (len_00 == 0) {
LAB_2303aa2c:
    len_00 = 0;
  }
  else {
LAB_2303a9bc:
    netconn_tcp_recvd(sock->conn,len_00);
  }
  return len_00;
}



