pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

int lwip_sock_make_addr(u16_t port,sockaddr *from,socklen_t *fromlen)

{
  int iVar1;
  undefined2 in_register_0000202a;
  size_t *in_a3;
  uint uVar2;
  undefined2 uStack32;
  u16_t uStack30;
  sockaddr_aligned saddr;
  
  uStack32 = 0x210;
  uStack30 = lwip_htons((u16_t)from);
  saddr._0_4_ = *(undefined4 *)CONCAT22(in_register_0000202a,port);
  memset(saddr + 4,0,8);
  uVar2 = (uint)(byte)uStack32;
  iVar1 = 1;
  if ((uVar2 <= *in_a3) && (iVar1 = 0, uVar2 < *in_a3)) {
    *in_a3 = uVar2;
  }
  memcpy(fromlen,&uStack32,*in_a3);
  return iVar1;
}



void free_socket(lwip_sock *sock,int is_tcp)

{
  netbuf *buf;
  netconn *conn;
  
  sys_arch_protect();
  buf = (netbuf *)sock->lastdata;
  conn = sock->conn;
  sock->lastdata = 0;
  sock->conn = (netconn *)0x0;
  sys_arch_unprotect();
  if (buf != (netbuf *)0x0) {
    if (is_tcp == 0) {
      netbuf_delete(buf);
    }
    else {
      pbuf_free((pbuf *)buf);
    }
  }
  if (conn != (netconn *)0x0) {
    netconn_delete(conn);
    return;
  }
  return;
}



err_t lwip_recvfrom_udp_raw(lwip_sock *sock,int flags,msghdr *msg,u16_t *datagram_len)

{
  ushort uVar1;
  uint uVar2;
  err_t eVar3;
  undefined3 extraout_var;
  uint uVar4;
  uint uVar5;
  int iVar6;
  netbuf *pnStack52;
  netbuf *buf;
  
  if ((msg->msg_iov != (iovec *)0x0) || (eVar3 = -0x10, msg->msg_iovlen < 1)) {
    pnStack52 = (netbuf *)sock->lastdata;
    if (pnStack52 == (netbuf *)0x0) {
      eVar3 = netconn_recv_udp_raw_netbuf_flags(sock->conn,&pnStack52,((flags & 8U) != 0) << 2);
      if (CONCAT31(extraout_var,eVar3) != 0) {
        return eVar3;
      }
      *(netbuf **)&sock->lastdata = pnStack52;
    }
    iVar6 = 0;
    uVar2 = 0;
    uVar1 = pnStack52->p->tot_len;
    while ((iVar6 < msg->msg_iovlen && (uVar2 < uVar1))) {
      uVar4 = msg->msg_iov[iVar6].iov_len;
      uVar5 = uVar1 - uVar2 & 0xffff;
      if (uVar4 <= uVar5) {
        uVar5 = uVar4 & 0xffff;
      }
      pbuf_copy_partial(pnStack52->p,msg->msg_iov[iVar6].iov_base,(u16_t)uVar5,(u16_t)uVar2);
      uVar2 = uVar2 + uVar5 & 0xffff;
      iVar6 = iVar6 + 1;
    }
    if (((socklen_t *)msg->msg_name != (socklen_t *)0x0) && (msg->msg_namelen != 0)) {
      lwip_sock_make_addr((short)pnStack52 + 8,(sockaddr *)(uint)pnStack52->port,
                          (socklen_t *)msg->msg_name);
    }
    msg->msg_flags = 0;
    if (msg->msg_control != (void *)0x0) {
      msg->msg_controllen = 0;
    }
    if ((flags & 1U) == 0) {
      sock->lastdata = 0;
      netbuf_delete(pnStack52);
    }
    *datagram_len = uVar1;
    eVar3 = '\0';
  }
  return eVar3;
}



lwip_sock * get_socket(int fd)

{
  lwip_sock *plVar1;
  
  if ((0x14 < (uint)fd) || (plVar1 = sockets + fd, plVar1->conn == (netconn *)0x0)) {
    errno = 9;
    plVar1 = (lwip_sock *)0x0;
  }
  return plVar1;
}



// WARNING: Type propagation algorithm not settling

void lwip_setsockopt_callback(void *arg)

{
  ip4_addr_t iVar1;
  err_t eVar2;
  ip4_addr_t *name;
  sys_mutex_t mutex;
  lwip_sock *plVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  netif *netif;
  netconn *pnVar4;
  lwip_socket_multicast_pair *plVar5;
  uint uVar6;
  int iVar7;
  byte bVar8;
  netconn_type nVar9;
  int iVar10;
  u32_t uVar11;
  uint fd;
  ip4_addr_t iStack40;
  ip4_addr_t if_addr;
  ip4_addr_t multi_addr;
  
  fd = *(uint *)arg;
  iVar1 = (ip4_addr_t)((ip4_addr_t *)((int)arg + 4))->addr;
  iVar10 = *(int *)((int)arg + 8);
  bVar8 = (byte)iVar10;
  uVar6 = *(uint *)((int)arg + 0x10);
  name = *(ip4_addr_t **)((int)arg + 0xc);
  if ((0x14 < fd) || (pnVar4 = sockets[fd].conn, pnVar4 == (netconn *)0x0)) {
    iVar1 = (ip4_addr_t)0x9;
    goto LAB_2303ac7e;
  }
  if (iVar1 == (ip4_addr_t)0x6) {
    iVar1 = (ip4_addr_t)0x16;
    if ((((uVar6 < 4) || (iVar7 = pnVar4->pcb, iVar7 == 0)) ||
        (iVar1 = (ip4_addr_t)0x5c, (pnVar4->type & 0xf0) != NETCONN_TCP)) ||
       ((iVar1 = (ip4_addr_t)0x16, *(char *)(iVar7 + 0x14) == '\x01' ||
        (iVar1 = (ip4_addr_t)0x5c, 4 < iVar10 - 1U)))) goto LAB_2303ac7e;
    iVar1 = (ip4_addr_t)name->addr;
    switch(iVar10) {
    case 1:
      if (iVar1 == (ip4_addr_t)0x0) {
        *(ushort *)(iVar7 + 0x1a) = *(ushort *)(iVar7 + 0x1a) & 0xffbf;
        goto LAB_2303ac7e;
      }
      *(ushort *)(iVar7 + 0x1a) = *(ushort *)(iVar7 + 0x1a) | 0x40;
      break;
    case 3:
      iVar1 = (ip4_addr_t)((int)iVar1 * 1000);
    case 2:
      *(ip4_addr_t *)&((ip4_addr_t *)(iVar7 + 0x94))->addr = iVar1;
      break;
    case 4:
      *(int *)(iVar7 + 0x98) = (int)iVar1 * 1000;
      break;
    case 5:
      *(ip4_addr_t *)&((ip4_addr_t *)(iVar7 + 0x9c))->addr = iVar1;
    }
LAB_2303acfa:
    iVar1 = (ip4_addr_t)0x0;
    goto LAB_2303ac7e;
  }
  if (iVar1 == (ip4_addr_t)0xfff) {
    if (iVar10 == 0x1005) {
      iVar1 = (ip4_addr_t)0x16;
      if ((uVar6 < 0x10) || (iVar10 = name->addr * 1000 + *(int *)(name + 2) / 1000, iVar10 < 0))
      goto LAB_2303ac7e;
      pnVar4->send_timeout = iVar10;
    }
    else {
      if (iVar10 < 0x1006) {
        if (((iVar10 != 8) && (iVar10 != 0x20)) && (iVar10 != 4)) goto switchD_2303add6_caseD_7;
        if (iVar10 == 0x20) {
          iVar1 = (ip4_addr_t)0x5c;
          if ((pnVar4->type & 0xf0) != NETCONN_UDP) goto LAB_2303ac7e;
        }
        else {
          if ((iVar10 != 4) && (iVar10 != 8)) {
            bVar8 = 0;
          }
        }
        iVar1 = (ip4_addr_t)0x16;
        if ((uVar6 < 4) || (iVar10 = pnVar4->pcb, iVar1 = (ip4_addr_t)0x16, iVar10 == 0))
        goto LAB_2303ac7e;
        iVar1 = (ip4_addr_t)name->addr;
        if (iVar1 == (ip4_addr_t)0x0) {
          *(byte *)(iVar10 + 9) = *(byte *)(iVar10 + 9) & ~bVar8;
          goto LAB_2303ac7e;
        }
        *(byte *)(iVar10 + 9) = *(byte *)(iVar10 + 9) | bVar8;
      }
      else {
        if (iVar10 == 0x100a) {
          iVar1 = (ip4_addr_t)0x16;
          if (((uVar6 < 4) || (iVar10 = pnVar4->pcb, iVar10 == 0)) ||
             (iVar1 = (ip4_addr_t)0x5c, (pnVar4->type & 0xf0) != NETCONN_UDP)) goto LAB_2303ac7e;
          iVar1 = (ip4_addr_t)name->addr;
          if (iVar1 == (ip4_addr_t)0x0) {
            bVar8 = *(byte *)(iVar10 + 0x10) & 0xfe;
            goto LAB_2303ad60;
          }
          *(byte *)(iVar10 + 0x10) = *(byte *)(iVar10 + 0x10) | 1;
        }
        else {
          if (iVar10 == 0x100b) {
            iVar1 = (ip4_addr_t)0x16;
            if (uVar6 < 6) goto LAB_2303ac7e;
            netif = (netif *)0x0;
            if (*(char *)&name->addr != '\0') {
              netif = netif_find((char *)name);
              iVar1 = (ip4_addr_t)0x13;
              if (netif == (netif *)0x0) goto LAB_2303ac7e;
            }
            pnVar4 = sockets[fd].conn;
            nVar9 = pnVar4->type & 0xf0;
            if (nVar9 == NETCONN_UDP) {
              udp_bind_netif((udp_pcb *)pnVar4->pcb,netif);
            }
            else {
              if (nVar9 != NETCONN_RAW) {
                iVar1 = (ip4_addr_t)0x0;
                if (nVar9 == NETCONN_TCP) {
                  tcp_bind_netif((tcp_pcb *)pnVar4->pcb,netif);
                }
                goto LAB_2303ac7e;
              }
              raw_bind_netif((raw_pcb *)pnVar4->pcb,netif);
            }
          }
          else {
            if (iVar10 != 0x1006) goto switchD_2303add6_caseD_7;
            iVar1 = (ip4_addr_t)0x16;
            if ((uVar6 < 0x10) ||
               (uVar11 = name->addr * 1000 + *(int *)(name + 2) / 1000, (int)uVar11 < 0))
            goto LAB_2303ac7e;
            pnVar4->recv_timeout = uVar11;
          }
        }
      }
    }
    goto LAB_2303acfa;
  }
  if (iVar1 != (ip4_addr_t)0x0) goto switchD_2303add6_caseD_7;
  switch(iVar10) {
  case 1:
    if ((3 < uVar6) && (pnVar4->pcb != 0)) {
      *(undefined *)(pnVar4->pcb + 10) = (char)name->addr;
      goto LAB_2303ac7e;
    }
    goto LAB_2303afd4;
  case 2:
    if ((3 < uVar6) && (pnVar4->pcb != 0)) {
      *(undefined *)(pnVar4->pcb + 0xb) = (char)name->addr;
      goto LAB_2303ac7e;
    }
LAB_2303afd4:
    iVar1 = (ip4_addr_t)0x16;
    goto LAB_2303ac7e;
  case 3:
  case 4:
    if ((uVar6 < 8) || (pnVar4->pcb == 0)) goto LAB_2303afd4;
    if ((pnVar4->type & 0xf0) == NETCONN_UDP) {
      iStack40 = (ip4_addr_t)name[1].addr;
      if_addr = name->addr;
      if (iVar10 == 3) {
        plVar3 = get_socket(fd);
        if (plVar3 != (lwip_sock *)0x0) {
          plVar5 = socket_ipv4_multicast_memberships;
          iVar10 = 0;
          do {
            if (plVar5->sock == (lwip_sock *)0x0) {
              socket_ipv4_multicast_memberships[iVar10].sock = plVar3;
              *(ip4_addr_t *)&socket_ipv4_multicast_memberships[iVar10].if_addr.addr = iStack40;
              socket_ipv4_multicast_memberships[iVar10].multi_addr.addr = if_addr;
              eVar2 = igmp_joingroup(&iStack40,&if_addr);
              iVar10 = CONCAT31(extraout_var,eVar2);
              goto LAB_2303aed6;
            }
            iVar10 = iVar10 + 1;
            plVar5 = plVar5 + 1;
          } while (iVar10 != 0x15);
        }
        iVar1 = (ip4_addr_t)0xc;
      }
      else {
        eVar2 = igmp_leavegroup(&iStack40,&if_addr);
        iVar10 = CONCAT31(extraout_var_00,eVar2);
        plVar3 = get_socket(fd);
        if (plVar3 != (lwip_sock *)0x0) {
          plVar5 = socket_ipv4_multicast_memberships;
          iVar7 = 0;
          do {
            if (((plVar3 == plVar5->sock) && ((ip4_addr_t)(plVar5->if_addr).addr == iStack40)) &&
               ((plVar5->multi_addr).addr == if_addr)) {
              socket_ipv4_multicast_memberships[iVar7].sock = (lwip_sock *)0x0;
              socket_ipv4_multicast_memberships[iVar7].if_addr.addr = 0;
              socket_ipv4_multicast_memberships[iVar7].multi_addr.addr = 0;
              break;
            }
            iVar7 = iVar7 + 1;
            plVar5 = plVar5 + 1;
          } while (iVar7 != 0x15);
        }
LAB_2303aed6:
        if (iVar10 != 0) {
          iVar1 = (ip4_addr_t)0x63;
        }
      }
      goto LAB_2303ac7e;
    }
    break;
  case 5:
    if ((uVar6 == 0) || (pnVar4->pcb == 0)) goto LAB_2303afd4;
    if ((pnVar4->type & 0xf0) == NETCONN_UDP) {
      *(undefined *)(pnVar4->pcb + 0x1d) = *(undefined *)&name->addr;
      goto LAB_2303ac7e;
    }
    break;
  case 6:
    if ((uVar6 < 4) || (pnVar4->pcb == 0)) goto LAB_2303afd4;
    if ((pnVar4->type & 0xf0) == NETCONN_UDP) {
      ((ip4_addr_t *)(pnVar4->pcb + 0x18))->addr = name->addr;
      goto LAB_2303ac7e;
    }
    break;
  case 7:
    if ((uVar6 == 0) || (iVar10 = pnVar4->pcb, iVar10 == 0)) goto LAB_2303afd4;
    if ((pnVar4->type & 0xf0) == NETCONN_UDP) {
      if (*(char *)&name->addr == '\0') {
        bVar8 = *(byte *)(iVar10 + 0x10) & 0xf7;
      }
      else {
        bVar8 = *(byte *)(iVar10 + 0x10) | 8;
      }
LAB_2303ad60:
      *(byte *)(iVar10 + 0x10) = bVar8;
      goto LAB_2303ac7e;
    }
  }
switchD_2303add6_caseD_7:
  iVar1 = (ip4_addr_t)0x5c;
LAB_2303ac7e:
  mutex = *(sys_mutex_t *)((int)arg + 0x18);
  *(ip4_addr_t *)&((ip4_addr_t *)((int)arg + 0x14))->addr = iVar1;
  sys_sem_signal((sys_mutex_t *)mutex);
  return;
}



void event_callback(netconn *conn,netconn_evt evt,u16_t len)

{
  short sVar1;
  u16_t uVar2;
  u16_t uVar3;
  bool bVar4;
  lwip_select_cb *plVar5;
  lwip_select_cb *plVar6;
  uint fd;
  sys_prot_t sVar7;
  lwip_sock *plVar8;
  undefined3 in_register_0000202d;
  nfds_t nVar9;
  int iVar10;
  ushort *puVar11;
  uint uVar12;
  uint uVar13;
  
