pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (conn == (netconn *)0x0) {
    return;
  }
  fd = conn->socket;
  if ((int)fd < 0) {
    sVar7 = sys_arch_protect();
    fd = conn->socket;
    if ((int)fd < 0) {
      if (CONCAT31(in_register_0000202d,evt) == 0) {
        conn->socket = fd - 1;
      }
      goto LAB_2303b018;
    }
    sys_arch_unprotect(sVar7);
  }
  plVar8 = get_socket(fd);
  if (plVar8 == (lwip_sock *)0x0) {
    return;
  }
  sVar7 = sys_arch_protect();
  bVar4 = true;
  switch(CONCAT31(in_register_0000202d,evt)) {
  case 0:
    iVar10 = ((uint)(ushort)plVar8->rcvevent + 1) * 0x10000;
    plVar8->rcvevent = (s16_t)((uint)iVar10 >> 0x10);
    bVar4 = iVar10 >> 0x10 < 2;
    break;
  case 1:
    plVar8->rcvevent = plVar8->rcvevent + -1;
    goto LAB_2303b0cc;
  case 2:
    uVar2 = plVar8->sendevent;
    plVar8->sendevent = 1;
    bVar4 = uVar2 == 0;
    break;
  case 3:
    plVar8->sendevent = 0;
LAB_2303b0cc:
    bVar4 = false;
    break;
  case 4:
    bVar4 = true;
    plVar8->errevent = 1;
  }
  if ((plVar8->select_waiting != '\0') && (bVar4)) {
    sVar1 = plVar8->rcvevent;
    uVar2 = plVar8->sendevent;
    uVar3 = plVar8->errevent;
    sys_arch_unprotect();
    sVar7 = sys_arch_protect();
    uVar12 = fd >> 5;
    uVar13 = 1 << (fd & 0x1f);
    plVar5 = select_cb_list;
    while (plVar6 = plVar5, iVar10 = select_cb_ctr, plVar6 != (lwip_select_cb *)0x0) {
      if (plVar6->sem_signalled == 0) {
        if (plVar6->poll_fds == (pollfd *)0x0) {
          if (((((0 < sVar1) && (plVar6->readset != (_types_fd_set *)0x0)) &&
               ((uVar13 & plVar6->readset->fds_bits[uVar12]) != 0)) ||
              (((uVar2 != 0 && (plVar6->writeset != (_types_fd_set *)0x0)) &&
               ((uVar13 & plVar6->writeset->fds_bits[uVar12]) != 0)))) ||
             (((uVar3 != 0 && (plVar6->exceptset != (_types_fd_set *)0x0)) &&
              ((uVar13 & plVar6->exceptset->fds_bits[uVar12]) != 0)))) {
LAB_2303b17c:
            plVar6->sem_signalled = 1;
            sys_sem_signal((sys_mutex_t *)&plVar6->sem);
          }
        }
        else {
          puVar11 = (ushort *)&plVar6->poll_fds->events;
          nVar9 = 0;
          while (nVar9 != plVar6->poll_nfds) {
            if ((fd == *(uint *)(puVar11 + -2)) &&
               ((((0 < sVar1 && ((*puVar11 & 1) != 0)) || ((uVar2 != 0 && ((*puVar11 & 2) != 0))))
                || (uVar3 != 0)))) goto LAB_2303b17c;
            nVar9 = nVar9 + 1;
            puVar11 = puVar11 + 4;
          }
        }
      }
      sys_arch_unprotect(sVar7);
      sVar7 = sys_arch_protect();
      plVar5 = select_cb_list;
      if (select_cb_ctr == iVar10) {
        plVar5 = plVar6->next;
      }
    }
  }
LAB_2303b018:
  sys_arch_unprotect(sVar7);
  return;
}



// WARNING: Could not reconcile some variable overlaps

int lwip_accept(int s,sockaddr *addr,socklen_t *addrlen)

{
  int iVar1;
  err_t err;
  lwip_sock *plVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar3;
  u16_t uStack58;
  u16_t port;
  netconn *pnStack56;
  netconn *newconn;
  ip_addr_t naddr;
  sockaddr_aligned tempaddr;
  
  uStack58 = 0;
  plVar2 = get_socket(s);
  if (plVar2 == (lwip_sock *)0x0) {
    return -1;
  }
  err = netconn_accept(plVar2->conn,(netconn **)&stack0xffffffc8);
  if (CONCAT31(extraout_var,err) == 0) {
    iVar3 = alloc_socket(pnStack56,1);
    if (iVar3 == -1) {
      netconn_delete(pnStack56);
      errno = 0x17;
      return -1;
    }
    sys_arch_protect();
    iVar1 = pnStack56->socket;
    pnStack56->socket = iVar3;
    sys_arch_unprotect();
    if (pnStack56->callback != (netconn_callback *)0x0) {
      iVar1 = (int)(short)~(ushort)iVar1;
      while (0 < iVar1) {
        iVar1 = iVar1 + -1;
        (*pnStack56->callback)(pnStack56,NETCONN_EVT_RCVPLUS,0);
      }
    }
    if (addr == (sockaddr *)0x0) {
      return iVar3;
    }
    if (addrlen == (socklen_t *)0x0) {
      return iVar3;
    }
    err = netconn_getaddr(pnStack56,(ip_addr_t *)&newconn,&uStack58,'\0');
    if (CONCAT31(extraout_var_00,err) == 0) {
      naddr.addr._0_2_ = 0x210;
      naddr.addr._2_2_ = lwip_htons(uStack58);
      tempaddr._0_4_ = (ip_addr_t)newconn;
      memset(tempaddr + 4,0,8);
      if ((uint)(byte)naddr.addr < *addrlen) {
        *addrlen = (uint)(byte)naddr.addr;
      }
      memcpy(addr,&naddr,*addrlen);
      return iVar3;
    }
    netconn_delete(pnStack56);
    free_socket(sockets + iVar3,1);
  }
  else {
    if ((plVar2->conn->type & 0xf0) != NETCONN_TCP) {
      errno = 0x5f;
      return -1;
    }
    if (CONCAT31(extraout_var,err) == -0xf) {
      errno = 0x16;
      return -1;
    }
  }
  iVar3 = err_to_errno(err);
  if (iVar3 != 0) {
    errno = iVar3;
  }
  return -1;
}



// WARNING: Type propagation algorithm not settling

int lwip_bind(int s,sockaddr *name,socklen_t namelen)

{
  err_t err;
  u16_t port;
  lwip_sock *plVar1;
  int iVar2;
  undefined3 extraout_var;
  ip_addr_t iStack20;
  ip_addr_t local_addr;
  
  plVar1 = get_socket(s);
  if (plVar1 != (lwip_sock *)0x0) {
    if (((namelen == 0x10) && (name->sa_family == '\x02')) && (((uint)name & 3) == 0)) {
      iStack20 = (ip_addr_t)((ip_addr_t *)(name->sa_data + 2))->addr;
      port = lwip_htons(*(u16_t *)name->sa_data);
      err = netconn_bind(plVar1->conn,&iStack20,port);
      if (CONCAT31(extraout_var,err) == 0) {
        return 0;
      }
    }
    else {
      err = -0x10;
    }
    iVar2 = err_to_errno(err);
    if (iVar2 != 0) {
      errno = iVar2;
    }
  }
  return -1;
}



// WARNING: Type propagation algorithm not settling

int lwip_close(int s)

{
  lwip_socket_multicast_pair *plVar1;
  uint is_tcp;
  err_t err;
  lwip_sock *sock;
  netconn *pnVar2;
  undefined3 extraout_var;
  int iVar3;
  ip_addr_t iStack40;
  ip_addr_t multi_addr;
  ip_addr_t if_addr;
  
  sock = get_socket(s);
  if (sock != (lwip_sock *)0x0) {
    is_tcp = 0;
    if (sock->conn != (netconn *)0x0) {
      is_tcp = (uint)((sock->conn->type & 0xf0) == NETCONN_TCP);
    }
    pnVar2 = (netconn *)get_socket(s);
    if (pnVar2 != (netconn *)0x0) {
      plVar1 = socket_ipv4_multicast_memberships;
      do {
        if (pnVar2 == ((lwip_sock *)plVar1)->conn) {
          iStack40 = (ip_addr_t)((ip_addr_t *)&((lwip_sock *)plVar1)->rcvevent)->addr;
          ((lwip_sock *)plVar1)->conn = (netconn *)0x0;
          *(undefined4 *)&((lwip_sock *)plVar1)->rcvevent = 0;
          multi_addr = ((ip_addr_t *)&((lwip_sock *)plVar1)->lastdata)->addr;
          ((lwip_sock *)plVar1)->lastdata = 0;
          netconn_join_leave_group(*(netconn **)&pnVar2->type,&iStack40,&multi_addr,NETCONN_LEAVE);
        }
        plVar1 = (lwip_socket_multicast_pair *)&((lwip_sock *)plVar1)->errevent;
      } while ((lwip_sock *)plVar1 != sockets);
    }
    err = netconn_prepare_delete(sock->conn);
    if (CONCAT31(extraout_var,err) == 0) {
      free_socket(sock,is_tcp);
      return 0;
    }
    iVar3 = err_to_errno(err);
    if (iVar3 != 0) {
      errno = iVar3;
    }
  }
  return -1;
}



// WARNING: Type propagation algorithm not settling

