pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int lwip_connect(int s,sockaddr *name,socklen_t namelen)

{
  err_t err;
  u16_t port;
  lwip_sock *plVar1;
  undefined3 extraout_var;
  int iVar2;
  undefined3 extraout_var_00;
  ip_addr_t iStack20;
  ip_addr_t remote_addr;
  
  plVar1 = get_socket(s);
  if (plVar1 == (lwip_sock *)0x0) {
    return 0xffffffff;
  }
  if (name->sa_family == '\0') {
    err = netconn_disconnect(plVar1->conn);
    iVar2 = CONCAT31(extraout_var,err);
  }
  else {
    if (((namelen != 0x10) || (name->sa_family != '\x02')) || (((uint)name & 3) != 0)) {
      err = -0x10;
      goto LAB_2303b43e;
    }
    iStack20 = (ip_addr_t)((ip_addr_t *)(name->sa_data + 2))->addr;
    port = lwip_htons(*(u16_t *)name->sa_data);
    err = netconn_connect(plVar1->conn,&iStack20,port);
    iVar2 = CONCAT31(extraout_var_00,err);
  }
  err = (err_t)iVar2;
  if (iVar2 == 0) {
    return 0;
  }
LAB_2303b43e:
  iVar2 = err_to_errno(err);
  if (iVar2 != 0) {
    errno = iVar2;
  }
  return -1;
}



int lwip_listen(int s,int backlog)

{
  err_t err;
  lwip_sock *plVar1;
  undefined3 extraout_var;
  int iVar2;
  u8_t backlog_00;
  
  plVar1 = get_socket(s);
  if (plVar1 != (lwip_sock *)0x0) {
    if (backlog < 0) {
      backlog = 0;
    }
    backlog_00 = (u8_t)backlog;
    if (0xff < backlog) {
      backlog_00 = -1;
    }
    err = netconn_listen_with_backlog(plVar1->conn,backlog_00);
    if (CONCAT31(extraout_var,err) == 0) {
      return 0;
    }
    if ((plVar1->conn->type & 0xf0) == NETCONN_TCP) {
      iVar2 = err_to_errno(err);
      if (iVar2 != 0) {
        errno = iVar2;
      }
    }
    else {
      errno = 0x5f;
    }
  }
  return -1;
}



// WARNING: Could not reconcile some variable overlaps

ssize_t lwip_recvfrom(int s,void *mem,size_t len,int flags,sockaddr *from,socklen_t *fromlen)

{
  uint uVar1;
  err_t err;
  lwip_sock *sock;
  ssize_t sVar2;
  undefined3 extraout_var;
  int iVar3;
  socklen_t sVar4;
  u16_t uStack70;
  u16_t datagram_len;
  void *pvStack68;
  iovec vec;
  msghdr msg;
  
  sock = get_socket(s);
  if (sock != (lwip_sock *)0x0) {
    if ((sock->conn->type & 0xf0) == NETCONN_TCP) {
      sVar2 = lwip_recv_tcp(sock,mem,len,flags);
      if (from == (sockaddr *)0x0) {
        return sVar2;
      }
      if (fromlen == (socklen_t *)0x0) {
        return sVar2;
      }
      netconn_getaddr(sock->conn,(ip_addr_t *)&vec.iov_len,(u16_t *)&stack0xffffffbc,'\0');
      lwip_sock_make_addr((short)register0x00002008 - 0x3c,(sockaddr *)((uint)pvStack68 & 0xffff),
                          (socklen_t *)from);
      return sVar2;
    }
    uStack70 = 0;
    sVar4 = 0;
    if (fromlen != (socklen_t *)0x0) {
      sVar4 = *fromlen;
    }
    pvStack68 = mem;
    vec.iov_base = (void *)len;
    vec.iov_len = (size_t)from;
    err = lwip_recvfrom_udp_raw(sock,flags,(msghdr *)&vec.iov_len,&uStack70);
    if (CONCAT31(extraout_var,err) == 0) {
      uVar1 = (uint)uStack70;
      if (len < (uint)uStack70) {
        uVar1 = len;
      }
      if (fromlen == (socklen_t *)0x0) {
        return uVar1;
      }
      *fromlen = sVar4;
      return uVar1;
    }
    iVar3 = err_to_errno(err);
    if (iVar3 != 0) {
      errno = iVar3;
    }
  }
  return -1;
}



ssize_t lwip_read(int s,void *mem,size_t len)

{
  ssize_t sVar1;
  
  sVar1 = lwip_recvfrom(s,mem,len,0,(sockaddr *)0x0,(socklen_t *)0x0);
  return sVar1;
}



ssize_t lwip_recv(int s,void *mem,size_t len,int flags)

{
  ssize_t sVar1;
  
  sVar1 = lwip_recvfrom(s,mem,len,flags,(sockaddr *)0x0,(socklen_t *)0x0);
  return sVar1;
}



// WARNING: Could not reconcile some variable overlaps

ssize_t lwip_sendto(int s,void *data,size_t size,int flags,sockaddr *to,socklen_t tolen)

{
  err_t eVar1;
  lwip_sock *plVar2;
  ssize_t sVar3;
  int iVar4;
  void *pvVar5;
  undefined3 extraout_var;
  int iVar6;
  pbuf *ppStack52;
  netbuf buf;
  
  plVar2 = get_socket(s);
  if (plVar2 == (lwip_sock *)0x0) {
    return -1;
  }
  if ((plVar2->conn->type & 0xf0) == NETCONN_TCP) {
    sVar3 = lwip_send(s,data,size,flags);
    return sVar3;
  }
  if (0xffff < size) {
    errno = 0x5a;
    return -1;
  }
  if (to != (sockaddr *)0x0) {
    if ((tolen != 0x10) || (to->sa_family != '\x02')) goto LAB_2303b61c;
    tolen = (uint)to & 3;
  }
  if (tolen == 0) {
    buf.p = (pbuf *)0x0;
    ppStack52 = (pbuf *)0x0;
    buf.addr.addr._2_1_ = '\0';
    if (to == (sockaddr *)0x0) {
      buf.ptr = (pbuf *)0x0;
      buf.addr.addr._0_2_ = 0;
    }
    else {
      buf.ptr = *(pbuf **)(to->sa_data + 2);
      buf.addr.addr._0_2_ = lwip_htons(*(u16_t *)to->sa_data);
    }
    pvVar5 = netbuf_alloc((netbuf *)&ppStack52,(u16_t)size);
    iVar4 = -1;
    if (pvVar5 != (void *)0x0) {
      if ((plVar2->conn->type & 0xf0) == NETCONN_RAW) {
        memcpy(ppStack52->payload,data,size);
      }
      else {
        buf.port = lwip_chksum_copy(ppStack52->payload,data,(u16_t)size);
        buf.addr.addr._2_1_ = '\x02';
      }
      eVar1 = netconn_send(plVar2->conn,(netbuf *)&ppStack52);
      iVar4 = CONCAT31(extraout_var,eVar1);
    }
    netbuf_free((netbuf *)&ppStack52);
    iVar6 = err_to_errno((err_t)iVar4);
    if (iVar6 != 0) {
      errno = iVar6;
    }
    if (iVar4 != 0) {
      return -1;
    }
    return size;
  }
LAB_2303b61c:
  iVar4 = err_to_errno(-0x10);
  if (iVar4 != 0) {
    errno = iVar4;
  }
  return -1;
}



ssize_t lwip_send(int s,void *data,size_t size,int flags)

{
  err_t err;
  lwip_sock *plVar1;
  ssize_t sVar2;
  undefined3 extraout_var;
  int iVar3;
  byte bVar4;
  size_t sStack20;
  size_t written;
  
  plVar1 = get_socket(s);
  if (plVar1 != (lwip_sock *)0x0) {
    if ((plVar1->conn->type & 0xf0) != NETCONN_TCP) {
      sVar2 = lwip_sendto(s,data,size,flags,(sockaddr *)0x0,0);
      return sVar2;
    }
    bVar4 = 3;
    if ((flags & 0x10U) == 0) {
      bVar4 = 1;
    }
    sStack20 = 0;
    err = netconn_write_partly(plVar1->conn,data,size,bVar4 | (byte)(flags >> 1) & 4,&sStack20);
    iVar3 = err_to_errno(err);
    if (iVar3 != 0) {
      errno = iVar3;
    }
    if (CONCAT31(extraout_var,err) == 0) {
      return sStack20;
    }
  }
  return -1;
}



