pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int lwip_socket(int domain,int type,int protocol)

{
  netconn_type t;
  netconn *newconn;
  int iVar1;
  u8_t proto;
  
  if (type == 2) {
    t = NETCONN_UDPLITE;
    if (protocol != 0x88) {
      t = NETCONN_UDP;
    }
    proto = '\0';
  }
  else {
    if (type == 3) {
      proto = (u8_t)protocol;
      t = NETCONN_RAW;
    }
    else {
      if (type != 1) {
        errno = 0x16;
        return -1;
      }
      proto = '\0';
      t = NETCONN_TCP;
    }
  }
  newconn = netconn_new_with_proto_and_callback(t,proto,event_callback);
  if (newconn == (netconn *)0x0) {
    errno = 0x69;
    return -1;
  }
  iVar1 = alloc_socket(newconn,0);
  if (iVar1 != -1) {
    newconn->socket = iVar1;
    return iVar1;
  }
  netconn_delete(newconn);
  errno = 0x17;
  return -1;
}



ssize_t lwip_write(int s,void *data,size_t size)

{
  ssize_t sVar1;
  
  sVar1 = lwip_send(s,data,size,0);
  return sVar1;
}



int lwip_select(int maxfdp1,_types_fd_set *readset,_types_fd_set *writeset,_types_fd_set *exceptset,
               timeval *timeout)

{
  uint uVar1;
  err_t eVar2;
  uint uVar3;
  undefined3 extraout_var;
  sys_prot_t sVar4;
  u8_t uVar5;
  u32_t timeout_00;
  lwip_sock *plVar6;
  uint uVar7;
  lwip_sock *plVar8;
  fd_mask local_7c;
  _types_fd_set lreadset;
  _types_fd_set lwriteset;
  _types_fd_set lexceptset;
  lwip_select_cb select_cb;
  
  if ((uint)maxfdp1 < 0x41) {
    uVar3 = lwip_selscan(maxfdp1,readset,writeset,exceptset,(_types_fd_set *)&local_7c,
                         (_types_fd_set *)(lreadset.fds_bits + 1),
                         (_types_fd_set *)(lwriteset.fds_bits + 1));
    if ((int)uVar3 < 0) {
      errno = 9;
    }
    else {
      uVar7 = uVar3;
      if ((uVar3 != 0) ||
         (((timeout != (timeval *)0x0 &&
           ((*(uint *)&timeout->tv_sec | *(uint *)((int)&timeout->tv_sec + 4)) == 0)) &&
          (uVar7 = timeout->tv_usec, uVar7 == 0)))) {
LAB_2303b9b6:
        if (readset != (_types_fd_set *)0x0) {
          readset->fds_bits[0] = local_7c;
          readset->fds_bits[1] = lreadset.fds_bits[0];
        }
        if (writeset != (_types_fd_set *)0x0) {
          writeset->fds_bits[0] = lreadset.fds_bits[1];
          writeset->fds_bits[1] = lwriteset.fds_bits[0];
        }
        if (exceptset == (_types_fd_set *)0x0) {
          return uVar7;
        }
        exceptset->fds_bits[0] = lwriteset.fds_bits[1];
        exceptset->fds_bits[1] = lexceptset.fds_bits[0];
        return uVar7;
      }
      memset(lexceptset.fds_bits + 1,0,0x24);
      select_cb.prev = (lwip_select_cb *)readset;
      select_cb.readset = writeset;
      select_cb.writeset = exceptset;
      eVar2 = sys_sem_new((sys_sem_t *)&select_cb.sem_signalled,'\0');
      if (CONCAT31(extraout_var,eVar2) == 0) {
        plVar6 = sockets;
        plVar8 = sockets;
        lwip_link_select_cb((lwip_select_cb *)(lexceptset.fds_bits + 1));
        uVar1 = 0;
        while (uVar1 != maxfdp1) {
          if ((((readset != (_types_fd_set *)0x0) &&
               ((1 << (uVar1 & 0x1f) & readset->fds_bits[uVar1 >> 5]) != 0)) ||
              ((writeset != (_types_fd_set *)0x0 &&
               ((1 << (uVar1 & 0x1f) & writeset->fds_bits[uVar1 >> 5]) != 0)))) ||
             ((exceptset != (_types_fd_set *)0x0 &&
              ((1 << (uVar1 & 0x1f) & exceptset->fds_bits[uVar1 >> 5]) != 0)))) {
            sys_arch_protect();
            if ((int)uVar1 < 0x15) {
              uVar5 = plVar8->select_waiting + '\x01';
              plVar8->select_waiting = uVar5;
              if (uVar5 != '\0') {
                sys_arch_unprotect();
                goto LAB_2303b9ec;
              }
              sockets[uVar1].select_waiting = -1;
              sys_arch_unprotect();
              errno = 0x10;
            }
            else {
              sys_arch_unprotect();
              errno = 9;
            }
            uVar7 = 0xffffffff;
            timeout_00 = 0;
            goto LAB_2303b986;
          }
LAB_2303b9ec:
          uVar1 = uVar1 + 1;
          plVar8 = plVar8 + 1;
        }
        uVar7 = lwip_selscan(maxfdp1,readset,writeset,exceptset,(_types_fd_set *)&local_7c,
                             (_types_fd_set *)(lreadset.fds_bits + 1),
                             (_types_fd_set *)(lwriteset.fds_bits + 1));
        timeout_00 = 0;
        if (uVar7 == 0) {
          timeout_00 = 0;
          if ((timeout != (timeval *)0x0) &&
             (timeout_00 = *(int *)&timeout->tv_sec * 1000 + (timeout->tv_usec + 500) / 1000,
             (int)timeout_00 < 1)) {
            timeout_00 = 1;
          }
          timeout_00 = sys_arch_sem_wait((sys_sem_t *)&select_cb.sem_signalled,timeout_00);
          uVar1 = maxfdp1;
        }
LAB_2303b986:
        while (uVar3 != uVar1) {
          if ((((readset != (_types_fd_set *)0x0) &&
               ((1 << (uVar3 & 0x1f) & readset->fds_bits[uVar3 >> 5]) != 0)) ||
              ((writeset != (_types_fd_set *)0x0 &&
               ((1 << (uVar3 & 0x1f) & writeset->fds_bits[uVar3 >> 5]) != 0)))) ||
             ((exceptset != (_types_fd_set *)0x0 &&
              ((1 << (uVar3 & 0x1f) & exceptset->fds_bits[uVar3 >> 5]) != 0)))) {
            sVar4 = sys_arch_protect();
            if ((int)uVar3 < 0x15) {
              if (plVar6->select_waiting != '\0') {
                plVar6->select_waiting = plVar6->select_waiting + -1;
              }
              sys_arch_unprotect(sVar4);
            }
            else {
              sys_arch_unprotect(sVar4);
              uVar7 = 0xffffffff;
              errno = 9;
            }
          }
          uVar3 = uVar3 + 1;
          plVar6 = plVar6 + 1;
        }
        lwip_unlink_select_cb((lwip_select_cb *)(lexceptset.fds_bits + 1));
        sys_sem_free((sys_sem_t *)&select_cb.sem_signalled);
        if (-1 < (int)uVar7) {
          if (timeout_00 != 0xffffffff) {
            uVar7 = lwip_selscan(maxfdp1,readset,writeset,exceptset,(_types_fd_set *)&local_7c,
                                 (_types_fd_set *)(lreadset.fds_bits + 1),
                                 (_types_fd_set *)(lwriteset.fds_bits + 1));
          }
          goto LAB_2303b9b6;
        }
      }
      else {
        errno = 0xc;
      }
    }
  }
  else {
    errno = 0x16;
  }
  return -1;
}



