pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int lwip_shutdown(int s,int how)

{
  err_t err;
  lwip_sock *plVar1;
  netconn *conn;
  undefined3 extraout_var;
  int iVar2;
  u8_t shut_tx;
  u8_t shut_rx;
  
  plVar1 = get_socket(s);
  if (plVar1 != (lwip_sock *)0x0) {
    conn = plVar1->conn;
    if (conn == (netconn *)0x0) {
      errno = 0x6b;
    }
    else {
      if ((conn->type & 0xf0) == NETCONN_TCP) {
        if (how == 0) {
          shut_tx = '\0';
          shut_rx = '\x01';
        }
        else {
          shut_rx = '\x01';
          if (how == 1) {
            shut_tx = '\x01';
            shut_rx = '\0';
          }
          else {
            shut_tx = '\x01';
            if (how != 2) {
              errno = 0x16;
              return -1;
            }
          }
        }
        err = netconn_shutdown(conn,shut_rx,shut_tx);
        iVar2 = err_to_errno(err);
        if (iVar2 != 0) {
          errno = iVar2;
        }
        return -(uint)(CONCAT31(extraout_var,err) != 0);
      }
      errno = 0x5f;
    }
  }
  return -1;
}



int lwip_setsockopt(int s,int level,int optname,void *optval,socklen_t optlen)

{
  err_t err;
  lwip_sock *plVar1;
  undefined3 extraout_var;
  socklen_t sVar2;
  int iStack44;
  lwip_setgetsockopt_data data;
  
  plVar1 = get_socket(s);
  sVar2 = errno;
  if (plVar1 != (lwip_sock *)0x0) {
    if (optval == (void *)0x0) {
      errno = 0xe;
      sVar2 = errno;
    }
    else {
      data.optlen = 0;
      data.err = (int)&plVar1->conn->op_completed;
      iStack44 = s;
      data.s = level;
      data.level = optname;
      data.optname = (int)optval;
      data.optval = optlen;
      err = tcpip_callback(lwip_setsockopt_callback,&iStack44);
      if (CONCAT31(extraout_var,err) == 0) {
        sys_arch_sem_wait((sys_sem_t *)data.err,0);
        sVar2 = data.optlen;
        if (data.optlen == 0) {
          return 0;
        }
      }
      else {
        sVar2 = err_to_errno(err);
        if (sVar2 == 0) {
          return -1;
        }
      }
    }
  }
  errno = sVar2;
  return -1;
}



int lwip_fcntl(int s,int cmd,int val)

{
  ushort uVar1;
  uint uVar2;
  lwip_sock *plVar3;
  byte bVar4;
  int iVar5;
  
  plVar3 = get_socket(s);
  if (plVar3 != (lwip_sock *)0x0) {
    if (cmd == 3) {
      uVar2 = 6;
      bVar4 = plVar3->conn->flags;
      if ((plVar3->conn->type & 0xf0) == NETCONN_TCP) {
        sys_arch_protect();
        uVar2 = 0;
        iVar5 = plVar3->conn->pcb;
        if ((iVar5 != 0) &&
           (uVar1 = *(ushort *)(iVar5 + 0x1a), uVar2 = (uint)((uVar1 & 0x10) == 0) << 1,
           (uVar1 & 0x20) == 0)) {
          uVar2 = uVar2 | 4;
        }
        sys_arch_unprotect();
      }
      return uVar2 | (int)(uint)bVar4 >> 1 & 1U;
    }
    if ((cmd == 4) && ((val & 0xfffffff8U) == 0)) {
      bVar4 = plVar3->conn->flags;
      if ((val & 1U) == 0) {
        bVar4 = bVar4 & 0xfd;
      }
      else {
        bVar4 = bVar4 | 2;
      }
      plVar3->conn->flags = bVar4;
      return 0;
    }
    errno = 0x26;
  }
  return -1;
}



void tcpip_thread(void *arg)

{
  byte *mem;
  undefined uVar1;
  memp_t type;
  u32_t timeout;
  int iVar2;
  undefined *puVar3;
  byte *pbStack36;
  tcpip_msg *msg;
  
  if (tcpip_init_done != (tcpip_init_done_fn)0x0) {
    (*tcpip_init_done)(tcpip_init_done_arg);
  }
switchD_2303bc70_caseD_5:
  do {
    while (timeout = sys_timeouts_sleeptime(), timeout != 0xffffffff) {
      if ((timeout != 0) &&
         (timeout = sys_arch_mbox_fetch(&tcpip_mbox,&pbStack36,timeout), timeout != 0xffffffff))
      goto LAB_2303bc5e;
      sys_check_timeouts();
    }
    sys_arch_mbox_fetch(&tcpip_mbox,&pbStack36,0);
LAB_2303bc5e:
    mem = pbStack36;
  } while (pbStack36 == (byte *)0x0);
  switch(*pbStack36) {
  case 0:
  case 4:
    (**(code **)(pbStack36 + 4))(*(undefined4 *)(pbStack36 + 8),*(code **)(pbStack36 + 4));
    goto switchD_2303bc70_caseD_5;
  case 1:
    puVar3 = *(undefined **)(pbStack36 + 8);
    uVar1 = (**(code **)(pbStack36 + 4))(puVar3,*(code **)(pbStack36 + 4));
    *puVar3 = uVar1;
    sys_sem_signal((sys_mutex_t *)*(sys_mutex_t *)(mem + 0xc));
    goto switchD_2303bc70_caseD_5;
  case 2:
    iVar2 = (**(code **)(pbStack36 + 0xc))
                      (*(undefined4 *)(pbStack36 + 4),*(undefined4 *)(pbStack36 + 8),
                       *(code **)(pbStack36 + 0xc));
    if (iVar2 != 0) {
      pbuf_free(*(pbuf **)(mem + 4));
    }
    type = MEMP_TCPIP_MSG_INPKT;
    break;
  case 3:
    (**(code **)(pbStack36 + 4))(*(undefined4 *)(pbStack36 + 8),*(code **)(pbStack36 + 4));
    type = MEMP_TCPIP_MSG_API;
    break;
  default:
    goto switchD_2303bc70_caseD_5;
  }
  memp_free(type,mem);
  goto switchD_2303bc70_caseD_5;
}



err_t tcpip_inpkt(pbuf *p,netif *inp,netif_input_fn *input_fn)

{
  err_t eVar1;
  undefined *msg;
  undefined3 extraout_var;
  
  sys_mbox_valid(&tcpip_mbox);
  msg = (undefined *)memp_malloc(MEMP_TCPIP_MSG_INPKT);
  if (msg == (undefined *)0x0) {
    printf("[LWIP] NO TCP MSG\r\n");
  }
  else {
    *(netif **)(msg + 8) = inp;
    *msg = 2;
    *(pbuf **)(msg + 4) = p;
    *(netif_input_fn **)(msg + 0xc) = input_fn;
    eVar1 = sys_mbox_trypost(&tcpip_mbox,msg);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      return eVar1;
    }
    printf("[LWIP] NO MBOX\r\n");
    memp_free(MEMP_TCPIP_MSG_INPKT,msg);
  }
  return -1;
}



err_t tcpip_input(pbuf *p,netif *inp)

{
  err_t eVar1;
  code *input_fn;
  
  if ((inp->flags & 0x18) == 0) {
    input_fn = ip4_input;
  }
  else {
    input_fn = ethernet_input;
  }
  eVar1 = tcpip_inpkt(p,inp,input_fn);
  return eVar1;
}



err_t tcpip_callback(tcpip_callback_fn function,void *ctx)

{
  err_t eVar1;
  undefined *data;
  
  sys_mbox_valid(&tcpip_mbox);
  data = (undefined *)memp_malloc(MEMP_TCPIP_MSG_API);
  if (data == (undefined *)0x0) {
    eVar1 = -1;
  }
  else {
    *data = 3;
    *(void **)(data + 8) = ctx;
    *(tcpip_callback_fn *)(data + 4) = function;
    sys_mbox_post(&tcpip_mbox,data);
    eVar1 = '\0';
  }
  return eVar1;
}



err_t tcpip_try_callback(tcpip_callback_fn function,void *ctx)

{
  err_t eVar1;
  undefined *msg;
  undefined3 extraout_var;
  
