pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  sys_mbox_valid(&tcpip_mbox);
  msg = (undefined *)memp_malloc(MEMP_TCPIP_MSG_API);
  if (msg != (undefined *)0x0) {
    *(void **)(msg + 8) = ctx;
    *msg = 3;
    *(tcpip_callback_fn *)(msg + 4) = function;
    eVar1 = sys_mbox_trypost(&tcpip_mbox,msg);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      return eVar1;
    }
    memp_free(MEMP_TCPIP_MSG_API,msg);
  }
  return -1;
}



// WARNING: Could not reconcile some variable overlaps

err_t tcpip_send_msg_wait_sem(tcpip_callback_fn fn,void *apimsg,sys_sem_t *sem)

{
  undefined auStack32 [4];
  tcpip_msg msg;
  
  sys_sem_valid(sem);
  sys_mbox_valid(&tcpip_mbox);
  auStack32[0] = 0;
  msg._0_4_ = fn;
  msg.msg._0_4_ = apimsg;
  sys_mbox_post(&tcpip_mbox,auStack32);
  sys_arch_sem_wait(sem,0);
  return '\0';
}



// WARNING: Could not reconcile some variable overlaps

err_t tcpip_api_call(tcpip_api_call_fn *fn,tcpip_api_call_data *call)

{
  sys_sem_t *sem;
  err_t eVar1;
  undefined3 extraout_var;
  undefined local_30 [4];
  tcpip_msg msg;
  
  sem = &call->sem;
  eVar1 = sys_sem_new(sem,'\0');
  if (CONCAT31(extraout_var,eVar1) == 0) {
    sys_mbox_valid(&tcpip_mbox);
    local_30[0] = 1;
    msg._0_4_ = fn;
    msg.msg._0_4_ = call;
    msg.msg._4_4_ = sem;
    sys_mbox_post(&tcpip_mbox,local_30);
    sys_arch_sem_wait(msg.msg._4_4_,0);
    sys_sem_free(sem);
    eVar1 = call->err;
  }
  return eVar1;
}



void tcpip_init(tcpip_init_done_fn initfunc,void *arg)

{
  lwip_init();
  tcpip_init_done = initfunc;
  tcpip_init_done_arg = arg;
  sys_mbox_new(&tcpip_mbox,0x32);
  sys_thread_new("TCP/IP",tcpip_thread,(void *)0x0,4000,0x1e);
  return;
}



altcp_pcb * altcp_alloc(void)

{
  altcp_pcb *__s;
  
  __s = (altcp_pcb *)memp_malloc(MEMP_ALTCP_PCB);
  if (__s != (altcp_pcb *)0x0) {
    memset(__s,0,0x2c);
  }
  return __s;
}



void altcp_free(altcp_pcb *conn)

{
  altcp_dealloc_fn paVar1;
  
  if (conn == (altcp_pcb *)0x0) {
    return;
  }
  if ((conn->fns != (altcp_functions *)0x0) &&
     (paVar1 = conn->fns->dealloc, paVar1 != (altcp_dealloc_fn)0x0)) {
    (*paVar1)(conn);
  }
  memp_free(MEMP_ALTCP_PCB,conn);
  return;
}



// WARNING: Exceeded maximum restarts with more pending

altcp_pcb * altcp_new_ip_type(altcp_allocator_t *allocator,u8_t ip_type)

{
  altcp_pcb *paVar1;
  
  if (allocator == (altcp_allocator_t *)0x0) {
    paVar1 = altcp_tcp_new_ip_type(ip_type);
    return paVar1;
  }
  if (allocator->alloc != (altcp_new_fn *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2303bf52. Too many branches
                    // WARNING: Treating indirect jump as call
    paVar1 = (*allocator->alloc)(allocator->arg);
    return paVar1;
  }
  return (altcp_pcb *)0x0;
}



altcp_pcb * altcp_new(altcp_allocator_t *allocator)

{
  altcp_pcb *paVar1;
  
  paVar1 = altcp_new_ip_type(allocator,'\0');
  return paVar1;
}



void altcp_arg(altcp_pcb *conn,void *arg)

{
  if (conn != (altcp_pcb *)0x0) {
    conn->arg = arg;
  }
  return;
}



void altcp_recv(altcp_pcb *conn,altcp_recv_fn *recv)

{
  if (conn != (altcp_pcb *)0x0) {
    conn->recv = recv;
  }
  return;
}



void altcp_sent(altcp_pcb *conn,altcp_sent_fn *sent)

{
  if (conn != (altcp_pcb *)0x0) {
    conn->sent = sent;
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

void altcp_poll(altcp_pcb *conn,altcp_poll_fn *poll,u8_t interval)

{
  altcp_set_poll_fn UNRECOVERED_JUMPTABLE;
  undefined3 in_register_00002031;
  
  if (conn != (altcp_pcb *)0x0) {
    conn->poll = poll;
    conn->pollinterval = interval;
    if ((conn->fns != (altcp_functions *)0x0) &&
       (UNRECOVERED_JUMPTABLE = conn->fns->set_poll, UNRECOVERED_JUMPTABLE != (altcp_set_poll_fn)0x0
       )) {
                    // WARNING: Could not recover jumptable at 0x2303bf86. Too many branches
                    // WARNING: Treating indirect jump as call
      (*UNRECOVERED_JUMPTABLE)((altcp_pcb *)CONCAT31(in_register_00002031,interval));
      return;
    }
  }
  return;
}



void altcp_err(altcp_pcb *conn,altcp_err_fn *err)

{
  if (conn != (altcp_pcb *)0x0) {
    conn->err = err;
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

void altcp_recved(altcp_pcb *conn,u16_t len)

{
  altcp_recved_fn *UNRECOVERED_JUMPTABLE;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->recved, UNRECOVERED_JUMPTABLE != (altcp_recved_fn *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303bf9e. Too many branches
                    // WARNING: Treating indirect jump as call
    (*UNRECOVERED_JUMPTABLE)();
    return;
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

err_t altcp_connect(altcp_pcb *conn,ip_addr_t *ipaddr,u16_t port,altcp_connected_fn connected)

{
  altcp_connect_fn *UNRECOVERED_JUMPTABLE;
  err_t eVar1;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->connect, UNRECOVERED_JUMPTABLE != (altcp_connect_fn *)0x0))
  {
                    // WARNING: Could not recover jumptable at 0x2303bfb0. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (*UNRECOVERED_JUMPTABLE)();
    return eVar1;
  }
  return -6;
}



// WARNING: Exceeded maximum restarts with more pending

void altcp_abort(altcp_pcb *conn)

{
  altcp_abort_fn UNRECOVERED_JUMPTABLE;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->abort, UNRECOVERED_JUMPTABLE != (altcp_abort_fn)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303bfc4. Too many branches
                    // WARNING: Treating indirect jump as call
    (*UNRECOVERED_JUMPTABLE)();
    return;
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

err_t altcp_close(altcp_pcb *conn)

{
  altcp_close_fn UNRECOVERED_JUMPTABLE;
  err_t eVar1;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->close, UNRECOVERED_JUMPTABLE != (altcp_close_fn)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303bfd6. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (*UNRECOVERED_JUMPTABLE)();
    return eVar1;
  }
  return -6;
}



// WARNING: Exceeded maximum restarts with more pending

