pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t altcp_write(altcp_pcb *conn,void *dataptr,u16_t len,u8_t apiflags)

{
  altcp_write_fn *UNRECOVERED_JUMPTABLE;
  err_t eVar1;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->write, UNRECOVERED_JUMPTABLE != (altcp_write_fn *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303bfea. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (*UNRECOVERED_JUMPTABLE)();
    return eVar1;
  }
  return -6;
}



// WARNING: Exceeded maximum restarts with more pending

err_t altcp_output(altcp_pcb *conn)

{
  altcp_output_fn UNRECOVERED_JUMPTABLE;
  err_t eVar1;
  
  if (((conn != (altcp_pcb *)0x0) && (conn->fns != (altcp_functions *)0x0)) &&
     (UNRECOVERED_JUMPTABLE = conn->fns->output, UNRECOVERED_JUMPTABLE != (altcp_output_fn)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303bffe. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (*UNRECOVERED_JUMPTABLE)();
    return eVar1;
  }
  return -6;
}



err_t altcp_tcp_connected(void *arg,tcp_pcb *tpcb,err_t err)

{
  err_t eVar1;
  
  if ((arg != (void *)0x0) && (*(code **)((int)arg + 0x14) != (code *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303c012. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (**(code **)((int)arg + 0x14))(*(undefined4 *)((int)arg + 8),arg);
    return eVar1;
  }
  return '\0';
}



err_t altcp_tcp_sent(void *arg,tcp_pcb *tpcb,u16_t len)

{
  err_t eVar1;
  
  if ((arg != (void *)0x0) && (*(code **)((int)arg + 0x1c) != (code *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303c026. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (**(code **)((int)arg + 0x1c))(*(undefined4 *)((int)arg + 8),arg);
    return eVar1;
  }
  return '\0';
}



err_t altcp_tcp_poll(void *arg,tcp_pcb *tpcb)

{
  err_t eVar1;
  
  if ((arg != (void *)0x0) && (*(code **)((int)arg + 0x20) != (code *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303c03a. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (**(code **)((int)arg + 0x20))(*(undefined4 *)((int)arg + 8),arg);
    return eVar1;
  }
  return '\0';
}



u16_t altcp_tcp_mss(altcp_pcb *conn)

{
  if (conn != (altcp_pcb *)0x0) {
    return *(u16_t *)((int)conn->state + 0x32);
  }
  return 0;
}



u16_t altcp_tcp_sndbuf(altcp_pcb *conn)

{
  if (conn != (altcp_pcb *)0x0) {
    return *(u16_t *)((int)conn->state + 100);
  }
  return 0;
}



u16_t altcp_tcp_sndqueuelen(altcp_pcb *conn)

{
  if (conn != (altcp_pcb *)0x0) {
    return *(u16_t *)((int)conn->state + 0x66);
  }
  return 0;
}



void altcp_tcp_nagle_disable(altcp_pcb *conn)

{
  void *pvVar1;
  
  if ((conn != (altcp_pcb *)0x0) && (pvVar1 = conn->state, pvVar1 != (void *)0x0)) {
    *(ushort *)((int)pvVar1 + 0x1a) = *(ushort *)((int)pvVar1 + 0x1a) | 0x40;
  }
  return;
}



void altcp_tcp_nagle_enable(altcp_pcb *conn)

{
  void *pvVar1;
  
  if ((conn != (altcp_pcb *)0x0) && (pvVar1 = conn->state, pvVar1 != (void *)0x0)) {
    *(ushort *)((int)pvVar1 + 0x1a) = *(ushort *)((int)pvVar1 + 0x1a) & 0xffbf;
  }
  return;
}



int altcp_tcp_nagle_disabled(altcp_pcb *conn)

{
  if ((conn != (altcp_pcb *)0x0) && (conn->state != (void *)0x0)) {
    return (uint)(*(ushort *)((int)conn->state + 0x1a) >> 6) & 1;
  }
  return 0;
}



void altcp_tcp_dealloc(altcp_pcb *conn)

{
  return;
}



ip_addr_t * altcp_tcp_get_ip(altcp_pcb *conn,int local)

{
  if (((conn != (altcp_pcb *)0x0) && (conn = (altcp_pcb *)conn->state, conn != (altcp_pcb *)0x0)) &&
     (local == 0)) {
    conn = (altcp_pcb *)&conn->inner_conn;
  }
  return (ip_addr_t *)conn;
}



u16_t altcp_tcp_get_port(altcp_pcb *conn,int local)

{
  void *pvVar1;
  
  if ((conn != (altcp_pcb *)0x0) && (pvVar1 = conn->state, pvVar1 != (void *)0x0)) {
    if (local == 0) {
      return *(u16_t *)((int)pvVar1 + 0x18);
    }
    return *(u16_t *)((int)pvVar1 + 0x16);
  }
  return 0;
}



void altcp_tcp_setup_callbacks(altcp_pcb *conn,tcp_pcb *tpcb)

{
  tcp_arg(tpcb,conn);
  tcp_recv(tpcb,altcp_tcp_recv);
  tcp_sent(tpcb,altcp_tcp_sent);
  tcp_err(tpcb,altcp_tcp_err);
  return;
}



void altcp_tcp_err(void *arg,err_t err)

{
  if (arg != (void *)0x0) {
    *(undefined4 *)((int)arg + 0xc) = 0;
    if (*(code **)((int)arg + 0x24) != (code *)0x0) {
      (**(code **)((int)arg + 0x24))(*(undefined4 *)((int)arg + 8));
    }
    altcp_free((altcp_pcb *)arg);
    return;
  }
  return;
}



err_t altcp_tcp_get_tcp_addrinfo(altcp_pcb *conn,int local,ip_addr_t *addr,u16_t *port)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    eVar1 = tcp_tcp_get_tcp_addrinfo((tcp_pcb *)conn->state,local,addr,port);
    return eVar1;
  }
  return -6;
}



void altcp_tcp_setprio(altcp_pcb *conn,u8_t prio)

{
  if (conn != (altcp_pcb *)0x0) {
    tcp_setprio((tcp_pcb *)conn->state,prio);
    return;
  }
  return;
}



err_t altcp_tcp_output(altcp_pcb *conn)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    eVar1 = tcp_output((tcp_pcb *)conn->state);
    return eVar1;
  }
  return -6;
}



err_t altcp_tcp_write(altcp_pcb *conn,void *dataptr,u16_t len,u8_t apiflags)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    eVar1 = tcp_write((tcp_pcb *)conn->state,dataptr,len,apiflags);
    return eVar1;
  }
  return -6;
}



err_t altcp_tcp_shutdown(altcp_pcb *conn,int shut_rx,int shut_tx)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    eVar1 = tcp_shutdown((tcp_pcb *)conn->state,shut_rx,shut_tx);
    return eVar1;
  }
  return -6;
}



err_t altcp_tcp_close(altcp_pcb *conn)

{
  tcp_pcb *pcb;
  err_t eVar1;
  undefined3 extraout_var;
  tcp_poll_fn *poll;
  
