pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  eVar1 = -6;
  if (conn != (altcp_pcb *)0x0) {
    pcb = (tcp_pcb *)conn->state;
    if (pcb != (tcp_pcb *)0x0) {
      poll = pcb->poll;
      tcp_arg(pcb,(void *)0x0);
      tcp_recv(pcb,(tcp_recv_fn *)0x0);
      tcp_sent(pcb,(tcp_sent_fn *)0x0);
      tcp_err(pcb,(tcp_err_fn *)0x0);
      tcp_poll(pcb,(tcp_poll_fn *)0x0,pcb->pollinterval);
      eVar1 = tcp_close(pcb);
      if (CONCAT31(extraout_var,eVar1) != 0) {
        altcp_tcp_setup_callbacks(conn,pcb);
        tcp_poll(pcb,poll,pcb->pollinterval);
        return eVar1;
      }
      conn->state = (void *)0x0;
    }
    altcp_free(conn);
    eVar1 = '\0';
  }
  return eVar1;
}



void altcp_tcp_abort(altcp_pcb *conn)

{
  if ((conn != (altcp_pcb *)0x0) && ((tcp_pcb *)conn->state != (tcp_pcb *)0x0)) {
    tcp_abort((tcp_pcb *)conn->state);
    return;
  }
  return;
}



altcp_pcb * altcp_tcp_listen(altcp_pcb *conn,u8_t backlog,err_t *err)

{
  tcp_pcb *pcb;
  
  if ((conn == (altcp_pcb *)0x0) ||
     (pcb = tcp_listen_with_backlog_and_err((tcp_pcb *)conn->state,backlog,err),
     pcb == (tcp_pcb *)0x0)) {
    conn = (altcp_pcb *)0x0;
  }
  else {
    *(tcp_pcb **)&conn->state = pcb;
    tcp_accept(pcb,altcp_tcp_accept);
  }
  return conn;
}



err_t altcp_tcp_connect(altcp_pcb *conn,ip_addr_t *ipaddr,u16_t port,altcp_connected_fn connected)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    conn->connected = connected;
    eVar1 = tcp_connect((tcp_pcb *)conn->state,ipaddr,port,altcp_tcp_connected);
    return eVar1;
  }
  return -6;
}



err_t altcp_tcp_bind(altcp_pcb *conn,ip_addr_t *ipaddr,u16_t port)

{
  err_t eVar1;
  
  if (conn != (altcp_pcb *)0x0) {
    eVar1 = tcp_bind((tcp_pcb *)conn->state,ipaddr,port);
    return eVar1;
  }
  return -6;
}



void altcp_tcp_recved(altcp_pcb *conn,u16_t len)

{
  if (conn != (altcp_pcb *)0x0) {
    tcp_recved((tcp_pcb *)conn->state,len);
    return;
  }
  return;
}



err_t altcp_tcp_recv(void *arg,tcp_pcb *tpcb,pbuf *p,err_t err)

{
  err_t eVar1;
  
  if ((arg != (void *)0x0) && (*(code **)((int)arg + 0x18) != (code *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x2303c266. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar1 = (**(code **)((int)arg + 0x18))(*(undefined4 *)((int)arg + 8));
    return eVar1;
  }
  if (p != (pbuf *)0x0) {
    pbuf_free(p);
    return '\0';
  }
  return '\0';
}



void altcp_tcp_set_poll(altcp_pcb *conn,u8_t interval)

{
  if (conn != (altcp_pcb *)0x0) {
    tcp_poll((tcp_pcb *)conn->state,altcp_tcp_poll,interval);
    return;
  }
  return;
}



err_t altcp_tcp_accept(void *arg,tcp_pcb *new_tpcb,err_t err)

{
  err_t eVar1;
  altcp_pcb *conn;
  undefined3 in_register_00002031;
  
  if ((arg != (void *)0x0) && (*(int *)((int)arg + 0x10) != 0)) {
    conn = altcp_alloc();
    if (conn != (altcp_pcb *)0x0) {
      altcp_tcp_setup_callbacks(conn,new_tpcb);
      *(tcp_pcb **)&conn->state = new_tpcb;
      conn->fns = (altcp_functions *)0x230861a8;
                    // WARNING: Could not recover jumptable at 0x2303c2dc. Too many branches
                    // WARNING: Treating indirect jump as call
      eVar1 = (**(code **)((int)arg + 0x10))
                        (*(undefined4 *)((int)arg + 8),conn,CONCAT31(in_register_00002031,err));
      return eVar1;
    }
    return -1;
  }
  return -0x10;
}



altcp_pcb * altcp_tcp_new_ip_type(u8_t ip_type)

{
  altcp_pcb *conn;
  tcp_pcb *pcb;
  
  pcb = tcp_new_ip_type(ip_type);
  conn = (altcp_pcb *)0x0;
  if (pcb != (tcp_pcb *)0x0) {
    conn = altcp_alloc();
    if (conn == (altcp_pcb *)0x0) {
      tcp_close(pcb);
    }
    else {
      altcp_tcp_setup_callbacks(conn,pcb);
      *(tcp_pcb **)&conn->state = pcb;
      conn->fns = (altcp_functions *)0x230861a8;
    }
  }
  return conn;
}



u16_t lwip_htons(u16_t n)

{
  undefined2 in_register_0000202a;
  
  return (u16_t)((ushort)(CONCAT22(in_register_0000202a,n) >> 8) | n << 8);
}



u32_t lwip_htonl(u32_t n)

{
  return n >> 8 & 0xff00 | n << 0x18 | n >> 0x18 | (n & 0xff00) << 8;
}



int lwip_strnicmp(char *str1,char *str2,size_t len)

{
  byte bVar1;
  int iVar2;
  
  iVar2 = 0;
  while( true ) {
    bVar1 = str1[iVar2];
    if ((bVar1 != str2[iVar2]) &&
       ((0x19 < (byte)((bVar1 | 0x20) + 0x9f) ||
        ((byte)(bVar1 | 0x20) != (byte)(str2[iVar2] | 0x20U))))) break;
    if ((len - 1 == iVar2) || (iVar2 = iVar2 + 1, bVar1 == 0)) {
      return 0;
    }
  }
  return 1;
}



void dns_call_found(u8_t idx,ip_addr_t *addr)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,idx);
  if (dns_requests[iVar1].found != (dns_found_callback *)0x0) {
    (*dns_requests[iVar1].found)(dns_table[iVar1].name,addr,dns_requests[iVar1].arg);
  }
  dns_requests[iVar1].found = (dns_found_callback *)0x0;
  return;
}



// WARNING: Variable defined which should be unmapped: hdr

err_t dns_send(u8_t idx)

{
  u8_t *dataptr;
  u8_t *puVar1;
  err_t eVar2;
  undefined3 in_register_00002029;
  int iVar3;
  size_t sVar4;
  pbuf *buf;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  undefined4 local_40;
  dns_query qry;
  dns_hdr hdr;
  
  iVar3 = CONCAT31(in_register_00002029,idx);
  if (dns_servers[dns_table[iVar3].server_idx].addr == 0) {
    dns_call_found(idx,(ip_addr_t *)0x0);
    eVar2 = '\0';
    dns_table[iVar3].state = '\0';
  }
  else {
    sVar4 = strlen(dns_table[iVar3].name);
    buf = pbuf_alloc(PBUF_TRANSPORT,(u16_t)((sVar4 + 0x12) * 0x10000 >> 0x10),PBUF_RAM);
    eVar2 = -1;
    if (buf != (pbuf *)0x0) {
      memset(&qry,0,0xc);
      qry.type = lwip_htons(dns_table[iVar3].txid);
      qry.cls._0_1_ = 1;
      puVar1 = &dns_table[iVar3].seqno;
      pbuf_take(buf,&qry,0xc);
      uVar6 = 0xc;
      do {
        dataptr = puVar1 + 1;
        uVar5 = 0;
        puVar1 = dataptr;
        while ((*puVar1 != '.' && (*puVar1 != '\0'))) {
          uVar5 = uVar5 + 1 & 0xff;
          puVar1 = puVar1 + 1;
        }
        if (0xfffe < uVar6 + uVar5) {
          pbuf_free(buf);
          return -6;
        }
        pbuf_put_at(buf,(u16_t)uVar6,(u8_t)uVar5);
        pbuf_take_at(buf,dataptr,(u16_t)((uint)((int)(puVar1 + -(int)dataptr) * 0x10000) >> 0x10),
                     (u16_t)((uVar6 + 1) * 0x10000 >> 0x10));
        uVar7 = uVar6 + uVar5 & 0xffff;
        uVar5 = uVar7 + 1;
        uVar6 = uVar5 & 0xffff;
      } while (*puVar1 != '\0');
      pbuf_put_at(buf,(u16_t)(uVar5 * 0x10000 >> 0x10),'\0');
      local_40 = 0x1000100;
      pbuf_take_at(buf,&local_40,4,(u16_t)((uVar7 + 2) * 0x10000 >> 0x10));
      eVar2 = udp_sendto(dns_pcbs,buf,dns_servers + dns_table[iVar3].server_idx,0x35);
      pbuf_free(buf);
    }
  }
  return eVar2;
}



void dns_check_entry(u8_t i)

{
  undefined3 in_register_00002029;
  int iVar1;
  u8_t uVar2;
  u16_t uVar3;
  uint uVar4;
  uint uVar5;
  u32_t uVar6;
  dns_table_entry_conflict1 *pdVar7;
  
  iVar1 = CONCAT31(in_register_00002029,i);
  uVar2 = dns_table[iVar1].state;
  if (uVar2 != '\x02') {
    if (uVar2 != '\x03') {
      if (uVar2 != '\x01') {
        return;
      }
      uVar4 = (uint)dns_txid;
      do {
        uVar5 = uVar4 + 1;
        uVar4 = uVar5 & 0xffff;
        pdVar7 = dns_table;
        while ((pdVar7->state != '\x02' || ((uint)pdVar7->txid != uVar4))) {
          pdVar7 = pdVar7 + 1;
          if (pdVar7 == (dns_table_entry_conflict1 *)arp_table) {
            uVar3 = (u16_t)(uVar5 * 0x10000 >> 0x10);
            dns_txid = uVar3;
            *(undefined2 *)&dns_table[iVar1].state = 2;
            dns_table[iVar1].txid = uVar3;
            *(undefined2 *)&dns_table[iVar1].tmr = 1;
            goto LAB_2303c5fe;
          }
        }
      } while( true );
    }
    uVar6 = dns_table[iVar1].ttl;
    if ((uVar6 != 0) && (uVar6 = uVar6 - 1, dns_table[iVar1].ttl = uVar6, uVar6 != 0)) {
      return;
    }
LAB_2303c65a:
    dns_table[iVar1].state = '\0';
    return;
  }
  uVar2 = dns_table[iVar1].tmr + -1;
  dns_table[iVar1].tmr = uVar2;
  if (uVar2 != '\0') {
    return;
  }
  uVar2 = dns_table[iVar1].retries + '\x01';
  dns_table[iVar1].retries = uVar2;
  if (uVar2 == '\x04') {
    if ((dns_table[iVar1].server_idx != '\0') || (dns_servers[1] == 0)) {
      dns_call_found(i,(ip_addr_t *)0x0);
      goto LAB_2303c65a;
    }
    dns_table[iVar1].server_idx = '\x01';
    *(undefined2 *)&dns_table[iVar1].tmr = 1;
  }
  else {
    dns_table[iVar1].tmr = uVar2;
  }
LAB_2303c5fe:
  dns_send(i);
  return;
}



