pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

void dns_recv(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  u8_t i;
  uint uVar1;
  u16_t uVar2;
  u16_t uVar3;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  uint uVar4;
  int iVar5;
  undefined2 extraout_var_03;
  uint uVar6;
  undefined2 extraout_var_04;
  undefined2 extraout_var_05;
  u32_t uVar7;
  undefined2 extraout_var_06;
  dns_table_entry_conflict1 *pdVar8;
  byte *pbVar9;
  int iVar10;
  uint uVar11;
  byte *pbVar12;
  short sStack96;
  short sStack94;
  dns_query qry;
  ip4_addr_t ip4addr;
  dns_hdr hdr;
  dns_answer ans;
  
  if (0xf < p->tot_len) {
    uVar2 = pbuf_copy_partial(p,&ip4addr,0xc,0);
    uVar1 = CONCAT22(extraout_var,uVar2);
    if (uVar1 == 0xc) {
      iVar10 = 0;
      uVar2 = lwip_htons((u16_t)ip4addr.addr);
      pdVar8 = dns_table;
      do {
        i = (u8_t)iVar10;
        if ((pdVar8->state == '\x02') && ((uint)pdVar8->txid == CONCAT22(extraout_var_00,uVar2))) {
          uVar2 = lwip_htons(hdr.id);
          uVar3 = lwip_htons(hdr._2_2_);
          uVar11 = CONCAT22(extraout_var_02,uVar3);
          if ((ip4addr.addr._2_1_ < '\0') &&
             ((CONCAT22(extraout_var_01,uVar2) == 1 &&
              (addr->addr == dns_servers[dns_table[iVar10].server_idx].addr)))) {
            pbVar12 = (byte *)dns_table[iVar10].name;
            goto LAB_2303c752;
          }
          break;
        }
        iVar10 = iVar10 + 1;
        pdVar8 = pdVar8 + 1;
      } while (iVar10 != 4);
    }
  }
  goto ignore_packet;
  while( true ) {
    pbVar9 = pbVar12 + uVar4;
    while( true ) {
      uVar1 = uVar1 + 1 & 0xffff;
      if (pbVar12 == pbVar9) break;
      uVar4 = pbuf_try_get_at(p,(u16_t)uVar1);
      if ((int)uVar4 < 0) goto ignore_packet;
      uVar6 = (uint)*pbVar12;
      if ((_ctype_[uVar6 + 1] & 3) == 1) {
        uVar6 = uVar6 + 0x20;
      }
      uVar4 = uVar4 & 0xff;
      if ((_ctype_[uVar4 + 1] & 3) == 1) {
        uVar4 = uVar4 + 0x20;
      }
      if ((uVar6 != uVar4) || (uVar1 == 0xffff)) goto ignore_packet;
      pbVar12 = pbVar12 + 1;
    }
    pbVar12 = pbVar12 + 1;
    iVar5 = pbuf_try_get_at(p,(u16_t)uVar1);
    if (iVar5 < 0) goto ignore_packet;
    if (iVar5 == 0) break;
LAB_2303c752:
    uVar4 = pbuf_try_get_at(p,(u16_t)uVar1);
    if ((((int)uVar4 < 0) || (uVar1 == 0xffff)) || ((uVar4 & 0xc0) == 0xc0)) goto ignore_packet;
  }
  if (uVar1 != 0xffff) {
    uVar4 = uVar1 + 1 & 0xffff;
    if (((uVar4 != 0xffff) &&
        (uVar2 = pbuf_copy_partial(p,&sStack96,4,(u16_t)((uVar1 + 1) * 0x10000 >> 0x10)),
        CONCAT22(extraout_var_03,uVar2) == 4)) &&
       ((sStack94 == 0x100 && ((sStack96 == 0x100 && (uVar4 < 0xfffc)))))) {
      if ((ip4addr.addr._3_1_ & 0xf) == 0) {
        uVar1 = uVar1 + 5;
        while ((uVar1 = uVar1 & 0xffff, uVar11 != 0 && (uVar1 < p->tot_len))) {
          do {
            uVar4 = uVar1 + 1 & 0xffff;
            uVar6 = pbuf_try_get_at(p,(u16_t)uVar1);
            if (((int)uVar6 < 0) || (uVar4 == 0)) goto ignore_packet;
            if ((uVar6 & 0xc0) == 0xc0) break;
            uVar6 = uVar6 + uVar4;
            if ((int)(uint)p->tot_len <= (int)uVar6) goto ignore_packet;
            uVar1 = uVar6 & 0xffff;
            iVar5 = pbuf_try_get_at(p,(u16_t)(uVar6 * 0x10000 >> 0x10));
            if (iVar5 < 0) goto ignore_packet;
            uVar4 = uVar1;
          } while (iVar5 != 0);
          if (uVar4 == 0xffff) goto ignore_packet;
          uVar1 = uVar4 + 1 & 0xffff;
          if (((uVar1 == 0xffff) ||
              (uVar2 = pbuf_copy_partial(p,&hdr.numauthrr,10,(u16_t)((uVar4 + 1) * 0x10000 >> 0x10))
              , CONCAT22(extraout_var_04,uVar2) != 10)) || (0xfff5 < uVar1)) goto ignore_packet;
          uVar1 = uVar4 + 0xb & 0xffff;
          if (((hdr.numextrarr == 0x100) && (hdr.numauthrr == 0x100)) && ((u16_t)ans.ttl == 0x400))
          {
            uVar2 = pbuf_copy_partial(p,&qry,4,(u16_t)((uVar4 + 0xb) * 0x10000 >> 0x10));
            if (CONCAT22(extraout_var_05,uVar2) == 4) {
              *(dns_query *)&dns_table[iVar10].ipaddr = qry;
              pbuf_free(p);
              uVar7 = lwip_htonl(ans._0_4_);
              dns_table[iVar10].state = '\x03';
              if (uVar7 < 0x93a81) {
                dns_table[iVar10].ttl = uVar7;
              }
              else {
                dns_table[iVar10].ttl = 0x93a80;
              }
              dns_call_found(i,&dns_table[iVar10].ipaddr);
              if (dns_table[iVar10].ttl != 0) {
                return;
              }
              if (dns_table[iVar10].state != '\x03') {
                return;
              }
              dns_table[iVar10].state = '\0';
              return;
            }
            goto ignore_packet;
          }
          uVar2 = lwip_htons((u16_t)ans.ttl);
          if (0xffff < (int)(CONCAT22(extraout_var_06,uVar2) + uVar1)) goto ignore_packet;
          uVar2 = lwip_htons((u16_t)ans.ttl);
          uVar1 = uVar2 + uVar1;
          uVar11 = uVar11 - 1 & 0xffff;
        }
      }
      else {
        if ((dns_table[iVar10].server_idx == '\0') && (dns_servers[1] != 0)) {
          *(undefined2 *)&dns_table[iVar10].tmr = 0x301;
          dns_check_entry(i);
          goto ignore_packet;
        }
      }
      pbuf_free(p);
      dns_call_found(i,(ip_addr_t *)0x0);
      dns_table[iVar10].state = '\0';
      return;
    }
  }
ignore_packet:
  pbuf_free(p);
  return;
}



void dns_init(void)

{
  if (dns_pcbs == (udp_pcb *)0x0) {
    dns_pcbs = udp_new_ip_type();
    udp_bind(dns_pcbs,&ip_addr_any,0);
    udp_recv(dns_pcbs,dns_recv,(void *)0x0);
    return;
  }
  return;
}



void dns_setserver(u8_t numdns,ip_addr_t *dnsserver)

{
  undefined3 in_register_00002029;
  u32_t uVar1;
  
  if (CONCAT31(in_register_00002029,numdns) < 2) {
    if (dnsserver == (ip_addr_t *)0x0) {
      uVar1 = 0;
    }
    else {
      uVar1 = dnsserver->addr;
    }
    dns_servers[CONCAT31(in_register_00002029,numdns)].addr = uVar1;
  }
  return;
}



ip_addr_t * dns_getserver(u8_t numdns)

{
  undefined3 in_register_00002029;
  
  if (CONCAT31(in_register_00002029,numdns) < 2) {
    return dns_servers + CONCAT31(in_register_00002029,numdns);
  }
  return &ip_addr_any;
}



void dns_tmr(void)

{
  dns_check_entry('\0');
  dns_check_entry('\x01');
  dns_check_entry('\x02');
  dns_check_entry('\x03');
  return;
}



err_t dns_gethostbyname_addrtype
                (char *hostname,ip_addr_t *addr,dns_found_callback *found,void *callback_arg,
                u8_t dns_addrtype)

{
  u8_t uVar1;
  uint uVar2;
  size_t __n;
  int iVar3;
  int iVar4;
  uint uVar5;
  byte bVar6;
  err_t eVar7;
  byte bVar8;
  uint uVar9;
  dns_table_entry_conflict1 *pdVar10;
  dns_table_entry_conflict1 *pdVar11;
  
  if (addr == (ip_addr_t *)0x0) {
    return -0x10;
  }
  if ((((hostname == (char *)0x0) || (*hostname == '\0')) || (dns_pcbs == (udp_pcb *)0x0)) ||
     (__n = strlen(hostname), 0xff < __n)) {
    eVar7 = -0x10;
  }
  else {
    iVar3 = ip4addr_aton(hostname,(ip4_addr_t *)addr);
    eVar7 = '\0';
    if (iVar3 == 0) {
      pdVar10 = dns_table;
      pdVar11 = dns_table;
      iVar3 = 0;
      do {
        if ((pdVar11->state == '\x03') &&
           (iVar4 = lwip_strnicmp(hostname,pdVar11->name,0x100), iVar4 == 0)) {
          addr->addr = dns_table[iVar3].ipaddr.addr;
          return '\0';
        }
        uVar1 = dns_seqno;
        iVar3 = iVar3 + 1;
        pdVar11 = pdVar11 + 1;
      } while (iVar3 != 4);
      eVar7 = -6;
      if (dns_servers[0] != 0) {
        uVar9 = 0;
        uVar2 = 4;
        bVar6 = 0;
        do {
          uVar5 = uVar9 & 0xff;
          if (pdVar10->state == '\0') goto LAB_2303cba6;
          if ((pdVar10->state == '\x03') && (bVar8 = dns_seqno - pdVar10->seqno, bVar6 < bVar8)) {
            uVar2 = uVar5;
            bVar6 = bVar8;
          }
          uVar9 = uVar9 + 1;
          pdVar10 = pdVar10 + 1;
        } while (uVar9 != 4);
        eVar7 = -1;
        if ((uVar2 != 4) &&
           (eVar7 = -1, uVar5 = uVar2, uVar9 = uVar2, dns_table[uVar2].state == '\x03')) {
LAB_2303cba6:
          iVar3 = uVar9 * 0x110;
          (&dns_table[0].state)[iVar3] = '\x01';
          (&dns_table[0].seqno)[iVar3] = uVar1;
          dns_requests[uVar5].found = found;
          dns_requests[uVar5].arg = callback_arg;
          memcpy(dns_table[0].name + iVar3,hostname,__n);
          dns_table[0].name[iVar3 + __n] = '\0';
          dns_seqno = dns_seqno + '\x01';
          dns_check_entry((u8_t)uVar5);
          eVar7 = -5;
        }
      }
    }
  }
  return eVar7;
}



err_t dns_gethostbyname(char *hostname,ip_addr_t *addr,dns_found_callback *found,void *callback_arg)

{
  err_t eVar1;
  
