pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  eVar1 = dns_gethostbyname_addrtype(hostname,addr,found,callback_arg,'\0');
  return eVar1;
}



u16_t lwip_standard_chksum(void *dataptr,int len)

{
  byte bVar1;
  ushort uVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  int iVar6;
  u16_t t;
  ushort uStack2;
  
  uStack2 = 0;
  uVar3 = (uint)dataptr & 1;
  if ((uVar3 != 0) && (0 < len)) {
    bVar1 = *(byte *)dataptr;
    len = len + -1;
    dataptr = (void *)((int)dataptr + 1);
    uStack2 = (ushort)bVar1 << 8;
  }
  uVar5 = (uint)dataptr & 3;
  if ((uVar5 != 0) && (uVar5 = 0, 1 < len)) {
    uVar5 = (uint)*(ushort *)dataptr;
    len = len + -2;
    dataptr = (void *)((int)dataptr + 2);
  }
  while (7 < len) {
    uVar4 = *(int *)dataptr + uVar5;
    if (uVar4 < uVar5) {
      uVar4 = uVar4 + 1;
    }
    uVar5 = ((int *)dataptr)[1] + uVar4;
    if (uVar5 < uVar4) {
      uVar5 = uVar5 + 1;
    }
    len = len + -8;
    dataptr = (int *)dataptr + 2;
  }
  iVar6 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
  while (1 < len) {
    len = len + -2;
    iVar6 = iVar6 + (uint)*(ushort *)dataptr;
    dataptr = (int *)((int)dataptr + 2);
  }
  if (len == 1) {
    uStack2 = uStack2 | *(byte *)dataptr;
  }
  uVar5 = ((uint)uStack2 + iVar6 >> 0x10) + ((uint)uStack2 + iVar6 & 0xffff);
  iVar6 = (uVar5 >> 0x10) + (uVar5 & 0xffff);
  uVar2 = (ushort)iVar6;
  if (uVar3 != 0) {
    uVar2 = (ushort)((uint)iVar6 >> 8) & 0xff | uVar2 * 0x100;
  }
  return (u16_t)uVar2;
}



u16_t inet_chksum_pseudo(pbuf *p,u8_t proto,u16_t proto_len,ip4_addr_t *src,ip4_addr_t *dest)

{
  bool bVar1;
  int iVar2;
  u16_t uVar3;
  u16_t uVar4;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined3 in_register_0000202d;
  uint uVar5;
  
  uVar5 = (src->addr >> 0x10) + (dest->addr & 0xffff) + (dest->addr >> 0x10) + (src->addr & 0xffff);
  uVar5 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
  uVar5 = (uVar5 >> 0x10) + (uVar5 & 0xffff);
  bVar1 = false;
  while (p != (pbuf *)0x0) {
    uVar3 = lwip_standard_chksum(p->payload,(uint)p->len);
    uVar5 = uVar5 + CONCAT22(extraout_var_01,uVar3);
    uVar5 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
    if ((p->len & 1) != 0) {
      bVar1 = (bool)(bVar1 ^ 1);
      uVar5 = uVar5 >> 8 & 0xff | uVar5 * 0x100 & 0xffff;
    }
    p = p->next;
  }
  if (bVar1) {
    uVar5 = uVar5 >> 8 & 0xff | (uVar5 & 0xff) << 8;
  }
  uVar3 = lwip_htons((u16_t)CONCAT31(in_register_0000202d,proto));
  uVar4 = lwip_htons(proto_len);
  uVar5 = uVar5 + CONCAT22(extraout_var_00,uVar4) + CONCAT22(extraout_var,uVar3);
  iVar2 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
  return (u16_t)~((short)iVar2 + (short)((uint)iVar2 >> 0x10));
}



u16_t ip_chksum_pseudo(pbuf *p,u8_t proto,u16_t proto_len,ip4_addr_t *src,ip4_addr_t *dest)

{
  bool bVar1;
  int iVar2;
  u16_t uVar3;
  u16_t uVar4;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined3 in_register_0000202d;
  uint uVar5;
  
  uVar5 = (src->addr >> 0x10) + (dest->addr & 0xffff) + (dest->addr >> 0x10) + (src->addr & 0xffff);
  uVar5 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
  uVar5 = (uVar5 >> 0x10) + (uVar5 & 0xffff);
  bVar1 = false;
  while (p != (pbuf *)0x0) {
    uVar3 = lwip_standard_chksum(p->payload,(uint)p->len);
    uVar5 = uVar5 + CONCAT22(extraout_var_01,uVar3);
    uVar5 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
    if ((p->len & 1) != 0) {
      bVar1 = (bool)(bVar1 ^ 1);
      uVar5 = uVar5 >> 8 & 0xff | uVar5 * 0x100 & 0xffff;
    }
    p = p->next;
  }
  if (bVar1) {
    uVar5 = uVar5 >> 8 & 0xff | (uVar5 & 0xff) << 8;
  }
  uVar3 = lwip_htons((u16_t)CONCAT31(in_register_0000202d,proto));
  uVar4 = lwip_htons(proto_len);
  uVar5 = uVar5 + CONCAT22(extraout_var_00,uVar4) + CONCAT22(extraout_var,uVar3);
  iVar2 = (uVar5 & 0xffff) + (uVar5 >> 0x10);
  return (u16_t)~((short)iVar2 + (short)((uint)iVar2 >> 0x10));
}



u16_t inet_chksum_pseudo_partial
                (pbuf *p,u8_t proto,u16_t proto_len,u16_t chksum_len,ip4_addr_t *src,
                ip4_addr_t *dest)

{
  bool bVar1;
  int iVar2;
  u16_t uVar3;
  u16_t uVar4;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined3 in_register_0000202d;
  undefined2 in_register_00002036;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  
  uVar5 = CONCAT22(in_register_00002036,chksum_len);
  uVar6 = (src->addr >> 0x10) + (dest->addr & 0xffff) + (dest->addr >> 0x10) + (src->addr & 0xffff);
  uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  uVar6 = (uVar6 >> 0x10) + (uVar6 & 0xffff);
  bVar1 = false;
  while ((p != (pbuf *)0x0 && (uVar5 != 0))) {
    uVar7 = (uint)p->len;
    if (uVar5 < (uint)p->len) {
      uVar7 = uVar5;
    }
    uVar3 = lwip_standard_chksum(p->payload,uVar7 & 0xffff);
    uVar6 = uVar6 + CONCAT22(extraout_var_01,uVar3);
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
    uVar5 = uVar5 - (uVar7 & 0xffff) & 0xffff;
    if ((p->len & 1) != 0) {
      bVar1 = (bool)(bVar1 ^ 1);
      uVar6 = uVar6 >> 8 & 0xff | uVar6 * 0x100 & 0xffff;
    }
    p = p->next;
  }
  if (bVar1) {
    uVar6 = uVar6 >> 8 & 0xff | (uVar6 & 0xff) << 8;
  }
  uVar3 = lwip_htons((u16_t)CONCAT31(in_register_0000202d,proto));
  uVar4 = lwip_htons(proto_len);
  uVar6 = uVar6 + CONCAT22(extraout_var_00,uVar4) + CONCAT22(extraout_var,uVar3);
  iVar2 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  return (u16_t)~((short)iVar2 + (short)((uint)iVar2 >> 0x10));
}



u16_t ip_chksum_pseudo_partial
                (pbuf *p,u8_t proto,u16_t proto_len,u16_t chksum_len,ip4_addr_t *src,
                ip4_addr_t *dest)

{
  bool bVar1;
  int iVar2;
  u16_t uVar3;
  u16_t uVar4;
  undefined2 extraout_var;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  undefined3 in_register_0000202d;
  uint uVar5;
  undefined2 in_register_00002036;
  uint uVar6;
  uint uVar7;
  
  uVar5 = CONCAT22(in_register_00002036,chksum_len);
  uVar6 = (src->addr >> 0x10) + (dest->addr & 0xffff) + (dest->addr >> 0x10) + (src->addr & 0xffff);
  uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  uVar6 = (uVar6 >> 0x10) + (uVar6 & 0xffff);
  bVar1 = false;
  while ((p != (pbuf *)0x0 && (uVar5 != 0))) {
    uVar7 = (uint)p->len;
    if (uVar5 < (uint)p->len) {
      uVar7 = uVar5;
    }
    uVar3 = lwip_standard_chksum(p->payload,uVar7 & 0xffff);
    uVar6 = uVar6 + CONCAT22(extraout_var_01,uVar3);
    uVar6 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
    uVar5 = uVar5 - (uVar7 & 0xffff) & 0xffff;
    if ((p->len & 1) != 0) {
      bVar1 = (bool)(bVar1 ^ 1);
      uVar6 = uVar6 >> 8 & 0xff | uVar6 * 0x100 & 0xffff;
    }
    p = p->next;
  }
  if (bVar1) {
    uVar6 = uVar6 >> 8 & 0xff | (uVar6 & 0xff) << 8;
  }
  uVar3 = lwip_htons((u16_t)CONCAT31(in_register_0000202d,proto));
  uVar4 = lwip_htons(proto_len);
  uVar6 = uVar6 + CONCAT22(extraout_var_00,uVar4) + CONCAT22(extraout_var,uVar3);
  iVar2 = (uVar6 & 0xffff) + (uVar6 >> 0x10);
  return (u16_t)~((short)iVar2 + (short)((uint)iVar2 >> 0x10));
}



