pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
u16_t inet_chksum(void *dataptr,u16_t len)

{
  u16_t uVar1;
  undefined2 in_register_0000202e;
  
  uVar1 = lwip_standard_chksum(dataptr,CONCAT22(in_register_0000202e,len));
  return ~uVar1;
}



u16_t inet_chksum_pbuf(pbuf *p)

{
  bool bVar1;
  ushort uVar2;
  uint uVar3;
  u16_t uVar4;
  undefined2 extraout_var;
  
  bVar1 = false;
  uVar3 = 0;
  while (uVar2 = (ushort)uVar3, p != (pbuf *)0x0) {
    uVar4 = lwip_standard_chksum(p->payload,(uint)p->len);
    uVar3 = uVar3 + CONCAT22(extraout_var,uVar4);
    uVar3 = (uVar3 & 0xffff) + (uVar3 >> 0x10);
    if ((p->len & 1) != 0) {
      bVar1 = (bool)(bVar1 ^ 1);
      uVar3 = uVar3 >> 8 & 0xff | uVar3 * 0x100 & 0xffff;
    }
    p = p->next;
  }
  if (bVar1) {
    uVar2 = (ushort)(uVar3 >> 8) & 0xff | (ushort)((uVar3 & 0xff) << 8);
  }
  return (u16_t)~uVar2;
}



u16_t lwip_chksum_copy(void *dst,void *src,u16_t len)

{
  u16_t uVar1;
  undefined2 in_register_00002032;
  
  memcpy(dst,src,CONCAT22(in_register_00002032,len));
  uVar1 = lwip_standard_chksum(dst,CONCAT22(in_register_00002032,len));
  return uVar1;
}



void lwip_init(void)

{
  stats_init();
  sys_init();
  mem_init();
  memp_init();
  netif_init();
  udp_init();
  tcp_init();
  igmp_init();
  dns_init();
  sys_timeouts_init();
  return;
}



void dhcp_set_state(dhcp *dhcp,u8_t new_state)

{
  undefined3 in_register_0000202d;
  
  if ((uint)dhcp->state != CONCAT31(in_register_0000202d,new_state)) {
    dhcp->state = new_state;
    dhcp->tries = '\0';
    dhcp->request_timeout = 0;
  }
  return;
}



u16_t dhcp_option_short(u16_t options_out_len,u8_t *options,u16_t value)

{
  undefined2 in_register_0000202a;
  int iVar1;
  
  iVar1 = CONCAT22(in_register_0000202a,options_out_len);
  options[iVar1] = (u8_t)(value >> 8);
  options[iVar1 + 1U & 0xffff] = (u8_t)value;
  return (u16_t)((uint)((iVar1 + 2) * 0x10000) >> 0x10);
}



u16_t dhcp_option_long(u16_t options_out_len,u8_t *options,u32_t value)

{
  undefined2 in_register_0000202a;
  int iVar1;
  
  iVar1 = CONCAT22(in_register_0000202a,options_out_len);
  options[iVar1] = (u8_t)(value >> 0x18);
  options[iVar1 + 1U & 0xffff] = (u8_t)(value >> 0x10);
  options[iVar1 + 2U & 0xffff] = (u8_t)(value >> 8);
  options[iVar1 + 3U & 0xffff] = (u8_t)value;
  return (u16_t)((uint)((iVar1 + 4) * 0x10000) >> 0x10);
}



pbuf * dhcp_create_msg(netif *netif,dhcp *dhcp,u8_t message_type,u16_t *options_out_len)

{
  u8_t uVar1;
  u32_t xid;
  undefined *__s;
  u32_t uVar2;
  undefined3 in_register_00002031;
  int iVar3;
  u8_t *puVar4;
  u8_t *puVar5;
  pbuf *ppVar6;
  
  iVar3 = CONCAT31(in_register_00002031,message_type);
  if (((netif == (netif *)0x0) || (dhcp == (dhcp *)0x0)) ||
     (ppVar6 = pbuf_alloc(PBUF_TRANSPORT,0x134,PBUF_RAM), ppVar6 == (pbuf *)0x0)) {
    ppVar6 = (pbuf *)0x0;
  }
  else {
    if ((iVar3 != 3) || (dhcp->state == '\x03')) {
      if (dhcp->tries == '\0') {
        xid = bl_rand();
      }
      dhcp->xid = xid;
    }
    __s = (undefined *)ppVar6->payload;
    memset(__s,0,0x134);
    *__s = 1;
    __s[1] = 1;
    __s[2] = netif->hwaddr_len;
    uVar2 = lwip_htonl(dhcp->xid);
    __s[4] = (char)uVar2;
    __s[5] = (char)(uVar2 >> 8);
    __s[6] = (char)(uVar2 >> 0x10);
    __s[7] = (char)(uVar2 >> 0x18);
    if (((iVar3 == 4) || ((iVar3 - 7U & 0xff) < 2)) ||
       ((iVar3 == 3 && ((byte)(dhcp->state - 4) < 2)))) {
      uVar2 = (netif->ip_addr).addr;
      __s[0xc] = (char)uVar2;
      __s[0xd] = (char)(uVar2 >> 8);
      __s[0xe] = (char)(uVar2 >> 0x10);
      __s[0xf] = (char)(uVar2 >> 0x18);
    }
    puVar5 = netif->hwaddr;
    puVar4 = __s + 0x1c;
    do {
      uVar1 = *puVar5;
      puVar5 = puVar5 + 1;
      *puVar4 = uVar1;
      puVar4 = puVar4 + 1;
    } while (puVar5 != &netif->hwaddr_len);
    __s[0xec] = 99;
    __s[0xef] = 99;
    __s[0xed] = 0x82;
    __s[0xf0] = 0x35;
    __s[0xf1] = 1;
    __s[0xee] = 0x53;
    __s[0xf2] = message_type;
    *options_out_len = 3;
  }
  return ppVar6;
}



void dhcp_option_trailer(u16_t options_out_len,u8_t *options,pbuf *p_out)

{
  undefined2 in_register_0000202a;
  uint uVar1;
  
  uVar1 = CONCAT22(in_register_0000202a,options_out_len) + 1U & 0xffff;
  options[CONCAT22(in_register_0000202a,options_out_len)] = -1;
  options = options + uVar1;
  while (uVar1 < 0x44) {
    *options = '\0';
    uVar1 = uVar1 + 1 & 0xffff;
    options = options + 1;
  }
  pbuf_realloc(p_out,(u16_t)((uVar1 + 0xf0) * 0x10000 >> 0x10));
  return;
}



err_t dhcp_discover(netif *netif)

{
  u8_t *options;
  dhcp *dhcp;
  pbuf *p_out;
  undefined2 extraout_var;
  uint uVar1;
  int iVar2;
  u16_t auStack34 [2];
  u16_t options_out_len;
  
  dhcp = (dhcp *)netif->client_data[0];
  (dhcp->offered_ip_addr).addr = 0;
  dhcp_set_state(dhcp,'\x06');
  p_out = dhcp_create_msg(netif,dhcp,'\x01',auStack34);
  if (p_out != (pbuf *)0x0) {
    uVar1 = (uint)auStack34[0];
    options = (u8_t *)((int)p_out->payload + 0xf0);
    options[uVar1] = '9';
    options[uVar1 + 1 & 0xffff] = '\x02';
    auStack34[0] = (u16_t)((uVar1 + 2) * 0x10000 >> 0x10);
    auStack34[0] = dhcp_option_short(auStack34[0],options,netif->mtu);
    options[CONCAT22(extraout_var,auStack34[0])] = '7';
    options[CONCAT22(extraout_var,auStack34[0]) + 1U & 0xffff] = '\x04';
    auStack34[0] = auStack34[0] + 2;
    iVar2 = 0;
    do {
      options[(uint)auStack34[0]] = "\x01\x03\x1c\x06"[iVar2];
      auStack34[0] = (u16_t)(((uint)auStack34[0] + 1) * 0x10000 >> 0x10);
      iVar2 = iVar2 + 1;
    } while (iVar2 != 4);
    dhcp_option_trailer(auStack34[0],options,p_out);
    udp_sendto_if_src(dhcp_pcb,p_out,&ip_addr_broadcast,0x43,netif,&ip_addr_any);
    pbuf_free(p_out);
  }
  if (dhcp->tries != -1) {
    dhcp->tries = dhcp->tries + '\x01';
  }
  if (dhcp->tries < 6) {
    uVar1 = (uint)((1 << ((uint)dhcp->tries & 0x1f)) * 0x3e80000) >> 0x10;
  }
  else {
    uVar1 = 60000;
  }
  dhcp->request_timeout = (u16_t)((int)(uVar1 + 499) / 500);
  return '\0';
}



