pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void dhcp_check(netif *netif)

{
  dhcp *dhcp;
  
  dhcp = (dhcp *)netif->client_data[0];
  dhcp_set_state(dhcp,'\b');
  etharp_query(netif,&dhcp->offered_ip_addr,(pbuf *)0x0);
  if (dhcp->tries != -1) {
    dhcp->tries = dhcp->tries + '\x01';
  }
  dhcp->request_timeout = 1;
  return;
}



// WARNING: Type propagation algorithm not settling

void dhcp_bind(netif *netif)

{
  byte bVar1;
  dhcp *dhcp;
  u16_t uVar2;
  uint uVar3;
  int iVar4;
  ip4_addr_t iStack24;
  ip4_addr_t sn_mask;
  ip4_addr_t gw_addr;
  
  if (netif == (netif *)0x0) {
    return;
  }
  dhcp = (dhcp *)netif->client_data[0];
  if (dhcp == (dhcp *)0x0) {
    return;
  }
  dhcp->lease_used = 0;
  if (dhcp->offered_t0_lease != 0xffffffff) {
    uVar3 = dhcp->offered_t0_lease + 0x1e;
    if (uVar3 < 0x3c0000) {
      uVar3 = uVar3 / 0x3c;
      uVar2 = (u16_t)uVar3;
      if (uVar3 == 0) {
        dhcp->t0_timeout = 1;
        goto LAB_2303d354;
      }
    }
    else {
      uVar2 = 0xffff;
    }
    dhcp->t0_timeout = uVar2;
  }
LAB_2303d354:
  if (dhcp->offered_t1_renew != 0xffffffff) {
    uVar3 = dhcp->offered_t1_renew + 0x1e;
    if (uVar3 < 0x3c0000) {
      uVar3 = uVar3 / 0x3c;
      uVar2 = (u16_t)uVar3;
      if (uVar3 != 0) goto LAB_2303d376;
      dhcp->t1_timeout = 1;
    }
    else {
      uVar2 = 0xffff;
LAB_2303d376:
      dhcp->t1_timeout = uVar2;
    }
    dhcp->t1_renew_time = dhcp->t1_timeout;
  }
  if (dhcp->offered_t2_rebind == 0xffffffff) goto LAB_2303d3b0;
  uVar3 = dhcp->offered_t2_rebind + 0x1e;
  if (uVar3 < 0x3c0000) {
    uVar3 = uVar3 / 0x3c;
    uVar2 = (u16_t)uVar3;
    if (uVar3 != 0) goto LAB_2303d3a4;
    dhcp->t2_timeout = 1;
  }
  else {
    uVar2 = 0xffff;
LAB_2303d3a4:
    dhcp->t2_timeout = uVar2;
  }
  dhcp->t2_rebind_time = dhcp->t2_timeout;
LAB_2303d3b0:
  if ((dhcp->t2_timeout <= dhcp->t1_timeout) && (dhcp->t2_timeout != 0)) {
    dhcp->t1_timeout = 0;
  }
  if (dhcp->subnet_mask_given == '\0') {
    bVar1 = *(byte *)&(dhcp->offered_ip_addr).addr;
    if ((char)bVar1 < '\0') {
      if (bVar1 < 0xc0) {
        iVar4 = 0x10000;
      }
      else {
        iVar4 = 0x1000000;
      }
      iStack24 = (ip4_addr_t)(iVar4 - 1);
    }
    else {
      iStack24 = (ip4_addr_t)0xff;
    }
  }
  else {
    iStack24 = (ip4_addr_t)(dhcp->offered_sn_mask).addr;
  }
  sn_mask = (dhcp->offered_gw_addr).addr;
  if ((ip4_addr_t)sn_mask == (ip4_addr_t)0x0) {
    sn_mask = (dhcp->offered_ip_addr).addr & (uint)iStack24 | 0x1000000;
  }
  dhcp_set_state(dhcp,'\n');
  netif_set_addr(netif,&dhcp->offered_ip_addr,&iStack24,&sn_mask);
  return;
}



err_t dhcp_inc_pcb_refcount(void)

{
  udp_pcb *pcb;
  
  if (dhcp_pcb_refcount == '\0') {
    pcb = udp_new();
    if (pcb == (udp_pcb *)0x0) {
      dhcp_pcb = pcb;
      return -1;
    }
    dhcp_pcb = pcb;
    pcb->so_options = pcb->so_options | 0x20;
    udp_bind(pcb,&ip_addr_any,0x44);
    udp_connect(dhcp_pcb,&ip_addr_any,0x43);
    udp_recv(dhcp_pcb,dhcp_recv,(void *)0x0);
  }
  dhcp_pcb_refcount = dhcp_pcb_refcount + '\x01';
  return '\0';
}



u16_t dhcp_option_hostname(u16_t options_out_len,u8_t *options)

{
  undefined2 in_register_0000202a;
  int iVar1;
  size_t sVar2;
  u8_t **in_a2;
  u8_t *puVar3;
  u8_t *puVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  
  iVar1 = CONCAT22(in_register_0000202a,options_out_len);
  if ((*in_a2 != (u8_t *)0x0) && (sVar2 = strlen((char *)*in_a2), sVar2 != 0)) {
    puVar3 = *in_a2;
    uVar6 = 0x41U - iVar1;
    if (sVar2 < 0x41U - iVar1) {
      uVar6 = sVar2;
    }
    options[iVar1] = '\f';
    uVar5 = iVar1 + 2U & 0xffff;
    options[iVar1 + 1U & 0xffff] = (u8_t)uVar6;
    puVar4 = puVar3;
    uVar7 = uVar5;
    while (puVar4 != puVar3 + uVar6) {
      options[uVar7] = *puVar4;
      uVar7 = uVar7 + 1 & 0xffff;
      puVar4 = puVar4 + 1;
    }
    options_out_len = (short)uVar5 + (short)uVar6;
  }
  return options_out_len;
}



err_t dhcp_reboot(netif *netif)

{
  u8_t *options;
  dhcp *dhcp;
  err_t eVar1;
  u16_t options_out_len_00;
  pbuf *p_out;
  undefined2 extraout_var;
  u32_t value;
  undefined2 extraout_var_00;
  uint uVar2;
  int iVar3;
  u16_t auStack34 [2];
  u16_t options_out_len;
  
  dhcp = (dhcp *)netif->client_data[0];
  dhcp_set_state(dhcp,'\x03');
  p_out = dhcp_create_msg(netif,dhcp,'\x03',auStack34);
  eVar1 = -1;
  if (p_out != (pbuf *)0x0) {
    uVar2 = (uint)auStack34[0];
    options = (u8_t *)((int)p_out->payload + 0xf0);
    options[uVar2] = '9';
    options[uVar2 + 1 & 0xffff] = '\x02';
    auStack34[0] = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
    options_out_len_00 = dhcp_option_short(auStack34[0],options,0x240);
    iVar3 = CONCAT22(extraout_var,options_out_len_00);
    options[iVar3] = '2';
    options[iVar3 + 1U & 0xffff] = '\x04';
    options_out_len_00 = (u16_t)((uint)((iVar3 + 2) * 0x10000) >> 0x10);
    auStack34[0] = options_out_len_00;
    value = lwip_htonl((dhcp->offered_ip_addr).addr);
    auStack34[0] = dhcp_option_long(options_out_len_00,options,value);
    options[CONCAT22(extraout_var_00,auStack34[0])] = '7';
    options[CONCAT22(extraout_var_00,auStack34[0]) + 1U & 0xffff] = '\x04';
    auStack34[0] = auStack34[0] + 2;
    iVar3 = 0;
    do {
      options[(uint)auStack34[0]] = "\x01\x03\x1c\x06"[iVar3];
      auStack34[0] = (u16_t)(((uint)auStack34[0] + 1) * 0x10000 >> 0x10);
      iVar3 = iVar3 + 1;
    } while (iVar3 != 4);
    auStack34[0] = dhcp_option_hostname(auStack34[0],options);
    dhcp_option_trailer(auStack34[0],options,p_out);
    eVar1 = udp_sendto_if(dhcp_pcb,p_out,&ip_addr_broadcast,0x43,netif);
    pbuf_free(p_out);
  }
  if (dhcp->tries != -1) {
    dhcp->tries = dhcp->tries + '\x01';
  }
  if (dhcp->tries < 10) {
    uVar2 = (uint)dhcp->tries * 0x3e80000 >> 0x10;
  }
  else {
    uVar2 = 10000;
  }
  dhcp->request_timeout = (u16_t)((int)(uVar2 + 499) / 500);
  return eVar1;
}



