pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t dhcp_select(netif *netif)

{
  u8_t *options;
  dhcp *dhcp;
  err_t eVar1;
  u16_t options_out_len_00;
  pbuf *p_out;
  undefined2 extraout_var;
  u32_t value;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  uint uVar2;
  int iVar3;
  u16_t auStack34 [2];
  u16_t options_out_len;
  
  eVar1 = -0x10;
  if (netif != (netif *)0x0) {
    dhcp = (dhcp *)netif->client_data[0];
    eVar1 = -6;
    if (dhcp != (dhcp *)0x0) {
      dhcp_set_state(dhcp,'\x01');
      p_out = dhcp_create_msg(netif,dhcp,'\x03',auStack34);
      eVar1 = -1;
      if (p_out != (pbuf *)0x0) {
        uVar2 = (uint)auStack34[0];
        options = (u8_t *)((int)p_out->payload + 0xf0);
        options[uVar2] = '9';
        options[uVar2 + 1 & 0xffff] = '\x02';
        auStack34[0] = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
        options_out_len_00 = dhcp_option_short(auStack34[0],options,netif->mtu);
        iVar3 = CONCAT22(extraout_var,options_out_len_00);
        options[iVar3] = '2';
        options[iVar3 + 1U & 0xffff] = '\x04';
        options_out_len_00 = (u16_t)((uint)((iVar3 + 2) * 0x10000) >> 0x10);
        auStack34[0] = options_out_len_00;
        value = lwip_htonl((dhcp->offered_ip_addr).addr);
        options_out_len_00 = dhcp_option_long(options_out_len_00,options,value);
        iVar3 = CONCAT22(extraout_var_00,options_out_len_00);
        options[iVar3] = '6';
        options[iVar3 + 1U & 0xffff] = '\x04';
        options_out_len_00 = (u16_t)((uint)((iVar3 + 2) * 0x10000) >> 0x10);
        auStack34[0] = options_out_len_00;
        value = lwip_htonl((dhcp->server_ip_addr).addr);
        auStack34[0] = dhcp_option_long(options_out_len_00,options,value);
        options[CONCAT22(extraout_var_01,auStack34[0])] = '7';
        options[CONCAT22(extraout_var_01,auStack34[0]) + 1U & 0xffff] = '\x04';
        auStack34[0] = auStack34[0] + 2;
        iVar3 = 0;
        do {
          options[(uint)auStack34[0]] = "\x01\x03\x1c\x06"[iVar3];
          auStack34[0] = (u16_t)(((uint)auStack34[0] + 1) * 0x10000 >> 0x10);
          iVar3 = iVar3 + 1;
        } while (iVar3 != 4);
        auStack34[0] = dhcp_option_hostname(auStack34[0],options);
        dhcp_option_trailer(auStack34[0],options,p_out);
        eVar1 = udp_sendto_if_src(dhcp_pcb,p_out,&ip_addr_broadcast,0x43,netif,&ip_addr_any);
        pbuf_free(p_out);
      }
      if (dhcp->tries != -1) {
        dhcp->tries = dhcp->tries + '\x01';
      }
      if (dhcp->tries < 6) {
        uVar2 = (uint)((1 << ((uint)dhcp->tries & 0x1f)) * 0x3e80000) >> 0x10;
      }
      else {
        uVar2 = 60000;
      }
      dhcp->request_timeout = (u16_t)((int)(uVar2 + 499) / 500);
    }
  }
  return eVar1;
}



void dhcp_dec_pcb_refcount(void)

{
  dhcp_pcb_refcount = dhcp_pcb_refcount + -1;
  if (dhcp_pcb_refcount == '\0') {
    udp_remove(dhcp_pcb);
    dhcp_pcb = (udp_pcb *)0x0;
    return;
  }
  return;
}



void dhcp_handle_ack(dhcp_msg *msg_in)

{
  u8_t uVar1;
  u32_t uVar2;
  int in_a1;
  uint uVar3;
  ip_addr_t iStack20;
  ip_addr_t dns_addr;
  
  uVar1 = dhcp_rx_options_given[3];
  *(undefined4 *)(msg_in->chaddr + 4) = 0;
  *(undefined4 *)(msg_in->chaddr + 8) = 0;
  if (uVar1 != '\0') {
    *(u32_t *)(msg_in->chaddr + 0xc) = dhcp_rx_options_val[3];
  }
  uVar3 = dhcp_rx_options_val[4];
  if (dhcp_rx_options_given[4] == '\0') {
    uVar3 = *(uint *)(msg_in->chaddr + 0xc) >> 1;
  }
  *(uint *)msg_in->sname = uVar3;
  uVar3 = dhcp_rx_options_val[5];
  if (dhcp_rx_options_given[5] == '\0') {
    uVar3 = (uint)(*(int *)(msg_in->chaddr + 0xc) * 7) >> 3;
  }
  *(uint *)(msg_in->sname + 4) = uVar3;
  *(undefined4 *)msg_in->chaddr = *(undefined4 *)(in_a1 + 0x10);
  if (dhcp_rx_options_given[6] == '\0') {
    *(undefined *)((int)&msg_in->xid + 3) = 0;
  }
  else {
    uVar2 = lwip_htonl(dhcp_rx_options_val[6]);
    *(u32_t *)(msg_in->chaddr + 4) = uVar2;
    *(undefined *)((int)&msg_in->xid + 3) = 1;
  }
  if (dhcp_rx_options_given[7] != '\0') {
    uVar2 = lwip_htonl(dhcp_rx_options_val[7]);
    *(u32_t *)(msg_in->chaddr + 8) = uVar2;
  }
  if (dhcp_rx_options_given[8] != '\0') {
    iStack20 = (ip_addr_t)lwip_htonl(dhcp_rx_options_val[8]);
    dns_setserver('\0',&iStack20);
    if (dhcp_rx_options_given[9] != '\0') {
      iStack20 = (ip_addr_t)lwip_htonl(dhcp_rx_options_val[9]);
      dns_setserver('\x01',&iStack20);
    }
  }
  return;
}



void dhcp_recv(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  byte bVar1;
  byte bVar2;
  bool bVar3;
  pbuf **pppVar4;
  netif *netif;
  uint uVar5;
  void *pvVar6;
  u16_t uVar7;
  u32_t uVar8;
  undefined2 extraout_var;
  void *pvVar9;
  uint uVar10;
  char *pcVar11;
  uint uVar12;
  u8_t *puVar13;
  u32_t *puVar14;
  pbuf *buf;
  uint uVar15;
  uint uVar16;
  int iVar17;
  uint uVar18;
  void *pvStack96;
  u32_t uStack68;
  u32_t value;
  
  netif = ip_data.current_input_netif;
  puVar14 = (u32_t *)(ip_data.current_input_netif)->client_data[0];
  if ((((puVar14 != (u32_t *)0x0) && (*(char *)(puVar14 + 1) != '\0')) && (0x2b < p->len)) &&
     (pcVar11 = (char *)p->payload, *pcVar11 == '\x02')) {
    uVar16 = 0;
    do {
      if (((uint)(ip_data.current_input_netif)->hwaddr_len <= (uVar16 & 0xff)) || (uVar16 == 6)) {
        uVar8 = lwip_htonl(*(u32_t *)(pcVar11 + 4));
        if ((uVar8 == *puVar14) && (memset(dhcp_rx_options_given,0,10), 0x2b < p->len)) {
          uVar16 = (uint)p->tot_len;
          bVar3 = false;
          uVar18 = 0xf0;
          buf = p;
          goto LAB_2303da8a;
        }
        break;
      }
      puVar13 = (ip_data.current_input_netif)->hwaddr + uVar16;
      iVar17 = uVar16 + 0x1c;
      uVar16 = uVar16 + 1;
    } while (pcVar11[iVar17] == *puVar13);
  }
free_pbuf_and_return:
  pbuf_free(p);
  return;
LAB_2303da8a:
  do {
    uVar12 = (uint)buf->len;
    if (uVar18 < uVar12) {
      pvStack96 = buf->payload;
      uVar12 = uVar18;
LAB_2303dccc:
      if (uVar16 <= uVar12) goto LAB_2303dce2;
      bVar2 = *(byte *)((int)pvStack96 + uVar12);
      if (bVar2 == 0xff) goto LAB_2303dce2;
      uVar15 = uVar12 + 2 & 0xffff;
      if (uVar15 < uVar12) break;
      if (uVar12 + 1 < (uint)buf->len) {
        bVar1 = ((byte *)((int)pvStack96 + uVar12))[1];
LAB_2303db20:
        uVar10 = (uint)bVar1;
        if (bVar2 == 0x33) {
          if (bVar1 != 4) break;
          uVar5 = 4;
          iVar17 = 3;
        }
        else {
          if (bVar2 < 0x34) {
            if (bVar2 == 1) {
              if (bVar1 == 4) {
                uVar5 = 4;
                iVar17 = 6;
                goto LAB_2303dba6;
              }
              break;
            }
            if (bVar2 == 0) goto LAB_2303dc92;
            if (bVar2 != 3) goto LAB_2303db3e;
            if (uVar10 <= bVar2) break;
            iVar17 = 7;
            uVar5 = 4;
          }
          else {
            if (bVar2 == 0x36) {
LAB_2303dc78:
              if (uVar10 != 4) break;
              uVar5 = 4;
              iVar17 = 2;
            }
            else {
              if (bVar2 < 0x37) {
                if (bVar2 == 0x34) goto LAB_2303dc62;
LAB_2303db70:
                if (bVar2 == 0x35) {
                  if (uVar10 != 1) break;
                  uVar5 = 1;
                  iVar17 = 1;
                }
                else {
LAB_2303db42:
                  iVar17 = -1;
                  uVar5 = 0;
                }
              }
              else {
                if (bVar2 == 0x3a) goto LAB_2303dc86;
LAB_2303db8c:
                if (bVar2 != 0x3b) goto LAB_2303db42;
                if (uVar10 != 4) break;
                uVar5 = 4;
                iVar17 = 5;
              }
            }
          }
        }
      }
      else {
        if (buf->next != (pbuf *)0x0) {
          bVar1 = *(byte *)buf->next->payload;
          goto LAB_2303db20;
        }
        if (bVar2 == 0x33) break;
        if (bVar2 < 0x34) {
          if (bVar2 == 1) break;
          if (bVar2 != 0) {
            if (bVar2 != 3) {
              uVar10 = 0;
LAB_2303db3e:
              if (bVar2 != 6) goto LAB_2303db42;
              if ((uVar10 & 3) == 0) {
                uVar5 = uVar10;
                if (8 < uVar10) {
                  uVar5 = 8;
                }
                if (uVar5 <= uVar10) {
                  iVar17 = 8;
                  goto LAB_2303dba6;
                }
              }
            }
            break;
          }
LAB_2303dc92:
          uVar12 = uVar12 + 1 & 0xffff;
          goto LAB_2303dc9a;
        }
        if (bVar2 == 0x36) {
          uVar10 = 0;
          goto LAB_2303dc78;
        }
        if (bVar2 < 0x37) {
          if (bVar2 != 0x34) {
            uVar10 = 0;
            goto LAB_2303db70;
          }
          uVar10 = 0;
LAB_2303dc62:
          if ((uVar10 != 1) || (uVar18 != 0xf0)) break;
          uVar5 = 1;
          iVar17 = 0;
        }
        else {
          if (bVar2 != 0x3a) {
            uVar10 = 0;
            goto LAB_2303db8c;
          }
          uVar10 = 0;
LAB_2303dc86:
          if (uVar10 != 4) break;
          uVar5 = 4;
          iVar17 = 4;
        }
      }
LAB_2303dba6:
      if (0xfffd < uVar10 + uVar12) break;
      uVar12 = uVar10 + uVar15 & 0xffff;
      if (uVar5 != 0) {
        uStack68 = 0;
        puVar13 = dhcp_rx_options_given + iVar17;
        while (*puVar13 == '\0') {
          uVar10 = uVar5;
          if (4 < uVar5) {
            uVar10 = 4;
          }
          uVar7 = pbuf_copy_partial(buf,&uStack68,(u16_t)uVar10,(u16_t)uVar15);
          if (uVar10 != CONCAT22(extraout_var,uVar7)) goto free_pbuf_and_return;
          if (uVar5 < 5) {
            if (uVar5 == 4) {
              uStack68 = lwip_htonl(uStack68);
            }
            else {
              if (uVar5 != 1) goto free_pbuf_and_return;
              uStack68 = uStack68 & 0xff;
            }
            dhcp_rx_options_given[iVar17] = '\x01';
            dhcp_rx_options_val[iVar17] = uStack68;
            break;
          }
          if ((uVar5 & 3) != 0) goto free_pbuf_and_return;
          *puVar13 = '\x01';
          uVar8 = lwip_htonl(uStack68);
          dhcp_rx_options_val[iVar17] = uVar8;
          uVar10 = uVar15 + 4 & 0xffff;
          uVar5 = uVar5 - 4 & 0xff;
          puVar13 = puVar13 + 1;
          if (uVar10 < uVar15) goto free_pbuf_and_return;
          iVar17 = iVar17 + 1;
          uVar15 = uVar10;
        }
      }
LAB_2303dc9a:
      uVar15 = (uint)buf->len;
      if (uVar15 <= uVar12) {
        uVar12 = uVar12 - uVar15 & 0xffff;
        uVar16 = uVar16 - uVar15 & 0xffff;
        if ((uVar16 <= uVar12) || (buf = buf->next, buf == (pbuf *)0x0)) break;
        pvStack96 = buf->payload;
      }
      goto LAB_2303dccc;
    }
    pppVar4 = &buf->next;
    uVar18 = uVar18 - uVar12 & 0xffff;
    uVar16 = uVar16 - uVar12 & 0xffff;
    buf = *pppVar4;
  } while (*pppVar4 != (pbuf *)0x0);
  goto free_pbuf_and_return;
LAB_2303dce2:
  if (dhcp_rx_options_given[0] != '\0') {
    dhcp_rx_options_given[0] = '\0';
    if (dhcp_rx_options_val[0] == 1) {
LAB_2303dd96:
      uVar16 = 0xec;
      uVar18 = 0x6c;
      buf = p;
      goto LAB_2303da8a;
    }
    if (dhcp_rx_options_val[0] == 2) goto LAB_2303dd80;
    if (dhcp_rx_options_val[0] == 3) {
      bVar3 = true;
      goto LAB_2303dd96;
    }
  }
  if (!bVar3) {
    if (dhcp_rx_options_given[1] == '\0') goto free_pbuf_and_return;
    pvVar9 = p->payload;
    if ((char)dhcp_rx_options_val[1] != '\x05') {
      if ((char)dhcp_rx_options_val[1] == '\x06') {
        if (((byte)(*(char *)((int)puVar14 + 5) - 3U) < 3) ||
           (*(char *)((int)puVar14 + 5) == '\x01')) {
          dhcp_set_state((dhcp *)netif->client_data[0],'\f');
          netif_set_addr(netif,(ip4_addr_t *)&ip_addr_any,(ip4_addr_t *)&ip_addr_any,
                         (ip4_addr_t *)&ip_addr_any);
          dhcp_discover(netif);
        }
      }
      else {
        if ((((char)dhcp_rx_options_val[1] == '\x02') && (*(char *)((int)puVar14 + 5) == '\x06')) &&
           (dhcp_rx_options_given[2] != '\0')) {
          pvVar6 = netif->client_data[0];
          *(undefined2 *)((int)pvVar6 + 8) = 0;
          uVar8 = lwip_htonl(dhcp_rx_options_val[2]);
          *(u32_t *)((int)pvVar6 + 0x18) = uVar8;
          *(undefined4 *)((int)pvVar6 + 0x1c) = *(undefined4 *)((int)pvVar9 + 0x10);
          dhcp_select(netif);
        }
      }
      goto free_pbuf_and_return;
    }
    if (*(char *)((int)puVar14 + 5) == '\x01') {
      dhcp_handle_ack((dhcp_msg *)netif->client_data[0]);
      if ((netif->flags & 8) != 0) {
        dhcp_check(netif);
        goto free_pbuf_and_return;
      }
    }
    else {
      if (2 < (byte)(*(char *)((int)puVar14 + 5) - 3U)) goto free_pbuf_and_return;
      dhcp_handle_ack((dhcp_msg *)netif->client_data[0]);
    }
    dhcp_bind(netif);
    goto free_pbuf_and_return;
  }
LAB_2303dd80:
  bVar3 = false;
  uVar16 = 0x6c;
  uVar18 = 0x2c;
  buf = p;
  goto LAB_2303da8a;
}



void dhcp_network_changed(netif *netif)

{
  byte bVar1;
  void *pvVar2;
  
  pvVar2 = netif->client_data[0];
  if (pvVar2 == (void *)0x0) {
    return;
  }
  bVar1 = *(byte *)((int)pvVar2 + 5);
  if (bVar1 < 6) {
    if (2 < bVar1) {
LAB_2303dec6:
      *(undefined *)((int)pvVar2 + 6) = 0;
      dhcp_reboot(netif);
      return;
    }
    if (bVar1 == 0) {
      return;
    }
  }
  else {
    if (bVar1 == 10) goto LAB_2303dec6;
  }
  *(undefined *)((int)pvVar2 + 6) = 0;
  dhcp_discover(netif);
  return;
}



