pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void dhcp_arp_reply(netif *netif,ip4_addr_t *addr)

{
  dhcp *dhcp;
  u8_t *options;
  pbuf *p_out;
  u32_t value;
  uint uVar1;
  u16_t options_out_len_00;
  u16_t auStack34 [2];
  u16_t options_out_len;
  
  if (netif != (netif *)0x0) {
    dhcp = (dhcp *)netif->client_data[0];
    if (((dhcp != (dhcp *)0x0) && (dhcp->state == '\b')) &&
       (addr->addr == (dhcp->offered_ip_addr).addr)) {
      dhcp_set_state(dhcp,'\f');
      p_out = dhcp_create_msg(netif,dhcp,'\x04',auStack34);
      if (p_out != (pbuf *)0x0) {
        uVar1 = (uint)auStack34[0];
        options = (u8_t *)((int)p_out->payload + 0xf0);
        options[uVar1] = '2';
        options[uVar1 + 1 & 0xffff] = '\x04';
        options_out_len_00 = (u16_t)((uVar1 + 2) * 0x10000 >> 0x10);
        auStack34[0] = options_out_len_00;
        value = lwip_htonl((dhcp->offered_ip_addr).addr);
        auStack34[0] = dhcp_option_long(options_out_len_00,options,value);
        dhcp_option_trailer(auStack34[0],options,p_out);
        udp_sendto_if_src(dhcp_pcb,p_out,&ip_addr_broadcast,0x43,netif,&ip_addr_any);
        pbuf_free(p_out);
      }
      if (dhcp->tries != -1) {
        dhcp->tries = dhcp->tries + '\x01';
      }
      dhcp->request_timeout = 0x14;
    }
    return;
  }
  return;
}



err_t dhcp_renew(netif *netif)

{
  u8_t *options;
  dhcp *dhcp;
  err_t eVar1;
  pbuf *p_out;
  undefined2 extraout_var;
  uint uVar2;
  int iVar3;
  u16_t auStack34 [2];
  u16_t options_out_len;
  
  dhcp = (dhcp *)netif->client_data[0];
  dhcp_set_state(dhcp,'\x05');
  p_out = dhcp_create_msg(netif,dhcp,'\x03',auStack34);
  eVar1 = -1;
  if (p_out != (pbuf *)0x0) {
    uVar2 = (uint)auStack34[0];
    options = (u8_t *)((int)p_out->payload + 0xf0);
    options[uVar2] = '9';
    options[uVar2 + 1 & 0xffff] = '\x02';
    auStack34[0] = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
    auStack34[0] = dhcp_option_short(auStack34[0],options,netif->mtu);
    options[CONCAT22(extraout_var,auStack34[0])] = '7';
    options[CONCAT22(extraout_var,auStack34[0]) + 1U & 0xffff] = '\x04';
    auStack34[0] = auStack34[0] + 2;
    iVar3 = 0;
    do {
      options[(uint)auStack34[0]] = "\x01\x03\x1c\x06"[iVar3];
      auStack34[0] = (u16_t)(((uint)auStack34[0] + 1) * 0x10000 >> 0x10);
      iVar3 = iVar3 + 1;
    } while (iVar3 != 4);
    auStack34[0] = dhcp_option_hostname(auStack34[0],options);
    dhcp_option_trailer(auStack34[0],options,p_out);
    eVar1 = udp_sendto_if(dhcp_pcb,p_out,&dhcp->server_ip_addr,0x43,netif);
    pbuf_free(p_out);
  }
  if (dhcp->tries != -1) {
    dhcp->tries = dhcp->tries + '\x01';
  }
  if (dhcp->tries < 10) {
    uVar2 = (uint)dhcp->tries * 0x7d00000 >> 0x10;
  }
  else {
    uVar2 = 20000;
  }
  dhcp->request_timeout = (u16_t)((int)(uVar2 + 499) / 500);
  return eVar1;
}



u8_t dhcp_supplied_address(netif *netif)

{
  byte bVar1;
  bool bVar2;
  
  if ((netif != (netif *)0x0) && (netif->client_data[0] != (void *)0x0)) {
    bVar1 = *(byte *)((int)netif->client_data[0] + 5);
    bVar2 = true;
    if (bVar1 != 10) {
      bVar2 = (uint)bVar1 - 4 < 2;
    }
    return (u8_t)bVar2;
  }
  return '\0';
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

void dhcp_release_and_stop(netif *netif)

{
  dhcp *dhcp;
  u8_t uVar1;
  undefined3 extraout_var;
  pbuf *p_out;
  u32_t value;
  uint uVar2;
  u8_t *options;
  u16_t options_out_len_00;
  u16_t uStack38;
  u16_t options_out_len;
  ip_addr_t n;
  ip_addr_t server_ip_addr;
  
  dhcp = (dhcp *)netif->client_data[0];
  if ((dhcp != (dhcp *)0x0) && (dhcp->state != '\0')) {
    n = (ip_addr_t)(dhcp->server_ip_addr).addr;
    (dhcp->offered_ip_addr).addr = 0;
    (dhcp->server_ip_addr).addr = 0;
    (dhcp->offered_sn_mask).addr = 0;
    (dhcp->offered_gw_addr).addr = 0;
    dhcp->offered_t2_rebind = 0;
    dhcp->offered_t1_renew = 0;
    dhcp->offered_t0_lease = 0;
    dhcp->t1_renew_time = 0;
    *(undefined4 *)&dhcp->t2_rebind_time = 0;
    dhcp->t0_timeout = 0;
    uVar1 = dhcp_supplied_address(netif);
    if ((CONCAT31(extraout_var,uVar1) != 0) &&
       (p_out = dhcp_create_msg(netif,dhcp,'\a',&uStack38), p_out != (pbuf *)0x0)) {
      uVar2 = (uint)uStack38;
      options = (u8_t *)((int)p_out->payload + 0xf0);
      options[uVar2] = '6';
      options[uVar2 + 1 & 0xffff] = '\x04';
      options_out_len_00 = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
      uStack38 = options_out_len_00;
      value = lwip_htonl((u32_t)n);
      uStack38 = dhcp_option_long(options_out_len_00,options,value);
      dhcp_option_trailer(uStack38,options,p_out);
      udp_sendto_if(dhcp_pcb,p_out,(ip_addr_t *)&stack0xffffffdc,0x43,netif);
      pbuf_free(p_out);
    }
    netif_set_addr(netif,(ip4_addr_t *)&ip_addr_any,(ip4_addr_t *)&ip_addr_any,
                   (ip4_addr_t *)&ip_addr_any);
    dhcp_set_state(dhcp,'\0');
    if (dhcp->pcb_allocated != '\0') {
      dhcp_dec_pcb_refcount();
      dhcp->pcb_allocated = '\0';
    }
  }
  return;
}



err_t dhcp_start(netif *netif)

{
  err_t eVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  dhcp *dhcp;
  
  if (netif == (netif *)0x0) {
    return -0x10;
  }
  if ((netif->flags & 1) == 0) {
    return -0x10;
  }
  dhcp = (dhcp *)netif->client_data[0];
  if (0x23f < netif->mtu) {
    if (dhcp == (dhcp *)0x0) {
      dhcp = (dhcp *)mem_malloc(0x34);
      if (dhcp == (dhcp *)0x0) {
        return -1;
      }
      *(dhcp **)netif->client_data = dhcp;
    }
    else {
      if (dhcp->pcb_allocated != '\0') {
        dhcp_dec_pcb_refcount();
      }
    }
    memset(dhcp,0,0x34);
    eVar1 = dhcp_inc_pcb_refcount();
    if (CONCAT31(extraout_var,eVar1) == 0) {
      dhcp->pcb_allocated = '\x01';
      if ((netif->flags & 4) == 0) {
        dhcp_set_state(dhcp,'\x02');
        return eVar1;
      }
      eVar1 = dhcp_discover(netif);
      if (CONCAT31(extraout_var_00,eVar1) == 0) {
        return eVar1;
      }
      dhcp_release_and_stop(netif);
    }
  }
  return -1;
}



void dhcp_coarse_tmr(void)

{
  short sVar1;
  netif *netif;
  dhcp *dhcp;
  pbuf *p_out;
  undefined2 extraout_var;
  uint uVar2;
  void *pvVar3;
  int iVar4;
  u8_t *options;
  u16_t auStack50 [2];
  u16_t options_out_len;
  
  netif = netif_list;
  while (netif != (netif *)0x0) {
    pvVar3 = netif->client_data[0];
    if ((pvVar3 != (void *)0x0) && (*(char *)((int)pvVar3 + 5) != '\0')) {
      if ((*(ushort *)((int)pvVar3 + 0x14) == 0) ||
         (uVar2 = (uint)*(ushort *)((int)pvVar3 + 0x12) + 1,
         *(undefined2 *)((int)pvVar3 + 0x12) = (short)(uVar2 * 0x10000 >> 0x10),
         (uint)*(ushort *)((int)pvVar3 + 0x14) != (uVar2 & 0xffff))) {
        sVar1 = *(short *)((int)pvVar3 + 0x10);
        if ((sVar1 == 0) || (*(short *)((int)pvVar3 + 0x10) = sVar1 + -1, sVar1 != 1)) {
          sVar1 = *(short *)((int)pvVar3 + 0xe);
          if ((sVar1 != 0) && (*(short *)((int)pvVar3 + 0xe) = sVar1 + -1, sVar1 == 1)) {
            pvVar3 = netif->client_data[0];
            if (((*(byte *)((int)pvVar3 + 5) & 0xfb) == 1) || (*(byte *)((int)pvVar3 + 5) == 10)) {
              dhcp_renew(netif);
              iVar4 = (uint)*(ushort *)((int)pvVar3 + 0xc) - (uint)*(ushort *)((int)pvVar3 + 0x12);
              if (1 < iVar4) {
                *(undefined2 *)((int)pvVar3 + 0xe) = (short)(iVar4 >> 1);
              }
            }
          }
        }
        else {
          dhcp = (dhcp *)netif->client_data[0];
          if ((dhcp->state < 0xb) && ((0x432U >> ((uint)dhcp->state & 0x1f) & 1) != 0)) {
            dhcp_set_state(dhcp,'\x04');
            p_out = dhcp_create_msg(netif,dhcp,'\x03',auStack50);
            if (p_out != (pbuf *)0x0) {
              uVar2 = (uint)auStack50[0];
              options = (u8_t *)((int)p_out->payload + 0xf0);
              options[uVar2] = '9';
              options[uVar2 + 1 & 0xffff] = '\x02';
              auStack50[0] = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
              auStack50[0] = dhcp_option_short(auStack50[0],options,netif->mtu);
              options[CONCAT22(extraout_var,auStack50[0])] = '7';
              options[CONCAT22(extraout_var,auStack50[0]) + 1U & 0xffff] = '\x04';
              auStack50[0] = auStack50[0] + 2;
              iVar4 = 0;
              do {
                options[(uint)auStack50[0]] = "\x01\x03\x1c\x06"[iVar4];
                auStack50[0] = (u16_t)(((uint)auStack50[0] + 1) * 0x10000 >> 0x10);
                iVar4 = iVar4 + 1;
              } while (iVar4 != 4);
              auStack50[0] = dhcp_option_hostname(auStack50[0],options);
              dhcp_option_trailer(auStack50[0],options,p_out);
              udp_sendto_if(dhcp_pcb,p_out,&ip_addr_broadcast,0x43,netif);
              pbuf_free(p_out);
            }
            if (dhcp->tries != -1) {
              dhcp->tries = dhcp->tries + '\x01';
            }
            uVar2 = 10000;
            if (dhcp->tries < 10) {
              uVar2 = (uint)dhcp->tries * 0x3e80000 >> 0x10;
            }
            dhcp->request_timeout = (u16_t)((int)(uVar2 + 499) / 500);
            iVar4 = (uint)dhcp->t0_timeout - (uint)dhcp->lease_used;
            if (1 < iVar4) {
              dhcp->t2_rebind_time = (u16_t)(iVar4 >> 1);
            }
          }
        }
      }
      else {
        dhcp_release_and_stop(netif);
        dhcp_start(netif);
      }
    }
    netif = netif->next;
  }
  return;
}



void dhcp_fine_tmr(void)

{
  char cVar1;
  ushort uVar2;
  netif *netif;
  void *pvVar3;
  
  netif = netif_list;
  do {
    if (netif == (netif *)0x0) {
      return;
    }
    pvVar3 = netif->client_data[0];
    if (pvVar3 != (void *)0x0) {
      uVar2 = *(ushort *)((int)pvVar3 + 8);
      if (uVar2 < 2) {
        if (uVar2 == 1) {
          *(undefined2 *)((int)pvVar3 + 8) = 0;
          pvVar3 = netif->client_data[0];
          cVar1 = *(char *)((int)pvVar3 + 5);
          if ((cVar1 == '\f') || (cVar1 == '\x06')) {
LAB_2303e534:
            dhcp_discover(netif);
          }
          else {
            if (cVar1 == '\x01') {
              if (*(byte *)((int)pvVar3 + 6) < 6) {
                dhcp_select(netif);
              }
              else {
                dhcp_release_and_stop(netif);
                dhcp_start(netif);
              }
            }
            else {
              if (cVar1 == '\b') {
                if (*(byte *)((int)pvVar3 + 6) < 2) {
                  dhcp_check(netif);
                }
                else {
                  dhcp_bind(netif);
                }
              }
              else {
                if (cVar1 == '\x03') {
                  if (1 < *(byte *)((int)pvVar3 + 6)) goto LAB_2303e534;
                  dhcp_reboot(netif);
                }
              }
            }
          }
        }
      }
      else {
        *(short *)((int)pvVar3 + 8) = uVar2 - 1;
      }
    }
    netif = netif->next;
  } while( true );
}



// WARNING: Type propagation algorithm not settling

