pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void dhcp_stop(netif *netif)

{
  dhcp *dhcp;
  u8_t uVar1;
  undefined3 extraout_var;
  pbuf *p_out;
  u32_t value;
  uint uVar2;
  u8_t *options;
  u16_t options_out_len;
  u16_t uStack38;
  ip_addr_t aiStack36 [3];
  
  dhcp = (dhcp *)netif->client_data[0];
  if ((dhcp != (dhcp *)0x0) && (dhcp->state != '\0')) {
    aiStack36[0] = (ip_addr_t)(dhcp->server_ip_addr).addr;
    (dhcp->offered_ip_addr).addr = 0;
    (dhcp->server_ip_addr).addr = 0;
    (dhcp->offered_sn_mask).addr = 0;
    (dhcp->offered_gw_addr).addr = 0;
    dhcp->offered_t2_rebind = 0;
    dhcp->offered_t1_renew = 0;
    dhcp->offered_t0_lease = 0;
    dhcp->t1_renew_time = 0;
    *(undefined4 *)&dhcp->t2_rebind_time = 0;
    dhcp->t0_timeout = 0;
    uVar1 = dhcp_supplied_address(netif);
    if ((CONCAT31(extraout_var,uVar1) != 0) &&
       (p_out = dhcp_create_msg(netif,dhcp,'\a',&uStack38), p_out != (pbuf *)0x0)) {
      uVar2 = (uint)uStack38;
      options = (u8_t *)((int)p_out->payload + 0xf0);
      options[uVar2] = '6';
      options[uVar2 + 1 & 0xffff] = '\x04';
      options_out_len = (u16_t)((uVar2 + 2) * 0x10000 >> 0x10);
      uStack38 = options_out_len;
      value = lwip_htonl((u32_t)aiStack36[0]);
      uStack38 = dhcp_option_long(options_out_len,options,value);
      dhcp_option_trailer(uStack38,options,p_out);
      udp_sendto_if(dhcp_pcb,p_out,aiStack36,0x43,netif);
      pbuf_free(p_out);
    }
    netif_set_addr(netif,(ip4_addr_t *)&ip_addr_any,(ip4_addr_t *)&ip_addr_any,
                   (ip4_addr_t *)&ip_addr_any);
    dhcp_set_state(dhcp,'\0');
    if (dhcp->pcb_allocated != '\0') {
      dhcp_dec_pcb_refcount();
      dhcp->pcb_allocated = '\0';
    }
  }
  return;
}



void etharp_free_entry(int i)

{
  pbuf *p;
  
  p = arp_table[i].q;
  if (p != (pbuf *)0x0) {
    pbuf_free(p);
    arp_table[i].q = (pbuf *)0x0;
  }
  arp_table[i].state = '\0';
  return;
}



s16_t etharp_find_entry(ip4_addr_t *ipaddr,u8_t flags,netif *netif)

{
  ushort uVar1;
  ushort uVar2;
  int iVar3;
  int iVar4;
  int i;
  undefined3 in_register_0000202d;
  etharp_entry *peVar5;
  int iVar6;
  s16_t sVar7;
  int iVar8;
  uint uVar9;
  int iVar10;
  ushort uVar11;
  ushort uVar12;
  
  peVar5 = arp_table;
  uVar2 = 0;
  uVar12 = 0;
  uVar11 = 0;
  iVar3 = 10;
  iVar8 = 0;
  iVar10 = 10;
  iVar4 = 10;
  iVar6 = 10;
  do {
    i = iVar6;
    if (iVar6 == 10) {
      i = iVar8;
    }
    if (peVar5->state != '\0') {
      if ((ipaddr != (ip4_addr_t *)0x0) && (ipaddr->addr == (peVar5->ipaddr).addr)) {
        if (netif == (netif *)0x0) {
          return (s16_t)iVar8;
        }
        if (peVar5->netif == netif) {
          return (s16_t)iVar8;
        }
      }
      uVar1 = peVar5->ctime;
      if (peVar5->state == '\x01') {
        if (peVar5->q == (pbuf *)0x0) {
          i = iVar6;
          if (uVar12 <= uVar1) {
            iVar4 = iVar8;
            uVar12 = uVar1;
          }
        }
        else {
          i = iVar6;
          if (uVar11 <= uVar1) {
            iVar3 = iVar8;
            uVar11 = uVar1;
          }
        }
      }
      else {
        i = iVar6;
        if (uVar2 <= uVar1) {
          iVar10 = iVar8;
          uVar2 = uVar1;
        }
      }
    }
    uVar9 = iVar8 + 1U & 0xffff;
    peVar5 = peVar5 + 1;
    iVar8 = (int)(short)uVar9;
    iVar6 = i;
    if (uVar9 == 10) {
      sVar7 = -1;
      if (CONCAT31(in_register_0000202d,flags) == 1) {
        if (i == 10) {
          i = iVar10;
          if (((iVar10 == 10) && (i = iVar4, iVar4 == 10)) && (i = iVar3, iVar3 == 10)) {
            return -1;
          }
          etharp_free_entry(i);
        }
        sVar7 = (s16_t)i;
        if (ipaddr != (ip4_addr_t *)0x0) {
          arp_table[i].ipaddr.addr = ipaddr->addr;
        }
        arp_table[i].ctime = 0;
        arp_table[i].netif = netif;
      }
      return sVar7;
    }
  } while( true );
}



err_t etharp_raw(netif *netif,eth_addr *ethsrc_addr,eth_addr *ethdst_addr,eth_addr *hwsrc_addr,
                ip4_addr_t *ipsrc_addr,eth_addr *hwdst_addr,ip4_addr_t *ipdst_addr,u16_t opcode)

{
  undefined *puVar1;
  err_t eVar2;
  u16_t uVar3;
  pbuf *p;
  
  p = pbuf_alloc(PBUF_LINK,0x1c,PBUF_RAM);
  if (p == (pbuf *)0x0) {
    eVar2 = -1;
    lwip_stats.etharp.memerr = lwip_stats.etharp.memerr + 1;
  }
  else {
    puVar1 = (undefined *)p->payload;
    uVar3 = lwip_htons(opcode);
    puVar1[6] = (char)uVar3;
    puVar1[7] = (char)(uVar3 >> 8);
    memcpy(puVar1 + 8,hwsrc_addr,6);
    memcpy(puVar1 + 0x12,hwdst_addr,6);
    memcpy(puVar1 + 0xe,ipsrc_addr,4);
    memcpy(puVar1 + 0x18,ipdst_addr,4);
    puVar1[1] = 1;
    puVar1[2] = 8;
    puVar1[4] = 6;
    puVar1[5] = 4;
    *puVar1 = 0;
    puVar1[3] = 0;
    ethernet_output(netif,p,ethsrc_addr,ethdst_addr,0x806);
    lwip_stats.etharp.xmit = lwip_stats.etharp.xmit + 1;
    pbuf_free(p);
    eVar2 = '\0';
  }
  return eVar2;
}



void etharp_cleanup_netif(netif *netif)

{
  etharp_entry *peVar1;
  int i;
  
  peVar1 = arp_table;
  i = 0;
  do {
    if ((peVar1->state != '\0') && (peVar1->netif == netif)) {
      etharp_free_entry(i);
    }
    i = i + 1;
    peVar1 = peVar1 + 1;
  } while (i != 10);
  return;
}



// WARNING: Type propagation algorithm not settling

void etharp_input(pbuf *p,netif *netif)

{
  bool bVar1;
  short *psVar2;
  u8_t uVar3;
  s16_t sVar4;
  undefined3 extraout_var;
  short extraout_var_00;
  ip4_addr_t iVar5;
  eth_addr *dst;
  u8_t flags;
  pbuf *p_00;
  ip4_addr_t iStack56;
  ip4_addr_t sipaddr;
  ip4_addr_t dipaddr;
  
  if (netif != (netif *)0x0) {
    psVar2 = (short *)p->payload;
    if ((((*psVar2 == 0x100) && (*(char *)(psVar2 + 2) == '\x06')) &&
        (*(char *)((int)psVar2 + 5) == '\x04')) && (psVar2[1] == 8)) {
      lwip_stats.etharp.recv = lwip_stats.etharp.recv + 1;
      memcpy(&iStack56,psVar2 + 7,4);
      memcpy(&sipaddr,psVar2 + 0xc,4);
      iVar5 = (ip4_addr_t)(netif->ip_addr).addr;
      dst = (eth_addr *)(psVar2 + 4);
      if ((iVar5 == (ip4_addr_t)0x0) || (iVar5 != (ip4_addr_t)sipaddr)) {
        bVar1 = false;
        flags = '\x02';
      }
      else {
        bVar1 = true;
        flags = '\x01';
      }
      if (((iStack56 != (ip4_addr_t)0x0) &&
          (uVar3 = ip4_addr_isbroadcast_u32((u32_t)iStack56,netif),
          CONCAT31(extraout_var,uVar3) == 0)) && (((uint)iStack56 & 0xf0) != 0xe0)) {
        sVar4 = etharp_find_entry(&iStack56,flags,netif);
        _sVar4 = CONCAT22(extraout_var_00,sVar4);
        if (-1 < extraout_var_00) {
          arp_table[_sVar4].state = '\x02';
          arp_table[_sVar4].netif = netif;
          memcpy(&arp_table[_sVar4].ethaddr,dst,6);
          p_00 = arp_table[_sVar4].q;
          arp_table[_sVar4].ctime = 0;
          if (p_00 != (pbuf *)0x0) {
            arp_table[_sVar4].q = (pbuf *)0x0;
            ethernet_output(netif,p_00,(eth_addr *)netif->hwaddr,dst,0x800);
            pbuf_free(p_00);
          }
        }
      }
      if (psVar2[3] == 0x100) {
        if (bVar1) {
          etharp_raw(netif,(eth_addr *)netif->hwaddr,dst,(eth_addr *)netif->hwaddr,
                     (ip4_addr_t *)&netif->ip_addr,dst,&iStack56,2);
        }
      }
      else {
        if (psVar2[3] == 0x200) {
          dhcp_arp_reply(netif,&iStack56);
        }
        else {
          lwip_stats.etharp.err = lwip_stats.etharp.err + 1;
        }
      }
    }
    else {
      lwip_stats.etharp.proterr = lwip_stats.etharp.proterr + 1;
      lwip_stats.etharp.drop = lwip_stats.etharp.drop + 1;
    }
    pbuf_free(p);
    return;
  }
  return;
}



