pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t etharp_request(netif *netif,ip4_addr_t *ipaddr)

{
  err_t eVar1;
  
  eVar1 = etharp_raw(netif,(eth_addr *)netif->hwaddr,&ethbroadcast,(eth_addr *)netif->hwaddr,
                     (ip4_addr_t *)&netif->ip_addr,&ethzero,ipaddr,1);
  return eVar1;
}



void etharp_tmr(void)

{
  u8_t uVar1;
  etharp_entry *peVar2;
  int i;
  uint uVar3;
  uint uVar4;
  
  peVar2 = arp_table;
  i = 0;
  do {
    uVar1 = peVar2->state;
    if (uVar1 != '\0') {
      uVar3 = (uint)peVar2->ctime + 1;
      uVar4 = uVar3 & 0xffff;
      peVar2->ctime = (u16_t)(uVar3 * 0x10000 >> 0x10);
      if (uVar4 < 300) {
        if (uVar1 == '\x01') {
          if (4 < uVar4) goto LAB_2303ea08;
          etharp_request(peVar2->netif,&peVar2->ipaddr);
        }
        else {
          if (uVar1 == '\x03') {
            peVar2->state = '\x04';
          }
          else {
            if (uVar1 == '\x04') {
              peVar2->state = '\x02';
            }
          }
        }
      }
      else {
LAB_2303ea08:
        etharp_free_entry(i);
      }
    }
    i = i + 1;
    peVar2 = peVar2 + 1;
    if (i == 10) {
      return;
    }
  } while( true );
}



err_t etharp_output_to_arp_index(netif *netif,pbuf *q,netif_addr_idx_t arp_idx)

{
  err_t eVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 in_register_00002031;
  int iVar2;
  eth_addr *ethsrc_addr;
  
  iVar2 = CONCAT31(in_register_00002031,arp_idx);
  ethsrc_addr = (eth_addr *)netif->hwaddr;
  if (arp_table[iVar2].state == '\x02') {
    if (arp_table[iVar2].ctime < 0x11d) {
      if (arp_table[iVar2].ctime < 0x10e) goto LAB_2303eaa0;
      eVar1 = etharp_raw(netif,ethsrc_addr,&arp_table[iVar2].ethaddr,ethsrc_addr,
                         (ip4_addr_t *)&netif->ip_addr,&ethzero,&arp_table[iVar2].ipaddr,1);
      _eVar1 = CONCAT31(extraout_var_00,eVar1);
    }
    else {
      eVar1 = etharp_request(netif,&arp_table[iVar2].ipaddr);
      _eVar1 = CONCAT31(extraout_var,eVar1);
    }
    if (_eVar1 == 0) {
      arp_table[iVar2].state = '\x03';
    }
  }
LAB_2303eaa0:
  eVar1 = ethernet_output(netif,q,ethsrc_addr,&arp_table[iVar2].ethaddr,0x800);
  return eVar1;
}



err_t etharp_query(netif *netif,ip4_addr_t *ipaddr,pbuf *q)

{
  pbuf **pppVar1;
  u8_t uVar2;
  err_t eVar3;
  ushort uVar4;
  undefined3 extraout_var;
  short extraout_var_00;
  pbuf *ppVar5;
  uint uVar6;
  
  uVar2 = ip4_addr_isbroadcast_u32(ipaddr->addr,netif);
  if (((CONCAT31(extraout_var,uVar2) != 0) || ((ipaddr->addr & 0xf0) == 0xe0)) ||
     (ipaddr->addr == 0)) {
    return -0x10;
  }
  uVar4 = etharp_find_entry(ipaddr,'\x01',netif);
  if (extraout_var_00 < 0) {
    if (q != (pbuf *)0x0) {
      lwip_stats.etharp.memerr = lwip_stats.etharp.memerr + 1;
    }
    return (err_t)uVar4;
  }
  uVar6 = (uint)uVar4 & 0xff;
  if (arp_table[uVar6].state == '\0') {
    arp_table[uVar6].state = '\x01';
    arp_table[uVar6].netif = netif;
  }
  else {
    eVar3 = -1;
    if (q != (pbuf *)0x0) goto LAB_2303eb7e;
  }
  eVar3 = etharp_request(netif,ipaddr);
  if (q == (pbuf *)0x0) {
    return eVar3;
  }
LAB_2303eb7e:
  if (1 < arp_table[uVar6].state) {
    etharp_cached_entry = (netif_addr_idx_t)uVar6;
    eVar3 = ethernet_output(netif,q,(eth_addr *)netif->hwaddr,&arp_table[uVar6].ethaddr,0x800);
    return eVar3;
  }
  ppVar5 = q;
  if (arp_table[uVar6].state == 1) {
    do {
      if ((ppVar5->type_internal & 0x40) != 0) {
        q = pbuf_clone(PBUF_LINK,PBUF_RAM,q);
        if (q == (pbuf *)0x0) {
          lwip_stats.etharp.memerr = lwip_stats.etharp.memerr + 1;
          return -1;
        }
        goto LAB_2303ebe4;
      }
      pppVar1 = &ppVar5->next;
      ppVar5 = *pppVar1;
    } while (*pppVar1 != (pbuf *)0x0);
    pbuf_ref(q);
LAB_2303ebe4:
    if (arp_table[uVar6].q != (pbuf *)0x0) {
      pbuf_free(arp_table[uVar6].q);
    }
    arp_table[uVar6].q = q;
    eVar3 = '\0';
  }
  return eVar3;
}



// WARNING: Variable defined which should be unmapped: mcastaddr

err_t etharp_output(netif *netif,pbuf *q,ip4_addr_t *ipaddr)

{
  netif_addr_idx_t nVar1;
  u8_t uVar2;
  err_t eVar3;
  undefined3 extraout_var;
  eth_addr *dst;
  uint uVar4;
  uint uVar5;
  etharp_entry *peVar6;
  undefined2 uStack24;
  u8_t uStack22;
  byte bStack21;
  eth_addr mcastaddr;
  
  uVar2 = ip4_addr_isbroadcast_u32(ipaddr->addr,netif);
  uVar4 = CONCAT31(extraout_var,uVar2);
  if (uVar4 == 0) {
    uVar5 = ipaddr->addr;
    if ((uVar5 & 0xf0) != 0xe0) {
      if (((((netif->ip_addr).addr ^ uVar5) & (netif->netmask).addr) != 0) &&
         ((uVar5 & 0xffff) != 0xfea9)) {
        if ((netif->gw).addr == 0) {
          return -4;
        }
        ipaddr = (ip4_addr_t *)&netif->gw;
      }
      uVar5 = (uint)etharp_cached_entry;
      peVar6 = arp_table;
      if (((arp_table[uVar5].state < 2) || (arp_table[uVar5].netif != netif)) ||
         (ipaddr->addr != arp_table[uVar5].ipaddr.addr)) {
        while (((peVar6->state < 2 || (peVar6->netif != netif)) ||
               (nVar1 = (netif_addr_idx_t)uVar4, ipaddr->addr != (peVar6->ipaddr).addr))) {
          uVar4 = uVar4 + 1 & 0xff;
          peVar6 = peVar6 + 1;
          if (uVar4 == 10) {
            eVar3 = etharp_query(netif,ipaddr,q);
            return eVar3;
          }
        }
      }
      else {
        lwip_stats.etharp.cachehit = lwip_stats.etharp.cachehit + 1;
        nVar1 = etharp_cached_entry;
      }
      etharp_cached_entry = nVar1;
      eVar3 = etharp_output_to_arp_index(netif,q,etharp_cached_entry);
      return eVar3;
    }
    uStack24 = 1;
    uStack22 = '^';
    dst = (eth_addr *)&uStack24;
    bStack21 = *(byte *)((int)&ipaddr->addr + 1) & 0x7f;
    mcastaddr.addr[0] = *(u8_t *)((int)&ipaddr->addr + 2);
    mcastaddr.addr[1] = *(u8_t *)((int)&ipaddr->addr + 3);
  }
  else {
    dst = &ethbroadcast;
  }
  eVar3 = ethernet_output(netif,q,(eth_addr *)netif->hwaddr,dst,0x800);
  return eVar3;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void igmp_send(netif *netif,igmp_group *group,u8_t type)

{
  u8_t *dataptr;
  u16_t uVar1;
  pbuf *p;
  undefined3 in_register_00002031;
  ip4_addr_t *dest;
  u8_t uVar2;
  u8_t uVar3;
  u8_t uVar4;
  u32_t uVar5;
  ip4_addr_t iStack40;
  ip4_addr_t src;
  u16_t ra [2];
  
  iStack40 = (ip4_addr_t)0;
  p = pbuf_alloc(PBUF_TRANSPORT,8,PBUF_RAM);
  if (p == (pbuf *)0x0) {
    lwip_stats.igmp.memerr = lwip_stats.igmp.memerr + 1;
  }
  else {
    iStack40 = (ip4_addr_t)(netif->ip_addr).addr;
    uVar5 = (group->group_address).addr;
    dataptr = (u8_t *)p->payload;
    uVar4 = (u8_t)(uVar5 >> 0x18);
    uVar2 = (u8_t)(uVar5 >> 8);
    uVar3 = (u8_t)(uVar5 >> 0x10);
    if (CONCAT31(in_register_00002031,type) == 0x16) {
      dataptr[7] = uVar4;
      dataptr[4] = (u8_t)uVar5;
      dataptr[5] = uVar2;
      dataptr[6] = uVar3;
      dest = &group->group_address;
      group->last_reporter_flag = '\x01';
    }
    else {
      dataptr[4] = (u8_t)uVar5;
      dataptr[5] = uVar2;
      dataptr[6] = uVar3;
      dataptr[7] = uVar4;
      dest = &allrouters;
    }
    *dataptr = type;
    dataptr[1] = '\0';
    dataptr[2] = '\0';
    dataptr[3] = '\0';
    uVar1 = inet_chksum(dataptr,8);
    dataptr[2] = (u8_t)uVar1;
    dataptr[3] = (u8_t)(uVar1 >> 8);
    src = 0x494;
    lwip_stats.igmp.xmit = lwip_stats.igmp.xmit + 1;
    ip4_output_if_opt(p,&iStack40,dest,'\x01','\0','\x02',netif,&src,_DAT_00000010);
    pbuf_free(p);
  }
  return;
}



void igmp_delaying_member(igmp_group *group,u8_t maxresp)

{
  uint uVar1;
  undefined3 in_register_0000202d;
  uint uVar2;
  
  uVar2 = CONCAT31(in_register_0000202d,maxresp);
  if ((group->group_state != '\x02') &&
     ((group->group_state != '\x01' || ((group->timer != 0 && (group->timer <= uVar2)))))) {
    return;
  }
  if (2 < uVar2) {
    uVar1 = bl_rand();
    group->timer = (u16_t)(uVar1 % uVar2);
    if (uVar1 % uVar2 != 0) goto LAB_2303ee92;
  }
  group->timer = 1;
LAB_2303ee92:
  group->group_state = '\x01';
  return;
}



void igmp_init(void)

{
  allrouters = 0x20000e0;
  allsystems = 0x10000e0;
  return;
}



err_t igmp_stop(netif *netif)

{
  void **mem;
  void *pvVar1;
  
