pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mem = (void **)netif->client_data[1];
  netif->client_data[1] = (void *)0x0;
  while (mem != (void **)0x0) {
    pvVar1 = *mem;
    if (netif->igmp_mac_filter != (netif_igmp_mac_filter_fn *)0x0) {
      (*netif->igmp_mac_filter)(netif,(ip4_addr_t *)(mem + 1),NETIF_DEL_MAC_FILTER);
    }
    memp_free(MEMP_IGMP_GROUP,mem);
    mem = (void **)pvVar1;
  }
  return '\0';
}



// WARNING: Type propagation algorithm not settling

void igmp_report_groups(netif *netif)

{
  igmp_group *group;
  
  if ((igmp_group *)netif->client_data[1] != (igmp_group *)0x0) {
    group = ((igmp_group *)netif->client_data[1])->next;
    while (group != (igmp_group *)0x0) {
      igmp_delaying_member(group,'\x05');
      group = group->next;
    }
    return;
  }
  return;
}



igmp_group * igmp_lookfor_group(netif *ifp,ip4_addr_t *addr)

{
  igmp_group *piVar1;
  
  piVar1 = (igmp_group *)ifp->client_data[1];
  while ((piVar1 != (igmp_group *)0x0 && ((piVar1->group_address).addr != addr->addr))) {
    piVar1 = piVar1->next;
  }
  return piVar1;
}



// WARNING: Type propagation algorithm not settling

igmp_group * igmp_lookup_group(netif *ifp,ip4_addr_t *addr)

{
  igmp_group *piVar1;
  igmp_group *piVar2;
  u32_t uVar3;
  
  piVar2 = igmp_lookfor_group(ifp,addr);
  if (piVar2 == (igmp_group *)0x0) {
    piVar1 = (igmp_group *)ifp->client_data[1];
    piVar2 = (igmp_group *)memp_malloc(MEMP_IGMP_GROUP);
    if (piVar2 != (igmp_group *)0x0) {
      uVar3 = 0;
      if (addr != (ip4_addr_t *)0x0) {
        uVar3 = addr->addr;
      }
      (piVar2->group_address).addr = uVar3;
      *(undefined4 *)&piVar2->last_reporter_flag = 0;
      piVar2->use = '\0';
      if (piVar1 == (igmp_group *)0x0) {
        piVar2->next = (igmp_group *)0x0;
        *(igmp_group **)(ifp->client_data + 1) = piVar2;
      }
      else {
        piVar2->next = piVar1->next;
        piVar1->next = piVar2;
      }
    }
  }
  return piVar2;
}



err_t igmp_start(netif *netif)

{
  err_t eVar1;
  igmp_group *piVar2;
  
  piVar2 = igmp_lookup_group(netif,&allsystems);
  if (piVar2 == (igmp_group *)0x0) {
    eVar1 = -1;
  }
  else {
    piVar2->group_state = '\x02';
    piVar2->use = piVar2->use + '\x01';
    eVar1 = '\0';
    if (netif->igmp_mac_filter != (netif_igmp_mac_filter_fn *)0x0) {
      (*netif->igmp_mac_filter)(netif,&allsystems,NETIF_ADD_MAC_FILTER);
      eVar1 = '\0';
    }
  }
  return eVar1;
}



// WARNING: Type propagation algorithm not settling

void igmp_input(pbuf *p,netif *inp,ip4_addr_t *dest)

{
  ip4_addr_t iVar1;
  char *dataptr;
  u16_t uVar2;
  undefined2 extraout_var;
  igmp_group *group;
  ip4_addr_t iStack36;
  ip4_addr_t groupaddr;
  
  lwip_stats.igmp.recv = lwip_stats.igmp.recv + 1;
  if (p->len < 8) {
    pbuf_free(p);
    lwip_stats.igmp.lenerr = lwip_stats.igmp.lenerr + 1;
    return;
  }
  dataptr = (char *)p->payload;
  uVar2 = inet_chksum(dataptr,p->len);
  if (CONCAT22(extraout_var,uVar2) != 0) {
    pbuf_free(p);
    lwip_stats.igmp.chkerr = lwip_stats.igmp.chkerr + 1;
    return;
  }
  group = igmp_lookfor_group(inp,dest);
  if (group == (igmp_group *)0x0) {
    pbuf_free(p);
    lwip_stats.igmp.drop = lwip_stats.igmp.drop + 1;
    return;
  }
  if (*dataptr == '\x11') {
    iVar1 = (ip4_addr_t)((ip4_addr_t *)(dataptr + 4))->addr;
    if (dest->addr == allsystems) {
      if (iVar1 == (ip4_addr_t)0x0) {
        if (dataptr[1] == '\0') {
          lwip_stats.igmp.rx_v1 = lwip_stats.igmp.rx_v1 + 1;
          dataptr[1] = '\n';
        }
        else {
          lwip_stats.igmp.rx_general = lwip_stats.igmp.rx_general + 1;
        }
        if ((igmp_group *)inp->client_data[1] != (igmp_group *)0x0) {
          group = ((igmp_group *)inp->client_data[1])->next;
          while (group != (igmp_group *)0x0) {
            igmp_delaying_member(group,dataptr[1]);
            group = group->next;
          }
        }
        goto LAB_2303f0da;
      }
      iStack36 = iVar1;
      group = igmp_lookfor_group(inp,&iStack36);
      if (group == (igmp_group *)0x0) {
        lwip_stats.igmp.drop = lwip_stats.igmp.drop + 1;
        goto LAB_2303f0da;
      }
    }
    else {
      if (iVar1 == (ip4_addr_t)0x0) goto LAB_2303f07c;
    }
    lwip_stats.igmp.rx_group = lwip_stats.igmp.rx_group + 1;
    igmp_delaying_member(group,dataptr[1]);
  }
  else {
    if (*dataptr == '\x16') {
      lwip_stats.igmp.rx_report = lwip_stats.igmp.rx_report + 1;
      if (group->group_state == '\x01') {
        *(undefined4 *)&group->last_reporter_flag = 0x200;
      }
      goto LAB_2303f0da;
    }
LAB_2303f07c:
    lwip_stats.igmp.proterr = lwip_stats.igmp.proterr + 1;
  }
LAB_2303f0da:
  pbuf_free(p);
  return;
}



err_t igmp_joingroup_netif(netif *netif,ip4_addr_t *groupaddr)

{
  u16_t uVar1;
  igmp_group *group;
  uint uVar2;
  err_t eVar3;
  
  if (((groupaddr->addr & 0xf0) == 0xe0) && (eVar3 = -6, groupaddr->addr != allsystems)) {
    if ((netif->flags & 0x20) != 0) {
      group = igmp_lookup_group(netif,groupaddr);
      eVar3 = -1;
      if (group != (igmp_group *)0x0) {
        if (group->group_state == '\0') {
          if ((group->use == '\0') && (netif->igmp_mac_filter != (netif_igmp_mac_filter_fn *)0x0)) {
            (*netif->igmp_mac_filter)(netif,groupaddr,NETIF_ADD_MAC_FILTER);
          }
          lwip_stats.igmp.tx_join = lwip_stats.igmp.tx_join + 1;
          igmp_send(netif,group,'\x16');
          uVar2 = bl_rand();
          uVar1 = (u16_t)(uVar2 % 5);
          if (uVar2 % 5 == 0) {
            uVar1 = 1;
          }
          group->timer = uVar1;
          group->group_state = '\x01';
        }
        group->use = group->use + '\x01';
        eVar3 = '\0';
      }
    }
    return eVar3;
  }
  return -6;
}



err_t igmp_joingroup(ip4_addr_t *ifaddr,ip4_addr_t *groupaddr)

{
  netif *netif;
  err_t eVar1;
  int iVar2;
  undefined3 extraout_var;
  
  if ((groupaddr->addr & 0xf0) != 0xe0) {
    return -6;
  }
  iVar2 = -6;
  eVar1 = -6;
  netif = netif_list;
  if (groupaddr->addr != allsystems) {
    while (eVar1 = (err_t)iVar2, netif != (netif *)0x0) {
      if (((netif->flags & 0x20) != 0) &&
         (((ifaddr == (ip4_addr_t *)0x0 || (ifaddr->addr == 0)) ||
          (ifaddr->addr == (netif->ip_addr).addr)))) {
        eVar1 = igmp_joingroup_netif(netif,groupaddr);
        iVar2 = CONCAT31(extraout_var,eVar1);
        if (iVar2 != 0) {
          return eVar1;
        }
      }
      netif = netif->next;
    }
  }
  return eVar1;
}



