pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t igmp_leavegroup_netif(netif *netif,ip4_addr_t *groupaddr)

{
  igmp_group *piVar1;
  igmp_group *group;
  err_t eVar2;
  igmp_group *piVar3;
  
  if (((groupaddr->addr & 0xf0) != 0xe0) || (eVar2 = -6, groupaddr->addr == allsystems)) {
    return -6;
  }
  if ((netif->flags & 0x20) != 0) {
    group = igmp_lookfor_group(netif,groupaddr);
    eVar2 = -6;
    if (group != (igmp_group *)0x0) {
      if (group->use < 2) {
        piVar1 = (igmp_group *)netif->client_data[1];
        do {
          piVar3 = piVar1;
          if (piVar3 == (igmp_group *)0x0) goto LAB_2303f2b0;
          piVar1 = piVar3->next;
        } while (group != piVar3->next);
        piVar3->next = group->next;
LAB_2303f2b0:
        if (group->last_reporter_flag != '\0') {
          lwip_stats.igmp.tx_leave = lwip_stats.igmp.tx_leave + 1;
          igmp_send(netif,group,'\x17');
        }
        if (netif->igmp_mac_filter != (netif_igmp_mac_filter_fn *)0x0) {
          (*netif->igmp_mac_filter)(netif,groupaddr,NETIF_DEL_MAC_FILTER);
        }
        memp_free(MEMP_IGMP_GROUP,group);
      }
      else {
        group->use = group->use - 1;
      }
      eVar2 = '\0';
    }
  }
  return eVar2;
}



err_t igmp_leavegroup(ip4_addr_t *ifaddr,ip4_addr_t *groupaddr)

{
  netif *netif;
  int iVar1;
  err_t eVar2;
  undefined3 extraout_var;
  
  eVar2 = -6;
  if ((groupaddr->addr & 0xf0) == 0xe0) {
    iVar1 = -6;
    eVar2 = -6;
    netif = netif_list;
    if (groupaddr->addr != allsystems) {
      while (eVar2 = (err_t)iVar1, netif != (netif *)0x0) {
        if (((netif->flags & 0x20) != 0) &&
           (((ifaddr == (ip4_addr_t *)0x0 || (ifaddr->addr == 0)) ||
            (ifaddr->addr == (netif->ip_addr).addr)))) {
          eVar2 = igmp_leavegroup_netif(netif,groupaddr);
          if (iVar1 != 0) {
            iVar1 = CONCAT31(extraout_var,eVar2);
          }
        }
        netif = netif->next;
      }
    }
  }
  return eVar2;
}



void igmp_tmr(void)

{
  igmp_group *group;
  netif *netif;
  uint uVar1;
  
  netif = netif_list;
  while (netif != (netif *)0x0) {
    group = (igmp_group *)netif->client_data[1];
    while (group != (igmp_group *)0x0) {
      if ((((group->timer != 0) &&
           (uVar1 = (uint)group->timer - 1, group->timer = (u16_t)(uVar1 * 0x10000 >> 0x10),
           (uVar1 & 0xffff) == 0)) && (group->group_state == '\x01')) &&
         ((group->group_address).addr != allsystems)) {
        group->group_state = '\x02';
        lwip_stats.igmp.tx_report = lwip_stats.igmp.tx_report + 1;
        igmp_send(netif,group,'\x16');
      }
      group = group->next;
    }
    netif = netif->next;
  }
  return;
}



int ip4_input_accept(netif *netif)

{
  u8_t uVar1;
  int iVar2;
  undefined3 extraout_var;
  u32_t uVar3;
  
  if ((netif->flags & 1) == 0) {
    return 0;
  }
  uVar3 = (netif->ip_addr).addr;
  iVar2 = 0;
  if (uVar3 != 0) {
    iVar2 = 1;
    if (uVar3 != ip_data.current_iphdr_dest) {
      uVar1 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,netif);
      return (uint)(CONCAT31(extraout_var,uVar1) != 0);
    }
  }
  return iVar2;
}



netif * ip4_route(ip4_addr_t *dest)

{
  byte bVar1;
  netif *pnVar2;
  netif *pnVar3;
  uint uVar4;
  uint uVar5;
  
  uVar5 = dest->addr;
  pnVar2 = netif_list;
  if (((uVar5 & 0xf0) != 0xe0) ||
     (pnVar3 = ip4_default_multicast_netif, ip4_default_multicast_netif == (netif *)0x0)) {
    while (pnVar2 != (netif *)0x0) {
      bVar1 = pnVar2->flags;
      if ((((bVar1 & 1) != 0) && ((bVar1 >> 2 & 1) != 0)) &&
         (uVar4 = (pnVar2->ip_addr).addr, uVar4 != 0)) {
        if (((uVar4 ^ uVar5) & (pnVar2->netmask).addr) == 0) {
          return pnVar2;
        }
        if (((bVar1 & 2) == 0) && (uVar5 == (pnVar2->gw).addr)) {
          return pnVar2;
        }
      }
      pnVar2 = pnVar2->next;
    }
    if (((netif_default == (netif *)0x0) || ((netif_default->flags & 5) != 5)) ||
       (((netif_default->ip_addr).addr == 0 || (pnVar3 = netif_default, (uVar5 & 0xff) == 0x7f)))) {
      lwip_stats.ip.rterr = lwip_stats.ip.rterr + 1;
      return (netif *)0x0;
    }
  }
  return pnVar3;
}



err_t ip4_input(pbuf *p,netif *inp)

{
  byte bVar1;
  uint uVar2;
  u8_t uVar3;
  raw_input_state_t rVar4;
  u16_t new_len;
  undefined2 extraout_var_02;
  undefined2 extraout_var_03;
  igmp_group *piVar5;
  undefined3 extraout_var;
  int iVar6;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  ip_hdr *dataptr;
  netif *netif;
  uint uVar7;
  
  lwip_stats.ip.recv = lwip_stats.ip.recv + 1;
  dataptr = (ip_hdr *)p->payload;
  bVar1 = dataptr->_v_hl;
  if (bVar1 >> 4 != 4) {
    pbuf_free(p);
    lwip_stats.ip.drop = lwip_stats.ip.drop + 1;
    lwip_stats.ip.err = lwip_stats.ip.err + 1;
    return '\0';
  }
  new_len = lwip_htons(dataptr->_len);
  uVar7 = (uint)bVar1 & 0xf;
  uVar2 = (uVar7 << 0x12) >> 0x10;
  if (CONCAT22(extraout_var_02,new_len) < (uint)p->tot_len) {
    pbuf_realloc(p,new_len);
  }
  if (((p->len < uVar2) || ((uint)p->tot_len < CONCAT22(extraout_var_02,new_len))) || (uVar2 < 0x14)
     ) {
    pbuf_free(p);
    lwip_stats.ip.lenerr = lwip_stats.ip.lenerr + 1;
    goto LAB_2303f588;
  }
  new_len = inet_chksum(dataptr,(u16_t)((uVar7 << 0x12) >> 0x10));
  if (CONCAT22(extraout_var_03,new_len) != 0) {
    pbuf_free(p);
    lwip_stats.ip.chkerr = lwip_stats.ip.chkerr + 1;
    goto LAB_2303f588;
  }
  ip_data.current_iphdr_dest = (dataptr->dest).addr;
  ip_data.current_iphdr_src = (dataptr->src).addr;
  netif = inp;
  if ((ip_data.current_iphdr_dest & 0xf0) == 0xe0) {
    if (((inp->flags & 0x20) == 0) ||
       (piVar5 = igmp_lookfor_group(inp,(ip4_addr_t *)&ip_data.current_iphdr_dest),
       piVar5 == (igmp_group *)0x0)) goto LAB_2303f60e;
    if ((ip_data.current_iphdr_dest != 0x10000e0) || (ip_data.current_iphdr_src != 0))
    goto LAB_2303f63e;
  }
  else {
    iVar6 = ip4_input_accept(inp);
    if (iVar6 == 0) {
      netif = netif_list;
      if ((char)ip_data.current_iphdr_dest.addr != '\x7f') {
        while (netif != (netif *)0x0) {
          if ((netif != inp) && (iVar6 = ip4_input_accept(netif), iVar6 != 0)) goto LAB_2303f63e;
          netif = netif->next;
        }
      }
    }
    else {
      if (inp != (netif *)0x0) goto LAB_2303f63e;
    }
LAB_2303f60e:
    if ((dataptr->_proto != '\x11') || (netif = inp, (&dataptr->_len)[uVar7 * 2] != 0x4400)) {
      netif = (netif *)0x0;
LAB_2303f63e:
      if ((ip_data.current_iphdr_src != 0) &&
         ((uVar3 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_src,inp),
          CONCAT31(extraout_var,uVar3) != 0 || ((ip_data.current_iphdr_src & 0xf0) == 0xe0)))) {
        pbuf_free(p);
        goto LAB_2303f588;
      }
    }
    if (netif == (netif *)0x0) {
      lwip_stats.ip.drop = lwip_stats.ip.drop + 1;
      pbuf_free(p);
      return '\0';
    }
  }
  if (((uint)*(byte *)&dataptr->_offset & 0x3f | (uint)*(byte *)((int)&dataptr->_offset + 1) << 8)
      == 0) {
    ip_data.current_ip_header_tot_len = (u16_t)(((uint)dataptr->_v_hl & 0xf) << 2);
    ip_data.current_netif = netif;
    ip_data.current_input_netif = inp;
    ip_data.current_ip4_header = dataptr;
    rVar4 = raw_input(p,inp);
    if (CONCAT31(extraout_var_00,rVar4) != 1) {
      pbuf_remove_header(p,uVar7 * 4);
      bVar1 = dataptr->_proto;
      if (bVar1 == 2) {
        igmp_input(p,inp,(ip4_addr_t *)&ip_data.current_iphdr_dest);
      }
      else {
        if (bVar1 < 3) {
          if (bVar1 == 1) {
            icmp_input(p,inp);
            ip_data.current_netif = (netif *)0x0;
            ip_data.current_input_netif = (netif *)0x0;
            ip_data.current_ip4_header = (ip_hdr *)0x0;
            ip_data.current_ip_header_tot_len = 0;
            ip_data.current_iphdr_src = 0;
            ip_data.current_iphdr_dest = 0;
            return '\0';
          }
        }
        else {
          if (bVar1 == 6) {
            tcp_input(p,inp);
            ip_data.current_netif = (netif *)0x0;
            ip_data.current_input_netif = (netif *)0x0;
            ip_data.current_ip4_header = (ip_hdr *)0x0;
            ip_data.current_ip_header_tot_len = 0;
            ip_data.current_iphdr_src = 0;
            ip_data.current_iphdr_dest = 0;
            return '\0';
          }
          if (bVar1 == 0x11) {
            udp_input(p,inp);
            ip_data.current_netif = (netif *)0x0;
            ip_data.current_input_netif = (netif *)0x0;
            ip_data.current_ip4_header = (ip_hdr *)0x0;
            ip_data.current_ip_header_tot_len = 0;
            ip_data.current_iphdr_src = 0;
            ip_data.current_iphdr_dest = 0;
            return '\0';
          }
        }
        if (CONCAT31(extraout_var_00,rVar4) != 2) {
          uVar3 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,netif);
          if ((CONCAT31(extraout_var_01,uVar3) == 0) &&
             ((ip_data.current_iphdr_dest & 0xf0) != 0xe0)) {
            pbuf_header_force(p,(s16_t)(uVar7 * 4));
            icmp_dest_unreach(p,ICMP_DUR_PROTO);
          }
          lwip_stats.ip.proterr = lwip_stats.ip.proterr + 1;
          lwip_stats.ip.drop = lwip_stats.ip.drop + 1;
        }
        pbuf_free(p);
      }
    }
    ip_data.current_netif = (netif *)0x0;
    ip_data.current_input_netif = (netif *)0x0;
    ip_data.current_ip4_header = (ip_hdr *)0x0;
    ip_data.current_ip_header_tot_len = 0;
    ip_data.current_iphdr_src = 0;
    ip_data.current_iphdr_dest = 0;
    return '\0';
  }
  pbuf_free(p);
  lwip_stats.ip.opterr = lwip_stats.ip.opterr + 1;
LAB_2303f588:
  lwip_stats.ip.drop = lwip_stats.ip.drop + 1;
  return '\0';
}



// WARNING: Type propagation algorithm not settling

