pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t ip4_output_if_opt_src
                (pbuf *p,ip4_addr_t *src,ip4_addr_t *dest,u8_t ttl,u8_t tos,u8_t proto,netif *netif,
                void *ip_options,u16_t optlen)

{
  uint header_size_increment;
  undefined *puVar1;
  uint uVar2;
  u8_t uVar3;
  err_t eVar4;
  u16_t uVar5;
  u16_t n;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  undefined3 in_register_00002035;
  undefined3 in_register_00002039;
  int iVar6;
  undefined3 in_register_0000203d;
  int iVar7;
  uint uVar8;
  uint __n;
  int iVar9;
  ushort in_stack_00000000;
  ip4_addr_t iStack52;
  ip4_addr_t dest_addr;
  
  __n = (uint)in_stack_00000000;
  if (dest == (ip4_addr_t *)0x0) {
    if (0x13 < p->len) {
      dest = &iStack52;
      iStack52 = (ip4_addr_t)((ip4_addr_t *)((int)p->payload + 0x10))->addr;
      goto LAB_2303f9c0;
    }
  }
  else {
    if (in_stack_00000000 == 0) {
      uVar2 = 0x14;
      iVar9 = 0;
    }
    else {
      if (0x28 < in_stack_00000000) {
        lwip_stats.ip.err = lwip_stats.ip.err + 1;
        return -6;
      }
      header_size_increment = __n + 3 & 0xfffc;
      uVar3 = pbuf_add_header(p,header_size_increment);
      uVar2 = header_size_increment + 0x14 & 0xffff;
      if (CONCAT31(extraout_var,uVar3) != 0) goto LAB_2303f856;
      memcpy(p->payload,ip_options,__n);
      if (__n < header_size_increment) {
        memset((void *)((int)p->payload + __n),0,header_size_increment - __n);
      }
      iVar7 = 0;
      iVar9 = 0;
      do {
        iVar6 = iVar7 * 2;
        iVar7 = iVar7 + 1;
        iVar9 = iVar9 + (uint)*(ushort *)(iVar6 + (int)p->payload);
      } while (iVar7 < (int)(header_size_increment >> 1));
    }
    uVar3 = pbuf_add_header(p,0x14);
    if (CONCAT31(extraout_var_00,uVar3) == 0) {
      puVar1 = (undefined *)p->payload;
      puVar1[8] = ttl;
      puVar1[9] = proto;
      header_size_increment = dest->addr;
      uVar8 = CONCAT31(in_register_00002035,ttl) << 8 | CONCAT31(in_register_0000203d,proto);
      puVar1[0x10] = (char)header_size_increment;
      puVar1[0x11] = (char)(header_size_increment >> 8);
      puVar1[0x12] = (char)(header_size_increment >> 0x10);
      __n = uVar2 >> 2 & 0xff | 0x40;
      *puVar1 = (char)__n;
      __n = __n << 8 | CONCAT31(in_register_00002039,tos);
      puVar1[0x13] = (char)(header_size_increment >> 0x18);
      puVar1[1] = tos;
      uVar5 = lwip_htons(p->tot_len);
      puVar1[2] = (char)uVar5;
      n = ip_id;
      puVar1[3] = (char)(uVar5 >> 8);
      puVar1[6] = 0;
      puVar1[7] = 0;
      n = lwip_htons(n);
      puVar1[5] = (char)(n >> 8);
      puVar1[4] = (char)n;
      ip_id = ip_id + 1;
      if (src == (ip4_addr_t *)0x0) {
        uVar2 = 0;
      }
      else {
        uVar2 = src->addr;
      }
      puVar1[0xf] = (char)(uVar2 >> 0x18);
      puVar1[0xc] = (char)uVar2;
      puVar1[0xd] = (char)(uVar2 >> 8);
      __n = (uVar2 & 0xffff) +
            CONCAT22(extraout_var_02,n) +
            (((int)__n >> 8 | __n << 8) & 0xffff) +
            ((uVar8 << 8 | (int)uVar8 >> 8) & 0xffff) +
            (header_size_increment & 0xffff) + (header_size_increment >> 0x10) + iVar9 +
            CONCAT22(extraout_var_01,uVar5) + (uVar2 >> 0x10);
      puVar1[0xe] = (char)(uVar2 >> 0x10);
      __n = (__n & 0xffff) + (__n >> 0x10);
      __n = ~((__n >> 0x10) + __n);
      puVar1[10] = (char)__n;
      puVar1[0xb] = (char)(__n >> 8);
LAB_2303f9c0:
      lwip_stats.ip.xmit = lwip_stats.ip.xmit + 1;
      eVar4 = (*netif->output)(netif,p,dest);
      return eVar4;
    }
  }
LAB_2303f856:
  lwip_stats.ip.err = lwip_stats.ip.err + 1;
  return -2;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

err_t ip4_output_if_opt(pbuf *p,ip4_addr_t *src,ip4_addr_t *dest,u8_t ttl,u8_t tos,u8_t proto,
                       netif *netif,void *ip_options,u16_t optlen)

{
  err_t eVar1;
  
  if ((dest != (ip4_addr_t *)0x0) && ((src == (ip4_addr_t *)0x0 || (src->addr == 0)))) {
    src = (ip4_addr_t *)&netif->ip_addr;
  }
  eVar1 = ip4_output_if_opt_src(p,src,dest,ttl,tos,proto,netif,ip_options,optlen);
  return eVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

err_t ip4_output_if(pbuf *p,ip4_addr_t *src,ip4_addr_t *dest,u8_t ttl,u8_t tos,u8_t proto,
                   netif *netif)

{
  err_t eVar1;
  
  eVar1 = ip4_output_if_opt(p,src,dest,ttl,tos,proto,netif,(void *)0x0,_DAT_00000010);
  return eVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

err_t ip4_output_if_src(pbuf *p,ip4_addr_t *src,ip4_addr_t *dest,u8_t ttl,u8_t tos,u8_t proto,
                       netif *netif)

{
  err_t eVar1;
  
  eVar1 = ip4_output_if_opt_src(p,src,dest,ttl,tos,proto,netif,(void *)0x0,_DAT_00000010);
  return eVar1;
}



u8_t ip4_addr_isbroadcast_u32(u32_t addr,netif *netif)

{
  byte bVar1;
  uint uVar2;
  uint uVar3;
  
  if (addr - 1 < 0xfffffffe) {
    bVar1 = netif->flags & 2;
    if ((netif->flags & 2) != 0) {
      uVar3 = (netif->ip_addr).addr;
      bVar1 = 0;
      if ((uVar3 != addr) && (uVar2 = (netif->netmask).addr, ((uVar3 ^ addr) & uVar2) == 0)) {
        uVar2 = ~uVar2;
        return (u8_t)((uVar2 & addr) == uVar2);
      }
    }
  }
  else {
    bVar1 = 1;
  }
  return (u8_t)bVar1;
}



int ip4addr_aton(char *cp,ip4_addr_t *addr)

{
  byte bVar1;
  int iVar2;
  u32_t n;
  u32_t *puVar3;
  uint uVar4;
  uint uVar5;
  int iVar6;
  u32_t uStack32;
  u32_t parts [4];
  
  bVar1 = *cp;
  puVar3 = &uStack32;
LAB_2303fabc:
  uVar5 = (uint)bVar1;
  if ((_ctype_[uVar5 + 1] & 4) == 0) {
    return 0;
  }
  iVar6 = 10;
  if (bVar1 == 0x30) {
    uVar5 = (uint)(byte)cp[1];
    if ((uVar5 & 0xdf) == 0x58) {
      uVar5 = (uint)(byte)cp[2];
      iVar6 = 0x10;
      cp = cp + 2;
    }
    else {
      cp = cp + 1;
      iVar6 = 8;
    }
  }
  n = 0;
  do {
    bVar1 = _ctype_[uVar5 + 1];
    if ((bVar1 & 4) == 0) {
      if ((iVar6 != 0x10) || ((bVar1 & 0x44) == 0)) break;
      iVar2 = 0x61;
      if ((bVar1 & 3) != 2) {
        iVar2 = 0x41;
      }
      n = n << 4 | (uVar5 + 10) - iVar2;
    }
    else {
      n = (iVar6 * n + uVar5) - 0x30;
    }
    uVar5 = (uint)(byte)cp[1];
    cp = cp + 1;
  } while( true );
  if (uVar5 == 0x2e) {
    if (puVar3 == parts + 2) {
      return 0;
    }
    *puVar3 = n;
    bVar1 = cp[1];
    cp = cp + 1;
    puVar3 = puVar3 + 1;
    goto LAB_2303fabc;
  }
  if ((uVar5 != 0) && ((bVar1 & 8) == 0)) {
    return 0;
  }
  iVar6 = (int)((int)puVar3 - (int)&uStack32) >> 2;
  iVar2 = iVar6 + 1;
  if (iVar2 == 2) {
    if (0xffffff < n) {
      return 0;
    }
    if (0xff < uStack32) {
      return 0;
    }
    uVar5 = uStack32 << 0x18;
  }
  else {
    if (iVar2 < 3) {
      if (iVar6 == -1) {
        return 0;
      }
      goto LAB_2303fb6a;
    }
    if (iVar2 == 3) {
      if (0xffff < n) {
        return 0;
      }
      if (0xff < uStack32) {
        return 0;
      }
      if (0xff < parts[0]) {
        return 0;
      }
      uVar5 = uStack32 << 0x18;
      uVar4 = parts[0] << 0x10;
    }
    else {
      if (iVar2 != 4) goto LAB_2303fb6a;
      if (0xff < n) {
        return 0;
      }
      if (0xff < uStack32) {
        return 0;
      }
      if (0xff < parts[0]) {
        return 0;
      }
      if (0xff < parts[1]) {
        return 0;
      }
      uVar5 = uStack32 << 0x18 | parts[0] << 0x10;
      uVar4 = parts[1] << 8;
    }
    uVar5 = uVar5 | uVar4;
  }
  n = n | uVar5;
LAB_2303fb6a:
  if (addr != (ip4_addr_t *)0x0) {
    n = lwip_htonl(n);
    addr->addr = n;
    return 1;
  }
  return 1;
}



u32_t ipaddr_addr(char *cp)

{
  int iVar1;
  ip4_addr_t iStack20;
  ip4_addr_t val;
  
  iVar1 = ip4addr_aton(cp,&iStack20);
  if (iVar1 == 0) {
    iStack20 = (ip4_addr_t)0xffffffff;
  }
  return (u32_t)iStack20;
}



