pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

char * ip4addr_ntoa_r(ip4_addr_t *addr,char *buf,int buflen)

{
  bool bVar1;
  uint uVar2;
  int iVar3;
  int iVar4;
  byte *pbVar5;
  uint uVar6;
  char *pcVar7;
  uint uVar8;
  uint uVar9;
  char *pcVar10;
  u32_t s_addr;
  char local_8 [4];
  char inv [3];
  
  _inv = addr->addr;
  iVar3 = 0;
  pbVar5 = (byte *)inv;
  pcVar10 = buf;
  while( true ) {
    uVar2 = 0;
    uVar9 = (uint)*pbVar5;
    do {
      uVar8 = uVar2;
      uVar6 = uVar9 / 10;
      local_8[uVar8] = (char)(uVar9 % 10) + '0';
      bVar1 = 9 < uVar9;
      uVar2 = uVar8 + 1 & 0xff;
      uVar9 = uVar6;
    } while (bVar1);
    *pbVar5 = (byte)uVar6;
    iVar4 = iVar3;
    pcVar7 = pcVar10;
    while (iVar3 = iVar4 + 1, uVar8 != 0xff) {
      if (buflen <= iVar4) {
        return (char *)0x0;
      }
      *pcVar7 = local_8[uVar8];
      iVar4 = iVar3;
      pcVar7 = pcVar7 + 1;
      uVar8 = uVar8 - 1 & 0xff;
    }
    if (buflen <= iVar4) break;
    *pcVar7 = '.';
    pbVar5 = pbVar5 + 1;
    pcVar10 = pcVar7 + 1;
    if (pbVar5 == (byte *)register0x00002008) {
      *pcVar7 = '\0';
      return buf;
    }
  }
  return (char *)0x0;
}



char * ip4addr_ntoa(ip4_addr_t *addr)

{
  char str [16];
  char *pcVar1;
  
  pcVar1 = ip4addr_ntoa_r(addr,(char *)&ram0x420151ac,0x10);
  return pcVar1;
}



void mem_init(void)

{
  ram = ram_heap;
  ram_heap._0_4_ = 0x2000;
  ram_heap[4] = '\0';
  ram_end = (mem *)(ram_heap + 0x2000);
  ram_heap._8192_4_ = 0x20002000;
  ram_heap[8196] = '\x01';
  lfree = (mem *)ram_heap;
  lwip_stats.mem.avail = 0x2000;
  sys_mutex_new(&mem_mutex);
  return;
}



void mem_free(uint param_1)

{
  ushort uVar1;
  ushort uVar2;
  short sVar3;
  u8_t *puVar4;
  mem *pmVar5;
  mem *pmVar6;
  mem *pmVar7;
  uint uVar8;
  mem *pmVar9;
  
  if (param_1 == 0) {
    return;
  }
  if ((((param_1 & 3) == 0) && (pmVar6 = (mem *)(param_1 - 8), ram <= pmVar6)) &&
     ((mem *)(param_1 + 0xc) <= ram_end)) {
    sys_mutex_lock(&mem_mutex);
    pmVar5 = ram_end;
    puVar4 = ram;
    pmVar9 = lfree;
    if (*(char *)(param_1 - 4) != '\0') {
      uVar1 = *(ushort *)(param_1 - 8);
      if ((uVar1 < 0x2001) && (uVar2 = *(ushort *)(param_1 - 6), uVar2 < 0x2001)) {
        pmVar7 = (mem *)((int)pmVar6 - (int)ram);
        uVar8 = (uint)pmVar7 & 0xffff;
        if ((uVar8 == (uint)uVar2) || ((uint)*(ushort *)(ram + (uint)uVar2) == uVar8)) {
          if (((mem *)(ram + uVar1) == ram_end) || ((uint)((mem *)(ram + uVar1))->prev == uVar8)) {
            *(undefined *)(param_1 - 4) = 0;
            if (pmVar6 < pmVar9) {
              lfree = pmVar6;
            }
            sVar3 = (short)((uint)((int)pmVar7 * 0x10000) >> 0x10);
            lwip_stats.mem.used = (lwip_stats.mem.used - uVar1) + sVar3;
            pmVar9 = (mem *)(puVar4 + *(ushort *)(param_1 - 8));
            if (((pmVar6 != pmVar9) && (pmVar9->used == '\0')) && (pmVar5 != pmVar9)) {
              if (pmVar9 == lfree) {
                lfree = pmVar6;
              }
              *(mem_size_t *)(param_1 - 8) = pmVar9->next;
              if (pmVar9->next != 0x2000) {
                *(short *)(puVar4 + (uint)pmVar9->next + 2) = sVar3;
              }
            }
            uVar1 = *(ushort *)(param_1 - 6);
            pmVar9 = (mem *)(puVar4 + uVar1);
            if ((pmVar6 != pmVar9) && (pmVar9->used == '\0')) {
              if (pmVar6 == lfree) {
                lfree = pmVar9;
              }
              pmVar9->next = *(mem_size_t *)(param_1 - 8);
              if (*(ushort *)(param_1 - 8) != 0x2000) {
                *(ushort *)(puVar4 + (uint)*(ushort *)(param_1 - 8) + 2) = uVar1;
              }
            }
            sys_mutex_unlock(&mem_mutex);
            return;
          }
        }
      }
    }
    sys_mutex_unlock(&mem_mutex);
  }
  sys_arch_protect();
  lwip_stats.mem.illegal = lwip_stats.mem.illegal + 1;
  sys_arch_unprotect();
  return;
}



mem * mem_trim(mem *param_1,uint param_2)

{
  mem_size_t mVar1;
  short sVar2;
  u8_t *puVar3;
  uint uVar4;
  mem_size_t mVar5;
  uint uVar6;
  uint uVar7;
  mem *pmVar8;
  mem *pmVar9;
  undefined2 uVar10;
  uint uVar11;
  uint uVar12;
  uint uVar13;
  
  uVar4 = param_2 + 3 & 0xfffc;
  if (uVar4 < 0xc) {
    uVar4 = 0xc;
  }
  else {
    if (0x2000 < uVar4) {
      return (mem *)0;
    }
  }
  if (uVar4 < param_2) {
    return (mem *)0;
  }
  if ((param_1 < ram) || (ram_end <= param_1)) {
    sys_arch_protect();
    lwip_stats.mem.illegal = lwip_stats.mem.illegal + 1;
    sys_arch_unprotect();
    return param_1;
  }
  uVar6 = (int)param_1 + (-8 - (int)ram);
  uVar11 = (uint)*(ushort *)&param_1[-2].used - 8;
  uVar7 = uVar6 & 0xffff;
  uVar12 = uVar11 & 0xffff;
  uVar13 = uVar12 - uVar7 & 0xffff;
  if (uVar13 < uVar4) {
    return (mem *)0;
  }
  if (uVar13 == uVar4) {
    return param_1;
  }
  sys_mutex_lock(&mem_mutex);
  puVar3 = ram;
  pmVar8 = (mem *)(ram + *(ushort *)&param_1[-2].used);
  mVar5 = (mem_size_t)uVar7;
  if (pmVar8->used == '\0') {
    uVar6 = uVar7 + 8 + uVar4;
    mVar1 = pmVar8->next;
    pmVar9 = (mem *)(ram + (uVar6 & 0xffff));
    if (lfree == pmVar8) {
      lfree = pmVar9;
    }
    pmVar9->used = '\0';
    pmVar9->next = mVar1;
    pmVar9->prev = mVar5;
    uVar10 = (undefined2)(uVar6 * 0x10000 >> 0x10);
    *(undefined2 *)&param_1[-2].used = uVar10;
    if (pmVar9->next != 0x2000) {
      *(undefined2 *)(puVar3 + (uint)pmVar9->next + 2) = uVar10;
    }
    sVar2 = (mVar5 - (short)uVar12) + lwip_stats.mem.used;
  }
  else {
    if (uVar13 < uVar4 + 0x14) goto LAB_2303ff8e;
    uVar7 = uVar7 + 8 + uVar4;
    pmVar8 = (mem *)(ram + (uVar7 & 0xffff));
    if (pmVar8 < lfree) {
      lfree = pmVar8;
    }
    pmVar8->used = '\0';
    mVar1 = *(mem_size_t *)&param_1[-2].used;
    pmVar8->prev = mVar5;
    pmVar8->next = mVar1;
    uVar10 = (undefined2)(uVar7 * 0x10000 >> 0x10);
    *(undefined2 *)&param_1[-2].used = uVar10;
    if (pmVar8->next != 0x2000) {
      *(undefined2 *)(puVar3 + (uint)pmVar8->next + 2) = uVar10;
    }
    sVar2 = ((short)(uVar6 * 0x10000 >> 0x10) - (short)(uVar11 * 0x10000 >> 0x10)) +
            lwip_stats.mem.used;
  }
  lwip_stats.mem.used = (short)uVar4 + sVar2;
LAB_2303ff8e:
  sys_mutex_unlock(&mem_mutex);
  return param_1;
}



mem_size_t * mem_malloc(uint param_1)

{
  ushort uVar1;
  u8_t *puVar2;
  mem_size_t *pmVar3;
  mem *pmVar4;
  uint uVar5;
  uint uVar6;
  ushort *puVar7;
  mem_size_t mVar8;
  uint uVar9;
  uint uVar10;
  mem *pmVar11;
  
