pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (param_1 == 0) {
LAB_23040080:
    pmVar3 = (mem_size_t *)0x0;
  }
  else {
    uVar5 = param_1 + 3 & 0xfffc;
    if (uVar5 < 0xc) {
      uVar5 = 0xc;
    }
    else {
      if (0x2000 < uVar5) {
        return (mem_size_t *)0;
      }
    }
    pmVar3 = (mem_size_t *)0x0;
    if (param_1 <= uVar5) {
      sys_mutex_lock(&mem_mutex);
      puVar2 = ram;
      pmVar11 = lfree;
      uVar9 = (uint)((int)lfree - (int)ram) & 0xffff;
      do {
        uVar10 = uVar9;
        if (0x2000 - uVar5 <= uVar10) {
          lwip_stats.mem.err = lwip_stats.mem.err + 1;
          sys_mutex_unlock(&mem_mutex);
          goto LAB_23040080;
        }
        pmVar4 = (mem *)(ram + uVar10);
        uVar9 = (uint)pmVar4->next;
      } while ((pmVar4->used != '\0') || (uVar6 = (-8 - uVar10) + uVar9, uVar6 < uVar5));
      if (uVar6 < uVar5 + 0x14) {
        pmVar4->used = '\x01';
        uVar10 = (uVar9 + lwip_stats.mem.used) - uVar10;
        lwip_stats.mem.used = (mem_size_t)(uVar10 * 0x10000 >> 0x10);
        if ((uint)lwip_stats.mem.max < (uVar10 & 0xffff)) {
          lwip_stats.mem.max = lwip_stats.mem.used;
        }
      }
      else {
        uVar9 = uVar5 + 8 + uVar10;
        puVar7 = (ushort *)(ram + (uVar9 & 0xffff));
        *(undefined *)(puVar7 + 2) = 0;
        uVar1 = pmVar4->next;
        puVar7[1] = (ushort)uVar10;
        *puVar7 = uVar1;
        mVar8 = (mem_size_t)(uVar9 * 0x10000 >> 0x10);
        pmVar4->next = mVar8;
        pmVar4->used = '\x01';
        if (*puVar7 != 0x2000) {
          *(mem_size_t *)(puVar2 + (uint)*puVar7 + 2) = mVar8;
        }
        uVar5 = uVar5 + (uint)lwip_stats.mem.used + 8;
        lwip_stats.mem.used = (mem_size_t)(uVar5 * 0x10000 >> 0x10);
        if ((uint)lwip_stats.mem.max < (uVar5 & 0xffff)) {
          lwip_stats.mem.max = lwip_stats.mem.used;
        }
      }
      if (pmVar11 == pmVar4) {
        while ((lfree = pmVar11, pmVar11->used != '\0' && (ram_end != pmVar11))) {
          pmVar11 = (mem *)(puVar2 + pmVar11->next);
        }
      }
      sys_mutex_unlock(&mem_mutex);
      pmVar3 = &pmVar4[1].prev;
    }
  }
  return pmVar3;
}



// WARNING: Type propagation algorithm not settling

void * do_memp_malloc_pool(memp_desc *desc)

{
  memp mVar1;
  sys_prot_t sVar2;
  stats_mem *psVar3;
  
  sVar2 = sys_arch_protect();
  mVar1 = (memp)((memp *)desc->tab)->next;
  if (mVar1 == (memp)0x0) {
    desc->stats->err = desc->stats->err + 1;
  }
  else {
    *(memp *)&((memp *)desc->tab)->next = *(memp *)mVar1;
    desc->stats->used = desc->stats->used + 1;
    psVar3 = desc->stats;
    if (psVar3->max < psVar3->used) {
      psVar3->max = psVar3->used;
    }
  }
  sys_arch_unprotect(sVar2);
  return (void *)mVar1;
}



// WARNING: Type propagation algorithm not settling

void memp_init_pool(memp_desc *desc)

{
  int iVar1;
  memp mVar2;
  
  iVar1 = 0;
  *desc->tab = (memp *)0x0;
  mVar2 = (memp)((uint)(desc->base + 3) & 0xfffffffc);
  while (iVar1 < (int)(uint)desc->num) {
    iVar1 = iVar1 + 1;
    *(memp **)mVar2 = ((memp *)desc->tab)->next;
    *(memp *)&((memp *)desc->tab)->next = mVar2;
    mVar2 = (memp)((int)mVar2 + (uint)desc->size);
  }
  desc->stats->avail = desc->num;
  return;
}



void memp_init(void)

{
  stats_ *psVar1;
  int iVar2;
  memp_desc *desc;
  
  iVar2 = 0;
  psVar1 = &lwip_stats;
  do {
    desc = *(memp_desc **)((int)memp_pools + iVar2);
    iVar2 = iVar2 + 4;
    memp_init_pool(desc);
    psVar1->memp[0] = desc->stats;
    psVar1 = (stats_ *)&(psVar1->link).fw;
  } while (iVar2 != 0x3c);
  return;
}



void * memp_malloc(memp_t type)

{
  undefined3 in_register_00002029;
  void *pvVar1;
  
  if (CONCAT31(in_register_00002029,type) < 0xf) {
    pvVar1 = do_memp_malloc_pool(memp_pools[CONCAT31(in_register_00002029,type)]);
    return pvVar1;
  }
  return (void *)0x0;
}



void memp_free(memp_t type,void *mem)

{
  memp_desc *pmVar1;
  undefined3 in_register_00002029;
  
  if ((CONCAT31(in_register_00002029,type) < 0xf) && (mem != (void *)0x0)) {
    pmVar1 = memp_pools[CONCAT31(in_register_00002029,type)];
    sys_arch_protect();
    pmVar1->stats->used = pmVar1->stats->used - 1;
    *(memp **)mem = *pmVar1->tab;
    *pmVar1->tab = mem;
    sys_arch_unprotect();
    return;
  }
  return;
}



err_t netif_null_output_ip4(netif *netif,pbuf *p,ip4_addr_t *ipaddr)

{
  return -0xc;
}



void netif_issue_reports(netif *netif,u8_t report_type)

{
  if (((netif->flags & 5) != 5) || ((report_type & 1) == 0)) {
    return;
  }
  if ((netif->ip_addr).addr != 0) {
    if ((netif->flags & 8) != 0) {
      etharp_request(netif,(ip4_addr_t *)&netif->ip_addr);
    }
    if ((netif->flags & 0x20) != 0) {
      igmp_report_groups(netif);
      return;
    }
  }
  return;
}



// WARNING: Variable defined which should be unmapped: new_addr
// WARNING: Type propagation algorithm not settling

int netif_do_set_ipaddr(netif *netif,ip4_addr_t *ipaddr,ip_addr_t *old_addr)

{
  ip_addr_t iVar1;
  ip_addr_t iStack20;
  ip_addr_t new_addr;
  
  iVar1 = (ip_addr_t)(netif->ip_addr).addr;
  iStack20 = (ip_addr_t)ipaddr->addr;
  if (iStack20 != iVar1) {
    *(ip_addr_t *)&old_addr->addr = iVar1;
    tcp_netif_ip_addr_changed(old_addr,&iStack20);
    udp_netif_ip_addr_changed(old_addr,&iStack20);
    raw_netif_ip_addr_changed(old_addr,&iStack20);
    (netif->ip_addr).addr = ipaddr->addr;
    netif_issue_reports(netif,'\x01');
    if (netif->status_callback != (netif_status_callback_fn *)0x0) {
      (*netif->status_callback)(netif);
    }
    return 1;
  }
  return 0;
}



void netif_init(void)

{
  return;
}



void netif_set_ipaddr(netif *netif,ip4_addr_t *ipaddr)

{
  ip_addr_t iStack20;
  ip_addr_t old_addr;
  
  if (netif != (netif *)0x0) {
    if (ipaddr == (ip4_addr_t *)0x0) {
      ipaddr = (ip4_addr_t *)&ip_addr_any;
    }
    netif_do_set_ipaddr(netif,ipaddr,&iStack20);
    return;
  }
  return;
}



