pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void netif_set_netmask(netif *netif,ip4_addr_t *netmask)

{
  if (netif != (netif *)0x0) {
    if (netmask == (ip4_addr_t *)0x0) {
      netmask = (ip4_addr_t *)&ip_addr_any;
    }
    if (netmask->addr != (netif->netmask).addr) {
      (netif->netmask).addr = netmask->addr;
    }
  }
  return;
}



void netif_set_gw(netif *netif,ip4_addr_t *gw)

{
  if (netif != (netif *)0x0) {
    if (gw == (ip4_addr_t *)0x0) {
      gw = (ip4_addr_t *)&ip_addr_any;
    }
    if (gw->addr != (netif->gw).addr) {
      (netif->gw).addr = gw->addr;
    }
  }
  return;
}



// WARNING: Variable defined which should be unmapped: old_addr

void netif_set_addr(netif *netif,ip4_addr_t *ipaddr,ip4_addr_t *netmask,ip4_addr_t *gw)

{
  bool bVar1;
  ip_addr_t iStack20;
  ip_addr_t old_addr;
  
  if (ipaddr == (ip4_addr_t *)0x0) {
    ipaddr = (ip4_addr_t *)&ip_addr_any;
  }
  if (netmask == (ip4_addr_t *)0x0) {
    netmask = (ip4_addr_t *)&ip_addr_any;
  }
  if (gw == (ip4_addr_t *)0x0) {
    gw = (ip4_addr_t *)&ip_addr_any;
  }
  bVar1 = ipaddr->addr == 0;
  if (bVar1) {
    netif_do_set_ipaddr(netif,ipaddr,&iStack20);
  }
  if (netmask->addr != (netif->netmask).addr) {
    (netif->netmask).addr = netmask->addr;
  }
  if (gw->addr != (netif->gw).addr) {
    (netif->gw).addr = gw->addr;
  }
  if (!bVar1) {
    netif_do_set_ipaddr(netif,ipaddr,&iStack20);
  }
  return;
}



netif * netif_add(netif *netif,ip4_addr_t *ipaddr,ip4_addr_t *netmask,ip4_addr_t *gw,void *state,
                 netif_init_fn_conflict *init,netif_input_fn *input)

{
  u8_t uVar1;
  err_t eVar2;
  undefined3 extraout_var;
  netif *pnVar3;
  
  if ((netif != (netif *)0x0) && (init != (netif_init_fn_conflict *)0x0)) {
    if (ipaddr == (ip4_addr_t *)0x0) {
      ipaddr = (ip4_addr_t *)&ip_addr_any;
    }
    if (netmask == (ip4_addr_t *)0x0) {
      netmask = (ip4_addr_t *)&ip_addr_any;
    }
    if (gw == (ip4_addr_t *)0x0) {
      gw = (ip4_addr_t *)&ip_addr_any;
    }
    netif->output = netif_null_output_ip4;
    (netif->ip_addr).addr = 0;
    (netif->netmask).addr = 0;
    (netif->gw).addr = 0;
    netif->mtu = 0;
    netif->flags = '\0';
    memset(netif->client_data,0,0xc);
    netif->state = state;
    uVar1 = netif_num;
    netif->input = input;
    netif->num = uVar1;
    netif->status_callback = (netif_status_callback_fn *)0x0;
    netif->link_callback = (netif_status_callback_fn *)0x0;
    netif->igmp_mac_filter = (netif_igmp_mac_filter_fn *)0x0;
    netif_set_addr(netif,ipaddr,netmask,gw);
    eVar2 = (*init)(netif);
    if (CONCAT31(extraout_var,eVar2) == 0) {
      do {
        if (netif->num == -1) {
          netif->num = '\0';
        }
        uVar1 = netif->num;
        pnVar3 = netif_list;
        while( true ) {
          if (pnVar3 == (netif *)0x0) {
            netif_num = '\0';
            if (uVar1 != -2) {
              netif_num = uVar1 + '\x01';
            }
            netif->next = netif_list;
            if ((netif->flags & 0x20) == 0) {
              netif_list = netif;
              return netif;
            }
            netif_list = netif;
            igmp_start(netif);
            return netif;
          }
          if (pnVar3->num == uVar1) break;
          pnVar3 = pnVar3->next;
        }
        netif->num = uVar1 + '\x01';
      } while( true );
    }
  }
  return (netif *)0x0;
}



void netif_set_default(netif *netif)

{
  netif_default = netif;
  return;
}



void netif_set_up(netif *netif)

{
  if (netif == (netif *)0x0) {
    return;
  }
  if ((netif->flags & 1) == 0) {
    netif->flags = netif->flags | 1;
    if (netif->status_callback != (netif_status_callback_fn *)0x0) {
      (*netif->status_callback)(netif);
    }
    netif_issue_reports(netif,'\x03');
    return;
  }
  return;
}



void netif_set_down(netif *netif)

{
  byte bVar1;
  
  if (netif == (netif *)0x0) {
    return;
  }
  bVar1 = netif->flags;
  if ((bVar1 & 1) != 0) {
    netif->flags = bVar1 & 0xfe;
    if ((bVar1 & 8) != 0) {
      etharp_cleanup_netif(netif);
    }
    if (netif->status_callback != (netif_status_callback_fn *)0x0) {
                    // WARNING: Could not recover jumptable at 0x23040594. Too many branches
                    // WARNING: Treating indirect jump as call
      (*netif->status_callback)(netif);
      return;
    }
  }
  return;
}



void netif_remove(netif *netif)

{
  netif *pnVar1;
  ip_addr_t *old_addr;
  netif *pnVar2;
  
  if (netif == (netif *)0x0) {
    return;
  }
  if ((netif->ip_addr).addr != 0) {
    old_addr = &netif->ip_addr;
    tcp_netif_ip_addr_changed(old_addr,(ip_addr_t *)0x0);
    udp_netif_ip_addr_changed(old_addr,(ip_addr_t *)0x0);
    raw_netif_ip_addr_changed(old_addr,(ip_addr_t *)0x0);
  }
  if ((netif->flags & 0x20) != 0) {
    igmp_stop(netif);
  }
  if ((netif->flags & 1) != 0) {
    netif_set_down(netif);
  }
  if (netif_default == netif) {
    netif_default = (netif *)0x0;
  }
  pnVar1 = netif_list;
  if (netif_list == netif) {
    netif_list = netif->next;
  }
  else {
    do {
      pnVar2 = pnVar1;
      if (pnVar2 == (netif *)0x0) {
        return;
      }
      pnVar1 = pnVar2->next;
    } while (pnVar2->next != netif);
    pnVar2->next = netif->next;
  }
  return;
}



void netif_set_status_callback(netif *netif,netif_status_callback_fn *status_callback)

{
  if (netif != (netif *)0x0) {
    netif->status_callback = status_callback;
  }
  return;
}



void netif_set_link_up(netif *netif)

{
  if (netif == (netif *)0x0) {
    return;
  }
  if ((netif->flags & 4) == 0) {
    netif->flags = netif->flags | 4;
    dhcp_network_changed(netif);
    netif_issue_reports(netif,'\x03');
    if (netif->link_callback != (netif_status_callback_fn *)0x0) {
                    // WARNING: Could not recover jumptable at 0x23040666. Too many branches
                    // WARNING: Treating indirect jump as call
      (*netif->link_callback)(netif);
      return;
    }
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

