pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void netif_set_link_down(netif *netif)

{
  if (netif != (netif *)0x0) {
    if ((netif->flags & 4) != 0) {
      netif->flags = netif->flags & 0xfb;
      if (netif->link_callback != (netif_status_callback_fn *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304068c. Too many branches
                    // WARNING: Treating indirect jump as call
        (*netif->link_callback)();
        return;
      }
    }
  }
  return;
}



netif * netif_get_by_index(u8_t idx)

{
  undefined3 in_register_00002029;
  netif *pnVar1;
  netif *pnVar2;
  
  pnVar1 = netif_list;
  pnVar2 = (netif *)0x0;
  if (CONCAT31(in_register_00002029,idx) != 0) {
    while ((pnVar2 = pnVar1, pnVar1 != (netif *)0x0 &&
           (((uint)pnVar1->num + 1 & 0xff) != CONCAT31(in_register_00002029,idx)))) {
      pnVar1 = pnVar1->next;
    }
  }
  return pnVar2;
}



netif * netif_find(char *name)

{
  uint uVar1;
  netif *pnVar2;
  
  if (name == (char *)0x0) {
    return (netif *)0x0;
  }
  uVar1 = atoi(name + 2);
  pnVar2 = netif_list;
  while( true ) {
    if (pnVar2 == (netif *)0x0) {
      return (netif *)0x0;
    }
    if ((((uint)pnVar2->num == (uVar1 & 0xff)) && (*name == pnVar2->name[0])) &&
       (name[1] == pnVar2->name[1])) break;
    pnVar2 = pnVar2->next;
  }
  return pnVar2;
}



pbuf * pbuf_skip_const(pbuf *in,u16_t in_offset,u16_t *out_offset)

{
  pbuf *ppVar1;
  undefined2 in_register_0000202e;
  
  if ((in != (pbuf *)0x0) && ((uint)in->len <= CONCAT22(in_register_0000202e,in_offset))) {
    ppVar1 = pbuf_skip_const(in->next,(u16_t)((CONCAT22(in_register_0000202e,in_offset) -
                                              (uint)in->len) * 0x10000 >> 0x10),out_offset);
    return ppVar1;
  }
  if (out_offset != (u16_t *)0x0) {
    *out_offset = in_offset;
  }
  return in;
}



void pbuf_free_ooseq_callback(void *arg)

{
  tcp_pcb *pcb;
  
  sys_arch_protect();
  pbuf_free_ooseq_pending = '\0';
  sys_arch_unprotect();
  pcb = tcp_active_pcbs;
  while( true ) {
    if (pcb == (tcp_pcb *)0x0) {
      return;
    }
    if (pcb->ooseq != (tcp_seg *)0x0) break;
    pcb = pcb->next;
  }
  tcp_free_ooseq(pcb);
  return;
}



u8_t pbuf_add_header_impl(pbuf *p,size_t header_size_increment,u8_t force)

{
  u8_t uVar1;
  pbuf *ppVar2;
  undefined3 in_register_00002031;
  uint uVar3;
  
  if (p == (pbuf *)0x0) {
    uVar1 = '\x01';
  }
  else {
    uVar1 = '\x01';
    if ((header_size_increment < 0x10000) && (uVar1 = '\0', header_size_increment != 0)) {
      uVar3 = (uint)p->tot_len + (header_size_increment & 0xffff);
      uVar1 = '\x01';
      if ((header_size_increment & 0xffff) <= (uVar3 & 0xffff)) {
        if ((char)p->type_internal < '\0') {
          ppVar2 = (pbuf *)((int)p->payload - header_size_increment);
          if (ppVar2 < p + 1) {
            return '\x01';
          }
        }
        else {
          if (CONCAT31(in_register_00002031,force) == 0) {
            return '\x01';
          }
          ppVar2 = (pbuf *)((int)p->payload - header_size_increment);
        }
        *(pbuf **)&p->payload = ppVar2;
        p->tot_len = (u16_t)(uVar3 * 0x10000 >> 0x10);
        p->len = (short)header_size_increment + p->len;
        return '\0';
      }
    }
  }
  return uVar1;
}



pbuf * pbuf_alloc_reference(void *payload,u16_t length,pbuf_type type)

{
  pbuf *ppVar1;
  
  ppVar1 = (pbuf *)memp_malloc(MEMP_PBUF);
  if (ppVar1 != (pbuf *)0x0) {
    ppVar1->next = (pbuf *)0x0;
    ppVar1->payload = payload;
    ppVar1->tot_len = length;
    ppVar1->len = length;
    ppVar1->type_internal = (u8_t)type;
    ppVar1->flags = '\0';
    *(undefined2 *)&ppVar1->ref = 1;
  }
  return ppVar1;
}



pbuf * pbuf_alloced_custom(pbuf_layer l,u16_t length,pbuf_type type,pbuf_custom *p,void *payload_mem
                          ,u16_t payload_mem_len)

{
  undefined3 in_register_00002029;
  uint uVar1;
  undefined2 in_register_0000202e;
  undefined2 in_register_0000203e;
  
  uVar1 = CONCAT31(in_register_00002029,l) + 3U & 0xfffffffc;
  if (CONCAT22(in_register_0000202e,length) + uVar1 <=
      CONCAT22(in_register_0000203e,payload_mem_len)) {
    if (payload_mem != (void *)0x0) {
      payload_mem = (void *)((int)payload_mem + uVar1);
    }
    (p->pbuf).flags = '\x02';
    (p->pbuf).next = (pbuf *)0x0;
    (p->pbuf).payload = payload_mem;
    (p->pbuf).tot_len = length;
    (p->pbuf).len = length;
    (p->pbuf).type_internal = (u8_t)type;
    *(undefined2 *)&(p->pbuf).ref = 1;
    return (pbuf *)p;
  }
  return (pbuf *)0x0;
}



u8_t pbuf_add_header(pbuf *p,size_t header_size_increment)

{
  u8_t uVar1;
  
  uVar1 = pbuf_add_header_impl(p,header_size_increment,'\0');
  return uVar1;
}



u8_t pbuf_remove_header(pbuf *p,size_t header_size_decrement)

{
  u8_t uVar1;
  
  if (p == (pbuf *)0x0) {
    uVar1 = '\x01';
  }
  else {
    uVar1 = '\x01';
    if ((header_size_decrement < 0x10000) && (uVar1 = '\0', header_size_decrement != 0)) {
      uVar1 = '\x01';
      if ((header_size_decrement & 0xffff) <= (uint)p->len) {
        p->len = p->len - (short)header_size_decrement;
        p->payload = (void *)(header_size_decrement + (int)p->payload);
        p->tot_len = p->tot_len - (short)header_size_decrement;
        return '\0';
      }
    }
  }
  return uVar1;
}



u8_t pbuf_header(pbuf *p,s16_t header_size_increment)

{
  u8_t uVar1;
  short in_register_0000202e;
  
  if (in_register_0000202e < 0) {
    uVar1 = pbuf_remove_header(p,-CONCAT22(in_register_0000202e,header_size_increment));
    return uVar1;
  }
  uVar1 = pbuf_add_header_impl(p,CONCAT22(in_register_0000202e,header_size_increment),'\0');
  return uVar1;
}



u8_t pbuf_header_force(pbuf *p,s16_t header_size_increment)

{
  u8_t uVar1;
  short in_register_0000202e;
  
  if (in_register_0000202e < 0) {
    uVar1 = pbuf_remove_header(p,-CONCAT22(in_register_0000202e,header_size_increment));
    return uVar1;
  }
  uVar1 = pbuf_add_header_impl(p,CONCAT22(in_register_0000202e,header_size_increment),'\x01');
  return uVar1;
}



u8_t pbuf_free(pbuf *p)

{
  u8_t uVar1;
  u8_t uVar2;
  pbuf *ppVar3;
  memp_t type;
  byte bVar4;
  
