pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar1 = '\0';
  if (p != (pbuf *)0x0) {
    uVar1 = '\0';
    do {
      sys_arch_protect();
      uVar2 = p->ref + -1;
      p->ref = uVar2;
      sys_arch_unprotect();
      if (uVar2 != '\0') {
        return uVar1;
      }
      ppVar3 = p->next;
      if ((p->flags & 2) == 0) {
        type = MEMP_PBUF_POOL;
        bVar4 = p->type_internal & 0xf;
        if (bVar4 != 2) {
          if (bVar4 != 1) {
            if ((p->type_internal & 0xf) == 0) {
              mem_free(p);
            }
            goto LAB_230408d6;
          }
          type = MEMP_PBUF;
        }
        memp_free(type,p);
      }
      else {
        (*(code *)p[1].next)(p,p[1].next);
      }
LAB_230408d6:
      uVar1 = uVar1 + '\x01';
      p = ppVar3;
    } while (ppVar3 != (pbuf *)0x0);
  }
  return uVar1;
}



pbuf * pbuf_alloc(pbuf_layer layer,u16_t length,pbuf_type type)

{
  u8_t uVar1;
  uint uVar2;
  uint uVar3;
  pbuf *ppVar4;
  err_t eVar5;
  undefined3 in_register_00002029;
  pbuf *p;
  pbuf *ppVar6;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  undefined2 in_register_00002032;
  uint uVar7;
  pbuf *ppVar8;
  
  uVar7 = CONCAT22(in_register_00002032,type);
  uVar3 = CONCAT22(in_register_0000202e,length);
  if (uVar7 != 0x41) {
    if (uVar7 < 0x42) {
      if (uVar7 == 1) goto LAB_230409bc;
    }
    else {
      uVar2 = CONCAT31(in_register_00002029,layer) & 0xffff;
      if (uVar7 == 0x182) {
        p = (pbuf *)0x0;
        ppVar8 = (pbuf *)0x0;
        while (ppVar6 = (pbuf *)memp_malloc(MEMP_PBUF_POOL), ppVar6 != (pbuf *)0x0) {
          uVar7 = 0x2f8 - (uVar2 + 3 & 0xfffffffc);
          if (uVar3 < (uVar7 & 0xffff)) {
            uVar7 = uVar3;
          }
          ppVar6->next = (pbuf *)0x0;
          ppVar6->payload = (void *)((int)&ppVar6[1].next + uVar2 + 3 & 0xfffffffc);
          ppVar6->tot_len = (u16_t)uVar3;
          ppVar6->len = (u16_t)uVar7;
          *(undefined4 *)&ppVar6->type_internal = 0x10082;
          ppVar4 = ppVar6;
          if (p != (pbuf *)0x0) {
            ppVar8->next = ppVar6;
            ppVar4 = p;
          }
          uVar3 = uVar3 - (uVar7 & 0xffff) & 0xffff;
          uVar2 = 0;
          p = ppVar4;
          ppVar8 = ppVar6;
          if (uVar3 == 0) {
            return ppVar4;
          }
        }
        sys_arch_protect();
        uVar1 = pbuf_free_ooseq_pending;
        pbuf_free_ooseq_pending = '\x01';
        sys_arch_unprotect();
        if ((uVar1 == '\0') &&
           (eVar5 = tcpip_try_callback(pbuf_free_ooseq_callback,(void *)0x0),
           CONCAT31(extraout_var,eVar5) != 0)) {
          sys_arch_protect();
          pbuf_free_ooseq_pending = '\0';
          sys_arch_unprotect();
        }
        if (p != (pbuf *)0x0) {
          pbuf_free(p);
        }
      }
      else {
        if (uVar7 == 0x280) {
          uVar7 = uVar3 + 3 & 0xfffffffc;
          uVar3 = (uVar2 + 3 & 0xfffffffc) + uVar7 & 0xffff;
          if ((uVar7 <= uVar3) && (uVar7 <= (uVar3 + 0x10 & 0xffff))) {
            p = (pbuf *)mem_malloc();
            if (p == (pbuf *)0x0) {
              return (pbuf *)0x0;
            }
            p->next = (pbuf *)0x0;
            p->payload = (void *)((int)&p[1].next + CONCAT31(in_register_00002029,layer) + 3 &
                                 0xfffffffc);
            p->tot_len = length;
            p->len = length;
            *(undefined4 *)&p->type_internal = 0x10080;
            return p;
          }
        }
      }
    }
    return (pbuf *)0x0;
  }
LAB_230409bc:
  p = pbuf_alloc_reference((void *)0x0,length,type);
  return p;
}



void pbuf_realloc(pbuf *p,u16_t new_len)

{
  ushort uVar1;
  uint uVar2;
  undefined2 in_register_0000202e;
  uint uVar3;
  
  uVar2 = CONCAT22(in_register_0000202e,new_len);
  uVar1 = p->tot_len;
  if (uVar2 < uVar1) {
    while (uVar3 = (uint)p->len, uVar3 < uVar2) {
      p->tot_len = p->tot_len + (new_len - uVar1);
      uVar2 = uVar2 - uVar3 & 0xffff;
      p = p->next;
    }
    if ((((p->type_internal & 0xf) == 0) && (uVar3 != uVar2)) && ((p->flags & 2) == 0)) {
      p = (pbuf *)mem_trim(p,(int)p->payload + (uVar2 - (int)p) & 0xffff);
    }
    p->len = (u16_t)uVar2;
    p->tot_len = (u16_t)uVar2;
    if (p->next != (pbuf *)0x0) {
      pbuf_free(p->next);
    }
    p->next = (pbuf *)0x0;
    return;
  }
  return;
}



pbuf * pbuf_free_header(pbuf *q,u16_t size)

{
  pbuf *ppVar1;
  undefined2 in_register_0000202e;
  uint header_size_decrement;
  
  header_size_decrement = CONCAT22(in_register_0000202e,size);
  while( true ) {
    if (header_size_decrement == 0) {
      return q;
    }
    if (q == (pbuf *)0x0) break;
    if (header_size_decrement < q->len) {
      pbuf_remove_header(q,header_size_decrement);
      return q;
    }
    ppVar1 = q->next;
    header_size_decrement = header_size_decrement - q->len & 0xffff;
    q->next = (pbuf *)0x0;
    pbuf_free(q);
    q = ppVar1;
  }
  return (pbuf *)0x0;
}



u16_t pbuf_clen(pbuf *p)

{
  u16_t uVar1;
  
  uVar1 = 0;
  while (p != (pbuf *)0x0) {
    uVar1 = uVar1 + 1;
    p = p->next;
  }
  return uVar1;
}



void pbuf_ref(pbuf *p)

{
  if (p != (pbuf *)0x0) {
    sys_arch_protect();
    p->ref = p->ref + '\x01';
    sys_arch_unprotect();
    return;
  }
  return;
}



void pbuf_cat(pbuf *h,pbuf *t)

{
  pbuf *ppVar1;
  
  if (h != (pbuf *)0x0) {
    if (t == (pbuf *)0x0) {
      return;
    }
    do {
      ppVar1 = h;
      ppVar1->tot_len = (u16_t)(((uint)ppVar1->tot_len + (uint)t->tot_len) * 0x10000 >> 0x10);
      h = ppVar1->next;
    } while (ppVar1->next != (pbuf *)0x0);
    ppVar1->next = t;
  }
  return;
}



void pbuf_chain(pbuf *h,pbuf *t)

{
  pbuf_cat(h,t);
  pbuf_ref(t);
  return;
}



err_t pbuf_copy(pbuf *p_to,pbuf *p_from)

{
  err_t eVar1;
  uint uVar2;
  uint __n;
  uint uVar3;
  uint uVar4;
  
  if (p_to == (pbuf *)0x0) {
    return -0x10;
  }
  if ((p_from == (pbuf *)0x0) || (p_to->tot_len < p_from->tot_len)) {
LAB_23040c06:
    eVar1 = -0x10;
  }
  else {
    uVar4 = 0;
    uVar3 = 0;
    do {
      __n = p_to->len - uVar3;
      uVar2 = p_from->len - uVar4;
      if (uVar2 < __n) {
        __n = uVar2;
      }
      memcpy((void *)((int)p_to->payload + uVar3),(void *)((int)p_from->payload + uVar4),__n);
      uVar4 = uVar4 + __n;
      uVar3 = uVar3 + __n;
      if (p_from->len <= uVar4) {
        p_from = p_from->next;
        uVar4 = 0;
      }
      if (uVar3 == (uint)p_to->len) {
        p_to = p_to->next;
        if (p_to == (pbuf *)0x0) {
          if (p_from == (pbuf *)0x0) {
            return '\0';
          }
          goto LAB_23040c06;
        }
        uVar3 = 0;
      }
      if ((((p_from != (pbuf *)0x0) && (p_from->len == p_from->tot_len)) &&
          (p_from->next != (pbuf *)0x0)) ||
         ((p_to->len == p_to->tot_len && (p_to->next != (pbuf *)0x0)))) {
        return -6;
      }
    } while (p_from != (pbuf *)0x0);
    eVar1 = '\0';
  }
  return eVar1;
}



