pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
u16_t pbuf_copy_partial(pbuf *buf,void *dataptr,u16_t len,u16_t offset)

{
  u16_t uVar1;
  uint uVar2;
  uint uVar3;
  uint __n;
  undefined2 in_register_00002032;
  undefined2 in_register_00002036;
  uint uVar4;
  
  uVar4 = CONCAT22(in_register_00002036,offset);
  uVar3 = CONCAT22(in_register_00002032,len);
  uVar1 = 0;
  if (buf != (pbuf *)0x0) {
    uVar2 = 0;
    uVar1 = 0;
    if (dataptr != (void *)0x0) {
      while ((uVar1 = (u16_t)uVar2, uVar3 != 0 && (buf != (pbuf *)0x0))) {
        __n = (uint)buf->len;
        if ((uVar4 == 0) || (uVar4 < __n)) {
          __n = __n - uVar4 & 0xffff;
          if (uVar3 < __n) {
            __n = uVar3;
          }
          __n = __n & 0xffff;
          memcpy((void *)((int)dataptr + uVar2),(void *)((int)buf->payload + uVar4),__n);
          uVar2 = uVar2 + __n & 0xffff;
          uVar3 = uVar3 - __n & 0xffff;
          uVar4 = 0;
        }
        else {
          uVar4 = uVar4 - __n & 0xffff;
        }
        buf = buf->next;
      }
    }
  }
  return uVar1;
}



err_t pbuf_take(pbuf *buf,void *dataptr,u16_t len)

{
  uint uVar1;
  err_t eVar2;
  undefined2 in_register_00002032;
  uint __n;
  int iVar3;
  
  uVar1 = CONCAT22(in_register_00002032,len);
  if (buf != (pbuf *)0x0) {
    eVar2 = -0x10;
    if (dataptr != (void *)0x0) {
      eVar2 = -1;
      iVar3 = 0;
      if (uVar1 <= buf->tot_len) {
        while (uVar1 != 0) {
          __n = (uint)buf->len;
          if (uVar1 < (uint)buf->len) {
            __n = uVar1;
          }
          memcpy(buf->payload,(void *)((int)dataptr + iVar3),__n);
          buf = buf->next;
          uVar1 = uVar1 - __n;
          iVar3 = iVar3 + __n;
        }
        eVar2 = '\0';
      }
    }
    return eVar2;
  }
  return -0x10;
}



err_t pbuf_take_at(pbuf *buf,void *dataptr,u16_t len,u16_t offset)

{
  err_t eVar1;
  pbuf *ppVar2;
  undefined2 in_register_00002032;
  size_t sVar3;
  uint uVar4;
  uint uVar5;
  size_t __n;
  u16_t auStack34 [2];
  u16_t target_offset;
  
  sVar3 = CONCAT22(in_register_00002032,len);
  ppVar2 = pbuf_skip_const(buf,offset,auStack34);
  if (ppVar2 == (pbuf *)0x0) {
    eVar1 = -1;
  }
  else {
    uVar4 = (uint)auStack34[0];
    eVar1 = -1;
    if ((int)(uVar4 + sVar3) <= (int)(uint)ppVar2->tot_len) {
      uVar5 = ppVar2->len - uVar4;
      __n = sVar3;
      if ((int)uVar5 < (int)sVar3) {
        __n = uVar5 & 0xffff;
      }
      memcpy((void *)((int)ppVar2->payload + uVar4),dataptr,__n);
      eVar1 = '\0';
      if ((sVar3 - __n & 0xffff) != 0) {
        eVar1 = pbuf_take(ppVar2->next,(void *)((int)dataptr + __n),
                          (u16_t)((sVar3 - __n) * 0x10000 >> 0x10));
      }
    }
  }
  return eVar1;
}



pbuf * pbuf_clone(pbuf_layer layer,pbuf_type type,pbuf *p)

{
  pbuf *p_to;
  
  p_to = pbuf_alloc(layer,p->tot_len,type);
  if (p_to != (pbuf *)0x0) {
    pbuf_copy(p_to,p);
  }
  return p_to;
}



int pbuf_try_get_at(pbuf *p,u16_t offset)

{
  pbuf *ppVar1;
  uint uVar2;
  u16_t auStack18 [2];
  u16_t q_idx;
  
  ppVar1 = pbuf_skip_const(p,offset,auStack18);
  uVar2 = 0xffffffff;
  if (ppVar1 != (pbuf *)0x0) {
    uVar2 = 0xffffffff;
    if ((uint)auStack18[0] < (uint)ppVar1->len) {
      uVar2 = (uint)*(byte *)((int)ppVar1->payload + (uint)auStack18[0]);
    }
  }
  return uVar2;
}



u8_t pbuf_get_at(pbuf *p,u16_t offset)

{
  u8_t uVar1;
  
  _uVar1 = pbuf_try_get_at(p,offset);
  uVar1 = (u8_t)_uVar1;
  if (_uVar1 < 0) {
    uVar1 = '\0';
  }
  return uVar1;
}



void pbuf_put_at(pbuf *p,u16_t offset,u8_t data)

{
  pbuf *ppVar1;
  u16_t auStack18 [2];
  u16_t q_idx;
  
  ppVar1 = pbuf_skip_const(p,offset,auStack18);
  if ((ppVar1 != (pbuf *)0x0) && ((uint)auStack18[0] < (uint)ppVar1->len)) {
    *(u8_t *)((int)ppVar1->payload + (uint)auStack18[0]) = data;
  }
  return;
}



u16_t pbuf_memcmp(pbuf *p,u16_t offset,void *s2,u16_t n)

{
  byte *pbVar1;
  ushort *puVar2;
  uint uVar3;
  u8_t uVar4;
  undefined3 extraout_var;
  undefined2 in_register_0000202e;
  undefined2 in_register_00002036;
  short sVar5;
  uint uVar6;
  
  uVar3 = CONCAT22(in_register_0000202e,offset);
  if ((int)(uint)p->tot_len < (int)(uVar3 + CONCAT22(in_register_00002036,n))) {
    return 0xffff;
  }
  do {
    puVar2 = &p->len;
    if (uVar3 < *puVar2) break;
    p = p->next;
    uVar3 = uVar3 - *puVar2 & 0xffff;
  } while (p != (pbuf *)0x0);
  uVar6 = 0;
  do {
    _sVar5 = uVar6 & 0xffff;
    sVar5 = (short)_sVar5;
    if (CONCAT22(in_register_00002036,n) <= _sVar5) {
      return 0;
    }
    uVar4 = pbuf_get_at(p,(u16_t)((_sVar5 + uVar3) * 0x10000 >> 0x10));
    pbVar1 = (byte *)((int)s2 + uVar6);
    uVar6 = uVar6 + 1;
  } while ((uint)*pbVar1 == CONCAT31(extraout_var,uVar4));
  if (0xfffe < _sVar5) {
    sVar5 = -2;
  }
  return sVar5 + 1;
}



u16_t pbuf_memfind(pbuf *p,void *mem,u16_t mem_len,u16_t start_offset)

{
  ushort uVar1;
  uint uVar2;
  u16_t uVar3;
  undefined2 extraout_var;
  undefined2 in_register_00002032;
  undefined2 in_register_00002036;
  
  uVar2 = CONCAT22(in_register_00002036,start_offset);
  uVar1 = p->tot_len;
  if ((int)(CONCAT22(in_register_00002032,mem_len) + uVar2) <= (int)(uint)uVar1) {
    while (uVar2 <= ((uint)uVar1 - CONCAT22(in_register_00002032,mem_len) & 0xffff)) {
      uVar3 = pbuf_memcmp(p,(u16_t)uVar2,mem,mem_len);
      if (CONCAT22(extraout_var,uVar3) == 0) {
        return (u16_t)uVar2;
      }
      uVar2 = uVar2 + 1 & 0xffff;
    }
  }
  return 0xffff;
}



raw_input_state_t raw_input(pbuf *p,netif *inp)

{
  u8_t uVar1;
  raw_pcb *prVar2;
  raw_pcb *prVar3;
  u8_t uVar4;
  raw_input_state_t rVar5;
  u8_t uVar6;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  u32_t uVar7;
  raw_pcb *prVar8;
  
  uVar4 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,ip_data.current_netif);
  uVar1 = *(u8_t *)((int)p->payload + 9);
  rVar5 = RAW_INPUT_NONE;
  prVar2 = raw_pcbs;
  prVar8 = (raw_pcb *)0x0;
  do {
    prVar3 = prVar2;
    if (prVar3 == (raw_pcb *)0x0) {
      return rVar5;
    }
    if ((prVar3->protocol == uVar1) &&
       ((prVar3->netif_idx == '\0' ||
        (prVar3->netif_idx == (u8_t)((ip_data.current_input_netif)->num + '\x01'))))) {
      uVar7 = (prVar3->local_ip).addr;
      if (CONCAT31(extraout_var,uVar4) == 0) {
        if ((uVar7 == 0) || (ip_data.current_iphdr_dest == uVar7)) goto LAB_23040f92;
      }
      else {
        if (uVar7 == 0) {
LAB_23040f92:
          if ((((prVar3->flags & 1) == 0) || ((prVar3->remote_ip).addr == ip_data.current_iphdr_src)
              ) && (prVar3->recv != (raw_recv_fn *)0x0)) {
            uVar6 = (*prVar3->recv)(prVar3->recv_arg,prVar3,p,(ip_addr_t *)0x4201fed0);
            if (CONCAT31(extraout_var_00,uVar6) != 0) {
              if (prVar8 == (raw_pcb *)0x0) {
                return RAW_INPUT_EATEN;
              }
              prVar8->next = prVar3->next;
              prVar3->next = raw_pcbs;
              raw_pcbs = prVar3;
              return RAW_INPUT_EATEN;
            }
            rVar5 = RAW_INPUT_DELIVERED;
          }
        }
      }
    }
    prVar2 = prVar3->next;
    prVar8 = prVar3;
  } while( true );
}



