pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t raw_bind(raw_pcb *pcb,ip_addr_t *ipaddr)

{
  err_t eVar1;
  
  eVar1 = -6;
  if ((pcb != (raw_pcb *)0x0) && (ipaddr != (ip_addr_t *)0x0)) {
    (pcb->local_ip).addr = ipaddr->addr;
    eVar1 = '\0';
  }
  return eVar1;
}



void raw_bind_netif(raw_pcb *pcb,netif *netif)

{
  u8_t uVar1;
  
  uVar1 = '\0';
  if (netif != (netif *)0x0) {
    uVar1 = netif->num + '\x01';
  }
  pcb->netif_idx = uVar1;
  return;
}



err_t raw_connect(raw_pcb *pcb,ip_addr_t *ipaddr)

{
  if ((pcb != (raw_pcb *)0x0) && (ipaddr != (ip_addr_t *)0x0)) {
    (pcb->remote_ip).addr = ipaddr->addr;
    pcb->flags = pcb->flags | 1;
    return '\0';
  }
  return -6;
}



void raw_recv(raw_pcb *pcb,raw_recv_fn *recv,void *recv_arg)

{
  pcb->recv = recv;
  pcb->recv_arg = recv_arg;
  return;
}



err_t raw_sendto_if_src(raw_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,netif *netif,ip_addr_t *src_ip)

{
  err_t eVar1;
  u8_t ttl;
  undefined3 extraout_var;
  pbuf *h;
  undefined3 extraout_var_00;
  
  if ((((pcb == (raw_pcb *)0x0) || (dst_ip == (ip_addr_t *)0x0)) || (netif == (netif *)0x0)) ||
     (src_ip == (ip_addr_t *)0x0)) {
    return -6;
  }
  if ((pcb->flags & 2) != 0) {
    if (p->len < 0x14) {
      return -6;
    }
    eVar1 = ip4_output_if(p,(ip4_addr_t *)src_ip,(ip4_addr_t *)0x0,'\0','\0','\0',netif);
    return eVar1;
  }
  if (0xffeb < p->tot_len) {
    return -1;
  }
  ttl = pbuf_add_header(p,0x14);
  if (CONCAT31(extraout_var,ttl) == 0) {
    ttl = pbuf_remove_header(p,0x14);
    h = p;
    if (CONCAT31(extraout_var_00,ttl) != 0) {
      return -1;
    }
  }
  else {
    h = pbuf_alloc(PBUF_IP,0,PBUF_RAM);
    if (h == (pbuf *)0x0) {
      return -1;
    }
    if (p->tot_len != 0) {
      pbuf_chain(h,p);
    }
  }
  if ((pcb->flags & 4) == 0) {
LAB_23041106:
    if ((dst_ip->addr & 0xf0) == 0xe0) {
      ttl = pcb->mcast_ttl;
      goto LAB_2304111a;
    }
  }
  else {
    if ((dst_ip->addr & 0xf0) == 0xe0) {
      h->flags = h->flags | 4;
      goto LAB_23041106;
    }
  }
  ttl = pcb->ttl;
LAB_2304111a:
  eVar1 = ip4_output_if(h,(ip4_addr_t *)src_ip,(ip4_addr_t *)dst_ip,ttl,pcb->tos,pcb->protocol,netif
                       );
  if (p != h) {
    pbuf_free(h);
    return eVar1;
  }
  return eVar1;
}



err_t raw_sendto(raw_pcb *pcb,pbuf *p,ip_addr_t *ipaddr)

{
  err_t eVar1;
  netif *netif;
  raw_pcb *src_ip;
  uint uVar2;
  
  if ((pcb == (raw_pcb *)0x0) || (ipaddr == (ip_addr_t *)0x0)) {
    return -6;
  }
  if (pcb->netif_idx == '\0') {
    if (((ipaddr->addr & 0xf0) == 0xe0) &&
       (netif = netif_get_by_index(pcb->mcast_ifindex), netif != (netif *)0x0)) goto LAB_230411a2;
    netif = ip4_route((ip4_addr_t *)ipaddr);
  }
  else {
    netif = netif_get_by_index(pcb->netif_idx);
  }
  if (netif == (netif *)0x0) {
    return -4;
  }
LAB_230411a2:
  uVar2 = (pcb->local_ip).addr;
  if ((uVar2 == 0) || (src_ip = pcb, (uVar2 & 0xf0) == 0xe0)) {
    src_ip = (raw_pcb *)&netif->ip_addr;
  }
  eVar1 = raw_sendto_if_src(pcb,p,ipaddr,netif,(ip_addr_t *)src_ip);
  return eVar1;
}



err_t raw_send(raw_pcb *pcb,pbuf *p)

{
  err_t eVar1;
  
  eVar1 = raw_sendto(pcb,p,&pcb->remote_ip);
  return eVar1;
}



void raw_remove(raw_pcb *pcb)

{
  raw_pcb *prVar1;
  raw_pcb *prVar2;
  
  prVar1 = raw_pcbs;
  if (raw_pcbs == pcb) {
    raw_pcbs = pcb->next;
  }
  else {
    do {
      prVar2 = prVar1;
      if ((prVar2 == (raw_pcb *)0x0) || (prVar1 = prVar2->next, prVar1 == (raw_pcb *)0x0))
      goto LAB_230411f0;
    } while (prVar1 != pcb);
    prVar2->next = pcb->next;
  }
LAB_230411f0:
  memp_free(MEMP_RAW_PCB,pcb);
  return;
}



raw_pcb * raw_new(u8_t proto)

{
  raw_pcb *prVar1;
  raw_pcb *__s;
  
  __s = (raw_pcb *)memp_malloc(MEMP_RAW_PCB);
  if (__s != (raw_pcb *)0x0) {
    memset(__s,0,0x1c);
    __s->ttl = -1;
    __s->mcast_ttl = -1;
    __s->protocol = proto;
    prVar1 = __s;
    __s->next = raw_pcbs;
    raw_pcbs = prVar1;
  }
  return __s;
}



raw_pcb * raw_new_ip_type(u8_t type,u8_t proto)

{
  raw_pcb *prVar1;
  
  prVar1 = raw_new(proto);
  return prVar1;
}



void raw_netif_ip_addr_changed(ip_addr_t *old_addr,ip_addr_t *new_addr)

{
  raw_pcb *prVar1;
  
  if ((((old_addr != (ip_addr_t *)0x0) && (old_addr->addr != 0)) && (new_addr != (ip_addr_t *)0x0))
     && (prVar1 = raw_pcbs, new_addr->addr != 0)) {
    while (prVar1 != (raw_pcb *)0x0) {
      if ((prVar1->local_ip).addr == old_addr->addr) {
        (prVar1->local_ip).addr = new_addr->addr;
      }
      prVar1 = prVar1->next;
    }
  }
  return;
}



raw_pcb * raw_get_pcbs(void)

{
  return raw_pcbs;
}



void stats_init(void)

{
  return;
}



// WARNING: Variable defined which should be unmapped: ip_str
// WARNING: Type propagation algorithm not settling

void stats_netstat(void *ctx)

{
  ushort uVar1;
  ip4_addr_t addr;
  int iVar2;
  udp_pcb *addr_00;
  raw_pcb *addr_01;
  char *pcVar3;
  int iVar4;
  tcp_pcb ***ppptStack164;
  tcp_pcb ***_tcp_pcb_list;
  char ip_str [128];
  
  memset(&_tcp_pcb_list,0,0x80);
  ppptStack164 = (tcp_pcb ***)0x0;
  iVar2 = tcp_get_pcbs(&ppptStack164);
  addr_00 = udp_get_pcbs();
  addr_01 = raw_get_pcbs();
  printf("netstat tools\r\n");
  iVar4 = 0;
  while (iVar4 < iVar2) {
    addr = (ip4_addr_t)((ip4_addr_t *)ppptStack164[iVar4])->addr;
    while (addr != (ip4_addr_t)0x0) {
      ip4addr_ntoa_r((ip4_addr_t *)addr,(char *)&_tcp_pcb_list,0x80);
      printf("TCP\t%s:%hu\t",&_tcp_pcb_list,
             (uint)*(ushort *)((int)&((ip4_addr_t *)((int)addr + 0x14))->addr + 2));
      ip4addr_ntoa_r((ip4_addr_t *)((int)addr + 4),(char *)&_tcp_pcb_list,0x80);
      uVar1 = *(ushort *)&((ip4_addr_t *)((int)addr + 0x18))->addr;
      pcVar3 = tcp_debug_state_str(*(tcp_state *)&((ip4_addr_t *)((int)addr + 0x14))->addr);
      printf("%s:%hu\t%s\r\n",&_tcp_pcb_list,(uint)uVar1,pcVar3);
      addr = (ip4_addr_t)((ip4_addr_t *)&((ip4_addr_t *)((int)addr + 0xc))->addr)->addr;
    }
    iVar4 = iVar4 + 1;
  }
  while (addr_00 != (udp_pcb *)0x0) {
    ip4addr_ntoa_r((ip4_addr_t *)addr_00,(char *)&_tcp_pcb_list,0x80);
    printf("UDP\t%s:%hu\t",&_tcp_pcb_list,(uint)addr_00->local_port);
    ip4addr_ntoa_r((ip4_addr_t *)&addr_00->remote_ip,(char *)&_tcp_pcb_list,0x80);
    printf("%s:%hu\r\n",&_tcp_pcb_list,(uint)addr_00->remote_port);
    addr_00 = addr_00->next;
  }
  while (addr_01 != (raw_pcb *)0x0) {
    ip4addr_ntoa_r((ip4_addr_t *)addr_01,(char *)&_tcp_pcb_list,0x80);
    printf("RAW\t%s\t",&_tcp_pcb_list);
    ip4addr_ntoa_r((ip4_addr_t *)&addr_01->remote_ip,(char *)&_tcp_pcb_list,0x80);
    printf("%s\t%d\r\n",&_tcp_pcb_list,(uint)addr_01->protocol);
    addr_01 = addr_01->next;
  }
  return;
}



