pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
u16_t tcp_new_port(void)

{
  uint uVar1;
  uint uVar2;
  u32_t uVar3;
  tcp_pcb ***ppptVar4;
  
  uVar2 = 0x4000;
again:
  tcp_port = tcp_port + 1;
  if (tcp_port == 0xffff) {
    tcp_port = 0xc000;
  }
  ppptVar4 = tcp_pcb_lists;
  do {
    uVar3 = (((tcp_pcb *)*ppptVar4)->local_ip).addr;
    while (uVar3 != 0) {
      if (*(u16_t *)(uVar3 + 0x16) == tcp_port) {
        uVar1 = uVar2 - 1;
        uVar2 = uVar1 & 0xffff;
        if (uVar2 == 0) {
          return (u16_t)(uVar1 * 0x10000 >> 0x10);
        }
        goto again;
      }
      uVar3 = *(u32_t *)(uVar3 + 0xc);
    }
    ppptVar4 = (tcp_pcb ***)((tcp_pcb **)ppptVar4 + 1);
    if (ppptVar4 == (tcp_pcb ***)tcp_state_str) {
      return tcp_port;
    }
  } while( true );
}



err_t tcp_close_shutdown_fin(tcp_pcb *pcb)

{
  err_t eVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  tcp_state tVar2;
  
  tVar2 = pcb->state;
  if (tVar2 != ESTABLISHED) {
    if (tVar2 == CLOSE_WAIT) {
      eVar1 = tcp_send_fin(pcb);
      _eVar1 = CONCAT31(extraout_var_00,eVar1);
      if (_eVar1 != 0) goto LAB_2304146c;
      tVar2 = LAST_ACK;
      goto LAB_2304144a;
    }
    if (tVar2 != SYN_RCVD) {
      return '\0';
    }
  }
  eVar1 = tcp_send_fin(pcb);
  _eVar1 = CONCAT31(extraout_var,eVar1);
  if (_eVar1 != 0) {
LAB_2304146c:
    if (_eVar1 == -1) {
      pcb->flags = pcb->flags | 8;
      return '\0';
    }
    return (err_t)_eVar1;
  }
  tVar2 = FIN_WAIT_1;
LAB_2304144a:
  pcb->state = tVar2;
  tcp_output(pcb);
  return '\0';
}



void tcp_init(void)

{
  uint uVar1;
  
  uVar1 = bl_rand();
  tcp_port = (u16_t)(((uVar1 & 0x3fff) - 0x4000) * 0x10000 >> 0x10);
  printf("-------------------->>>>>>>> LWIP tcp_port %u\r\n");
  return;
}



void tcp_free(tcp_pcb *pcb)

{
  memp_free(MEMP_TCP_PCB,pcb);
  return;
}



err_t tcp_bind(tcp_pcb *pcb,ip_addr_t *ipaddr,u16_t port)

{
  tcp_pcb *ptVar1;
  err_t eVar2;
  undefined2 extraout_var;
  int iVar3;
  undefined2 in_register_00002032;
  tcp_pcb ***ppptVar4;
  u32_t *puVar5;
  
  if (ipaddr == (ip_addr_t *)0x0) {
    ipaddr = &ip_addr_any;
  }
  eVar2 = -0x10;
  if ((pcb != (tcp_pcb *)0x0) && (eVar2 = -6, pcb->state == CLOSED)) {
    if (CONCAT22(in_register_00002032,port) == 0) {
      port = tcp_new_port();
      if (CONCAT22(extraout_var,port) == 0) {
        return -2;
      }
    }
    else {
      ppptVar4 = tcp_pcb_lists;
      iVar3 = 0;
      do {
        puVar5 = (u32_t *)(((tcp_pcb *)*ppptVar4)->local_ip).addr;
        while (puVar5 != (u32_t *)0x0) {
          if ((((uint)*(ushort *)((int)puVar5 + 0x16) == CONCAT22(in_register_00002032,port)) &&
              (((pcb->so_options & 4) == 0 || ((*(byte *)((int)puVar5 + 9) & 4) == 0)))) &&
             ((*puVar5 == 0 || ((ipaddr->addr == 0 || (*puVar5 == ipaddr->addr)))))) {
            return -8;
          }
          puVar5 = (u32_t *)puVar5[3];
        }
        iVar3 = iVar3 + 1;
        ppptVar4 = (tcp_pcb ***)((tcp_pcb **)ppptVar4 + 1);
      } while ((uint)((pcb->so_options & 4) == 0) + 3 != iVar3);
    }
    if (ipaddr->addr != 0) {
      (pcb->local_ip).addr = ipaddr->addr;
    }
    pcb->local_port = port;
    ptVar1 = pcb;
    pcb->next = tcp_bound_pcbs;
    tcp_bound_pcbs = ptVar1;
    tcp_timer_needed();
    eVar2 = '\0';
  }
  return eVar2;
}



void tcp_bind_netif(tcp_pcb *pcb,netif *netif)

{
  u8_t uVar1;
  
  uVar1 = '\0';
  if (netif != (netif *)0x0) {
    uVar1 = netif->num + '\x01';
  }
  pcb->netif_idx = uVar1;
  return;
}



tcp_pcb * tcp_listen_with_backlog_and_err(tcp_pcb *pcb,u8_t backlog,err_t *err)

{
  u8_t uVar1;
  tcp_pcb *ptVar2;
  tcp_pcb *ptVar3;
  err_t eVar4;
  tcp_pcb *ptVar5;
  
  if (pcb == (tcp_pcb *)0x0) {
    ptVar3 = (tcp_pcb *)0x0;
    eVar4 = -0x10;
  }
  else {
    if (pcb->state == CLOSED) {
      ptVar3 = tcp_listen_pcbs;
      if ((pcb->so_options & 4) != 0) {
        while (ptVar3 != (tcp_pcb *)0x0) {
          if ((ptVar3->local_port == pcb->local_port) &&
             ((ptVar3->local_ip).addr == (pcb->local_ip).addr)) {
            eVar4 = -8;
            goto LAB_2304166a;
          }
          ptVar3 = ptVar3->next;
        }
      }
      ptVar3 = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB_LISTEN);
      eVar4 = -1;
      if (ptVar3 != (tcp_pcb *)0x0) {
        ptVar3->callback_arg = pcb->callback_arg;
        ptVar3->local_port = pcb->local_port;
        ptVar3->state = LISTEN;
        ptVar3->prio = pcb->prio;
        uVar1 = pcb->so_options;
        ptVar3->netif_idx = '\0';
        ptVar3->so_options = uVar1;
        ptVar3->ttl = pcb->ttl;
        ptVar3->tos = pcb->tos;
        (ptVar3->local_ip).addr = (pcb->local_ip).addr;
        if (pcb->local_port != 0) {
          ptVar2 = tcp_bound_pcbs;
          if (tcp_bound_pcbs == pcb) {
            tcp_bound_pcbs = pcb->next;
          }
          else {
            do {
              ptVar5 = ptVar2;
              if (ptVar5 == (tcp_pcb *)0x0) goto LAB_230415fc;
              ptVar2 = ptVar5->next;
            } while (ptVar5->next != pcb);
            ptVar5->next = pcb->next;
          }
LAB_230415fc:
          pcb->next = (tcp_pcb *)0x0;
        }
        tcp_free(pcb);
        *(undefined4 *)&ptVar3->remote_port = 0x23041bc6;
        ptVar2 = ptVar3;
        ptVar3->next = tcp_listen_pcbs;
        tcp_listen_pcbs = ptVar2;
        tcp_timer_needed();
        eVar4 = '\0';
      }
    }
    else {
      eVar4 = -0xf;
LAB_2304166a:
      ptVar3 = (tcp_pcb *)0x0;
    }
  }
  if (err != (err_t *)0x0) {
    *err = eVar4;
  }
  return ptVar3;
}



u32_t tcp_update_rcv_ann_wnd(tcp_pcb *pcb)

{
  u32_t uVar1;
  u32_t uVar2;
  u32_t uVar3;
  uint uVar4;
  
  uVar3 = pcb->rcv_ann_right_edge;
  uVar2 = pcb->rcv_nxt;
  uVar4 = (uint)pcb->mss;
  uVar1 = (pcb->rcv_wnd - uVar3) + uVar2;
  if (0x408 < pcb->mss) {
    uVar4 = 0x408;
  }
  if (-1 < (int)(uVar1 - uVar4)) {
    pcb->rcv_ann_wnd = pcb->rcv_wnd;
    return uVar1;
  }
  if ((int)(uVar2 - uVar3) < 1) {
    pcb->rcv_ann_wnd = (short)uVar3 - (short)uVar2;
  }
  else {
    pcb->rcv_ann_wnd = 0;
  }
  return 0;
}



void tcp_recved(tcp_pcb *pcb,u16_t len)

{
  u32_t uVar1;
  tcpwnd_size_t tVar2;
  
  if (pcb == (tcp_pcb *)0x0) {
    return;
  }
  tVar2 = len + pcb->rcv_wnd;
  if ((0x810 < tVar2) || (tVar2 < pcb->rcv_wnd)) {
    tVar2 = 0x810;
  }
  pcb->rcv_wnd = tVar2;
  uVar1 = tcp_update_rcv_ann_wnd(pcb);
  if (0x407 < uVar1) {
    pcb->flags = pcb->flags | 2;
    tcp_output(pcb);
    return;
  }
  return;
}



void tcp_seg_free(tcp_seg *seg)

{
  if (seg == (tcp_seg *)0x0) {
    return;
  }
  if (seg->p != (pbuf *)0x0) {
    pbuf_free(seg->p);
  }
  memp_free(MEMP_TCP_SEG,seg);
  return;
}



void tcp_segs_free(tcp_seg *seg)

{
  tcp_seg *ptVar1;
  
