pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (seg != (tcp_seg *)0x0) {
    do {
      ptVar1 = seg->next;
      tcp_seg_free(seg);
      seg = ptVar1;
    } while (ptVar1 != (tcp_seg *)0x0);
    return;
  }
  return;
}



void tcp_setprio(tcp_pcb *pcb,u8_t prio)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->prio = prio;
  }
  return;
}



tcp_seg * tcp_seg_copy(tcp_seg *seg)

{
  tcp_seg *__dest;
  
  __dest = (tcp_seg *)memp_malloc(MEMP_TCP_SEG);
  if (__dest != (tcp_seg *)0x0) {
    memcpy(__dest,seg,0x14);
    pbuf_ref(__dest->p);
  }
  return __dest;
}



void tcp_arg(tcp_pcb *pcb,void *arg)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->callback_arg = arg;
  }
  return;
}



void tcp_recv(tcp_pcb *pcb,tcp_recv_fn *recv)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->recv = recv;
  }
  return;
}



void tcp_sent(tcp_pcb *pcb,tcp_sent_fn *sent)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->sent = sent;
  }
  return;
}



void tcp_err(tcp_pcb *pcb,tcp_err_fn *err)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->errf = err;
  }
  return;
}



void tcp_accept(tcp_pcb *pcb,tcp_accept_fn accept)

{
  if ((pcb != (tcp_pcb *)0x0) && (pcb->state == LISTEN)) {
    *(tcp_accept_fn *)&pcb->remote_port = accept;
  }
  return;
}



void tcp_poll(tcp_pcb *pcb,tcp_poll_fn *poll,u8_t interval)

{
  if (pcb != (tcp_pcb *)0x0) {
    pcb->poll = poll;
    pcb->pollinterval = interval;
  }
  return;
}



u32_t tcp_next_iss(tcp_pcb *pcb)

{
  u32_t iss;
  
  return iss + tcp_ticks;
}



u16_t tcp_eff_send_mss_netif(u16_t sendmss,netif *outif,ip_addr_t *dest)

{
  ushort uVar1;
  u16_t uVar2;
  undefined2 in_register_0000202a;
  uint uVar3;
  
  uVar2 = sendmss;
  if (outif != (netif *)0x0) {
    uVar1 = outif->mtu;
    if (((uVar1 != 0) && (uVar2 = 0, 0x28 < uVar1)) &&
       (uVar3 = (uint)uVar1 - 0x28 & 0xffff, uVar2 = (u16_t)uVar3,
       CONCAT22(in_register_0000202a,sendmss) < uVar3)) {
      uVar2 = sendmss;
    }
  }
  return uVar2;
}



err_t tcp_connect(tcp_pcb *pcb,ip_addr_t *ipaddr,u16_t port,tcp_connected_fn connected)

{
  u16_t uVar1;
  err_t eVar2;
  u16_t uVar3;
  netif *outif;
  undefined2 extraout_var_00;
  u32_t uVar4;
  undefined3 extraout_var;
  undefined2 in_register_00002032;
  tcp_pcb *ptVar5;
  tcp_pcb *ptVar6;
  
  eVar2 = -0x10;
  if (((pcb != (tcp_pcb *)0x0) && (ipaddr != (ip_addr_t *)0x0)) &&
     (eVar2 = -10, pcb->state == CLOSED)) {
    (pcb->remote_ip).addr = ipaddr->addr;
    pcb->remote_port = port;
    if (pcb->netif_idx == '\0') {
      outif = ip4_route((ip4_addr_t *)&pcb->remote_ip);
    }
    else {
      outif = netif_get_by_index(pcb->netif_idx);
    }
    eVar2 = -4;
    if (outif != (netif *)0x0) {
      if ((pcb->local_ip).addr == 0) {
        (pcb->local_ip).addr = (outif->ip_addr).addr;
      }
      uVar1 = pcb->local_port;
      if (uVar1 == 0) {
        uVar3 = tcp_new_port();
        pcb->local_port = uVar3;
        if (CONCAT22(extraout_var_00,uVar3) == 0) {
          return -2;
        }
      }
      else {
        ptVar5 = tcp_active_pcbs;
        if ((pcb->so_options & 4) != 0) {
          while (ptVar6 = tcp_tw_pcbs, ptVar5 != (tcp_pcb *)0x0) {
            if (((ptVar5->local_port == uVar1) &&
                ((uint)ptVar5->remote_port == CONCAT22(in_register_00002032,port))) &&
               (((ptVar5->local_ip).addr == (pcb->local_ip).addr &&
                ((ptVar5->remote_ip).addr == ipaddr->addr)))) {
              return -8;
            }
            ptVar5 = ptVar5->next;
          }
          while (ptVar6 != (tcp_pcb *)0x0) {
            if (((ptVar6->local_port == uVar1) &&
                ((uint)ptVar6->remote_port == CONCAT22(in_register_00002032,port))) &&
               (((ptVar6->local_ip).addr == (pcb->local_ip).addr &&
                ((ptVar6->remote_ip).addr == ipaddr->addr)))) {
              return -8;
            }
            ptVar6 = ptVar6->next;
          }
        }
      }
      uVar4 = tcp_next_iss(pcb);
      *(undefined4 *)&pcb->rcv_wnd = 0x8100810;
      pcb->snd_nxt = uVar4;
      pcb->snd_wnd = 0x810;
      uVar4 = uVar4 - 1;
      pcb->lastack = uVar4;
      pcb->snd_wl2 = uVar4;
      pcb->snd_lbb = uVar4;
      pcb->mss = 0x218;
      pcb->rcv_nxt = 0;
      pcb->rcv_ann_right_edge = 0;
      uVar3 = tcp_eff_send_mss_netif(0x218,outif,&pcb->remote_ip);
      pcb->mss = uVar3;
      pcb->cwnd = 1;
      pcb->connected = connected;
      eVar2 = tcp_enqueue_flags(pcb,'\x02');
      if (CONCAT31(extraout_var,eVar2) == 0) {
        pcb->state = SYN_SENT;
        if (uVar1 != 0) {
          ptVar5 = tcp_bound_pcbs;
          if (tcp_bound_pcbs == pcb) {
            tcp_bound_pcbs = pcb->next;
          }
          else {
            do {
              ptVar6 = ptVar5;
              if (ptVar6 == (tcp_pcb *)0x0) goto LAB_2304193a;
              ptVar5 = ptVar6->next;
            } while (ptVar6->next != pcb);
            ptVar6->next = pcb->next;
          }
        }
LAB_2304193a:
        ptVar5 = pcb;
        pcb->next = tcp_active_pcbs;
        tcp_active_pcbs = ptVar5;
        tcp_timer_needed();
        tcp_active_pcbs_changed = '\x01';
        tcp_output(pcb);
      }
    }
  }
  return eVar2;
}



char * tcp_debug_state_str(tcp_state s)

{
  undefined3 in_register_00002029;
  
  return tcp_state_str[CONCAT31(in_register_00002029,s)];
}



err_t tcp_tcp_get_tcp_addrinfo(tcp_pcb *pcb,int local,ip_addr_t *addr,u16_t *port)

{
  u16_t uVar1;
  
  if (pcb == (tcp_pcb *)0x0) {
    return -6;
  }
  if (local == 0) {
    if (addr != (ip_addr_t *)0x0) {
      addr->addr = (pcb->remote_ip).addr;
    }
    if (port == (u16_t *)0x0) {
      return '\0';
    }
    uVar1 = pcb->remote_port;
  }
  else {
    if (addr != (ip_addr_t *)0x0) {
      addr->addr = (pcb->local_ip).addr;
    }
    if (port == (u16_t *)0x0) {
      return '\0';
    }
    uVar1 = pcb->local_port;
  }
  *port = uVar1;
  return '\0';
}



void tcp_free_ooseq(tcp_pcb *pcb)

{
  if (pcb->ooseq != (tcp_seg *)0x0) {
    tcp_segs_free(pcb->ooseq);
    pcb->ooseq = (tcp_seg *)0x0;
    return;
  }
  return;
}



void tcp_pcb_purge(tcp_pcb *pcb)

{
  if (((pcb != (tcp_pcb *)0x0) && (LISTEN < pcb->state)) && (pcb->state != TIME_WAIT)) {
    if (pcb->refused_data != (pbuf *)0x0) {
      pbuf_free(pcb->refused_data);
      pcb->refused_data = (pbuf *)0x0;
    }
    if (pcb->ooseq != (tcp_seg *)0x0) {
      tcp_free_ooseq(pcb);
    }
    pcb->rtime = -1;
    tcp_segs_free(pcb->unsent);
    tcp_segs_free(pcb->unacked);
    pcb->unsent = (tcp_seg *)0x0;
    pcb->unacked = (tcp_seg *)0x0;
    pcb->unsent_oversize = 0;
    return;
  }
  return;
}



