pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void tcp_pcb_remove(tcp_pcb **pcblist,tcp_pcb *pcb)

{
  tcp_pcb *ptVar1;
  tcp_pcb *ptVar2;
  
  ptVar1 = *pcblist;
  if (*pcblist == pcb) {
    *pcblist = pcb->next;
  }
  else {
    do {
      ptVar2 = ptVar1;
      if (ptVar2 == (tcp_pcb *)0x0) goto LAB_23041a5a;
      ptVar1 = ptVar2->next;
    } while (ptVar2->next != pcb);
    ptVar2->next = pcb->next;
  }
LAB_23041a5a:
  pcb->next = (tcp_pcb *)0x0;
  tcp_pcb_purge(pcb);
  if (((pcb->state != TIME_WAIT) && (pcb->state != LISTEN)) && ((pcb->flags & 1) != 0)) {
    pcb->flags = pcb->flags | 2;
    tcp_output(pcb);
  }
  pcb->state = CLOSED;
  pcb->local_port = 0;
  return;
}



void tcp_abandon(tcp_pcb *pcb,int reset)

{
  tcp_pcb *ptVar1;
  u16_t uVar2;
  tcp_pcb *ptVar3;
  tcp_err_fn *UNRECOVERED_JUMPTABLE;
  void *pvVar4;
  u32_t seqno;
  u32_t ackno;
  
  if (pcb == (tcp_pcb *)0x0) {
    return;
  }
  if (pcb->state == TIME_WAIT) {
    tcp_pcb_remove(&tcp_tw_pcbs,pcb);
    tcp_free(pcb);
    return;
  }
  seqno = pcb->snd_nxt;
  ackno = pcb->rcv_nxt;
  UNRECOVERED_JUMPTABLE = pcb->errf;
  pvVar4 = pcb->callback_arg;
  uVar2 = pcb->local_port;
  if (pcb->state == CLOSED) {
    reset = 0;
    if (uVar2 != 0) {
      ptVar1 = tcp_bound_pcbs;
      if (tcp_bound_pcbs == pcb) {
        tcp_bound_pcbs = pcb->next;
      }
      else {
        do {
          ptVar3 = ptVar1;
          if (ptVar3 == (tcp_pcb *)0x0) goto LAB_23041b20;
          ptVar1 = ptVar3->next;
        } while (ptVar3->next != pcb);
        ptVar3->next = pcb->next;
      }
LAB_23041b20:
      pcb->next = (tcp_pcb *)0x0;
      uVar2 = 0;
      reset = 0;
    }
  }
  else {
    tcp_pcb_remove(&tcp_active_pcbs,pcb);
    tcp_active_pcbs_changed = '\x01';
  }
  if (pcb->unacked != (tcp_seg *)0x0) {
    tcp_segs_free(pcb->unacked);
  }
  if (pcb->unsent != (tcp_seg *)0x0) {
    tcp_segs_free(pcb->unsent);
  }
  if (pcb->ooseq != (tcp_seg *)0x0) {
    tcp_segs_free(pcb->ooseq);
  }
  if (reset != 0) {
    tcp_rst(pcb,seqno,ackno,(ip_addr_t *)pcb,&pcb->remote_ip,uVar2,pcb->remote_port);
  }
  tcp_free(pcb);
  if (UNRECOVERED_JUMPTABLE == (tcp_err_fn *)0x0) {
    return;
  }
                    // WARNING: Could not recover jumptable at 0x23041b7c. Too many branches
                    // WARNING: Treating indirect jump as call
  (*UNRECOVERED_JUMPTABLE)(pvVar4,-0xd);
  return;
}



void tcp_abort(tcp_pcb *pcb)

{
  tcp_abandon(pcb,1);
  return;
}



err_t tcp_accept_null(void *arg,tcp_pcb *pcb,err_t err)

{
  tcp_abort(pcb);
  return -0xd;
}



void tcp_netif_ip_addr_changed_pcblist(tcp_pcb *pcb_list)

{
  tcp_pcb *in_a1;
  tcp_pcb *pcb;
  
  while (pcb = in_a1, pcb != (tcp_pcb *)0x0) {
    in_a1 = pcb->next;
    if ((pcb->local_ip).addr == (pcb_list->local_ip).addr) {
      tcp_abort(pcb);
    }
  }
  return;
}



void tcp_netif_ip_addr_changed(ip_addr_t *old_addr,ip_addr_t *new_addr)

{
  u32_t *puVar1;
  
  if (old_addr == (ip_addr_t *)0x0) {
    return;
  }
  if (old_addr->addr != 0) {
    tcp_netif_ip_addr_changed_pcblist((tcp_pcb *)old_addr);
    tcp_netif_ip_addr_changed_pcblist((tcp_pcb *)old_addr);
    if ((new_addr != (ip_addr_t *)0x0) && (puVar1 = tcp_listen_pcbs, new_addr->addr != 0)) {
      while (puVar1 != (u32_t *)0x0) {
        if (*puVar1 == old_addr->addr) {
          *puVar1 = new_addr->addr;
        }
        puVar1 = (u32_t *)puVar1[3];
      }
    }
  }
  return;
}



void tcp_kill_state(tcp_state state)

{
  undefined3 in_register_00002029;
  uint uVar1;
  tcp_pcb *pcb;
  uint uVar2;
  tcp_pcb *ptVar3;
  
  uVar1 = 0;
  pcb = (tcp_pcb *)0x0;
  ptVar3 = tcp_active_pcbs;
  while (ptVar3 != (tcp_pcb *)0x0) {
    if (((uint)ptVar3->state == CONCAT31(in_register_00002029,state)) &&
       (uVar2 = tcp_ticks - ptVar3->tmr, uVar1 <= uVar2)) {
      uVar1 = uVar2;
      pcb = ptVar3;
    }
    ptVar3 = ptVar3->next;
  }
  if (pcb != (tcp_pcb *)0x0) {
    tcp_abandon(pcb,0);
    return;
  }
  return;
}



tcp_pcb * tcp_alloc(u8_t prio)

{
  u32_t uVar1;
  tcp_pcb *pcb;
  undefined3 in_register_00002029;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  tcp_pcb *ptVar5;
  int iVar6;
  
  iVar6 = CONCAT31(in_register_00002029,prio);
  pcb = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB);
  ptVar5 = tcp_active_pcbs;
  if (pcb != (tcp_pcb *)0x0) goto LAB_23041d62;
  while (pcb = ptVar5, pcb != (tcp_pcb *)0x0) {
    ptVar5 = pcb->next;
    if ((pcb->flags & 8) != 0) {
      pcb->flags = pcb->flags & 0xfff7;
      tcp_close_shutdown_fin(pcb);
    }
  }
  uVar3 = 0;
  ptVar5 = tcp_tw_pcbs;
  while (ptVar5 != (tcp_pcb *)0x0) {
    uVar4 = tcp_ticks - ptVar5->tmr;
    if (uVar3 <= uVar4) {
      pcb = ptVar5;
      uVar3 = uVar4;
    }
    ptVar5 = ptVar5->next;
  }
  if (pcb != (tcp_pcb *)0x0) {
    tcp_abort(pcb);
  }
  pcb = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB);
  if (pcb == (tcp_pcb *)0x0) {
    tcp_kill_state(LAST_ACK);
    pcb = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB);
    if (pcb == (tcp_pcb *)0x0) {
      tcp_kill_state(CLOSING);
      pcb = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB);
      if (pcb == (tcp_pcb *)0x0) {
        if ((char)prio < '\0') {
          iVar6 = 0x7f;
LAB_23041e24:
          uVar3 = iVar6 - 1U & 0xff;
          uVar4 = 0;
          ptVar5 = tcp_active_pcbs;
          while (ptVar5 != (tcp_pcb *)0x0) {
            uVar2 = (uint)ptVar5->prio;
            if ((uVar2 < uVar3) || ((uVar2 == uVar3 && (uVar4 <= tcp_ticks - ptVar5->tmr)))) {
              uVar4 = tcp_ticks - ptVar5->tmr;
              pcb = ptVar5;
              uVar3 = uVar2;
            }
            ptVar5 = ptVar5->next;
          }
          if (pcb != (tcp_pcb *)0x0) {
            tcp_abort(pcb);
          }
        }
        else {
          if (iVar6 != 0) goto LAB_23041e24;
        }
        pcb = (tcp_pcb *)memp_malloc(MEMP_TCP_PCB);
        if (pcb == (tcp_pcb *)0x0) {
          return (tcp_pcb *)0x0;
        }
        lwip_stats.memp[2]->err = lwip_stats.memp[2]->err - 1;
      }
      lwip_stats.memp[2]->err = lwip_stats.memp[2]->err - 1;
    }
    lwip_stats.memp[2]->err = lwip_stats.memp[2]->err - 1;
  }
  lwip_stats.memp[2]->err = lwip_stats.memp[2]->err - 1;
LAB_23041d62:
  memset(pcb,0,0xa4);
  pcb->snd_buf = 0x1580;
  *(undefined4 *)&pcb->rcv_wnd = 0x8100810;
  pcb->ttl = -1;
  pcb->rto = 6;
  pcb->sv = 6;
  *(undefined4 *)&pcb->rtime = 0x218ffff;
  uVar1 = tcp_ticks;
  pcb->prio = prio;
  pcb->tmr = uVar1;
  pcb->last_timer = tcp_timer_ctr;
  *(undefined4 *)&pcb->cwnd = 0x15800001;
  pcb->recv = tcp_recv_null;
  pcb->keep_idle = 7200000;
  pcb->keep_intvl = 75000;
  pcb->keep_cnt = 9;
  return pcb;
}



tcp_pcb * tcp_new_ip_type(u8_t type)

{
  tcp_pcb *ptVar1;
  
  ptVar1 = tcp_alloc('@');
  return ptVar1;
}



err_t tcp_close_shutdown(tcp_pcb *pcb,u8_t rst_on_unacked_data)

{
  tcp_state tVar1;
  err_t eVar2;
  undefined3 in_register_0000202d;
  tcp_pcb *ptVar3;
  tcp_pcb *ptVar4;
  tcp_pcb ***ppptVar5;
  
  tVar1 = pcb->state;
  if (((CONCAT31(in_register_0000202d,rst_on_unacked_data) == 0) ||
      ((tVar1 != ESTABLISHED && (tVar1 != CLOSE_WAIT)))) ||
     ((pcb->refused_data == (pbuf *)0x0 && (pcb->rcv_wnd == 0x810)))) {
    if (tVar1 == LISTEN) {
      ppptVar5 = tcp_pcb_lists;
      do {
        ptVar3 = *ppptVar5[1];
        while (ptVar3 != (tcp_pcb *)0x0) {
          if (pcb == (tcp_pcb *)ptVar3->listener) {
            ptVar3->listener = (tcp_pcb_listen *)0x0;
          }
          ptVar3 = ptVar3->next;
        }
        ppptVar5 = ppptVar5 + 1;
      } while (ppptVar5 != (tcp_pcb ***)0x2308643c);
      tcp_pcb_remove((tcp_pcb **)&tcp_listen_pcbs,pcb);
      memp_free(MEMP_TCP_PCB_LISTEN,pcb);
      return '\0';
    }
    if (tVar1 == CLOSED) {
      if (pcb->local_port != 0) {
        ptVar3 = tcp_bound_pcbs;
        if (tcp_bound_pcbs == pcb) {
          tcp_bound_pcbs = pcb->next;
        }
        else {
          do {
            ptVar4 = ptVar3;
            if (ptVar4 == (tcp_pcb *)0x0) goto LAB_23041f3a;
            ptVar3 = ptVar4->next;
          } while (ptVar4->next != pcb);
          ptVar4->next = pcb->next;
        }
LAB_23041f3a:
        pcb->next = (tcp_pcb *)0x0;
      }
    }
    else {
      if (tVar1 != SYN_SENT) {
        eVar2 = tcp_close_shutdown_fin(pcb);
        return eVar2;
      }
      tcp_pcb_remove(&tcp_active_pcbs,pcb);
      tcp_active_pcbs_changed = '\x01';
    }
  }
  else {
    tcp_rst(pcb,pcb->snd_nxt,pcb->rcv_nxt,(ip_addr_t *)pcb,&pcb->remote_ip,pcb->local_port,
            pcb->remote_port);
    tcp_pcb_purge(pcb);
    ptVar3 = tcp_active_pcbs;
    if (tcp_active_pcbs == pcb) {
      tcp_active_pcbs = pcb->next;
    }
    else {
      do {
        ptVar4 = ptVar3;
        if (ptVar4 == (tcp_pcb *)0x0) goto LAB_23041ecc;
        ptVar3 = ptVar4->next;
      } while (ptVar4->next != pcb);
      ptVar4->next = pcb->next;
    }
LAB_23041ecc:
    ptVar3 = tcp_input_pcb;
    tcp_active_pcbs_changed = '\x01';
    pcb->next = (tcp_pcb *)0x0;
    if (ptVar3 == pcb) {
      tcp_trigger_input_pcb_close();
      return '\0';
    }
  }
  tcp_free(pcb);
  return '\0';
}



err_t tcp_close(tcp_pcb *pcb)

{
  err_t eVar1;
  
  if (pcb != (tcp_pcb *)0x0) {
    if (pcb->state != LISTEN) {
      pcb->flags = pcb->flags | 0x10;
    }
    eVar1 = tcp_close_shutdown(pcb,'\x01');
    return eVar1;
  }
  return -0x10;
}



err_t tcp_recv_null(void *arg,tcp_pcb *pcb,pbuf *p,err_t err)

{
  err_t eVar1;
  undefined3 in_register_00002035;
  
  if (pcb == (tcp_pcb *)0x0) {
    return -0x10;
  }
  if (p != (pbuf *)0x0) {
    tcp_recved(pcb,p->tot_len);
    pbuf_free(p);
    return '\0';
  }
  if (CONCAT31(in_register_00002035,err) == 0) {
    eVar1 = tcp_close(pcb);
    return eVar1;
  }
  return '\0';
}



err_t tcp_process_refused_data(tcp_pcb *pcb)

{
  byte bVar1;
  err_t eVar2;
  err_t eVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  pbuf *p;
  
  if (pcb == (tcp_pcb *)0x0) {
    return -0x10;
  }
  p = pcb->refused_data;
  bVar1 = p->flags;
  pcb->refused_data = (pbuf *)0x0;
  if (pcb->recv == (tcp_recv_fn *)0x0) {
    eVar2 = tcp_recv_null((void *)0x0,pcb,p,'\0');
    _eVar2 = CONCAT31(extraout_var_01,eVar2);
  }
  else {
    eVar2 = (*pcb->recv)(pcb->callback_arg,pcb,p,'\0');
    _eVar2 = CONCAT31(extraout_var,eVar2);
  }
  eVar2 = (err_t)_eVar2;
  if (_eVar2 == 0) {
    if ((bVar1 & 0x20) == 0) {
      return eVar2;
    }
    if (pcb->rcv_wnd != 0x810) {
      pcb->rcv_wnd = pcb->rcv_wnd + 1;
    }
    if (pcb->recv == (tcp_recv_fn *)0x0) {
      return eVar2;
    }
    eVar3 = (*pcb->recv)(pcb->callback_arg,pcb,(pbuf *)0x0,'\0');
    if (CONCAT31(extraout_var_00,eVar3) != -0xd) {
      return eVar2;
    }
  }
  else {
    if (_eVar2 != -0xd) {
      pcb->refused_data = p;
      return -5;
    }
  }
  return -0xd;
}



void tcp_fasttmr(void)

{
  tcp_pcb *pcb;
  tcp_pcb *ptVar1;
  
  tcp_timer_ctr = tcp_timer_ctr + '\x01';
  pcb = tcp_active_pcbs;
  while( true ) {
    if (pcb == (tcp_pcb *)0x0) {
      return;
    }
    if (pcb->last_timer == tcp_timer_ctr) break;
    pcb->last_timer = tcp_timer_ctr;
    if ((pcb->flags & 1) != 0) {
      pcb->flags = pcb->flags | 2;
      tcp_output(pcb);
      pcb->flags = pcb->flags & 0xfffc;
    }
    if ((pcb->flags & 8) != 0) {
      pcb->flags = pcb->flags & 0xfff7;
      tcp_close_shutdown_fin(pcb);
    }
    ptVar1 = pcb->next;
    if (pcb->refused_data == (pbuf *)0x0) goto LAB_23042130;
    tcp_active_pcbs_changed = '\0';
    tcp_process_refused_data(pcb);
    pcb = tcp_active_pcbs;
    if (tcp_active_pcbs_changed == '\0') {
LAB_23042130:
      pcb = ptVar1;
    }
  }
  ptVar1 = pcb->next;
  goto LAB_23042130;
}



err_t tcp_shutdown(tcp_pcb *pcb,int shut_rx,int shut_tx)

{
  tcp_state tVar1;
  err_t eVar2;
  u8_t rst_on_unacked_data;
  
  rst_on_unacked_data = (u8_t)shut_rx;
  if (pcb == (tcp_pcb *)0x0) {
    return -0x10;
  }
  tVar1 = pcb->state;
  if (tVar1 == LISTEN) {
LAB_23042196:
    eVar2 = -0xb;
  }
  else {
    if (shut_rx == 0) {
      if (shut_tx != 0) {
        if ((tVar1 < CLOSING) && ((1 << ((uint)tVar1 & 0x1f) & 0x98U) != 0)) goto LAB_23042188;
        goto LAB_23042196;
      }
    }
    else {
      rst_on_unacked_data = '\x01';
      pcb->flags = pcb->flags | 0x10;
      if (shut_tx != 0) {
LAB_23042188:
        eVar2 = tcp_close_shutdown(pcb,rst_on_unacked_data);
        return eVar2;
      }
      if (pcb->refused_data != (pbuf *)0x0) {
        pbuf_free(pcb->refused_data);
        pcb->refused_data = (pbuf *)0x0;
      }
    }
    eVar2 = '\0';
  }
  return eVar2;
}



void tcp_slowtmr(void)

{
  tcp_state tVar1;
  short sVar2;
  tcp_pcb *pcb;
  uint uVar3;
  tcp_err_fn *ptVar4;
  err_t eVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  uint uVar6;
  byte bVar7;
  uint uVar8;
  u32_t uVar9;
  byte bVar10;
  s16_t sVar11;
  void *pvVar12;
  tcp_pcb *ptVar13;
  tcp_pcb *pcb_00;
  
  tcp_ticks = tcp_ticks + 1;
  tcp_timer_ctr = tcp_timer_ctr + '\x01';
  do {
    pcb_00 = tcp_active_pcbs;
    ptVar13 = (tcp_pcb *)0x0;
LAB_23042200:
    do {
      while( true ) {
        pcb = pcb_00;
        pcb_00 = tcp_tw_pcbs;
        if (pcb == (tcp_pcb *)0x0) {
          while (pcb_00 != (tcp_pcb *)0x0) {
            if (tcp_ticks - pcb_00->tmr < 0xf1) {
              pcb = pcb_00;
              pcb_00 = pcb_00->next;
            }
            else {
              tcp_pcb_purge(pcb_00);
              ptVar13 = pcb_00->next;
              if (pcb != (tcp_pcb *)0x0) {
                pcb->next = pcb_00->next;
                ptVar13 = tcp_tw_pcbs;
              }
              tcp_tw_pcbs = ptVar13;
              ptVar13 = pcb_00->next;
              tcp_free(pcb_00);
              pcb_00 = ptVar13;
            }
          }
          return;
        }
        if (pcb->last_timer != tcp_timer_ctr) break;
        pcb_00 = pcb->next;
        ptVar13 = pcb;
      }
      pcb->last_timer = tcp_timer_ctr;
      if (pcb->state == SYN_SENT) {
        bVar7 = 5;
      }
      else {
        bVar7 = 0xb;
      }
      uVar3 = 1;
      if (pcb->nrtx <= bVar7) {
        uVar3 = (uint)pcb->persist_backoff;
        if (pcb->persist_backoff == 0) {
          sVar2 = pcb->rtime;
          if (sVar2 < 0) {
LAB_23042456:
            if (pcb->rtime < pcb->rto) goto LAB_230422b0;
          }
          else {
            if (sVar2 != 0x7fff) {
              pcb->rtime = sVar2 + 1;
              goto LAB_23042456;
            }
          }
          eVar5 = tcp_rexmit_rto_prepare(pcb);
          if ((CONCAT31(extraout_var_02,eVar5) == 0) ||
             ((pcb->unacked == (tcp_seg *)0x0 && (pcb->unsent != (tcp_seg *)0x0)))) {
            if (pcb->state != SYN_SENT) {
              uVar6 = (uint)pcb->nrtx;
              if (0xc < pcb->nrtx) {
                uVar6 = 0xc;
              }
              _sVar11 = ((int)pcb->sa >> 3) + (int)pcb->sv <<
                        ((uint)"\x01\x02\x03\x04\x05\x06\a\a\a\a\a\a\a"[uVar6] & 0x1f);
              sVar11 = (s16_t)_sVar11;
              if (0x7ffe < _sVar11) {
                sVar11 = 0x7fff;
              }
              pcb->rto = sVar11;
            }
            pcb->rtime = 0;
            uVar6 = (uint)pcb->snd_wnd;
            if ((uint)pcb->cwnd < (uint)pcb->snd_wnd) {
              uVar6 = (uint)pcb->cwnd;
            }
            uVar8 = (uint)pcb->mss << 0x11;
            pcb->ssthresh = (tcpwnd_size_t)(uVar6 >> 1);
            if (uVar6 >> 1 < uVar8 >> 0x10) {
              pcb->ssthresh = (tcpwnd_size_t)(uVar8 >> 0x10);
            }
            pcb->cwnd = pcb->mss;
            pcb->bytes_acked = 0;
            tcp_rexmit_rto_commit(pcb);
            goto LAB_230422b2;
          }
        }
        else {
          if (0xb < pcb->persist_probe) {
            uVar3 = 1;
            goto LAB_230422b2;
          }
          bVar7 = *(byte *)((int)&ip_addr_broadcast.addr + uVar3 + 3);
          if ((bVar7 <= pcb->persist_cnt) ||
             (bVar10 = pcb->persist_cnt + 1, pcb->persist_cnt = bVar10, bVar7 <= bVar10)) {
            if (pcb->snd_wnd == 0) {
              eVar5 = tcp_zero_window_probe(pcb);
              if (CONCAT31(extraout_var_01,eVar5) == 0) goto LAB_230423a0;
            }
            else {
              eVar5 = tcp_split_unsent_seg(pcb,pcb->snd_wnd);
              if ((CONCAT31(extraout_var,eVar5) != 0) ||
                 (eVar5 = tcp_output(pcb), CONCAT31(extraout_var_00,eVar5) != 0)) {
LAB_230423a0:
                pcb->persist_cnt = '\0';
                if (pcb->persist_backoff < 7) {
                  pcb->persist_backoff = pcb->persist_backoff + 1;
                }
              }
            }
          }
        }
LAB_230422b0:
        uVar3 = 0;
      }
LAB_230422b2:
      tVar1 = pcb->state;
      if (((tVar1 == FIN_WAIT_2) && ((pcb->flags & 0x10) != 0)) && (0x28 < tcp_ticks - pcb->tmr)) {
        uVar3 = uVar3 + 1 & 0xff;
      }
      bVar7 = pcb->so_options & 8;
      if (((pcb->so_options & 8) != 0) &&
         ((tVar1 == ESTABLISHED || (bVar7 = 0, tVar1 == CLOSE_WAIT)))) {
        uVar6 = tcp_ticks - pcb->tmr;
        if ((pcb->keep_intvl * pcb->keep_cnt + pcb->keep_idle) / 500 < uVar6) {
          uVar3 = uVar3 + 1 & 0xff;
          bVar7 = 1;
        }
        else {
          bVar7 = 0;
          if ((((uint)pcb->keep_cnt_sent * pcb->keep_intvl + pcb->keep_idle) / 500 < uVar6) &&
             (eVar5 = tcp_keepalive(pcb), bVar7 = 0, CONCAT31(extraout_var_03,eVar5) == 0)) {
            pcb->keep_cnt_sent = pcb->keep_cnt_sent + '\x01';
          }
        }
      }
      if ((pcb->ooseq != (tcp_seg *)0x0) && ((uint)((int)pcb->rto * 6) <= tcp_ticks - pcb->tmr)) {
        tcp_free_ooseq(pcb);
      }
      tVar1 = pcb->state;
      if (tVar1 == SYN_RCVD) {
        if (0x28 < tcp_ticks - pcb->tmr) {
          uVar3 = uVar3 + 1 & 0xff;
        }
LAB_23042362:
        if (uVar3 == 0) {
          pcb_00 = pcb->next;
          bVar7 = pcb->polltmr + 1;
          pcb->polltmr = bVar7;
          ptVar13 = pcb;
          if (pcb->pollinterval <= bVar7) {
            pcb->polltmr = '\0';
            tcp_active_pcbs_changed = '\0';
            if (pcb->poll != (tcp_poll_fn *)0x0) {
              eVar5 = (*pcb->poll)(pcb->callback_arg,pcb);
              if (tcp_active_pcbs_changed != '\0') break;
              if (CONCAT31(extraout_var_04,eVar5) != 0) goto LAB_23042200;
            }
            tcp_output(pcb);
          }
          goto LAB_23042200;
        }
      }
      else {
        if (tVar1 == LAST_ACK) {
          uVar9 = pcb->tmr;
          uVar6 = 0xf0;
        }
        else {
          if ((tVar1 != FIN_WAIT_1) && (tVar1 != CLOSING)) goto LAB_23042362;
          uVar9 = pcb->tmr;
          uVar6 = 10;
        }
        if (tcp_ticks - uVar9 <= uVar6) goto LAB_23042362;
      }
      ptVar4 = pcb->errf;
      tcp_pcb_purge(pcb);
      pcb_00 = pcb->next;
      if (ptVar13 != (tcp_pcb *)0x0) {
        ptVar13->next = pcb->next;
        pcb_00 = tcp_active_pcbs;
      }
      tcp_active_pcbs = pcb_00;
      if (bVar7 != 0) {
        tcp_rst(pcb,pcb->snd_nxt,pcb->rcv_nxt,(ip_addr_t *)pcb,&pcb->remote_ip,pcb->local_port,
                pcb->remote_port);
      }
      pvVar12 = pcb->callback_arg;
      pcb_00 = pcb->next;
      tcp_free(pcb);
      tcp_active_pcbs_changed = '\0';
    } while ((ptVar4 == (tcp_err_fn *)0x0) ||
            ((*ptVar4)(pvVar12,-0xd), tcp_active_pcbs_changed == '\0'));
  } while( true );
}



void tcp_tmr(void)

{
  tcp_fasttmr();
  tcp_timer = tcp_timer + 1;
  if ((tcp_timer & 1) != 0) {
    tcp_slowtmr();
    return;
  }
  return;
}



