pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int tcp_get_pcbs(tcp_pcb ****list)

{
  *list = tcp_pcb_lists;
  return 4;
}



u8_t tcp_get_next_optbyte(void)

{
  uint uVar1;
  
  uVar1 = (uint)tcp_optidx;
  if ((tcphdr_opt2 != (u8_t *)0x0) && (tcphdr_opt1len <= uVar1)) {
    tcp_optidx = tcp_optidx + 1;
    return tcphdr_opt2[uVar1 - tcphdr_opt1len & 0xff];
  }
  tcp_optidx = tcp_optidx + 1;
  return *(u8_t *)((int)&tcphdr[1].src + uVar1);
}



void tcp_oos_insert_segment(tcp_seg *cseg,tcp_seg *next)

{
  u32_t uVar1;
  ushort uVar2;
  tcp_seg *ptVar3;
  u16_t new_len;
  int iVar4;
  tcp_hdr *ptVar5;
  
  new_len = lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
  if ((new_len & 1) == 0) {
    do {
      iVar4 = cseg->len + seqno;
      uVar1 = next->tcphdr->seqno;
      if ((int)(iVar4 - (next->len + uVar1)) < 0) {
        if (0 < (int)(iVar4 - uVar1)) {
          new_len = (u16_t)((uVar1 - seqno) * 0x10000 >> 0x10);
          cseg->len = new_len;
          pbuf_realloc(cseg->p,new_len);
        }
        goto LAB_23042662;
      }
      new_len = lwip_htons(next->tcphdr->_hdrlen_rsvd_flags);
      if ((new_len & 1) != 0) {
        uVar2 = cseg->tcphdr->_hdrlen_rsvd_flags;
        new_len = lwip_htons(1);
        ptVar5 = cseg->tcphdr;
        uVar2 = new_len | uVar2;
        *(char *)&ptVar5->_hdrlen_rsvd_flags = (char)uVar2;
        *(undefined *)((int)&ptVar5->_hdrlen_rsvd_flags + 1) = (char)((uint)uVar2 >> 8);
      }
      ptVar3 = next->next;
      tcp_seg_free(next);
      next = ptVar3;
    } while (ptVar3 != (tcp_seg *)0x0);
  }
  else {
    tcp_segs_free(next);
  }
  next = (tcp_seg *)0x0;
LAB_23042662:
  cseg->next = next;
  return;
}



void tcp_parseopt(undefined2 *param_1)

{
  uint uVar1;
  u8_t uVar2;
  byte bVar3;
  undefined2 uVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  
  tcp_optidx = 0;
  while( true ) {
    while( true ) {
      do {
        uVar1 = (uint)tcphdr_optlen;
        if (uVar1 <= tcp_optidx) {
          return;
        }
        uVar2 = tcp_get_next_optbyte();
      } while (CONCAT31(extraout_var,uVar2) == 1);
      if (uVar2 == '\0') {
        return;
      }
      if (CONCAT31(extraout_var,uVar2) == 2) break;
      uVar2 = tcp_get_next_optbyte();
      if (CONCAT31(extraout_var_02,uVar2) < 2) {
        return;
      }
      tcp_optidx = (tcp_optidx - 2) + (short)CONCAT31(extraout_var_02,uVar2);
    }
    uVar2 = tcp_get_next_optbyte();
    if (CONCAT31(extraout_var_00,uVar2) != 4) {
      return;
    }
    if (uVar1 <= (uint)tcp_optidx + 1) break;
    bVar3 = tcp_get_next_optbyte();
    uVar2 = tcp_get_next_optbyte();
    uVar1 = CONCAT31(extraout_var_01,uVar2) & 0xffff | ((uint)bVar3 << 0x18) >> 0x10;
    uVar4 = (undefined2)uVar1;
    if (0x2af < (uVar1 - 1 & 0xffff)) {
      uVar4 = 0x2b0;
    }
    *param_1 = uVar4;
  }
  return;
}



int tcp_input_delayed_close(tcp_pcb *pcb)

{
  if ((recv_flags & 0x10) != 0) {
    if (((pcb->flags & 0x10) == 0) && (pcb->errf != (tcp_err_fn *)0x0)) {
      (*pcb->errf)(pcb->callback_arg,-0xf);
    }
    tcp_pcb_remove(&tcp_active_pcbs,pcb);
    tcp_free(pcb);
    return 1;
  }
  return 0;
}



tcp_seg * tcp_free_acked_segments(tcp_seg *seg_list)

{
  ushort uVar1;
  tcp_seg *ptVar2;
  u16_t uVar3;
  u32_t uVar4;
  tcp_seg *in_a1;
  
  while( true ) {
    if (in_a1 == (tcp_seg *)0x0) {
      return (tcp_seg *)0x0;
    }
    uVar4 = lwip_htonl(in_a1->tcphdr->seqno);
    uVar1 = in_a1->len;
    uVar3 = lwip_htons(in_a1->tcphdr->_hdrlen_rsvd_flags);
    if (0 < (int)((uVar1 - ackno) + uVar4 + (uint)((uVar3 & 3) != 0))) break;
    ptVar2 = in_a1->next;
    uVar3 = pbuf_clen(in_a1->p);
    *(u16_t *)&seg_list->next = *(short *)&seg_list->next - uVar3;
    recv_acked = in_a1->len + recv_acked;
    tcp_seg_free(in_a1);
    in_a1 = ptVar2;
  }
  return in_a1;
}



void tcp_receive(tcp_pcb *pcb)

{
  ushort n;
  ushort uVar1;
  short sVar2;
  tcp_seg *cseg;
  tcp_seg *next;
  u16_t new_len;
  u16_t uVar3;
  int iVar4;
  u32_t uVar5;
  pbuf *p;
  u32_t uVar6;
  uint header_size_decrement;
  u32_t uVar7;
  uint uVar8;
  tcp_hdr *ptVar9;
  tcpwnd_size_t tVar10;
  short sVar11;
  tcpflags_t tVar12;
  uint uVar13;
  uint uVar14;
  tcp_seg *ptVar15;
  
  uVar5 = seqno;
  uVar7 = ackno;
  if ((flags & 0x10) != 0) {
    n = pcb->snd_wnd;
    uVar6 = pcb->snd_wl2;
    if ((((int)(pcb->snd_wl1 - seqno) < 0) ||
        ((pcb->snd_wl1 == seqno && ((int)(uVar6 - ackno) < 0)))) ||
       ((uVar6 == ackno && ((uint)n < (uint)tcphdr->wnd)))) {
      uVar1 = tcphdr->wnd;
      pcb->snd_wnd = uVar1;
      if (pcb->snd_wnd_max < uVar1) {
        pcb->snd_wnd_max = uVar1;
      }
      pcb->snd_wl1 = uVar5;
      pcb->snd_wl2 = uVar7;
    }
    uVar13 = uVar7 - pcb->lastack;
    if ((int)uVar13 < 1) {
      if ((((tcplen == 0) && ((uint)pcb->snd_wnd + pcb->snd_wl2 == (uint)n + uVar6)) &&
          (-1 < pcb->rtime)) && (pcb->lastack == uVar7)) {
        if (pcb->dupacks != -1) {
          pcb->dupacks = pcb->dupacks + '\x01';
        }
        if (pcb->dupacks < 4) {
          if (pcb->dupacks != 3) goto LAB_2304299c;
        }
        else {
          tVar10 = pcb->mss + pcb->cwnd;
          if (tVar10 < pcb->cwnd) {
            tVar10 = 0xffff;
          }
          pcb->cwnd = tVar10;
        }
        tcp_rexmit_fast(pcb);
      }
      else {
        pcb->dupacks = '\0';
      }
    }
    else {
      if ((int)(uVar7 - pcb->snd_nxt) < 1) {
        if ((pcb->flags & 4) != 0) {
          pcb->flags = pcb->flags & 0xfffb;
          pcb->bytes_acked = 0;
          pcb->cwnd = pcb->ssthresh;
        }
        pcb->lastack = uVar7;
        pcb->rto = (pcb->sa >> 3) + pcb->sv;
        *(undefined2 *)&pcb->nrtx = 0;
        if (SYN_RCVD < pcb->state) {
          header_size_decrement = (uint)pcb->cwnd;
          uVar13 = uVar13 & 0xffff;
          if (header_size_decrement < pcb->ssthresh) {
            uVar8 = ((uint)((pcb->flags & 0x800) == 0) + 1) * (uint)pcb->mss;
            if (uVar13 < (uVar8 & 0xffff)) {
              uVar8 = uVar13;
            }
          }
          else {
            uVar13 = uVar13 + pcb->bytes_acked;
            uVar8 = uVar13 & 0xffff;
            sVar11 = (short)uVar8;
            if (uVar8 < pcb->bytes_acked) {
              sVar11 = -1;
            }
            else {
              if (uVar8 < header_size_decrement) {
                pcb->bytes_acked = (tcpwnd_size_t)(uVar13 * 0x10000 >> 0x10);
                goto LAB_23042cf8;
              }
            }
            pcb->bytes_acked = sVar11 - pcb->cwnd;
            uVar8 = (uint)pcb->mss;
          }
          uVar13 = header_size_decrement + uVar8 & 0xffff;
          tVar10 = (tcpwnd_size_t)uVar13;
          if (uVar13 < header_size_decrement) {
            tVar10 = 0xffff;
          }
          pcb->cwnd = tVar10;
        }
LAB_23042cf8:
        cseg = tcp_free_acked_segments((tcp_seg *)&pcb->snd_queuelen);
        pcb->unacked = cseg;
        cseg = tcp_free_acked_segments((tcp_seg *)&pcb->snd_queuelen);
        ptVar15 = pcb->unacked;
        pcb->unsent = cseg;
        pcb->polltmr = '\0';
        pcb->rtime = -(ushort)(ptVar15 == (tcp_seg *)0x0);
        if (cseg == (tcp_seg *)0x0) {
          pcb->unsent_oversize = 0;
        }
        pcb->snd_buf = pcb->snd_buf + recv_acked;
        if ((int)((uint)pcb->flags << 0x14) < 0) {
          if (ptVar15 == (tcp_seg *)0x0) {
            if (cseg != (tcp_seg *)0x0) {
              uVar7 = pcb->rto_end;
              ptVar9 = cseg->tcphdr;
              goto LAB_23042d74;
            }
          }
          else {
            uVar7 = pcb->rto_end;
            ptVar9 = ptVar15->tcphdr;
LAB_23042d74:
            uVar5 = lwip_htonl(ptVar9->seqno);
            if (0 < (int)(uVar7 - uVar5)) goto LAB_2304299c;
          }
          pcb->flags = pcb->flags & 0xf7ff;
        }
      }
      else {
        tcp_send_empty_ack(pcb);
      }
    }
LAB_2304299c:
    if ((pcb->rttest != 0) && ((int)(pcb->rtseq - ackno) < 0)) {
      uVar8 = (uint)(ushort)tcp_ticks;
      header_size_decrement = pcb->rttest & 0xffff;
      uVar13 = (int)pcb->sa >> 3 & 0xffff;
      uVar14 = (uVar8 - header_size_decrement) - uVar13 & 0xffff;
      iVar4 = (int)(short)uVar14;
      sVar11 = (short)((uVar14 + (int)pcb->sa) * 0x10000 >> 0x10);
      pcb->sa = sVar11;
      if (iVar4 < 0) {
        iVar4 = (int)(((header_size_decrement - uVar8) + uVar13) * 0x10000) >> 0x10;
      }
      pcb->rttest = 0;
      sVar2 = (short)((uint)((((int)pcb->sv - ((int)pcb->sv >> 2)) + iVar4) * 0x10000) >> 0x10);
      pcb->sv = sVar2;
      pcb->rto = (sVar11 >> 3) + sVar2;
    }
  }
  uVar7 = pcb->rcv_nxt;
  if ((tcplen == 0) || (FIN_WAIT_2 < pcb->state)) {
    if ((-1 < (int)(seqno - uVar7)) && ((int)(((seqno + 1) - uVar7) - (uint)pcb->rcv_wnd) < 1)) {
      return;
    }
    tVar12 = pcb->flags;
  }
  else {
    uVar13 = uVar7 - seqno;
    if (((int)(uVar13 - 1) < 0) || (0 < (int)(((1 - seqno) - (uint)tcplen) + uVar7))) {
      if ((int)(seqno - uVar7) < 0) {
        pcb->flags = pcb->flags | 2;
      }
    }
    else {
      header_size_decrement = uVar13 & 0xffff;
      inseg.len = inseg.len - (short)(uVar13 * 0x10000 >> 0x10);
      iVar4 = (inseg.p)->tot_len - header_size_decrement;
      p = inseg.p;
      while (n = p->len, n < header_size_decrement) {
        p->tot_len = (u16_t)((uint)(iVar4 * 0x10000) >> 0x10);
        p->len = 0;
        header_size_decrement = header_size_decrement - n & 0xffff;
        p = p->next;
      }
      pbuf_remove_header(p,header_size_decrement);
      ptVar9 = inseg.tcphdr;
      uVar7 = pcb->rcv_nxt;
      seqno = uVar7;
      *(char *)&(inseg.tcphdr)->seqno = (char)uVar7;
      *(undefined *)((int)&ptVar9->seqno + 1) = (char)(uVar7 >> 8);
      *(undefined *)((int)&ptVar9->seqno + 2) = (char)(uVar7 >> 0x10);
      *(undefined *)((int)&ptVar9->seqno + 3) = (char)(uVar7 >> 0x18);
    }
    uVar7 = pcb->rcv_nxt;
    if (((int)(seqno - uVar7) < 0) || (0 < (int)(((seqno + 1) - uVar7) - (uint)pcb->rcv_wnd))) {
LAB_23042ffc:
      tcp_send_empty_ack(pcb);
      return;
    }
    if (seqno != uVar7) {
      cseg = pcb->ooseq;
      ptVar15 = (tcp_seg *)0x0;
      if (pcb->ooseq == (tcp_seg *)0x0) {
        cseg = tcp_seg_copy(&inseg);
        pcb->ooseq = cseg;
      }
      else {
        do {
          next = cseg;
          uVar7 = next->tcphdr->seqno;
          if (seqno == uVar7) {
            if ((next->len < inseg.len) && (cseg = tcp_seg_copy(&inseg), cseg != (tcp_seg *)0x0)) {
              if (ptVar15 == (tcp_seg *)0x0) {
                pcb->ooseq = cseg;
              }
              else {
                ptVar15->next = cseg;
              }
LAB_23043062:
              tcp_oos_insert_segment(cseg,next);
            }
            goto LAB_23042ffc;
          }
          if (ptVar15 == (tcp_seg *)0x0) {
            if ((int)(seqno - uVar7) < 0) {
              cseg = tcp_seg_copy(&inseg);
              if (cseg != (tcp_seg *)0x0) {
                pcb->ooseq = cseg;
                goto LAB_23043062;
              }
              goto LAB_23042ffc;
            }
          }
          else {
            if ((-1 < (int)((seqno - 1) - ptVar15->tcphdr->seqno)) &&
               ((int)((seqno + 1) - uVar7) < 1)) {
              cseg = tcp_seg_copy(&inseg);
              if (cseg != (tcp_seg *)0x0) {
                uVar7 = ptVar15->tcphdr->seqno;
                if (0 < (int)((ptVar15->len + uVar7) - seqno)) {
                  new_len = (u16_t)((seqno - uVar7) * 0x10000 >> 0x10);
                  ptVar15->len = new_len;
                  pbuf_realloc(ptVar15->p,new_len);
                }
                ptVar15->next = cseg;
                goto LAB_23043062;
              }
              goto LAB_23042ffc;
            }
          }
          cseg = next->next;
          ptVar15 = next;
        } while (next->next != (tcp_seg *)0x0);
        if ((0 < (int)(seqno - uVar7)) &&
           (new_len = lwip_htons(next->tcphdr->_hdrlen_rsvd_flags), (new_len & 1) == 0)) {
          cseg = tcp_seg_copy(&inseg);
          next->next = cseg;
          if (cseg != (tcp_seg *)0x0) {
            uVar7 = next->tcphdr->seqno;
            if (0 < (int)((next->len + uVar7) - seqno)) {
              new_len = (u16_t)((seqno - uVar7) * 0x10000 >> 0x10);
              next->len = new_len;
              pbuf_realloc(next->p,new_len);
            }
            if (0 < (int)(((tcplen + seqno) - pcb->rcv_nxt) - (uint)pcb->rcv_wnd)) {
              new_len = lwip_htons(next->next->tcphdr->_hdrlen_rsvd_flags);
              if ((new_len & 1) != 0) {
                n = next->next->tcphdr->_hdrlen_rsvd_flags;
                new_len = lwip_htons(n);
                new_len = lwip_htons(new_len & 0x3e);
                ptVar9 = next->next->tcphdr;
                uVar13 = (uint)n & 0xffffc0ff | (uint)new_len;
                *(char *)&ptVar9->_hdrlen_rsvd_flags = (char)uVar13;
                *(undefined *)((int)&ptVar9->_hdrlen_rsvd_flags + 1) = (char)(uVar13 >> 8);
              }
              next->next->len = (pcb->rcv_wnd - (short)seqno) + (short)pcb->rcv_nxt;
              pbuf_realloc(next->next->p,next->next->len);
              new_len = next->next->len;
              uVar3 = lwip_htons(next->next->tcphdr->_hdrlen_rsvd_flags);
              tcplen = new_len + ((uVar3 & 3) != 0);
            }
          }
        }
      }
      goto LAB_23042ffc;
    }
    uVar13 = (uint)inseg.len;
    new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
    uVar13 = ((new_len & 3) != 0) + uVar13;
    tcplen = (u16_t)(uVar13 * 0x10000 >> 0x10);
    if ((uint)pcb->rcv_wnd < (uVar13 & 0xffff)) {
      new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
      if ((new_len & 1) != 0) {
        n = (inseg.tcphdr)->_hdrlen_rsvd_flags;
        new_len = lwip_htons(n);
        new_len = lwip_htons(new_len & 0x3e);
        ptVar9 = inseg.tcphdr;
        uVar13 = (uint)n & 0xffffc0ff | (uint)new_len;
        *(char *)&(inseg.tcphdr)->_hdrlen_rsvd_flags = (char)uVar13;
        *(undefined *)((int)&ptVar9->_hdrlen_rsvd_flags + 1) = (char)(uVar13 >> 8);
      }
      inseg.len = pcb->rcv_wnd;
      new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
      if ((new_len & 2) != 0) {
        inseg.len = inseg.len - 1;
      }
      pbuf_realloc(inseg.p,inseg.len);
      new_len = inseg.len;
      uVar3 = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
      tcplen = new_len + ((uVar3 & 3) != 0);
    }
    if (pcb->ooseq != (tcp_seg *)0x0) {
      new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
      if ((new_len & 1) == 0) {
        cseg = pcb->ooseq;
        while (cseg != (tcp_seg *)0x0) {
          uVar7 = cseg->tcphdr->seqno;
          if ((int)((tcplen + seqno) - (cseg->len + uVar7)) < 0) {
            if (0 < (int)((tcplen + seqno) - uVar7)) {
              inseg.len = (short)uVar7 - (short)seqno;
              new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
              if ((new_len & 2) != 0) {
                inseg.len = inseg.len - 1;
              }
              pbuf_realloc(inseg.p,inseg.len);
              new_len = inseg.len;
              uVar3 = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
              tcplen = new_len + ((uVar3 & 3) != 0);
            }
            break;
          }
          new_len = lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
          if (((new_len & 1) != 0) &&
             (new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags), (new_len & 2) == 0)) {
            n = (inseg.tcphdr)->_hdrlen_rsvd_flags;
            new_len = lwip_htons(1);
            ptVar9 = inseg.tcphdr;
            n = n | new_len;
            *(char *)&(inseg.tcphdr)->_hdrlen_rsvd_flags = (char)n;
            *(undefined *)((int)&ptVar9->_hdrlen_rsvd_flags + 1) = (char)((uint)n >> 8);
            new_len = inseg.len;
            uVar3 = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
            tcplen = new_len + ((uVar3 & 3) != 0);
          }
          ptVar15 = cseg->next;
          tcp_seg_free(cseg);
          cseg = ptVar15;
        }
        pcb->ooseq = cseg;
      }
      else {
        while (cseg = pcb->ooseq, cseg != (tcp_seg *)0x0) {
          pcb->ooseq = cseg->next;
          tcp_seg_free(cseg);
        }
      }
    }
    tVar10 = pcb->rcv_wnd - tcplen;
    pcb->rcv_nxt = seqno + tcplen;
    pcb->rcv_wnd = tVar10;
    tcp_update_rcv_ann_wnd(pcb);
    if ((inseg.p)->tot_len != 0) {
      recv_data = inseg.p;
      inseg.p = (pbuf *)0x0;
    }
    new_len = lwip_htons((inseg.tcphdr)->_hdrlen_rsvd_flags);
    if ((new_len & 1) != 0) {
      recv_flags = recv_flags | 0x20;
    }
    while (cseg = pcb->ooseq, cseg != (tcp_seg *)0x0) {
      uVar7 = cseg->tcphdr->seqno;
      if (uVar7 != pcb->rcv_nxt) break;
      n = cseg->len;
      seqno = uVar7;
      new_len = lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
      pcb->rcv_nxt = (uint)((new_len & 3) != 0) + (uint)n + pcb->rcv_nxt;
      lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
      new_len = cseg->len;
      uVar3 = lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
      pcb->rcv_wnd = pcb->rcv_wnd - (((uVar3 & 3) != 0) + new_len);
      tcp_update_rcv_ann_wnd(pcb);
      p = cseg->p;
      if (p->tot_len != 0) {
        if (recv_data != (pbuf *)0x0) {
          pbuf_cat(recv_data,p);
          p = recv_data;
        }
        recv_data = p;
        cseg->p = (pbuf *)0x0;
      }
      new_len = lwip_htons(cseg->tcphdr->_hdrlen_rsvd_flags);
      if (((new_len & 1) != 0) && (recv_flags = recv_flags | 0x20, pcb->state == ESTABLISHED)) {
        pcb->state = CLOSE_WAIT;
      }
      pcb->ooseq = cseg->next;
      tcp_seg_free(cseg);
    }
    n = pcb->flags;
    if ((n & 1) == 0) {
      tVar12 = n | 1;
      goto LAB_23042fca;
    }
    tVar12 = n & 0xfffe;
  }
  tVar12 = tVar12 | 2;
LAB_23042fca:
  pcb->flags = tVar12;
  return;
}



