pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Restarted to delay deadcode elimination for space: ram

void tcp_input(pbuf *p,netif *inp)

{
  ushort uVar1;
  u16_t uVar2;
  byte bVar3;
  tcp_hdr *ptVar4;
  tcp_hdr *ptVar5;
  tcp_pcb *ptVar6;
  u8_t uVar7;
  err_t eVar8;
  u16_t sendmss;
  tcpwnd_size_t tVar9;
  undefined3 extraout_var;
  undefined2 extraout_var_08;
  undefined2 extraout_var_09;
  undefined3 extraout_var_00;
  tcp_pcb *pcb;
  u32_t uVar10;
  netif *outif;
  undefined3 extraout_var_01;
  undefined2 extraout_var_10;
  tcp_seg *seg;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined3 extraout_var_05;
  undefined3 extraout_var_06;
  undefined3 extraout_var_07;
  uint header_size_decrement;
  u32_t ackno;
  int iVar11;
  tcp_state tVar12;
  u16_t uVar13;
  tcpflags_t tVar14;
  uint uVar15;
  void *pvVar16;
  tcp_accept_fn paVar17;
  uint uVar18;
  tcp_pcb *ptVar19;
  pbuf *p_00;
  u16_t remote_port;
  tcp_pcb *ptVar20;
  tcp_pcb *pcb_00;
  
  lwip_stats.tcp.recv = lwip_stats.tcp.recv + 1;
  tcphdr = (tcp_hdr *)p->payload;
  if (p->len < 0x14) goto LAB_230432a4;
  uVar7 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,ip_data.current_netif);
  if ((CONCAT31(extraout_var,uVar7) == 0) && ((ip_data.current_iphdr_dest & 0xf0) != 0xe0)) {
    sendmss = ip_chksum_pseudo(p,'\x06',p->tot_len,(ip4_addr_t *)&ip_data.current_iphdr_src,
                               (ip4_addr_t *)&ip_data.current_iphdr_dest);
    if (CONCAT22(extraout_var_08,sendmss) == 0) {
      sendmss = lwip_htons(tcphdr->_hdrlen_rsvd_flags);
      header_size_decrement = CONCAT22(extraout_var_09,sendmss) >> 10 & 0xfc;
      if ((0x13 < header_size_decrement) && (header_size_decrement <= p->tot_len)) {
        tcphdr_optlen = (u16_t)((header_size_decrement - 0x14) * 0x10000 >> 0x10);
        tcphdr_opt2 = (u8_t *)0x0;
        if (p->len < header_size_decrement) {
          pbuf_remove_header(p,0x14);
          sendmss = tcphdr_optlen;
          uVar1 = p->len;
          header_size_decrement = (uint)tcphdr_optlen;
          tcphdr_opt1len = uVar1;
          pbuf_remove_header(p,(uint)uVar1);
          p_00 = p->next;
          header_size_decrement = header_size_decrement - (uint)uVar1 & 0xffff;
          if (p_00->len < header_size_decrement) goto LAB_230432a4;
          tcphdr_opt2 = (u8_t *)p_00->payload;
          pbuf_remove_header(p_00,header_size_decrement);
          p->tot_len = (uVar1 + p->tot_len) - sendmss;
        }
        else {
          tcphdr_opt1len = tcphdr_optlen;
          pbuf_remove_header(p,header_size_decrement);
        }
        ptVar4 = tcphdr;
        sendmss = lwip_htons(tcphdr->src);
        *(char *)&ptVar4->src = (char)sendmss;
        *(undefined *)((int)&ptVar4->src + 1) = (char)(sendmss >> 8);
        ptVar4 = tcphdr;
        sendmss = lwip_htons(tcphdr->dest);
        *(char *)&ptVar4->dest = (char)sendmss;
        *(undefined *)((int)&ptVar4->dest + 1) = (char)(sendmss >> 8);
        ptVar4 = tcphdr;
        seqno = lwip_htonl(tcphdr->seqno);
        *(undefined *)((int)&ptVar4->seqno + 1) = (char)(seqno >> 8);
        *(undefined *)((int)&ptVar4->seqno + 2) = (char)(seqno >> 0x10);
        *(char *)&ptVar4->seqno = (char)seqno;
        *(undefined *)((int)&ptVar4->seqno + 3) = (char)(seqno >> 0x18);
        ptVar4 = tcphdr;
        ackno = lwip_htonl(tcphdr->ackno);
        *(undefined *)((int)&ptVar4->ackno + 1) = (char)(ackno >> 8);
        *(undefined *)((int)&ptVar4->ackno + 2) = (char)(ackno >> 0x10);
        *(char *)&ptVar4->ackno = (char)ackno;
        *(undefined *)((int)&ptVar4->ackno + 3) = (char)(ackno >> 0x18);
        ptVar4 = tcphdr;
        sendmss = lwip_htons(tcphdr->wnd);
        ptVar5 = tcphdr;
        *(char *)&ptVar4->wnd = (char)sendmss;
        *(undefined *)((int)&ptVar4->wnd + 1) = (char)(sendmss >> 8);
        sendmss = lwip_htons(ptVar5->_hdrlen_rsvd_flags);
        ptVar19 = tcp_active_pcbs;
        ptVar6 = tcp_listen_pcbs;
        ptVar4 = tcphdr;
        flags = (byte)sendmss & 0x3f;
        tcplen = p->tot_len;
        header_size_decrement = (uint)tcplen;
        if (((sendmss & 3) == 0) ||
           (uVar15 = header_size_decrement + 1, tcplen = (u16_t)(uVar15 * 0x10000 >> 0x10),
           header_size_decrement <= (uVar15 & 0xffff))) {
          uVar2 = tcplen;
          pcb = tcp_active_pcbs;
          ptVar20 = (tcp_pcb *)0x0;
LAB_230434e6:
          pcb_00 = pcb;
          pcb = tcp_tw_pcbs;
          if (pcb_00 == (tcp_pcb *)0x0) goto LAB_2304374c;
          if (((((pcb_00->netif_idx != '\0') &&
                (pcb_00->netif_idx != (u8_t)((ip_data.current_input_netif)->num + '\x01'))) ||
               (pcb_00->remote_port != tcphdr->src)) ||
              ((pcb_00->local_port != tcphdr->dest ||
               ((pcb_00->remote_ip).addr != ip_data.current_iphdr_src)))) ||
             ((pcb_00->local_ip).addr != ip_data.current_iphdr_dest)) goto LAB_23043672;
          if (ptVar20 == (tcp_pcb *)0x0) {
            lwip_stats.tcp.cachehit = lwip_stats.tcp.cachehit + 1;
          }
          else {
            tcp_active_pcbs = pcb_00;
            ptVar20->next = pcb_00->next;
            pcb_00->next = ptVar19;
          }
          inseg.len = p->tot_len;
          recv_data = (pbuf *)0x0;
          recv_flags = '\0';
          recv_acked = 0;
          inseg.next = (tcp_seg *)0x0;
          inseg.tcphdr = ptVar4;
          inseg.p = p;
          if ((sendmss & 8) != 0) {
            p->flags = p->flags | 1;
          }
          if ((pcb_00->refused_data != (pbuf *)0x0) &&
             ((eVar8 = tcp_process_refused_data(pcb_00), CONCAT31(extraout_var_00,eVar8) == -0xd ||
              ((pcb_00->refused_data != (pbuf *)0x0 && (tcplen != 0)))))) {
            if (pcb_00->rcv_ann_wnd == 0) {
              tcp_send_empty_ack(pcb_00);
            }
            lwip_stats.tcp.drop = lwip_stats.tcp.drop + 1;
            goto aborted;
          }
          uVar7 = flags;
          tcp_input_pcb = pcb_00;
          if ((flags & 4) != 0) {
            if (pcb_00->state == SYN_SENT) {
              if (pcb_00->snd_nxt != ackno) goto switchD_23043a08_caseD_8;
            }
            else {
              if (pcb_00->rcv_nxt != seqno) {
                iVar11 = seqno - pcb_00->rcv_nxt;
                if ((-1 < iVar11) && ((int)(iVar11 - (uint)pcb_00->rcv_wnd) < 1)) goto LAB_23043994;
                goto switchD_23043a08_caseD_8;
              }
            }
            recv_flags = recv_flags | 8;
            tVar14 = pcb_00->flags & 0xfffe;
LAB_2304394e:
            pcb_00->flags = tVar14;
            goto switchD_23043a08_caseD_8;
          }
          bVar3 = flags & 2;
          tVar14 = pcb_00->flags;
          if (((flags & 2) != 0) && (1 < (byte)(pcb_00->state + ~LISTEN))) {
LAB_230439b6:
            tVar14 = tVar14 | 2;
            goto LAB_2304394e;
          }
          if ((tVar14 & 0x10) == 0) {
            pcb_00->tmr = tcp_ticks;
          }
          *(undefined2 *)&pcb_00->persist_probe = 0;
          if (tcphdr_optlen != 0) {
            tcp_parseopt(&pcb_00->mss);
          }
          ackno = seqno;
          switch((uint)pcb_00->state - 2 & 0xff) {
          case 0:
            if (((uVar7 & 0x12) != 0x12) || (uVar10 = pcb_00->lastack + 1, uVar10 != ackno)) {
              if (((uVar7 & 0x10) != 0) &&
                 (tcp_rst(pcb_00,ackno,seqno + tcplen,&ip_data.current_iphdr_dest,
                          &ip_data.current_iphdr_src,tcphdr->dest,tcphdr->src), pcb_00->nrtx < 6)) {
                pcb_00->rtime = 0;
                tcp_rexmit_rto(pcb_00);
              }
              goto switchD_23043a08_caseD_8;
            }
            pcb_00->lastack = uVar10;
            uVar10 = ackno + 1;
            pcb_00->rcv_nxt = uVar10;
            pcb_00->rcv_ann_right_edge = uVar10;
            sendmss = pcb_00->mss;
            uVar2 = tcphdr->wnd;
            pcb_00->snd_wl1 = ackno - 1;
            pcb_00->snd_wnd = uVar2;
            pcb_00->snd_wnd_max = uVar2;
            pcb_00->state = ESTABLISHED;
            outif = ip4_route((ip4_addr_t *)&pcb_00->remote_ip);
            sendmss = tcp_eff_send_mss_netif
                                (sendmss,outif,(ip_addr_t *)(ip4_addr_t *)&pcb_00->remote_ip);
            iVar11 = CONCAT22(extraout_var_10,sendmss);
            uVar15 = iVar11 << 1;
            pcb_00->mss = sendmss;
            tVar9 = 0x111c;
            header_size_decrement = uVar15;
            if (uVar15 < 0x111c) {
              header_size_decrement = 0x111c;
            }
            if ((uint)(iVar11 << 2) < header_size_decrement) {
              tVar9 = (tcpwnd_size_t)((uint)(iVar11 << 0x12) >> 0x10);
            }
            else {
              if (0x111c < uVar15) {
                tVar9 = (tcpwnd_size_t)((uint)(iVar11 << 0x11) >> 0x10);
              }
            }
            pcb_00->cwnd = tVar9;
            seg = pcb_00->unacked;
            pcb_00->snd_queuelen = pcb_00->snd_queuelen - 1;
            if (seg == (tcp_seg *)0x0) {
              seg = pcb_00->unsent;
              pcb_00->unsent = seg->next;
            }
            else {
              pcb_00->unacked = seg->next;
            }
            tcp_seg_free(seg);
            if (pcb_00->unacked == (tcp_seg *)0x0) {
              pcb_00->rtime = -1;
            }
            else {
              pcb_00->rtime = 0;
              pcb_00->nrtx = '\0';
            }
            if ((pcb_00->connected == (tcp_connected_fn)0x0) ||
               (eVar8 = (*pcb_00->connected)(pcb_00->callback_arg,pcb_00,'\0'),
               CONCAT31(extraout_var_02,eVar8) != -0xd)) {
LAB_23043994:
              tVar14 = pcb_00->flags;
              goto LAB_230439b6;
            }
            goto aborted;
          case 1:
            if ((uVar7 & 0x10) == 0) {
              if ((bVar3 != 0) && (pcb_00->rcv_nxt - 1 == seqno)) {
                tcp_rexmit(pcb_00);
              }
              goto switchD_23043a08_caseD_8;
            }
            if (((int)((ackno - 1) - pcb_00->lastack) < 0) || (0 < (int)(ackno - pcb_00->snd_nxt)))
            {
              tcp_rst(pcb_00,ackno,seqno + tcplen,&ip_data.current_iphdr_dest,
                      &ip_data.current_iphdr_src,tcphdr->dest,tcphdr->src);
              goto switchD_23043a08_caseD_8;
            }
            pcb_00->state = ESTABLISHED;
            if ((pcb_00->listener == (tcp_pcb_listen *)0x0) ||
               (paVar17 = pcb_00->listener->accept, paVar17 == (tcp_accept_fn)0x0))
            goto LAB_23043b68;
            eVar8 = (*paVar17)(pcb_00->callback_arg,pcb_00,'\0');
            if (CONCAT31(extraout_var_03,eVar8) != 0) {
              if (CONCAT31(extraout_var_03,eVar8) == -0xd) goto aborted;
              goto LAB_23043b68;
            }
            tcp_receive(pcb_00);
            if (recv_acked != 0) {
              recv_acked = recv_acked - 1;
            }
            uVar18 = (uint)pcb_00->mss;
            uVar15 = uVar18 << 1;
            tVar9 = 0x111c;
            header_size_decrement = uVar15;
            if (uVar15 < 0x111c) {
              header_size_decrement = 0x111c;
            }
            if (uVar18 << 2 < header_size_decrement) {
              tVar9 = (tcpwnd_size_t)((uVar18 << 0x12) >> 0x10);
            }
            else {
              if (0x111c < uVar15) {
                tVar9 = (tcpwnd_size_t)((uVar18 << 0x11) >> 0x10);
              }
            }
            pcb_00->cwnd = tVar9;
            break;
          case 2:
          case 5:
            tcp_receive(pcb_00);
            break;
          case 3:
            tcp_receive(pcb_00);
            if ((recv_flags & 0x20) != 0) {
              if ((((flags & 0x10) == 0) || (pcb_00->snd_nxt != ackno)) ||
                 (pcb_00->unsent != (tcp_seg *)0x0)) {
                pcb_00->flags = pcb_00->flags | 2;
                tVar12 = CLOSING;
                goto LAB_23043bda;
              }
              pcb_00->flags = pcb_00->flags | 2;
              tcp_pcb_purge(pcb_00);
              ptVar6 = tcp_active_pcbs;
              if (pcb_00 == tcp_active_pcbs) goto LAB_23043c86;
              goto LAB_23043c9c;
            }
            if ((((flags & 0x10) == 0) || (pcb_00->snd_nxt != ackno)) ||
               (pcb_00->unsent != (tcp_seg *)0x0)) goto switchD_23043a08_caseD_8;
            tVar12 = FIN_WAIT_2;
            goto LAB_23043bda;
          case 4:
            tcp_receive(pcb_00);
            if ((recv_flags & 0x20) == 0) goto switchD_23043a08_caseD_8;
            pcb_00->flags = pcb_00->flags | 2;
            tcp_pcb_purge(pcb_00);
            ptVar6 = tcp_active_pcbs;
            if (pcb_00 == tcp_active_pcbs) goto LAB_23043c86;
            goto LAB_23043d18;
          case 6:
            tcp_receive(pcb_00);
            if ((((flags & 0x10) == 0) || (pcb_00->snd_nxt != ackno)) ||
               (pcb_00->unsent != (tcp_seg *)0x0)) goto switchD_23043a08_caseD_8;
            tcp_pcb_purge(pcb_00);
            ptVar6 = tcp_active_pcbs;
            if (pcb_00 != tcp_active_pcbs) goto LAB_23043d52;
LAB_23043c86:
            tcp_active_pcbs = pcb_00->next;
            goto LAB_23043c9e;
          case 7:
            tcp_receive(pcb_00);
            if ((((flags & 0x10) != 0) && (pcb_00->snd_nxt == ackno)) &&
               (pcb_00->unsent == (tcp_seg *)0x0)) {
              recv_flags = recv_flags | 0x10;
            }
          default:
            goto switchD_23043a08_caseD_8;
          }
          if ((recv_flags & 0x20) == 0) goto switchD_23043a08_caseD_8;
          pcb_00->flags = pcb_00->flags | 2;
          tVar12 = CLOSE_WAIT;
LAB_23043bda:
          pcb_00->state = tVar12;
          goto switchD_23043a08_caseD_8;
        }
      }
LAB_230432a4:
      lwip_stats.tcp.lenerr = lwip_stats.tcp.lenerr + 1;
    }
    else {
      lwip_stats.tcp.chkerr = lwip_stats.tcp.chkerr + 1;
    }
  }
  else {
    lwip_stats.tcp.proterr = lwip_stats.tcp.proterr + 1;
  }
  lwip_stats.tcp.drop = lwip_stats.tcp.drop + 1;
LAB_23043728:
  pbuf_free(p);
  return;
LAB_2304374c:
  if (pcb == (tcp_pcb *)0x0) goto code_r0x2304374e;
  if ((((pcb->netif_idx == '\0') ||
       (pcb->netif_idx == (u8_t)((ip_data.current_input_netif)->num + '\x01'))) &&
      ((remote_port = pcb->remote_port, remote_port == tcphdr->src &&
       ((uVar13 = pcb->local_port, uVar13 == tcphdr->dest &&
        (ip_data.current_iphdr_src == (pcb->remote_ip).addr)))))) &&
     (ip_data.current_iphdr_dest == (pcb->local_ip).addr)) {
    if ((sendmss & 4) != 0) goto LAB_23043728;
    if ((sendmss & 2) == 0) {
      if ((sendmss & 1) != 0) {
        pcb->tmr = tcp_ticks;
      }
    }
    else {
      iVar11 = seqno - pcb->rcv_nxt;
      if ((-1 < iVar11) && ((int)(iVar11 - (uint)pcb->rcv_wnd) < 1)) {
        ackno = tcplen + seqno;
        goto LAB_23043702;
      }
    }
    if (uVar2 == 0) goto LAB_23043728;
    pcb->flags = pcb->flags | 2;
    goto LAB_23043724;
  }
  pcb = pcb->next;
  goto LAB_2304374c;
code_r0x2304374e:
  ptVar20 = (tcp_pcb *)0x0;
  pcb_00 = (tcp_pcb *)0x0;
  ptVar19 = tcp_listen_pcbs;
  while (ptVar19 != (tcp_pcb *)0x0) {
    if (((ptVar19->netif_idx == '\0') ||
        (ptVar19->netif_idx == (u8_t)((ip_data.current_input_netif)->num + '\x01'))) &&
       (ptVar19->local_port == tcphdr->dest)) {
      ackno = (ptVar19->local_ip).addr;
      if (ip_data.current_iphdr_dest == ackno) goto LAB_230437aa;
      if (ackno == 0) {
        ptVar20 = ptVar19;
        pcb_00 = pcb;
      }
    }
    pcb = ptVar19;
    ptVar19 = ptVar19->next;
  }
  pcb = pcb_00;
  ptVar19 = ptVar20;
  if (ptVar20 == (tcp_pcb *)0x0) {
    sendmss = lwip_htons(tcphdr->_hdrlen_rsvd_flags);
    if ((sendmss & 4) != 0) goto LAB_23043728;
    lwip_stats.tcp.proterr = lwip_stats.tcp.proterr + 1;
    lwip_stats.tcp.drop = lwip_stats.tcp.drop + 1;
    remote_port = tcphdr->src;
    uVar13 = tcphdr->dest;
    ackno = seqno + tcplen;
    pcb = (tcp_pcb *)0x0;
  }
  else {
LAB_230437aa:
    if (pcb == (tcp_pcb *)0x0) {
      lwip_stats.tcp.cachehit = lwip_stats.tcp.cachehit + 1;
    }
    else {
      tcp_listen_pcbs = ptVar19;
      pcb->next = ptVar19->next;
      ptVar19->next = ptVar6;
    }
    if ((sendmss & 4) != 0) goto LAB_23043728;
    if ((sendmss & 0x10) == 0) {
      if ((sendmss & 2) != 0) {
        pcb = tcp_alloc(ptVar19->prio);
        ptVar4 = tcphdr;
        if (pcb == (tcp_pcb *)0x0) {
          lwip_stats.tcp.memerr = lwip_stats.tcp.memerr + 1;
          if (*(code **)&ptVar19->remote_port != (code *)0x0) {
            (**(code **)&ptVar19->remote_port)(ptVar19->callback_arg,0,0xffffffff);
          }
        }
        else {
          (pcb->local_ip).addr = ip_data.current_iphdr_dest;
          (pcb->remote_ip).addr = ip_data.current_iphdr_src;
          pcb->local_port = ptVar19->local_port;
          pcb->remote_port = ptVar4->src;
          pcb->state = SYN_RCVD;
          ackno = seqno + 1;
          pcb->rcv_nxt = ackno;
          pcb->rcv_ann_right_edge = ackno;
          uVar10 = tcp_next_iss(pcb);
          ackno = seqno;
          pcb->snd_wl2 = uVar10;
          pcb->snd_nxt = uVar10;
          pcb->lastack = uVar10;
          pcb->snd_lbb = uVar10;
          pcb->snd_wl1 = ackno - 1;
          pvVar16 = ptVar19->callback_arg;
          *(tcp_pcb **)&pcb->listener = ptVar19;
          pcb->callback_arg = pvVar16;
          pcb->so_options = ptVar19->so_options & 0xc;
          pcb->netif_idx = ptVar19->netif_idx;
          ptVar6 = pcb;
          pcb->next = tcp_active_pcbs;
          tcp_active_pcbs = ptVar6;
          tcp_timer_needed();
          tcp_active_pcbs_changed = '\x01';
          if (tcphdr_optlen != 0) {
            tcp_parseopt(&pcb->mss);
          }
          uVar2 = tcphdr->wnd;
          sendmss = pcb->mss;
          pcb->snd_wnd = uVar2;
          pcb->snd_wnd_max = uVar2;
          outif = ip4_route((ip4_addr_t *)&pcb->remote_ip);
          sendmss = tcp_eff_send_mss_netif(sendmss,outif,(ip_addr_t *)(ip4_addr_t *)&pcb->remote_ip)
          ;
          pcb->mss = sendmss;
          eVar8 = tcp_enqueue_flags(pcb,'\x12');
          if (CONCAT31(extraout_var_01,eVar8) == 0) {
LAB_23043724:
            tcp_output(pcb);
          }
          else {
            tcp_abandon(pcb,0);
          }
        }
      }
      goto LAB_23043728;
    }
    remote_port = tcphdr->src;
    uVar13 = tcphdr->dest;
    ackno = seqno + tcplen;
    pcb = ptVar19;
  }
LAB_23043702:
  tcp_rst(pcb,ackno,ackno,&ip_data.current_iphdr_dest,&ip_data.current_iphdr_src,uVar13,remote_port)
  ;
  goto LAB_23043728;
LAB_23043672:
  pcb = pcb_00->next;
  ptVar20 = pcb_00;
  goto LAB_230434e6;
  while (ptVar6 = ptVar19->next, pcb_00 != ptVar19->next) {
LAB_23043d52:
    ptVar19 = ptVar6;
    if (ptVar19 == (tcp_pcb *)0x0) goto LAB_23043c9e;
  }
  goto LAB_23043c94;
  while (ptVar6 = ptVar19->next, pcb_00 != ptVar19->next) {
LAB_23043d18:
    ptVar19 = ptVar6;
    if (ptVar19 == (tcp_pcb *)0x0) goto LAB_23043c9e;
  }
  goto LAB_23043c94;
  while (ptVar6 = ptVar19->next, pcb_00 != ptVar19->next) {
LAB_23043c9c:
    ptVar19 = ptVar6;
    if (ptVar19 == (tcp_pcb *)0x0) goto LAB_23043c9e;
  }
LAB_23043c94:
  ptVar19->next = pcb_00->next;
LAB_23043c9e:
  tcp_active_pcbs_changed = '\x01';
  pcb_00->state = TIME_WAIT;
  ptVar6 = pcb_00;
  pcb_00->next = tcp_tw_pcbs;
  tcp_tw_pcbs = ptVar6;
  tcp_timer_needed();
switchD_23043a08_caseD_8:
  if ((recv_flags & 8) == 0) {
    if (recv_acked != 0) {
      if ((pcb_00->sent != (tcp_sent_fn *)0x0) &&
         (eVar8 = (*pcb_00->sent)(pcb_00->callback_arg,pcb_00,recv_acked),
         CONCAT31(extraout_var_04,eVar8) == -0xd)) goto aborted;
      recv_acked = 0;
    }
    iVar11 = tcp_input_delayed_close(pcb_00);
    if (iVar11 == 0) {
      if (recv_data != (pbuf *)0x0) {
        if ((pcb_00->flags & 0x10) != 0) {
          pbuf_free(recv_data);
LAB_23043b68:
          tcp_abort(pcb_00);
          goto aborted;
        }
        if (pcb_00->recv == (tcp_recv_fn *)0x0) {
          eVar8 = tcp_recv_null((void *)0x0,pcb_00,recv_data,'\0');
          iVar11 = CONCAT31(extraout_var_06,eVar8);
        }
        else {
          eVar8 = (*pcb_00->recv)(pcb_00->callback_arg,pcb_00,recv_data,'\0');
          iVar11 = CONCAT31(extraout_var_05,eVar8);
        }
        if (iVar11 == -0xd) goto aborted;
        if (iVar11 != 0) {
          pcb_00->refused_data = recv_data;
        }
      }
      if ((recv_flags & 0x20) != 0) {
        p_00 = pcb_00->refused_data;
        if (p_00 == (pbuf *)0x0) {
          if (pcb_00->rcv_wnd != 0x810) {
            pcb_00->rcv_wnd = pcb_00->rcv_wnd + 1;
          }
          if ((pcb_00->recv != (tcp_recv_fn *)0x0) &&
             (eVar8 = (*pcb_00->recv)(pcb_00->callback_arg,pcb_00,(pbuf *)0x0,'\0'),
             CONCAT31(extraout_var_07,eVar8) == -0xd)) goto aborted;
        }
        else {
          p_00->flags = p_00->flags | 0x20;
        }
      }
      tcp_input_pcb = (tcp_pcb *)0x0;
      iVar11 = tcp_input_delayed_close(pcb_00);
      if (iVar11 == 0) {
        tcp_output(pcb_00);
      }
    }
  }
  else {
    if (pcb_00->errf != (tcp_err_fn *)0x0) {
      (*pcb_00->errf)(pcb_00->callback_arg,-0xe);
    }
    tcp_pcb_remove(&tcp_active_pcbs,pcb_00);
    tcp_free(pcb_00);
  }
aborted:
  tcp_input_pcb = (tcp_pcb *)0x0;
  recv_data = (pbuf *)0x0;
  if (inseg.p != (pbuf *)0x0) {
    pbuf_free(inseg.p);
    inseg.p = (pbuf *)0x0;
  }
  return;
}



void tcp_trigger_input_pcb_close(void)

{
  recv_flags = recv_flags | 0x10;
  return;
}



