pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void tcp_seg_add_chksum(u16_t chksum,u16_t len,u16_t *seg_chksum,u8_t *seg_chksum_swapped)

{
  ushort uVar1;
  undefined2 in_register_0000202a;
  uint uVar2;
  
  uVar2 = CONCAT22(in_register_0000202a,chksum) + (uint)*seg_chksum;
  uVar2 = uVar2 + (uVar2 >> 0x10) & 0xffff;
  uVar1 = (ushort)uVar2;
  if ((len & 1) != 0) {
    *seg_chksum_swapped = '\x01' - *seg_chksum_swapped;
    uVar1 = (ushort)(uVar2 >> 8) | (ushort)(uVar2 << 8);
  }
  *seg_chksum = uVar1;
  return;
}



tcp_seg * tcp_create_segment(tcp_pcb *pcb,pbuf *p,u8_t hdrflags,u32_t seqno,u8_t optflags)

{
  tcp_seg *seg;
  u8_t uVar1;
  u16_t uVar2;
  undefined3 extraout_var;
  u32_t uVar3;
  undefined3 in_register_00002031;
  tcp_hdr *ptVar4;
  
  seg = (tcp_seg *)memp_malloc(MEMP_TCP_SEG);
  if (seg == (tcp_seg *)0x0) {
    pbuf_free(p);
  }
  else {
    seg->flags = optflags;
    seg->next = (tcp_seg *)0x0;
    seg->p = p;
    uVar2 = p->tot_len;
    seg->chksum = 0;
    seg->len = uVar2 + ((ushort)optflags & 1) * -4;
    seg->chksum_swapped = '\0';
    uVar1 = pbuf_add_header(p,0x14);
    if (CONCAT31(extraout_var,uVar1) == 0) {
      ptVar4 = (tcp_hdr *)seg->p->payload;
      seg->tcphdr = ptVar4;
      uVar2 = lwip_htons(pcb->local_port);
      *(char *)&ptVar4->src = (char)uVar2;
      *(undefined *)((int)&ptVar4->src + 1) = (char)(uVar2 >> 8);
      ptVar4 = seg->tcphdr;
      uVar2 = lwip_htons(pcb->remote_port);
      *(char *)&ptVar4->dest = (char)uVar2;
      *(undefined *)((int)&ptVar4->dest + 1) = (char)(uVar2 >> 8);
      ptVar4 = seg->tcphdr;
      uVar3 = lwip_htonl(seqno);
      *(char *)&ptVar4->seqno = (char)uVar3;
      *(undefined *)((int)&ptVar4->seqno + 1) = (char)(uVar3 >> 8);
      *(undefined *)((int)&ptVar4->seqno + 3) = (char)(uVar3 >> 0x18);
      *(undefined *)((int)&ptVar4->seqno + 2) = (char)(uVar3 >> 0x10);
      ptVar4 = seg->tcphdr;
      uVar2 = lwip_htons((((ushort)optflags & 1) + 5) * 0x1000 |
                         (ushort)CONCAT31(in_register_00002031,hdrflags));
      *(char *)&ptVar4->_hdrlen_rsvd_flags = (char)uVar2;
      *(undefined *)((int)&ptVar4->_hdrlen_rsvd_flags + 1) = (char)(uVar2 >> 8);
      ptVar4 = seg->tcphdr;
      *(undefined *)&ptVar4->urgp = 0;
      *(undefined *)((int)&ptVar4->urgp + 1) = 0;
    }
    else {
      lwip_stats.tcp.err = lwip_stats.tcp.err + 1;
      tcp_seg_free(seg);
      seg = (tcp_seg *)0x0;
    }
  }
  return seg;
}



pbuf * tcp_output_alloc_header_common
                 (u32_t ackno,u16_t datalen,u32_t seqno_be,u16_t src_port,u16_t dst_port,u8_t flags,
                 u16_t wnd)

{
  undefined *puVar1;
  u16_t uVar2;
  pbuf *ppVar3;
  u32_t uVar4;
  undefined2 in_register_0000202e;
  undefined3 in_register_0000203d;
  
  ppVar3 = pbuf_alloc(PBUF_IP,(u16_t)((uint)((CONCAT22(in_register_0000202e,datalen) + 0x14) *
                                            0x10000) >> 0x10),PBUF_RAM);
  if (ppVar3 != (pbuf *)0x0) {
    puVar1 = (undefined *)ppVar3->payload;
    uVar2 = lwip_htons(src_port);
    *puVar1 = (char)uVar2;
    puVar1[1] = (char)(uVar2 >> 8);
    uVar2 = lwip_htons(dst_port);
    puVar1[2] = (char)uVar2;
    puVar1[4] = (char)seqno_be;
    puVar1[5] = (char)(seqno_be >> 8);
    puVar1[3] = (char)(uVar2 >> 8);
    puVar1[6] = (char)(seqno_be >> 0x10);
    puVar1[7] = (char)(seqno_be >> 0x18);
    uVar4 = lwip_htonl(ackno);
    puVar1[8] = (char)uVar4;
    puVar1[9] = (char)(uVar4 >> 8);
    puVar1[0xb] = (char)(uVar4 >> 0x18);
    puVar1[10] = (char)(uVar4 >> 0x10);
    uVar2 = lwip_htons((ushort)CONCAT31(in_register_0000203d,flags) | 0x5000);
    puVar1[0xc] = (char)uVar2;
    puVar1[0xd] = (char)(uVar2 >> 8);
    uVar2 = lwip_htons(wnd);
    puVar1[0xe] = (char)uVar2;
    puVar1[0xf] = (char)(uVar2 >> 8);
    puVar1[0x10] = 0;
    puVar1[0x11] = 0;
    puVar1[0x12] = 0;
    puVar1[0x13] = 0;
  }
  return ppVar3;
}



pbuf * tcp_output_alloc_header(tcp_pcb *pcb,u16_t datalen,u32_t seqno_be)

{
  pbuf *ppVar1;
  
  ppVar1 = tcp_output_alloc_header_common
                     (pcb->rcv_nxt,datalen,seqno_be,pcb->local_port,pcb->remote_port,'\x10',
                      pcb->rcv_ann_wnd);
  if (ppVar1 != (pbuf *)0x0) {
    pcb->rcv_ann_right_edge = pcb->rcv_nxt + (uint)pcb->rcv_ann_wnd;
  }
  return ppVar1;
}



err_t tcp_output_control_segment(tcp_pcb *pcb,pbuf *p,ip_addr_t *src,ip_addr_t *dst)

{
  err_t eVar1;
  u16_t uVar2;
  netif *netif;
  u8_t ttl;
  u8_t tos;
  void *pvVar3;
  
  if ((pcb == (tcp_pcb *)0x0) || (pcb->netif_idx == '\0')) {
    netif = ip4_route((ip4_addr_t *)dst);
  }
  else {
    netif = netif_get_by_index(pcb->netif_idx);
  }
  eVar1 = -4;
  if (netif != (netif *)0x0) {
    pvVar3 = p->payload;
    uVar2 = ip_chksum_pseudo(p,'\x06',p->tot_len,(ip4_addr_t *)src,(ip4_addr_t *)dst);
    *(undefined *)((int)pvVar3 + 0x10) = (char)uVar2;
    *(undefined *)((int)pvVar3 + 0x11) = (char)(uVar2 >> 8);
    if (pcb == (tcp_pcb *)0x0) {
      tos = '\0';
      ttl = -1;
    }
    else {
      ttl = pcb->ttl;
      tos = pcb->tos;
    }
    lwip_stats.tcp.xmit = lwip_stats.tcp.xmit + 1;
    eVar1 = ip4_output_if(p,(ip4_addr_t *)src,(ip4_addr_t *)dst,ttl,tos,'\x06',netif);
  }
  pbuf_free(p);
  return eVar1;
}



err_t tcp_write(tcp_pcb *pcb,void *arg,u16_t len,u8_t apiflags)

{
  ushort uVar1;
  tcp_seg *ptVar2;
  u16_t chksum_00;
  u16_t uVar3;
  u16_t len_00;
  undefined2 in_register_00002032;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  tcp_hdr *ptVar8;
  err_t eVar9;
  err_t eVar10;
  uint uVar11;
  tcp_seg *ptVar12;
  tcp_seg *seg;
  tcp_seg *ptVar13;
  uint uVar14;
  pbuf *p;
  tcp_seg *ptVar15;
  u8_t uStack67;
  u16_t uStack66;
  u8_t chksum_swapped;
  u16_t chksum;
  
  uVar4 = CONCAT22(in_register_00002032,len);
  if (pcb == (tcp_pcb *)0x0) {
    return -0x10;
  }
  uVar5 = (uint)pcb->mss;
  uVar7 = (uint)(pcb->snd_wnd_max >> 1);
  if (uVar5 < uVar7) {
    uVar7 = uVar5;
  }
  if (uVar7 == 0) {
    uVar7 = uVar5;
  }
  if (arg == (void *)0x0) {
    return -0x10;
  }
  if ((pcb->state != CLOSE_WAIT) && (2 < (byte)(pcb->state + ~LISTEN))) {
    return -0xb;
  }
  if (uVar4 == 0) {
LAB_23044268:
    ptVar2 = pcb->unsent;
    uVar3 = pcb->snd_queuelen;
    if (ptVar2 == (tcp_seg *)0x0) {
      ptVar15 = (tcp_seg *)0x0;
      uVar5 = 0;
      uVar11 = 0;
    }
    else {
      do {
        ptVar15 = ptVar2;
        ptVar2 = ptVar15->next;
      } while (ptVar2 != (tcp_seg *)0x0);
      uVar5 = (uint)pcb->unsent_oversize;
      uVar11 = 0;
      if (pcb->unsent_oversize != 0) {
        uVar11 = (uVar7 - ptVar15->len) + ((uint)ptVar15->flags & 1) * -4;
        uVar14 = uVar5;
        if (uVar4 < uVar5) {
          uVar14 = uVar4;
        }
        if ((uVar14 & 0xffff) < (uVar11 & 0xffff)) {
          uVar11 = uVar14;
        }
        uVar11 = uVar11 & 0xffff;
        uVar5 = uVar5 - uVar11 & 0xffff;
        ptVar2 = ptVar15;
      }
    }
    seg = (tcp_seg *)0x0;
    ptVar13 = (tcp_seg *)0x0;
    uVar14 = uVar11;
    while (uVar14 < uVar4) {
      uVar6 = uVar4 - uVar14;
      if (uVar7 < (uVar4 - uVar14 & 0xffff)) {
        uVar6 = uVar7;
      }
      uStack66 = 0;
      uStack67 = '\0';
      p = pbuf_alloc(PBUF_TRANSPORT,(u16_t)uVar7,PBUF_RAM);
      if (p == (pbuf *)0x0) {
memerr:
        pcb->flags = pcb->flags | 0x80;
        lwip_stats.tcp.memerr = lwip_stats.tcp.memerr + 1;
        if (seg != (tcp_seg *)0x0) {
          tcp_segs_free(seg);
        }
        goto LAB_23044228;
      }
      uVar1 = p->len;
      len_00 = (u16_t)uVar6;
      p->tot_len = len_00;
      p->len = len_00;
      chksum_00 = lwip_chksum_copy(p->payload,(void *)((int)arg + uVar14),len_00);
      tcp_seg_add_chksum(chksum_00,len_00,&uStack66,&uStack67);
      chksum_00 = pbuf_clen(p);
      uVar3 = uVar3 + chksum_00;
      uVar5 = (uint)uVar1 - (uVar6 & 0xffff) & 0xffff;
      if (0x10 < uVar3) {
        pbuf_free(p);
        goto memerr;
      }
      ptVar2 = tcp_create_segment(pcb,p,'\0',pcb->snd_lbb + uVar14,'\0');
      if (ptVar2 == (tcp_seg *)0x0) goto memerr;
      ptVar2->chksum = uStack66;
      ptVar2->chksum_swapped = uStack67;
      ptVar2->flags = ptVar2->flags | 4;
      ptVar12 = ptVar2;
      if (seg != (tcp_seg *)0x0) {
        ptVar13->next = ptVar2;
        ptVar12 = seg;
      }
      uVar14 = uVar14 + (uVar6 & 0xffff) & 0xffff;
      seg = ptVar12;
      ptVar13 = ptVar2;
    }
    if (uVar11 != 0) {
      p = ptVar15->p;
      while (chksum_00 = (u16_t)uVar11, p != (pbuf *)0x0) {
        p->tot_len = p->tot_len + chksum_00;
        if (p->next == (pbuf *)0x0) {
          len_00 = lwip_chksum_copy((void *)((int)p->payload + (uint)p->len),arg,chksum_00);
          tcp_seg_add_chksum(len_00,chksum_00,&ptVar15->chksum,&ptVar15->chksum_swapped);
          ptVar15->flags = ptVar15->flags | 4;
          p->len = p->len + chksum_00;
        }
        p = p->next;
      }
      ptVar15->len = chksum_00 + ptVar15->len;
    }
    pcb->unsent_oversize = (u16_t)uVar5;
    if (ptVar15 == (tcp_seg *)0x0) {
      pcb->unsent = seg;
    }
    else {
      ptVar15->next = seg;
    }
    pcb->snd_queuelen = uVar3;
    pcb->snd_lbb = pcb->snd_lbb + uVar4;
    pcb->snd_buf = pcb->snd_buf - len;
    eVar10 = '\0';
    eVar9 = '\0';
    if (((ptVar2 != (tcp_seg *)0x0) && (eVar9 = eVar10, ptVar2->tcphdr != (tcp_hdr *)0x0)) &&
       ((apiflags & 2) == 0)) {
      uVar1 = ptVar2->tcphdr->_hdrlen_rsvd_flags;
      uVar3 = lwip_htons(8);
      ptVar8 = ptVar2->tcphdr;
      uVar1 = uVar3 | uVar1;
      *(char *)&ptVar8->_hdrlen_rsvd_flags = (char)uVar1;
      *(undefined *)((int)&ptVar8->_hdrlen_rsvd_flags + 1) = (char)((uint)uVar1 >> 8);
    }
  }
  else {
    if (uVar4 <= pcb->snd_buf) {
      if (pcb->snd_queuelen < 0x10) goto LAB_23044268;
      lwip_stats.tcp.memerr = lwip_stats.tcp.memerr + 1;
    }
    pcb->flags = pcb->flags | 0x80;
LAB_23044228:
    eVar9 = -1;
  }
  return eVar9;
}



err_t tcp_split_unsent_seg(tcp_pcb *pcb,u16_t split)

{
  byte bVar1;
  ushort *puVar2;
  ushort uVar3;
  tcp_seg *ptVar4;
  uint uVar5;
  u16_t len;
  u16_t uVar6;
  pbuf *p;
  undefined2 extraout_var;
  u32_t uVar7;
  tcp_seg *ptVar8;
  undefined2 in_register_0000202e;
  byte hdrflags;
  tcp_hdr *ptVar9;
  int iVar10;
  uint uVar11;
  uint uVar12;
  u8_t uStack51;
  u16_t uStack50;
  u8_t chksum_swapped;
  u16_t chksum;
  
  uVar5 = CONCAT22(in_register_0000202e,split);
  ptVar4 = pcb->unsent;
  uStack50 = 0;
  uStack51 = '\0';
  if (ptVar4 != (tcp_seg *)0x0) {
    if (uVar5 == 0) {
      return -6;
    }
    uVar11 = (uint)ptVar4->len;
    if (uVar11 <= uVar5) {
      return '\0';
    }
    bVar1 = ptVar4->flags;
    iVar10 = ((uint)bVar1 & 1) * 4;
    uVar12 = uVar11 - uVar5 & 0xffff;
    p = pbuf_alloc(PBUF_TRANSPORT,(u16_t)((uVar12 + iVar10) * 0x10000 >> 0x10),PBUF_RAM);
    if ((p != (pbuf *)0x0) &&
       (len = pbuf_copy_partial(ptVar4->p,(void *)((int)p->payload + iVar10),
                                (u16_t)((uVar11 - uVar5) * 0x10000 >> 0x10),
                                (u16_t)((((uint)ptVar4->p->tot_len - (uint)ptVar4->len) + uVar5) *
                                        0x10000 >> 0x10)), CONCAT22(extraout_var,len) == uVar12)) {
      uVar6 = inet_chksum((void *)((int)p->payload + iVar10),len);
      tcp_seg_add_chksum(~uVar6,len,&uStack50,&uStack51);
      len = lwip_htons(ptVar4->tcphdr->_hdrlen_rsvd_flags);
      hdrflags = (byte)len & 8;
      if ((len & 8) == 0) {
        len = len & 0x3f;
      }
      else {
        len = len & 0x37;
        hdrflags = 8;
      }
      if ((len & 1) != 0) {
        len = len & 0xfe;
        hdrflags = hdrflags | 1;
      }
      uVar7 = lwip_htonl(ptVar4->tcphdr->seqno);
      ptVar8 = tcp_create_segment(pcb,p,hdrflags,uVar5 + uVar7,bVar1 & 0xfb);
      if (ptVar8 != (tcp_seg *)0x0) {
        ptVar8->chksum = uStack50;
        ptVar8->chksum_swapped = uStack51;
        ptVar8->flags = ptVar8->flags | 4;
        uVar6 = pbuf_clen(ptVar4->p);
        pcb->snd_queuelen = pcb->snd_queuelen - uVar6;
        pbuf_realloc(ptVar4->p,
                     (u16_t)(((uint)ptVar4->p->tot_len + (uVar5 - uVar11 & 0xffff)) * 0x10000 >>
                            0x10));
        ptVar4->len = (short)((uVar5 - uVar11) * 0x10000 >> 0x10) + ptVar4->len;
        uVar3 = ptVar4->tcphdr->_hdrlen_rsvd_flags;
        len = lwip_htons(len);
        ptVar9 = ptVar4->tcphdr;
        uVar3 = uVar3 | len;
        *(char *)&ptVar9->_hdrlen_rsvd_flags = (char)uVar3;
        *(undefined *)((int)&ptVar9->_hdrlen_rsvd_flags + 1) = (char)((uint)uVar3 >> 8);
        len = pbuf_clen(ptVar4->p);
        pcb->snd_queuelen = len + pcb->snd_queuelen;
        p = ptVar4->p;
        ptVar4->chksum = 0;
        ptVar4->chksum_swapped = '\0';
        uVar5 = (uint)p->tot_len - (uint)ptVar4->len;
        while( true ) {
          uVar5 = uVar5 & 0xffff;
          puVar2 = &p->len;
          if (uVar5 <= *puVar2) break;
          p = p->next;
          uVar5 = uVar5 - *puVar2;
          if (p == (pbuf *)0x0) goto LAB_230446e4;
        }
        do {
          len = inet_chksum((void *)((int)p->payload + uVar5),
                            (u16_t)((p->len - uVar5) * 0x10000 >> 0x10));
          tcp_seg_add_chksum(~len,(u16_t)((p->len - uVar5) * 0x10000 >> 0x10),&ptVar4->chksum,
                             &ptVar4->chksum_swapped);
          p = p->next;
          uVar5 = 0;
        } while (p != (pbuf *)0x0);
LAB_230446e4:
        len = pbuf_clen(ptVar8->p);
        pcb->snd_queuelen = len + pcb->snd_queuelen;
        ptVar8->next = ptVar4->next;
        ptVar4->next = ptVar8;
        ptVar4 = ptVar8->next;
        if (ptVar4 != (tcp_seg *)0x0) {
          return '\0';
        }
        pcb->unsent_oversize = 0;
        return (err_t)ptVar4;
      }
    }
    lwip_stats.tcp.memerr = lwip_stats.tcp.memerr + 1;
    if (p != (pbuf *)0x0) {
      pbuf_free(p);
    }
  }
  return -1;
}



err_t tcp_enqueue_flags(tcp_pcb *pcb,u8_t flags)

{
  err_t eVar1;
  u16_t uVar2;
  pbuf *p;
  tcp_seg *ptVar3;
  uint uVar4;
  tcp_seg *ptVar5;
  tcp_seg *ptVar6;
  
  uVar4 = ((uint)flags & 2) >> 1;
  p = pbuf_alloc(PBUF_TRANSPORT,(u16_t)(uVar4 << 2),PBUF_RAM);
  if ((p == (pbuf *)0x0) ||
     (ptVar3 = tcp_create_segment(pcb,p,flags,pcb->snd_lbb,(u8_t)uVar4), ptVar3 == (tcp_seg *)0x0))
  {
    eVar1 = -1;
    pcb->flags = pcb->flags | 0x80;
    lwip_stats.tcp.memerr = lwip_stats.tcp.memerr + 1;
  }
  else {
    ptVar5 = pcb->unsent;
    if (pcb->unsent == (tcp_seg *)0x0) {
      pcb->unsent = ptVar3;
    }
    else {
      do {
        ptVar6 = ptVar5;
        ptVar5 = ptVar6->next;
      } while (ptVar5 != (tcp_seg *)0x0);
      ptVar6->next = ptVar3;
    }
    pcb->unsent_oversize = 0;
    if ((flags & 3) != 0) {
      pcb->snd_lbb = pcb->snd_lbb + 1;
    }
    if ((flags & 1) != 0) {
      pcb->flags = pcb->flags | 0x20;
    }
    uVar2 = pbuf_clen(ptVar3->p);
    pcb->snd_queuelen = uVar2 + pcb->snd_queuelen;
    eVar1 = '\0';
  }
  return eVar1;
}



err_t tcp_send_fin(tcp_pcb *pcb)

{
  ushort uVar1;
  tcp_seg *ptVar2;
  tcp_seg *ptVar3;
  err_t eVar4;
  u16_t uVar5;
  tcp_hdr *ptVar6;
  
