pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  ptVar2 = pcb->unsent;
  if (pcb->unsent != (tcp_seg *)0x0) {
    do {
      ptVar3 = ptVar2;
      ptVar2 = ptVar3->next;
    } while (ptVar3->next != (tcp_seg *)0x0);
    uVar5 = lwip_htons(ptVar3->tcphdr->_hdrlen_rsvd_flags);
    if ((uVar5 & 7) == 0) {
      uVar1 = ptVar3->tcphdr->_hdrlen_rsvd_flags;
      uVar5 = lwip_htons(1);
      ptVar6 = ptVar3->tcphdr;
      uVar1 = uVar5 | uVar1;
      *(char *)&ptVar6->_hdrlen_rsvd_flags = (char)uVar1;
      *(undefined *)((int)&ptVar6->_hdrlen_rsvd_flags + 1) = (char)((uint)uVar1 >> 8);
      pcb->flags = pcb->flags | 0x20;
      return '\0';
    }
  }
  eVar4 = tcp_enqueue_flags(pcb,'\x01');
  return eVar4;
}



err_t tcp_rexmit_rto_prepare(tcp_pcb *pcb)

{
  u8_t uVar1;
  ushort uVar2;
  tcp_seg *ptVar3;
  u16_t uVar4;
  u32_t uVar5;
  tcp_seg *ptVar6;
  
  ptVar3 = pcb->unacked;
  if (pcb->unacked != (tcp_seg *)0x0) {
    do {
      uVar1 = ptVar3->p->ref;
      if (ptVar3->next == (tcp_seg *)0x0) {
        if (uVar1 != '\x01') {
          return -6;
        }
        ptVar3->next = pcb->unsent;
        ptVar6 = pcb->unacked;
        pcb->unacked = (tcp_seg *)0x0;
        pcb->unsent = ptVar6;
        pcb->flags = pcb->flags | 0x800;
        uVar5 = lwip_htonl(ptVar3->tcphdr->seqno);
        uVar2 = ptVar3->len;
        uVar4 = lwip_htons(ptVar3->tcphdr->_hdrlen_rsvd_flags);
        pcb->rto_end = (uint)((uVar4 & 3) != 0) + uVar5 + uVar2;
        pcb->rttest = 0;
        return '\0';
      }
      ptVar3 = ptVar3->next;
    } while (uVar1 == '\x01');
  }
  return -6;
}



err_t tcp_rexmit(tcp_pcb *pcb)

{
  tcp_seg *ptVar1;
  u32_t uVar2;
  u32_t uVar3;
  err_t eVar4;
  tcp_seg *ptVar5;
  
  ptVar1 = pcb->unacked;
  eVar4 = -6;
  if ((ptVar1 != (tcp_seg *)0x0) && (eVar4 = -6, ptVar1->p->ref == '\x01')) {
    ptVar5 = (tcp_seg *)&pcb->unsent;
    pcb->unacked = ptVar1->next;
    while (ptVar5->next != (tcp_seg *)0x0) {
      uVar2 = lwip_htonl(ptVar5->next->tcphdr->seqno);
      uVar3 = lwip_htonl(ptVar1->tcphdr->seqno);
      if (-1 < (int)(uVar2 - uVar3)) break;
      ptVar5 = ptVar5->next;
    }
    ptVar1->next = ptVar5->next;
    ptVar5->next = ptVar1;
    if (ptVar1->next == (tcp_seg *)0x0) {
      pcb->unsent_oversize = 0;
    }
    if (pcb->nrtx != -1) {
      pcb->nrtx = pcb->nrtx + '\x01';
    }
    pcb->rttest = 0;
    eVar4 = '\0';
  }
  return eVar4;
}



void tcp_rexmit_fast(tcp_pcb *pcb)

{
  err_t eVar1;
  undefined3 extraout_var;
  uint uVar2;
  uint uVar3;
  
  if (pcb->unacked != (tcp_seg *)0x0) {
    if (((pcb->flags & 4) == 0) && (eVar1 = tcp_rexmit(pcb), CONCAT31(extraout_var,eVar1) == 0)) {
      uVar3 = (uint)pcb->snd_wnd;
      if ((uint)pcb->cwnd < (uint)pcb->snd_wnd) {
        uVar3 = (uint)pcb->cwnd;
      }
      pcb->ssthresh = (tcpwnd_size_t)((int)uVar3 >> 1);
      uVar2 = (uint)pcb->mss << 1;
      if ((uint)((int)uVar3 >> 1) < uVar2) {
        pcb->ssthresh = (tcpwnd_size_t)uVar2;
      }
      pcb->rtime = 0;
      pcb->cwnd = pcb->mss * 3 + pcb->ssthresh;
      pcb->flags = pcb->flags | 4;
    }
    return;
  }
  return;
}



void tcp_rst(tcp_pcb *pcb,u32_t seqno,u32_t ackno,ip_addr_t *param_4,ip_addr_t *remote_ip,
            u16_t param_6,u16_t remote_port)

{
  u32_t seqno_be;
  pbuf *p;
  
  seqno_be = lwip_htonl(seqno);
  p = tcp_output_alloc_header_common(ackno,0,seqno_be,param_6,remote_port,'\x14',0x1008);
  if (p != (pbuf *)0x0) {
    tcp_output_control_segment(pcb,p,param_4,remote_ip);
    return;
  }
  return;
}



err_t tcp_send_empty_ack(tcp_pcb *pcb)

{
  err_t eVar1;
  u32_t seqno_be;
  pbuf *p;
  undefined3 extraout_var;
  tcpflags_t tVar2;
  
  seqno_be = lwip_htonl(pcb->snd_nxt);
  p = tcp_output_alloc_header(pcb,0,seqno_be);
  if (p == (pbuf *)0x0) {
    eVar1 = -2;
    pcb->flags = pcb->flags | 3;
  }
  else {
    eVar1 = tcp_output_control_segment(pcb,p,(ip_addr_t *)pcb,&pcb->remote_ip);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      tVar2 = pcb->flags & 0xfffc;
    }
    else {
      tVar2 = pcb->flags | 3;
    }
    pcb->flags = tVar2;
  }
  return eVar1;
}



err_t tcp_output(tcp_pcb *pcb)

{
  ushort uVar1;
  ushort uVar2;
  bool bVar3;
  short sVar4;
  tcp_seg *ptVar5;
  tcp_seg *seg;
  err_t eVar6;
  u16_t proto_len;
  u16_t uVar7;
  netif *outif;
  u32_t uVar8;
  undefined2 extraout_var_00;
  undefined2 extraout_var_01;
  uint uVar9;
  undefined3 extraout_var;
  u32_t uVar10;
  tcp_hdr *ptVar11;
  pbuf *p;
  tcp_seg *ptVar12;
  tcp_seg *ptVar13;
  uint uVar14;
  ip4_addr_t *dest;
  
  if (tcp_input_pcb == pcb) {
    return '\0';
  }
  seg = pcb->unsent;
  if (seg == (tcp_seg *)0x0) {
    uVar1 = pcb->flags;
  }
  else {
    uVar1 = pcb->cwnd;
    uVar2 = pcb->snd_wnd;
    dest = (ip4_addr_t *)&pcb->remote_ip;
    if (pcb->netif_idx == '\0') {
      outif = ip4_route(dest);
    }
    else {
      outif = netif_get_by_index(pcb->netif_idx);
    }
    if (outif == (netif *)0x0) {
      return -4;
    }
    if ((pcb->local_ip).addr == 0) {
      (pcb->local_ip).addr = (outif->ip_addr).addr;
    }
    uVar14 = (uint)uVar1;
    if ((uint)uVar2 < (uint)uVar1) {
      uVar14 = (uint)uVar2;
    }
    uVar8 = lwip_htonl(seg->tcphdr->seqno);
    if (uVar8 + ((uint)seg->len - pcb->lastack) <= uVar14) {
      pcb->persist_backoff = '\0';
      ptVar12 = pcb->unacked;
      ptVar13 = pcb->unacked;
      while (ptVar5 = ptVar12, ptVar5 != (tcp_seg *)0x0) {
        ptVar12 = ptVar5->next;
        ptVar13 = ptVar5;
      }
      do {
        uVar8 = lwip_htonl(seg->tcphdr->seqno);
        if ((uVar14 < (uVar8 - pcb->lastack) + (uint)seg->len) ||
           (((((lwip_htons(seg->tcphdr->_hdrlen_rsvd_flags), pcb->unacked != (tcp_seg *)0x0 &&
               ((pcb->flags & 0x44) == 0)) &&
              ((ptVar12 = pcb->unsent, ptVar12 == (tcp_seg *)0x0 ||
               ((ptVar12->next == (tcp_seg *)0x0 && (ptVar12->len < pcb->mss)))))) &&
             (pcb->snd_buf != 0)) && ((pcb->snd_queuelen < 0x10 && ((pcb->flags & 0xa0) == 0)))))) {
          if (pcb->unsent != (tcp_seg *)0x0) goto output_done;
          break;
        }
        if (pcb->state != SYN_SENT) {
          uVar1 = seg->tcphdr->_hdrlen_rsvd_flags;
          proto_len = lwip_htons(0x10);
          ptVar11 = seg->tcphdr;
          uVar1 = proto_len | uVar1;
          *(char *)&ptVar11->_hdrlen_rsvd_flags = (char)uVar1;
          *(undefined *)((int)&ptVar11->_hdrlen_rsvd_flags + 1) = (char)((uint)uVar1 >> 8);
        }
        if (seg->p->ref == '\x01') {
          ptVar11 = seg->tcphdr;
          uVar8 = lwip_htonl(pcb->rcv_nxt);
          *(char *)&ptVar11->ackno = (char)uVar8;
          *(undefined *)((int)&ptVar11->ackno + 1) = (char)(uVar8 >> 8);
          *(undefined *)((int)&ptVar11->ackno + 2) = (char)(uVar8 >> 0x10);
          *(undefined *)((int)&ptVar11->ackno + 3) = (char)(uVar8 >> 0x18);
          ptVar11 = seg->tcphdr;
          proto_len = lwip_htons(pcb->rcv_ann_wnd);
          *(char *)&ptVar11->wnd = (char)proto_len;
          *(undefined *)((int)&ptVar11->wnd + 1) = (char)(proto_len >> 8);
          pcb->rcv_ann_right_edge = pcb->rcv_nxt + (uint)pcb->rcv_ann_wnd;
          if ((seg->flags & 1) != 0) {
            ptVar11 = seg->tcphdr;
            proto_len = tcp_eff_send_mss_netif(0x2b0,outif,(ip_addr_t *)dest);
            uVar8 = lwip_htonl(CONCAT22(extraout_var_00,proto_len) | 0x2040000);
            *(u32_t *)(ptVar11 + 1) = uVar8;
          }
          if (pcb->rtime < 0) {
            pcb->rtime = 0;
          }
          if (pcb->rttest == 0) {
            pcb->rttest = tcp_ticks;
            uVar8 = lwip_htonl(seg->tcphdr->seqno);
            pcb->rtseq = uVar8;
          }
          p = seg->p;
          sVar4 = (short)((uint)((int)((int)seg->tcphdr - (int)p->payload) * 0x10000) >> 0x10);
          p->len = p->len - sVar4;
          seg->p->tot_len = seg->p->tot_len - sVar4;
          ptVar11 = seg->tcphdr;
          *(tcp_hdr **)&seg->p->payload = ptVar11;
          *(undefined *)&ptVar11->chksum = 0;
          *(undefined *)((int)&ptVar11->chksum + 1) = 0;
          if ((seg->flags & 4) == 0) {
            lwip_htons(seg->tcphdr->_hdrlen_rsvd_flags);
          }
          p = seg->p;
          proto_len = p->tot_len;
          uVar7 = lwip_htons(seg->tcphdr->_hdrlen_rsvd_flags);
          proto_len = ip_chksum_pseudo_partial
                                (p,'\x06',proto_len,
                                 (ushort)(CONCAT22(extraout_var_01,uVar7) >> 10) & 0xfc,
                                 (ip4_addr_t *)pcb,dest);
          bVar3 = seg->chksum_swapped != '\0';
          if (bVar3) {
            seg->chksum_swapped = '\0';
            seg->chksum = seg->chksum >> 8 | seg->chksum << 8;
          }
          ptVar11 = seg->tcphdr;
          uVar9 = (uint)seg->chksum + (~(uint)proto_len & 0xffff);
          uVar9 = ~((uVar9 >> 0x10) + uVar9);
          *(char *)&ptVar11->chksum = (char)uVar9;
          *(undefined *)((int)&ptVar11->chksum + 1) = (char)(uVar9 >> 8);
          lwip_stats.tcp.xmit = lwip_stats.tcp.xmit + 1;
          eVar6 = ip4_output_if(seg->p,(ip4_addr_t *)pcb,dest,pcb->ttl,pcb->tos,'\x06',outif);
          if (bVar3) {
            seg->chksum_swapped = '\x01';
            seg->chksum = seg->chksum >> 8 | seg->chksum << 8;
          }
          if (CONCAT31(extraout_var,eVar6) != 0) {
            pcb->flags = pcb->flags | 0x80;
            return eVar6;
          }
        }
        pcb->unsent = seg->next;
        if (pcb->state != SYN_SENT) {
          pcb->flags = pcb->flags & 0xfffc;
        }
        uVar8 = lwip_htonl(seg->tcphdr->seqno);
        uVar1 = seg->len;
        proto_len = lwip_htons(seg->tcphdr->_hdrlen_rsvd_flags);
        uVar8 = (uint)((proto_len & 3) != 0) + uVar8 + uVar1;
        if ((int)(pcb->snd_nxt - uVar8) < 0) {
          pcb->snd_nxt = uVar8;
        }
        uVar1 = seg->len;
        proto_len = lwip_htons(seg->tcphdr->_hdrlen_rsvd_flags);
        if ((uint)((proto_len & 3) != 0) + (uint)uVar1 == 0) {
          tcp_seg_free(seg);
        }
        else {
          seg->next = (tcp_seg *)0x0;
          if (pcb->unacked == (tcp_seg *)0x0) {
            pcb->unacked = seg;
            ptVar13 = seg;
          }
          else {
            uVar8 = lwip_htonl(seg->tcphdr->seqno);
            uVar10 = lwip_htonl(ptVar13->tcphdr->seqno);
            ptVar12 = (tcp_seg *)&pcb->unacked;
            if ((int)(uVar8 - uVar10) < 0) {
              while (ptVar12->next != (tcp_seg *)0x0) {
                uVar8 = lwip_htonl(ptVar12->next->tcphdr->seqno);
                uVar10 = lwip_htonl(seg->tcphdr->seqno);
                if (-1 < (int)(uVar8 - uVar10)) break;
                ptVar12 = ptVar12->next;
              }
              seg->next = ptVar12->next;
              ptVar12->next = seg;
            }
            else {
              ptVar13->next = seg;
              ptVar13 = seg;
            }
          }
        }
        seg = pcb->unsent;
      } while (seg != (tcp_seg *)0x0);
      pcb->unsent_oversize = 0;
      goto output_done;
    }
    if ((((uint)pcb->snd_wnd == uVar14) && (pcb->unacked == (tcp_seg *)0x0)) &&
       (pcb->persist_backoff == '\0')) {
      *(undefined2 *)&pcb->persist_cnt = 0x100;
      pcb->persist_probe = '\0';
    }
    uVar1 = pcb->flags;
  }
  if ((uVar1 & 2) != 0) {
    eVar6 = tcp_send_empty_ack(pcb);
    return eVar6;
  }
output_done:
  pcb->flags = pcb->flags & 0xff7f;
  return '\0';
}



