pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void tcp_rexmit_rto_commit(tcp_pcb *pcb)

{
  if (pcb->nrtx != -1) {
    pcb->nrtx = pcb->nrtx + '\x01';
  }
  tcp_output(pcb);
  return;
}



void tcp_rexmit_rto(tcp_pcb *pcb)

{
  err_t eVar1;
  undefined3 extraout_var;
  
  eVar1 = tcp_rexmit_rto_prepare(pcb);
  if (CONCAT31(extraout_var,eVar1) == 0) {
    tcp_rexmit_rto_commit(pcb);
    return;
  }
  return;
}



err_t tcp_keepalive(tcp_pcb *pcb)

{
  err_t eVar1;
  u32_t seqno_be;
  pbuf *p;
  
  seqno_be = lwip_htonl(pcb->snd_nxt - 1);
  p = tcp_output_alloc_header(pcb,0,seqno_be);
  if (p != (pbuf *)0x0) {
    eVar1 = tcp_output_control_segment(pcb,p,(ip_addr_t *)pcb,&pcb->remote_ip);
    return eVar1;
  }
  return -1;
}



err_t tcp_zero_window_probe(tcp_pcb *pcb)

{
  ushort uVar1;
  uint uVar2;
  err_t eVar3;
  u16_t uVar4;
  pbuf *p;
  u32_t uVar5;
  tcp_seg *ptVar6;
  void *pvVar7;
  
  ptVar6 = pcb->unsent;
  if (ptVar6 == (tcp_seg *)0x0) {
    eVar3 = '\0';
  }
  else {
    if (pcb->persist_probe != -1) {
      pcb->persist_probe = pcb->persist_probe + '\x01';
    }
    uVar2 = 0;
    uVar4 = lwip_htons(ptVar6->tcphdr->_hdrlen_rsvd_flags);
    if ((uVar4 & 1) != 0) {
      uVar2 = (uint)(ptVar6->len == 0);
    }
    p = tcp_output_alloc_header(pcb,(ushort)uVar2 ^ 1,ptVar6->tcphdr->seqno);
    if (p != (pbuf *)0x0) {
      pvVar7 = p->payload;
      if (uVar2 == 0) {
        pbuf_copy_partial(ptVar6->p,(void *)((int)pvVar7 + 0x14),1,
                          (u16_t)(((uint)ptVar6->p->tot_len - (uint)ptVar6->len) * 0x10000 >> 0x10))
        ;
      }
      else {
        uVar1 = *(ushort *)((int)pvVar7 + 0xc);
        uVar4 = lwip_htons(0x11);
        uVar2 = (int)(short)(uVar1 & 0xc0ff) | (uint)uVar4;
        *(undefined *)((int)pvVar7 + 0xc) = (char)uVar2;
        *(undefined *)((int)pvVar7 + 0xd) = (char)(uVar2 >> 8);
      }
      uVar5 = lwip_htonl(ptVar6->tcphdr->seqno);
      if ((int)(pcb->snd_nxt - (uVar5 + 1)) < 0) {
        pcb->snd_nxt = uVar5 + 1;
      }
      eVar3 = tcp_output_control_segment(pcb,p,(ip_addr_t *)pcb,&pcb->remote_ip);
      return eVar3;
    }
    eVar3 = -1;
  }
  return eVar3;
}



void sys_timeout_abs(u32_t abs_time,sys_timeout_handler *handler,void *arg)

{
  sys_timeo *psVar1;
  sys_timeo *psVar2;
  sys_timeo *psVar3;
  
  psVar1 = (sys_timeo *)memp_malloc(MEMP_SYS_TIMEOUT);
  psVar2 = next_timeout;
  psVar3 = next_timeout;
  if (psVar1 != (sys_timeo *)0x0) {
    psVar1->next = (sys_timeo *)0x0;
    psVar1->h = handler;
    psVar1->arg = arg;
    psVar1->time = abs_time;
    psVar3 = psVar1;
    if (psVar2 != (sys_timeo *)0x0) {
      if ((int)(abs_time - psVar2->time) < 0) {
        psVar1->next = psVar2;
      }
      else {
        do {
          psVar3 = psVar2;
          psVar2 = psVar3->next;
          if (psVar2 == (sys_timeo *)0x0) break;
        } while (-1 < (int)(abs_time - psVar2->time));
        psVar1->next = psVar2;
        psVar3->next = psVar1;
        psVar3 = next_timeout;
      }
    }
  }
  next_timeout = psVar3;
  return;
}



void lwip_cyclic_timer(void *arg)

{
  TickType_t TVar1;
  u32_t abs_time;
  u32_t uVar2;
  
  (**(code **)((int)arg + 4))(*(code **)((int)arg + 4));
  TVar1 = sys_now();
  uVar2 = current_timeout_due_time + *(int *)arg;
  abs_time = TVar1 + *(int *)arg;
  if (-1 < (int)(uVar2 - TVar1)) {
    abs_time = uVar2;
  }
  sys_timeout_abs(abs_time,lwip_cyclic_timer,arg);
  return;
}



void sys_timeout(u32_t msecs,sys_timeout_handler *handler,void *arg)

{
  TickType_t TVar1;
  
  TVar1 = sys_now();
  sys_timeout_abs(TVar1 + msecs,handler,arg);
  return;
}



void tcp_timer_needed(void)

{
  if ((tcpip_tcp_timer_active == 0) &&
     ((tcp_active_pcbs != (tcp_pcb *)0x0 || (tcp_tw_pcbs != (tcp_pcb *)0x0)))) {
    tcpip_tcp_timer_active = 1;
    sys_timeout(0xfa,tcpip_tcp_timer,(void *)0x0);
    return;
  }
  return;
}



void tcpip_tcp_timer(void *arg)

{
  tcp_tmr();
  if ((tcp_active_pcbs == (tcp_pcb *)0x0) && (tcp_tw_pcbs == (tcp_pcb *)0x0)) {
    tcpip_tcp_timer_active = 0;
    return;
  }
  sys_timeout(0xfa,tcpip_tcp_timer,(void *)0x0);
  return;
}



void sys_timeouts_init(void)

{
  u32_t *arg;
  u32_t *puVar1;
  
  arg = &DAT_23086494;
  do {
    puVar1 = arg + 2;
    sys_timeout(*arg,lwip_cyclic_timer,arg);
    arg = puVar1;
  } while (puVar1 != (u32_t *)CSWTCH_13);
  return;
}



void sys_untimeout(sys_timeout_handler *handler,void *arg)

{
  sys_timeo *psVar1;
  sys_timeo *psVar2;
  sys_timeo *mem;
  
  psVar1 = (sys_timeo *)0x0;
  mem = next_timeout;
  if (next_timeout != (sys_timeo *)0x0) {
    do {
      psVar2 = mem->next;
      if ((mem->h == handler) && (mem->arg == arg)) {
        if (psVar1 != (sys_timeo *)0x0) {
          psVar1->next = psVar2;
          psVar2 = next_timeout;
        }
        next_timeout = psVar2;
        memp_free(MEMP_SYS_TIMEOUT,mem);
        return;
      }
      psVar1 = mem;
      mem = psVar2;
    } while (psVar2 != (sys_timeo *)0x0);
  }
  return;
}



void sys_check_timeouts(void)

{
  sys_timeo *mem;
  sys_timeout_handler *psVar1;
  void *pvVar2;
  TickType_t TVar3;
  
  TVar3 = sys_now();
  while ((mem = next_timeout, next_timeout != (sys_timeo *)0x0 &&
         (-1 < (int)(TVar3 - next_timeout->time)))) {
    psVar1 = next_timeout->h;
    pvVar2 = next_timeout->arg;
    current_timeout_due_time = next_timeout->time;
    next_timeout = next_timeout->next;
    memp_free(MEMP_SYS_TIMEOUT,mem);
    if (psVar1 != (sys_timeout_handler *)0x0) {
      (*psVar1)(pvVar2);
    }
  }
  return;
}



u32_t sys_timeouts_sleeptime(void)

{
  u32_t uVar1;
  TickType_t TVar2;
  
  uVar1 = 0xffffffff;
  if (next_timeout != (sys_timeo *)0x0) {
    TVar2 = sys_now();
    uVar1 = next_timeout->time - TVar2;
    if ((int)uVar1 < 0) {
      uVar1 = 0;
    }
  }
  return uVar1;
}



