pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void udp_init(void)

{
  int iVar1;
  
  iVar1 = bl_rand();
  udp_port = (ushort)((uint)(iVar1 << 0x12) >> 0x12) + 0xc000;
  return;
}



void udp_input(pbuf *p,netif *inp)

{
  udp_pcb *puVar1;
  udp_pcb *puVar2;
  u8_t uVar3;
  u16_t uVar4;
  u16_t uVar5;
  undefined3 extraout_var;
  undefined2 extraout_var_01;
  undefined2 extraout_var_02;
  undefined2 extraout_var_03;
  undefined3 extraout_var_00;
  u32_t uVar6;
  uint uVar7;
  udp_pcb *puVar8;
  udp_pcb *puVar9;
  udp_pcb *puVar10;
  u16_t *puVar11;
  
  lwip_stats.udp.recv = lwip_stats.udp.recv + 1;
  if (p->len < 8) {
    lwip_stats.udp.lenerr = lwip_stats.udp.lenerr + 1;
    lwip_stats.udp.drop = lwip_stats.udp.drop + 1;
  }
  else {
    puVar11 = (u16_t *)p->payload;
    uVar3 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,ip_data.current_netif);
    _uVar3 = CONCAT31(extraout_var,uVar3);
    uVar4 = lwip_htons(*puVar11);
    uVar5 = lwip_htons(puVar11[1]);
    puVar1 = udp_pcbs;
    puVar9 = (udp_pcb *)0x0;
    puVar2 = udp_pcbs;
    puVar8 = (udp_pcb *)0x0;
    while (puVar10 = puVar2, puVar10 != (udp_pcb *)0x0) {
      if (((uint)puVar10->local_port == CONCAT22(extraout_var_02,uVar5)) &&
         ((puVar10->netif_idx == '\0' ||
          (puVar10->netif_idx == (u8_t)((ip_data.current_input_netif)->num + '\x01'))))) {
        uVar7 = (puVar10->local_ip).addr;
        if (_uVar3 == 0) {
          if ((uVar7 == 0) || (uVar7 == ip_data.current_iphdr_dest)) goto LAB_230454fc;
        }
        else {
          if ((uVar7 == 0) ||
             ((ip_data.current_iphdr_dest == 0xffffffff ||
              (((uVar7 ^ ip_data.current_iphdr_dest) & (inp->netmask).addr) == 0)))) {
LAB_230454fc:
            if ((puVar10->flags & 4) != 0) goto LAB_23045532;
            if (puVar9 == (udp_pcb *)0x0) {
LAB_23045520:
              puVar9 = puVar10;
            }
            else {
              if ((_uVar3 == 0) || (ip_data.current_iphdr_dest != 0xffffffff)) {
                if (uVar7 != 0) goto LAB_23045520;
              }
              else {
                uVar6 = (inp->ip_addr).addr;
                if (((puVar9->local_ip).addr != uVar6) && (uVar6 == uVar7)) goto LAB_23045520;
              }
            }
LAB_23045532:
            if (((uint)puVar10->remote_port == CONCAT22(extraout_var_01,uVar4)) &&
               ((uVar6 = (puVar10->remote_ip).addr, uVar6 == 0 ||
                (uVar6 == ip_data.current_iphdr_src)))) {
              if (puVar8 == (udp_pcb *)0x0) {
                lwip_stats.udp.cachehit = lwip_stats.udp.cachehit + 1;
              }
              else {
                udp_pcbs = puVar10;
                puVar8->next = puVar10->next;
                puVar10->next = puVar1;
              }
              goto LAB_23045556;
            }
          }
        }
      }
      puVar2 = puVar10->next;
      puVar8 = puVar10;
    }
    puVar10 = puVar9;
    if ((puVar9 != (udp_pcb *)0x0) || ((inp->ip_addr).addr == ip_data.current_iphdr_dest)) {
LAB_23045556:
      if ((puVar11[3] == 0) ||
         (uVar5 = ip_chksum_pseudo(p,'\x11',p->tot_len,(ip4_addr_t *)&ip_data.current_iphdr_src,
                                   (ip4_addr_t *)&ip_data.current_iphdr_dest),
         CONCAT22(extraout_var_03,uVar5) == 0)) {
        uVar3 = pbuf_remove_header(p,8);
        if (CONCAT31(extraout_var_00,uVar3) == 0) {
          if (puVar10 != (udp_pcb *)0x0) {
            if (puVar10->recv != (udp_recv_fn *)0x0) {
                    // WARNING: Could not recover jumptable at 0x230455e0. Too many branches
                    // WARNING: Treating indirect jump as call
              (*puVar10->recv)(puVar10->recv_arg,puVar10,p,(ip_addr_t *)0x4201fed0,uVar4);
              return;
            }
            goto LAB_23045438;
          }
          if ((_uVar3 == 0) && ((ip_data.current_iphdr_dest & 0xf0) != 0xe0)) {
            pbuf_header_force(p,(s16_t)(((uint)ip_data.current_ip_header_tot_len + 8) * 0x10000 >>
                                       0x10));
            icmp_dest_unreach(p,ICMP_DUR_PORT);
          }
          lwip_stats.udp.proterr = lwip_stats.udp.proterr + 1;
        }
      }
      else {
        lwip_stats.udp.chkerr = lwip_stats.udp.chkerr + 1;
      }
      lwip_stats.udp.drop = lwip_stats.udp.drop + 1;
    }
  }
LAB_23045438:
  pbuf_free(p);
  return;
}



err_t udp_bind(udp_pcb *pcb,ip_addr_t *ipaddr,u16_t port)

{
  bool bVar1;
  err_t eVar2;
  undefined2 in_register_00002032;
  u32_t uVar3;
  udp_pcb *puVar4;
  short sVar5;
  
  if (ipaddr == (ip_addr_t *)0x0) {
    ipaddr = &ip_addr_any;
  }
  eVar2 = -0x10;
  puVar4 = udp_pcbs;
  if (pcb != (udp_pcb *)0x0) {
    while (puVar4 != (udp_pcb *)0x0) {
      if (puVar4 == pcb) {
        bVar1 = true;
        goto LAB_23045638;
      }
      puVar4 = puVar4->next;
    }
    bVar1 = false;
LAB_23045638:
    puVar4 = udp_pcbs;
    if (CONCAT22(in_register_00002032,port) == 0) {
      sVar5 = 0x4000;
      do {
        puVar4 = udp_pcbs;
        if (udp_port == 0xffff) {
          port = 0xc000;
        }
        else {
          port = udp_port + 1;
        }
        while( true ) {
          udp_port = port;
          if (puVar4 == (udp_pcb *)0x0) goto LAB_23045660;
          if (puVar4->local_port == port) break;
          puVar4 = puVar4->next;
        }
        sVar5 = sVar5 + -1;
        if (sVar5 == 0) {
          return -8;
        }
      } while( true );
    }
    while (puVar4 != (udp_pcb *)0x0) {
      if ((puVar4 != pcb) &&
         ((((pcb->so_options & 4) == 0 || ((puVar4->so_options & 4) == 0)) &&
          ((uint)puVar4->local_port == CONCAT22(in_register_00002032,port))))) {
        uVar3 = (puVar4->local_ip).addr;
        if (uVar3 == ipaddr->addr) {
          return -8;
        }
        if (ipaddr->addr == 0) {
          return -8;
        }
        if (uVar3 == 0) {
          return -8;
        }
      }
      puVar4 = puVar4->next;
    }
LAB_23045660:
    uVar3 = ipaddr->addr;
    pcb->local_port = port;
    (pcb->local_ip).addr = uVar3;
    if (!bVar1) {
      puVar4 = pcb;
      pcb->next = udp_pcbs;
      udp_pcbs = puVar4;
    }
    eVar2 = '\0';
  }
  return eVar2;
}



