pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t udp_sendto_if_src_chksum
                (udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port,netif *netif,u8_t have_chksum
                ,u16_t chksum,ip_addr_t *src_ip)

{
  u8_t ttl;
  err_t eVar1;
  u16_t uVar2;
  undefined2 uVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  pbuf *h;
  undefined2 extraout_var_01;
  uint uVar4;
  undefined2 extraout_var_02;
  undefined3 in_register_0000203d;
  undefined *puVar5;
  
  if (pcb == (udp_pcb *)0x0) {
    return -0x10;
  }
  if (p == (pbuf *)0x0) {
    return -0x10;
  }
  if (dst_ip == (ip_addr_t *)0x0) {
    return -0x10;
  }
  if (src_ip == (ip_addr_t *)0x0) {
    return -0x10;
  }
  if (netif == (netif *)0x0) {
    return -0x10;
  }
  if ((pcb->local_port == 0) &&
     (eVar1 = udp_bind(pcb,(ip_addr_t *)pcb,0), CONCAT31(extraout_var,eVar1) != 0)) {
    return eVar1;
  }
  if (p->tot_len < 0xfff8) {
    ttl = pbuf_add_header(p,8);
    h = p;
    if (CONCAT31(extraout_var_00,ttl) != 0) {
      h = pbuf_alloc(PBUF_IP,8,PBUF_RAM);
      if (h == (pbuf *)0x0) goto LAB_23045726;
      if (p->tot_len != 0) {
        pbuf_chain(h,p);
      }
    }
    puVar5 = (undefined *)h->payload;
    uVar2 = lwip_htons(pcb->local_port);
    *puVar5 = (char)uVar2;
    puVar5[1] = (char)(uVar2 >> 8);
    uVar2 = lwip_htons(dst_port);
    puVar5[2] = (char)uVar2;
    puVar5[3] = (char)(uVar2 >> 8);
    puVar5[6] = 0;
    puVar5[7] = 0;
    if (((pcb->flags & 8) != 0) && ((dst_ip->addr & 0xf0) == 0xe0)) {
      h->flags = h->flags | 4;
    }
    uVar2 = lwip_htons(h->tot_len);
    puVar5[4] = (char)uVar2;
    puVar5[5] = (char)(uVar2 >> 8);
    if ((pcb->flags & 1) == 0) {
      if (CONCAT31(in_register_0000203d,have_chksum) == 0) {
        uVar2 = ip_chksum_pseudo(h,'\x11',h->tot_len,(ip4_addr_t *)src_ip,(ip4_addr_t *)dst_ip);
        uVar4 = CONCAT22(extraout_var_02,uVar2);
      }
      else {
        uVar2 = ip_chksum_pseudo_partial
                          (h,'\x11',h->tot_len,8,(ip4_addr_t *)src_ip,(ip4_addr_t *)dst_ip);
        uVar4 = CONCAT22(extraout_var_01,uVar2) + (~(uint)chksum & 0xffff);
        uVar4 = uVar4 + (uVar4 >> 0x10) & 0xffff;
      }
      uVar3 = (undefined2)uVar4;
      if (uVar4 == 0) {
        uVar3 = 0xffff;
      }
      puVar5[6] = (char)uVar3;
      puVar5[7] = (char)((ushort)uVar3 >> 8);
    }
    if ((dst_ip->addr & 0xf0) == 0xe0) {
      ttl = pcb->mcast_ttl;
    }
    else {
      ttl = pcb->ttl;
    }
    eVar1 = ip4_output_if_src(h,(ip4_addr_t *)src_ip,(ip4_addr_t *)dst_ip,ttl,pcb->tos,'\x11',netif)
    ;
    if (h != p) {
      pbuf_free(h);
    }
    lwip_stats.udp.xmit = lwip_stats.udp.xmit + 1;
  }
  else {
LAB_23045726:
    eVar1 = -1;
  }
  return eVar1;
}



err_t udp_sendto_if_chksum
                (udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port,netif *netif,u8_t have_chksum
                ,u16_t chksum)

{
  err_t eVar1;
  uint uVar2;
  udp_pcb *src_ip;
  
  if ((((pcb != (udp_pcb *)0x0) && (p != (pbuf *)0x0)) && (dst_ip != (ip_addr_t *)0x0)) &&
     (netif != (netif *)0x0)) {
    uVar2 = (pcb->local_ip).addr;
    if ((uVar2 == 0) || ((uVar2 & 0xf0) == 0xe0)) {
      src_ip = (udp_pcb *)&netif->ip_addr;
    }
    else {
      src_ip = pcb;
      if (uVar2 != (netif->ip_addr).addr) {
        return -4;
      }
    }
    eVar1 = udp_sendto_if_src_chksum
                      (pcb,p,dst_ip,dst_port,netif,have_chksum,chksum,(ip_addr_t *)src_ip);
    return eVar1;
  }
  return -0x10;
}



err_t udp_sendto_chksum(udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port,u8_t have_chksum,
                       u16_t chksum)

{
  err_t eVar1;
  netif *netif;
  u32_t uVar2;
  
  if (((pcb == (udp_pcb *)0x0) || (p == (pbuf *)0x0)) || (dst_ip == (ip_addr_t *)0x0)) {
    return -0x10;
  }
  if (pcb->netif_idx == '\0') {
    if ((dst_ip->addr & 0xf0) == 0xe0) {
      if (pcb->mcast_ifindex == '\0') {
        uVar2 = (pcb->mcast_ip4).addr;
        if ((uVar2 == 0) || (uVar2 == 0xffffffff)) goto LAB_2304591a;
        netif = ip4_route(&pcb->mcast_ip4);
      }
      else {
        netif = netif_get_by_index(pcb->mcast_ifindex);
      }
      if (netif != (netif *)0x0) goto LAB_2304592e;
    }
LAB_2304591a:
    netif = ip4_route((ip4_addr_t *)dst_ip);
  }
  else {
    netif = netif_get_by_index(pcb->netif_idx);
  }
  if (netif == (netif *)0x0) {
    lwip_stats.udp.rterr = lwip_stats.udp.rterr + 1;
    return -4;
  }
LAB_2304592e:
  eVar1 = udp_sendto_if_chksum(pcb,p,dst_ip,dst_port,netif,have_chksum,chksum);
  return eVar1;
}



err_t udp_send_chksum(udp_pcb *pcb,pbuf *p,u8_t have_chksum,u16_t chksum)

{
  err_t eVar1;
  
  if ((pcb != (udp_pcb *)0x0) && (p != (pbuf *)0x0)) {
    eVar1 = udp_sendto_chksum(pcb,p,&pcb->remote_ip,pcb->remote_port,have_chksum,chksum);
    return eVar1;
  }
  return -0x10;
}



err_t udp_sendto(udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port)

{
  err_t eVar1;
  
  eVar1 = udp_sendto_chksum(pcb,p,dst_ip,dst_port,'\0',0);
  return eVar1;
}



err_t udp_sendto_if(udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port,netif *netif)

{
  err_t eVar1;
  
  eVar1 = udp_sendto_if_chksum(pcb,p,dst_ip,dst_port,netif,'\0',0);
  return eVar1;
}



err_t udp_sendto_if_src(udp_pcb *pcb,pbuf *p,ip_addr_t *dst_ip,u16_t dst_port,netif *netif,
                       ip_addr_t *src_ip)

{
  err_t eVar1;
  
  eVar1 = udp_sendto_if_src_chksum(pcb,p,dst_ip,dst_port,netif,'\0',0,src_ip);
  return eVar1;
}



void udp_bind_netif(udp_pcb *pcb,netif *netif)

{
  u8_t uVar1;
  
  uVar1 = '\0';
  if (netif != (netif *)0x0) {
    uVar1 = netif->num + '\x01';
  }
  pcb->netif_idx = uVar1;
  return;
}



err_t udp_connect(udp_pcb *pcb,ip_addr_t *ipaddr,u16_t port)

{
  err_t eVar1;
  undefined3 extraout_var;
  udp_pcb *puVar2;
  u32_t uVar3;
  
  if ((pcb == (udp_pcb *)0x0) || (ipaddr == (ip_addr_t *)0x0)) {
    return -0x10;
  }
  if ((pcb->local_port != 0) ||
     (eVar1 = udp_bind(pcb,(ip_addr_t *)pcb,0), CONCAT31(extraout_var,eVar1) == 0)) {
    uVar3 = ipaddr->addr;
    pcb->remote_port = port;
    (pcb->remote_ip).addr = uVar3;
    pcb->flags = pcb->flags | 4;
    puVar2 = udp_pcbs;
    while (puVar2 != (udp_pcb *)0x0) {
      if (puVar2 == pcb) goto LAB_230459f6;
      puVar2 = puVar2->next;
    }
    pcb->next = udp_pcbs;
    udp_pcbs = pcb;
LAB_230459f6:
    eVar1 = '\0';
  }
  return eVar1;
}



