pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void udp_disconnect(udp_pcb *pcb)

{
  byte bVar1;
  
  if (pcb != (udp_pcb *)0x0) {
    bVar1 = pcb->flags;
    (pcb->remote_ip).addr = 0;
    pcb->remote_port = 0;
    pcb->netif_idx = '\0';
    pcb->flags = bVar1 & 0xfb;
  }
  return;
}



void udp_recv(udp_pcb *pcb,udp_recv_fn *recv,void *recv_arg)

{
  if (pcb != (udp_pcb *)0x0) {
    pcb->recv = recv;
    pcb->recv_arg = recv_arg;
  }
  return;
}



void udp_remove(udp_pcb *pcb)

{
  udp_pcb *puVar1;
  udp_pcb *puVar2;
  
  if (pcb == (udp_pcb *)0x0) {
    return;
  }
  puVar1 = udp_pcbs;
  if (udp_pcbs == pcb) {
    udp_pcbs = pcb->next;
  }
  else {
    do {
      puVar2 = puVar1;
      if ((puVar2 == (udp_pcb *)0x0) || (puVar1 = puVar2->next, puVar1 == (udp_pcb *)0x0))
      goto LAB_23045a58;
    } while (puVar1 != pcb);
    puVar2->next = pcb->next;
  }
LAB_23045a58:
  memp_free(MEMP_UDP_PCB,pcb);
  return;
}



udp_pcb * udp_new(void)

{
  udp_pcb *__s;
  
  __s = (udp_pcb *)memp_malloc(MEMP_UDP_PCB);
  if (__s != (udp_pcb *)0x0) {
    memset(__s,0,0x28);
    __s->ttl = -1;
    __s->mcast_ttl = -1;
  }
  return __s;
}



udp_pcb * udp_new_ip_type(void)

{
  udp_pcb *__s;
  
  __s = (udp_pcb *)memp_malloc(MEMP_UDP_PCB);
  if (__s != (udp_pcb *)0x0) {
    memset(__s,0,0x28);
    __s->ttl = -1;
    __s->mcast_ttl = -1;
  }
  return __s;
}



void udp_netif_ip_addr_changed(ip_addr_t *old_addr,ip_addr_t *new_addr)

{
  udp_pcb *puVar1;
  
  if ((((old_addr != (ip_addr_t *)0x0) && (old_addr->addr != 0)) && (new_addr != (ip_addr_t *)0x0))
     && (puVar1 = udp_pcbs, new_addr->addr != 0)) {
    while (puVar1 != (udp_pcb *)0x0) {
      if ((puVar1->local_ip).addr == old_addr->addr) {
        (puVar1->local_ip).addr = new_addr->addr;
      }
      puVar1 = puVar1->next;
    }
  }
  return;
}



udp_pcb * udp_get_pcbs(void)

{
  return udp_pcbs;
}



err_t ethernet_input(pbuf *p,netif *netif)

{
  short sVar1;
  u8_t uVar2;
  byte *__s1;
  undefined3 extraout_var;
  int iVar3;
  undefined3 extraout_var_00;
  byte bVar4;
  
  if (p->len < 0xf) {
LAB_23045aec:
    lwip_stats.etharp.proterr = lwip_stats.etharp.proterr + 1;
  }
  else {
    if (p->if_idx == '\0') {
      p->if_idx = netif->num + '\x01';
    }
    __s1 = (byte *)p->payload;
    sVar1 = *(short *)(__s1 + 0xc);
    if ((*__s1 & 1) != 0) {
      if (*__s1 == 1) {
        if ((__s1[1] == 0) && (__s1[2] == 0x5e)) {
          bVar4 = p->flags | 0x10;
LAB_23045b4a:
          p->flags = bVar4;
        }
      }
      else {
        iVar3 = memcmp(__s1,&ethbroadcast,6);
        if (iVar3 == 0) {
          bVar4 = p->flags | 8;
          goto LAB_23045b4a;
        }
      }
    }
    if (sVar1 == 8) {
      if (((netif->flags & 8) != 0) &&
         (uVar2 = pbuf_remove_header(p,0xe), CONCAT31(extraout_var_00,uVar2) == 0)) {
        ip4_input(p,netif);
        return '\0';
      }
      goto free_and_return;
    }
    if (sVar1 != 0x608) goto LAB_23045aec;
    if ((netif->flags & 8) == 0) goto free_and_return;
    uVar2 = pbuf_remove_header(p,0xe);
    if (CONCAT31(extraout_var,uVar2) == 0) {
      etharp_input(p,netif);
      return '\0';
    }
    lwip_stats.etharp.lenerr = lwip_stats.etharp.lenerr + 1;
  }
  lwip_stats.etharp.drop = lwip_stats.etharp.drop + 1;
free_and_return:
  pbuf_free(p);
  return '\0';
}



err_t ethernet_output(netif *netif,pbuf *p,eth_addr *src,eth_addr *dst,u16_t eth_type)

{
  void *__dest;
  u8_t uVar1;
  err_t eVar2;
  u16_t uVar3;
  undefined3 extraout_var;
  
  uVar3 = lwip_htons(eth_type);
  uVar1 = pbuf_add_header(p,0xe);
  if (CONCAT31(extraout_var,uVar1) == 0) {
    __dest = p->payload;
    *(undefined *)((int)__dest + 0xc) = (char)uVar3;
    *(undefined *)((int)__dest + 0xd) = (char)(uVar3 >> 8);
    memcpy(__dest,dst,6);
    memcpy((void *)((int)__dest + 6),src,6);
                    // WARNING: Could not recover jumptable at 0x23045c42. Too many branches
                    // WARNING: Treating indirect jump as call
    eVar2 = (*netif->linkoutput)(netif,p);
    return eVar2;
  }
  lwip_stats.link.lenerr = lwip_stats.link.lenerr + 1;
  return -2;
}



err_t netconn_apimsg(tcpip_callback_fn_conflict *fn,api_msg *apimsg)

{
  err_t eVar1;
  undefined3 extraout_var;
  
  eVar1 = tcpip_send_msg_wait_sem((tcpip_callback_fn)fn,apimsg,&apimsg->conn->op_completed);
  if (CONCAT31(extraout_var,eVar1) == 0) {
    eVar1 = apimsg->err;
  }
  return eVar1;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_close_shutdown(netconn *conn,u8_t how)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    pnStack52 = conn;
    msg.err = how;
    msg.msg._0_4_ = sys_now();
    eVar1 = netconn_apimsg(lwip_netconn_do_close,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Variable defined which should be unmapped: msg

netconn * netconn_new_with_proto_and_callback(netconn_type t,u8_t proto,netconn_callback *callback)

{
  err_t eVar1;
  netconn *mem;
  undefined3 extraout_var;
  netconn *pnStack52;
  api_msg msg;
  
  mem = netconn_alloc(t,callback);
  if (mem != (netconn *)0x0) {
    pnStack52 = mem;
    msg.err = proto;
    eVar1 = netconn_apimsg(lwip_netconn_do_newconn,(api_msg *)&pnStack52);
    if (CONCAT31(extraout_var,eVar1) != 0) {
      sys_mbox_valid(&mem->recvmbox);
      sys_mbox_valid(&mem->acceptmbox);
      sys_sem_valid(&mem->op_completed);
      sys_sem_free(&mem->op_completed);
      sys_mbox_free(&mem->recvmbox);
      memp_free(MEMP_NETCONN,mem);
      mem = (netconn *)0x0;
    }
  }
  return mem;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_prepare_delete(netconn *conn)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    pnStack52 = conn;
    msg.msg._0_4_ = sys_now();
    eVar1 = netconn_apimsg(lwip_netconn_do_delconn,(api_msg *)&pnStack52);
    return eVar1;
  }
  return '\0';
}



err_t netconn_delete(netconn *conn)

{
  err_t eVar1;
  undefined3 extraout_var;
  
  eVar1 = '\0';
  if ((conn != (netconn *)0x0) &&
     (eVar1 = netconn_prepare_delete(conn), CONCAT31(extraout_var,eVar1) == 0)) {
    netconn_free(conn);
  }
  return eVar1;
}



