pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

err_t netconn_getaddr(netconn *conn,ip_addr_t *addr,u16_t *port,u8_t local)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn == (netconn *)0x0) {
    return -0x10;
  }
  if ((addr != (ip_addr_t *)0x0) && (port != (u16_t *)0x0)) {
    pnStack52 = conn;
    msg._4_4_ = addr;
    msg.msg._0_4_ = port;
    msg.msg[4] = local;
    eVar1 = netconn_apimsg(lwip_netconn_do_getaddr,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_bind(netconn *conn,ip_addr_t *addr,u16_t port)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    if (addr == (ip_addr_t *)0x0) {
      addr = &ip_addr_any;
    }
    pnStack52 = conn;
    msg._4_4_ = addr;
    msg.msg._0_2_ = port;
    eVar1 = netconn_apimsg(lwip_netconn_do_bind,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_connect(netconn *conn,ip_addr_t *addr,u16_t port)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    if (addr == (ip_addr_t *)0x0) {
      addr = &ip_addr_any;
    }
    pnStack52 = conn;
    msg._4_4_ = addr;
    msg.msg._0_2_ = port;
    eVar1 = netconn_apimsg(lwip_netconn_do_connect,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



err_t netconn_disconnect(netconn *conn)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    pnStack52 = conn;
    eVar1 = netconn_apimsg(lwip_netconn_do_disconnect,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



err_t netconn_listen_with_backlog(netconn *conn,u8_t backlog)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    pnStack52 = conn;
    eVar1 = netconn_apimsg(lwip_netconn_do_listen,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_tcp_recvd(netconn *conn,size_t len)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn == (netconn *)0x0) {
    return -0x10;
  }
  if ((conn->type & 0xf0) == NETCONN_TCP) {
    pnStack52 = conn;
    msg._4_4_ = len;
    eVar1 = netconn_apimsg(lwip_netconn_do_recv,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_send(netconn *conn,netbuf *buf)

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    pnStack52 = conn;
    msg._4_4_ = buf;
    eVar1 = netconn_apimsg(lwip_netconn_do_send,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_write_vectors_partly
                (netconn *conn,netvector *vectors,u16_t vectorcnt,u8_t apiflags,
                size_t *bytes_written)

{
  err_t eVar1;
  int iVar2;
  undefined3 extraout_var;
  undefined2 in_register_00002032;
  size_t *psVar3;
  uint uVar4;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn == (netconn *)0x0) {
    return -0x10;
  }
  eVar1 = -6;
  if ((conn->type & 0xf0) == NETCONN_TCP) {
    if ((((uint)((conn->flags & 2 | apiflags & 4) != 0) | conn->send_timeout) != 0) &&
       (bytes_written == (size_t *)0x0)) {
      return -6;
    }
    psVar3 = &vectors->len;
    iVar2 = 0;
    msg.msg._8_4_ = 0;
    while (iVar2 < CONCAT22(in_register_00002032,vectorcnt)) {
      uVar4 = *psVar3;
      psVar3 = psVar3 + 2;
      msg.msg._8_4_ = msg.msg._8_4_ + uVar4;
      if (msg.msg._8_4_ < uVar4) {
        return -6;
      }
      iVar2 = iVar2 + 1;
    }
    if (msg.msg._8_4_ != 0) {
      if ((int)msg.msg._8_4_ < 0) {
        if (bytes_written == (size_t *)0x0) {
          return -6;
        }
        msg.msg._8_4_ = 0x7fffffff;
      }
      msg.msg._4_4_ = 0;
      msg.msg._12_4_ = 0;
      pnStack52 = conn;
      msg._4_4_ = vectors;
      msg.msg._0_2_ = vectorcnt;
      msg.msg[16] = apiflags;
      if (conn->send_timeout == 0) {
        msg.msg._20_4_ = 0;
      }
      else {
        msg.msg._20_4_ = sys_now();
      }
      eVar1 = netconn_apimsg(lwip_netconn_do_write,(api_msg *)&pnStack52);
      if (CONCAT31(extraout_var,eVar1) == 0) {
        if (bytes_written == (size_t *)0x0) {
          eVar1 = '\0';
        }
        else {
          *bytes_written = msg.msg._12_4_;
        }
      }
      return eVar1;
    }
    eVar1 = '\0';
  }
  return eVar1;
}



err_t netconn_write_partly
                (netconn *conn,void *dataptr,size_t size,u8_t apiflags,size_t *bytes_written)

{
  err_t eVar1;
  void *pvStack24;
  netvector vector;
  
  pvStack24 = dataptr;
  vector.ptr = (void *)size;
  eVar1 = netconn_write_vectors_partly(conn,(netvector *)&pvStack24,1,apiflags,bytes_written);
  return eVar1;
}



err_t netconn_err(netconn *conn)

{
  err_t eVar1;
  
  eVar1 = '\0';
  if (conn != (netconn *)0x0) {
    sys_arch_protect();
    eVar1 = conn->pending_err;
    conn->pending_err = '\0';
    sys_arch_unprotect();
  }
  return eVar1;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_accept(netconn *conn,netconn **new_conn)

{
  err_t eVar1;
  undefined3 extraout_var;
  int iVar2;
  u32_t uVar3;
  sys_mbox_t *mbox;
  err_t eStack37;
  err_t err;
  netconn *pnStack36;
  void *accept_ptr;
  
  if ((new_conn == (netconn **)0x0) || (*new_conn = (netconn *)0x0, conn == (netconn *)0x0)) {
    eVar1 = -0x10;
  }
  else {
    eVar1 = netconn_err(conn);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      mbox = &conn->acceptmbox;
      eStack37 = eVar1;
      iVar2 = sys_mbox_valid(mbox);
      if ((iVar2 != 0) && ((conn->flags & 1) == 0)) {
        if ((conn->flags & 2) == 0) {
          uVar3 = sys_arch_mbox_fetch(mbox,(void **)&stack0xffffffdc,conn->recv_timeout);
          if (uVar3 == 0xffffffff) {
            return -3;
          }
        }
        else {
          uVar3 = sys_arch_mbox_tryfetch(mbox,(void **)&stack0xffffffdc);
          if (uVar3 == 0xffffffff) {
            return -7;
          }
        }
        if (conn->callback != (netconn_callback *)0x0) {
          (*conn->callback)(conn,NETCONN_EVT_RCVMINUS,0);
        }
        iVar2 = lwip_netconn_is_err_msg(pnStack36,&eStack37);
        if (iVar2 != 0) {
          return eStack37;
        }
        if (pnStack36 != (netconn *)0x0) {
          *new_conn = pnStack36;
          return eVar1;
        }
      }
      eVar1 = -0xf;
    }
  }
  return eVar1;
}



