pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

err_t netconn_recv_data(netconn *conn,void **new_buf,u8_t apiflags)

{
  err_t eVar1;
  int iVar2;
  undefined3 extraout_var;
  u32_t uVar3;
  undefined3 extraout_var_00;
  void **ppvVar4;
  sys_mbox_t *mbox;
  err_t eStack37;
  err_t err;
  void **msg;
  void *buf;
  
  msg = (void **)0x0;
  if ((new_buf == (void **)0x0) || (*new_buf = (void *)0x0, conn == (netconn *)0x0)) {
    return -0x10;
  }
  mbox = &conn->recvmbox;
  iVar2 = sys_mbox_valid(mbox);
  if (iVar2 == 0) {
    eVar1 = netconn_err(conn);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      return -0xb;
    }
    return eVar1;
  }
  if (((apiflags & 4 | conn->flags & 3) == 0) && (conn->pending_err == '\0')) {
    uVar3 = sys_arch_mbox_fetch(mbox,(void **)&stack0xffffffdc,conn->recv_timeout);
    if (uVar3 == 0xffffffff) {
      return -3;
    }
  }
  else {
    uVar3 = sys_arch_mbox_tryfetch(mbox,(void **)&stack0xffffffdc);
    if (uVar3 == 0xffffffff) {
      eVar1 = netconn_err(conn);
      if (CONCAT31(extraout_var_00,eVar1) != 0) {
        return eVar1;
      }
      if ((conn->flags & 1) != 0) {
        return -0xb;
      }
      return -7;
    }
  }
  if ((conn->type & 0xf0) == NETCONN_TCP) {
    iVar2 = lwip_netconn_is_err_msg(msg,&eStack37);
    ppvVar4 = msg;
    if (iVar2 != 0) {
      if (eStack37 == -0xf) {
        return '\0';
      }
      return eStack37;
    }
  }
  else {
    ppvVar4 = (void **)*msg;
  }
  if (conn->callback != (netconn_callback *)0x0) {
    (*conn->callback)(conn,NETCONN_EVT_RCVMINUS,*(u16_t *)(ppvVar4 + 2));
  }
  *(void ***)new_buf = msg;
  return '\0';
}



err_t netconn_recv_udp_raw_netbuf_flags(netconn *conn,netbuf **new_buf,u8_t apiflags)

{
  err_t eVar1;
  
  if ((conn != (netconn *)0x0) && ((conn->type & 0xf0) != NETCONN_TCP)) {
    eVar1 = netconn_recv_data(conn,new_buf,apiflags);
    return eVar1;
  }
  return -0x10;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_recv_data_tcp(netconn *conn,pbuf **new_buf,u8_t apiflags)

{
  err_t eVar1;
  int iVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint uVar3;
  pbuf *ppVar4;
  netconn *pnStack68;
  api_msg msg;
  
  iVar2 = sys_mbox_valid(&conn->recvmbox);
  if (iVar2 == 0) {
    return -0xb;
  }
  if ((char)conn->flags < '\0') {
    conn->flags = conn->flags & 0x7f;
  }
  else {
    eVar1 = netconn_recv_data(conn,new_buf,apiflags);
    if (CONCAT31(extraout_var_00,eVar1) != 0) {
      return eVar1;
    }
    ppVar4 = *new_buf;
    if ((apiflags & 8) == 0) {
      uVar3 = 1;
      if (ppVar4 != (pbuf *)0x0) {
        uVar3 = (uint)ppVar4->tot_len;
      }
      if ((conn->type & 0xf0) == NETCONN_TCP) {
        pnStack68 = conn;
        msg._4_4_ = uVar3;
        netconn_apimsg(lwip_netconn_do_recv,(api_msg *)&pnStack68);
      }
    }
    if (ppVar4 != (pbuf *)0x0) {
      return eVar1;
    }
    if ((apiflags & 0x10) != 0) {
      conn->flags = conn->flags | 0x80;
      return -7;
    }
  }
  if (conn->callback != (netconn_callback *)0x0) {
    (*conn->callback)(conn,NETCONN_EVT_RCVMINUS,0);
  }
  if (conn->pcb == 0) {
    eVar1 = netconn_err(conn);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      eVar1 = -0xe;
    }
  }
  else {
    netconn_close_shutdown(conn,'\x01');
    eVar1 = -0xf;
  }
  return eVar1;
}



err_t netconn_recv_tcp_pbuf_flags(netconn *conn,pbuf **new_buf,u8_t apiflags)

{
  err_t eVar1;
  
  if ((conn != (netconn *)0x0) && ((conn->type & 0xf0) == NETCONN_TCP)) {
    eVar1 = netconn_recv_data_tcp(conn,new_buf,apiflags);
    return eVar1;
  }
  return -0x10;
}



err_t netconn_shutdown(netconn *conn,u8_t shut_rx,u8_t shut_tx)

{
  err_t eVar1;
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  
  eVar1 = netconn_close_shutdown
                    (conn,CONCAT31(in_register_0000202d,shut_rx) != 0 |
                          (CONCAT31(in_register_00002031,shut_tx) != 0) << 1);
  return eVar1;
}



// WARNING: Could not reconcile some variable overlaps

err_t netconn_join_leave_group
                (netconn *conn,ip_addr_t *multiaddr,ip_addr_t *netif_addr,netconn_igmp join_or_leave
                )

{
  err_t eVar1;
  netconn *pnStack52;
  api_msg msg;
  
  if (conn != (netconn *)0x0) {
    if (multiaddr == (ip_addr_t *)0x0) {
      multiaddr = &ip_addr_any;
    }
    if (netif_addr == (ip_addr_t *)0x0) {
      netif_addr = &ip_addr_any;
    }
    pnStack52 = conn;
    msg._4_4_ = multiaddr;
    msg.msg._0_4_ = netif_addr;
    msg.msg[5] = join_or_leave;
    eVar1 = netconn_apimsg(lwip_netconn_do_join_leave_group,(api_msg *)&pnStack52);
    return eVar1;
  }
  return -0x10;
}



err_t netconn_gethostbyname(char *name,ip_addr_t *addr)

{
  err_t eVar1;
  err_t eVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined auStack36 [3];
  err_t err;
  sys_sem_t sem;
  dns_api_msg msg;
  
  eVar2 = -0x10;
  if ((name != (char *)0x0) && (addr != (ip_addr_t *)0x0)) {
    sem = (sys_sem_t)name;
    eVar1 = sys_sem_new((sys_sem_t *)auStack36,'\0');
    eVar2 = eVar1;
    if (CONCAT31(extraout_var,eVar1) == 0) {
      eVar2 = tcpip_send_msg_wait_sem(lwip_netconn_do_gethostbyname,&sem,(sys_sem_t *)auStack36);
      sys_sem_free((sys_sem_t *)auStack36);
      if (CONCAT31(extraout_var_00,eVar2) == 0) {
        eVar2 = eVar1;
      }
    }
  }
  return eVar2;
}



void lwip_netconn_do_dns_found(char *name,ip_addr_t *ipaddr,void *arg)

{
  if (ipaddr == (ip_addr_t *)0x0) {
    **(undefined **)((int)arg + 0xc) = 0xfa;
  }
  else {
    **(undefined **)((int)arg + 0xc) = 0;
    **(u32_t **)((int)arg + 4) = ipaddr->addr;
  }
  sys_sem_signal((sys_mutex_t *)*(sys_mutex_t *)((int)arg + 8));
  return;
}



void recv_udp(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  ushort uVar1;
  err_t eVar2;
  int iVar3;
  netbuf *buf;
  undefined3 extraout_var;
  u32_t uVar4;
  
  if (arg != (void *)0x0) {
    iVar3 = sys_mbox_valid((sys_mbox_t *)((int)arg + 0x10));
    if ((iVar3 != 0) && (buf = (netbuf *)memp_malloc(MEMP_NETBUF), buf != (netbuf *)0x0)) {
      buf->p = p;
      buf->ptr = p;
      uVar4 = 0;
      if (addr != (ip_addr_t *)0x0) {
        uVar4 = addr->addr;
      }
      (buf->addr).addr = uVar4;
      buf->port = port;
      uVar1 = p->tot_len;
      eVar2 = sys_mbox_trypost((sys_mbox_t *)((int)arg + 0x10),buf);
      if (CONCAT31(extraout_var,eVar2) != 0) {
        netbuf_delete(buf);
        return;
      }
      if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304635c. Too many branches
                    // WARNING: Treating indirect jump as call
        (**(code **)((int)arg + 0x2c))(arg,0,(uint)uVar1);
        return;
      }
      return;
    }
  }
  pbuf_free(p);
  return;
}



void setup_tcp(netconn *conn)

{
  tcp_pcb *pcb;
  
