pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  pcb = (tcp_pcb *)conn->pcb;
  tcp_arg(pcb,conn);
  tcp_recv(pcb,recv_tcp);
  tcp_sent(pcb,sent_tcp);
  tcp_poll(pcb,poll_tcp,'\x02');
  tcp_err(pcb,err_tcp);
  return;
}



err_t lwip_netconn_do_connected(void *arg,tcp_pcb *pcb,err_t err)

{
  byte bVar1;
  err_t eVar2;
  sys_mutex_t mutex;
  undefined3 in_register_00002031;
  
  eVar2 = -6;
  if (arg != (void *)0x0) {
    mutex = *(sys_mutex_t *)((int)arg + 0x28);
    if (mutex != (sys_mutex_t)0x0) {
      *(err_t *)&mutex->pcWriteTo = err;
      mutex = (sys_mutex_t)(**(int **)((int)arg + 0x28) + 0xc);
    }
    if (((*(byte *)arg & 0xf0) == 0x10) && (CONCAT31(in_register_00002031,err) == 0)) {
      setup_tcp((netconn *)arg);
    }
    bVar1 = *(byte *)((int)arg + 0x24);
    *(undefined4 *)((int)arg + 0x28) = 0;
    *(undefined *)((int)arg + 1) = 0;
    *(byte *)((int)arg + 0x24) = bVar1 & 0xfb;
    if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
      (**(code **)((int)arg + 0x2c))(arg,2,0);
    }
    eVar2 = '\0';
    if ((bVar1 & 4) == 0) {
      sys_sem_signal((sys_mutex_t *)mutex);
    }
  }
  return eVar2;
}



void err_tcp(void *arg,err_t err)

{
  char cVar1;
  byte bVar2;
  sys_sem_t *sem;
  int iVar3;
  uint uVar4;
  void *msg;
  
  sys_arch_protect();
  cVar1 = *(char *)((int)arg + 1);
  *(undefined4 *)((int)arg + 4) = 0;
  *(byte *)((int)arg + 0x24) = *(byte *)((int)arg + 0x24) | 1;
  *(err_t *)((int)arg + 8) = err;
  *(undefined *)((int)arg + 1) = 0;
  sys_arch_unprotect();
  if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
    (**(code **)((int)arg + 0x2c))(arg,4,0);
  }
  if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
    (**(code **)((int)arg + 0x2c))(arg,0,0);
  }
  if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
    (**(code **)((int)arg + 0x2c))(arg,2,0);
  }
  uVar4 = (uint)(byte)err + 0xf & 0xff;
  msg = (void *)0x0;
  if (uVar4 < 3) {
    msg = *(void **)(CSWTCH_13 + uVar4 * 4);
  }
  iVar3 = sys_mbox_valid((sys_mbox_t *)((int)arg + 0x10));
  if (iVar3 != 0) {
    sys_mbox_trypost((sys_mbox_t *)((int)arg + 0x10),msg);
  }
  iVar3 = sys_mbox_valid((sys_mbox_t *)((int)arg + 0x14));
  if (iVar3 != 0) {
    sys_mbox_trypost((sys_mbox_t *)((int)arg + 0x14),msg);
  }
  if (((cVar1 == '\x01') || ((byte)(cVar1 - 3U) < 2)) &&
     (bVar2 = *(byte *)((int)arg + 0x24), *(byte *)((int)arg + 0x24) = bVar2 & 0xfb,
     (bVar2 & 4) == 0)) {
    if (cVar1 == '\x04') {
      err = '\0';
    }
    *(err_t *)(*(int *)((int)arg + 0x28) + 4) = err;
    sem = (sys_sem_t *)(**(int **)((int)arg + 0x28) + 0xc);
    sys_sem_valid(sem);
    *(undefined4 *)((int)arg + 0x28) = 0;
    sys_sem_signal((sys_mutex_t *)sem);
    return;
  }
  return;
}



err_t lwip_netconn_do_writemore(netconn *conn)

{
  ushort uVar1;
  bool bVar2;
  err_t eVar3;
  TickType_t TVar4;
  netconn *pnVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint uVar6;
  api_msg *paVar7;
  int iVar8;
  uint uVar9;
  int iVar10;
  uint uVar11;
  byte apiflags;
  byte bVar12;
  
  apiflags = conn->current_msg->msg[0x14];
  bVar12 = conn->flags & 2 | apiflags & 4;
  if (conn->send_timeout == 0) {
LAB_23046596:
    do {
      paVar7 = conn->current_msg;
      uVar9 = (*(int **)paVar7->msg)[1] - *(int *)(paVar7->msg + 8);
      if (uVar9 < 0x10000) {
        uVar11 = uVar9 & 0xffff;
      }
      else {
        apiflags = apiflags | 2;
        uVar11 = 0xffff;
      }
      uVar1 = ((tcp_pcb *)conn->pcb)->snd_buf;
      uVar6 = (uint)uVar1;
      if (uVar6 < uVar11) {
        if (bVar12 == 0) {
          apiflags = apiflags | 2;
        }
        else {
          if (uVar1 == 0) {
            iVar8 = -7;
            if (*(int *)(paVar7->msg + 0x10) != 0) {
              iVar8 = 0;
            }
            goto LAB_230465ce;
          }
        }
LAB_2304662c:
        bVar2 = false;
        if (((uVar9 & 0xffff) == uVar6) && (1 < *(ushort *)(paVar7->msg + 4))) goto LAB_2304663e;
      }
      else {
        uVar6 = uVar11;
        if ((uVar11 != 0xffff) || (uVar9 < 0x10000)) goto LAB_2304662c;
LAB_2304663e:
        apiflags = apiflags | 2;
        bVar2 = true;
      }
      eVar3 = tcp_write((tcp_pcb *)conn->pcb,
                        (void *)(**(int **)paVar7->msg + *(int *)(paVar7->msg + 8)),(u16_t)uVar6,
                        apiflags);
      iVar8 = CONCAT31(extraout_var_00,eVar3);
      if (iVar8 != 0) {
        if (1 < (iVar8 + 1U & 0xff)) goto LAB_2304657e;
        iVar8 = -1;
        break;
      }
      *(uint *)(conn->current_msg->msg + 0x10) = *(int *)(conn->current_msg->msg + 0x10) + uVar6;
      *(uint *)(conn->current_msg->msg + 8) = uVar6 + *(int *)(conn->current_msg->msg + 8);
      paVar7 = conn->current_msg;
      if (*(int *)(paVar7->msg + 8) == *(int *)(*(int *)paVar7->msg + 4)) {
        *(short *)(paVar7->msg + 4) = *(short *)(paVar7->msg + 4) + -1;
        paVar7 = conn->current_msg;
        if (*(short *)(paVar7->msg + 4) != 0) {
          *(int *)paVar7->msg = *(int *)paVar7->msg + 8;
          *(undefined4 *)(conn->current_msg->msg + 8) = 0;
        }
      }
    } while (bVar2);
    if (bVar12 == 0) {
LAB_230466a6:
      if (((*(ushort *)(conn->pcb + 100) < 0xac1) || (7 < *(ushort *)(conn->pcb + 0x66))) &&
         (conn->callback != (netconn_callback *)0x0)) {
        (*conn->callback)(conn,NETCONN_EVT_SENDMINUS,0);
      }
    }
    else {
LAB_230465ce:
      if (*(uint *)(conn->current_msg->msg + 0xc) <= *(uint *)(conn->current_msg->msg + 0x10))
      goto LAB_230466a6;
      if (conn->callback != (netconn_callback *)0x0) {
        (*conn->callback)(conn,NETCONN_EVT_SENDMINUS,0);
      }
      conn->flags = conn->flags | 0x10;
    }
    eVar3 = (err_t)iVar8;
    if (iVar8 != 0) {
      if (iVar8 != -1) goto LAB_2304657e;
      eVar3 = tcp_output((tcp_pcb *)conn->pcb);
      if (CONCAT31(extraout_var_01,eVar3) == -4) goto LAB_2304660e;
      if (bVar12 == 0) {
        return '\0';
      }
      iVar8 = *(int *)(conn->current_msg->msg + 0x10);
      goto LAB_23046578;
    }
    iVar8 = *(int *)(conn->current_msg->msg + 0x10);
    iVar10 = *(int *)(conn->current_msg->msg + 0xc);
    eVar3 = tcp_output((tcp_pcb *)conn->pcb);
    if (CONCAT31(extraout_var,eVar3) == -4) {
LAB_2304660e:
      eVar3 = -4;
      goto LAB_2304657e;
    }
    if (iVar8 != iVar10 && bVar12 == 0) {
      return '\0';
    }
  }
  else {
    TVar4 = sys_now();
    if ((int)(TVar4 - *(int *)(conn->current_msg->msg + 0x18)) < conn->send_timeout)
    goto LAB_23046596;
    iVar8 = *(int *)(conn->current_msg->msg + 0x10);
LAB_23046578:
    eVar3 = -7;
    if (iVar8 == 0) goto LAB_2304657e;
  }
  eVar3 = '\0';
LAB_2304657e:
  pnVar5 = conn->current_msg->conn;
  conn->current_msg->err = eVar3;
  conn->current_msg = (api_msg *)0x0;
  conn->state = NETCONN_NONE;
  sys_sem_signal((sys_mutex_t *)&pnVar5->op_completed);
  return '\0';
}



err_t lwip_netconn_do_close_internal(netconn *conn)

{
  byte bVar1;
  bool bVar2;
  tcp_pcb *pcb;
  netconn *pnVar3;
  err_t eVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  TickType_t TVar5;
  int iVar6;
  int iVar7;
  
  bVar1 = conn->current_msg->msg[0];
  pcb = (tcp_pcb *)conn->pcb;
  if (((bVar1 == 3) ||
      (((bVar1 & 1) != 0 && (((byte)(pcb->state + ~ESTABLISHED) < 2 || (pcb->state == CLOSING))))))
     || ((bVar2 = false, (bVar1 & 2) != 0 && ((pcb->flags & 0x10) != 0)))) {
    tcp_arg(pcb,(void *)0x0);
    bVar2 = true;
  }
  if (pcb->state == LISTEN) {
    tcp_accept(pcb,(tcp_accept_fn)0x0);
    if (!bVar2) {
LAB_2304677c:
      eVar4 = tcp_shutdown(pcb,(uint)bVar1 & 1,(uint)bVar1 & 2);
      iVar6 = CONCAT31(extraout_var,eVar4);
      goto LAB_230467c4;
    }
  }
  else {
    if ((bVar1 & 1) != 0) {
      tcp_recv(pcb,(tcp_recv_fn *)0x0);
      tcp_accept(pcb,(tcp_accept_fn)0x0);
    }
    if ((bVar1 & 2) != 0) {
      tcp_sent(pcb,(tcp_sent_fn *)0x0);
    }
    if (!bVar2) goto LAB_2304677c;
    tcp_poll(pcb,(tcp_poll_fn *)0x0,'\0');
    tcp_err(pcb,(tcp_err_fn *)0x0);
  }
  eVar4 = tcp_close(pcb);
  iVar6 = CONCAT31(extraout_var_00,eVar4);
LAB_230467c4:
  if ((iVar6 != 0) && (iVar6 == -1)) {
    iVar7 = conn->send_timeout;
    if (iVar7 < 1) {
      iVar7 = 5000;
    }
    TVar5 = sys_now();
    if ((int)(TVar5 - *(int *)(conn->current_msg->msg + 4)) < iVar7) {
      if ((bVar1 & 2) != 0) {
        tcp_sent(pcb,sent_tcp);
      }
      tcp_poll(pcb,poll_tcp,'\x01');
      tcp_err(pcb,err_tcp);
      tcp_arg(pcb,conn);
      return (err_t)iVar6;
    }
    if (bVar2) {
      tcp_abort(pcb);
      iVar6 = 0;
    }
  }
  pnVar3 = conn->current_msg->conn;
  conn->current_msg->err = (err_t)iVar6;
  conn->current_msg = (api_msg *)0x0;
  conn->state = NETCONN_NONE;
  if (iVar6 == 0) {
    if (bVar2) {
      conn->pcb = 0;
      if (conn->callback != (netconn_callback *)0x0) {
        (*conn->callback)(conn,NETCONN_EVT_ERROR,0);
      }
    }
    if (((bVar1 & 1) != 0) && (conn->callback != (netconn_callback *)0x0)) {
      (*conn->callback)(conn,NETCONN_EVT_RCVPLUS,0);
    }
    if (((bVar1 & 2) != 0) && (conn->callback != (netconn_callback *)0x0)) {
      (*conn->callback)(conn,NETCONN_EVT_SENDPLUS,0);
    }
  }
  sys_sem_signal((sys_mutex_t *)&pnVar3->op_completed);
  return '\0';
}



err_t poll_tcp(void *arg,tcp_pcb *pcb)

{
  int iVar1;
  
