pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (*(char *)((int)arg + 1) == '\x01') {
    lwip_netconn_do_writemore((netconn *)arg);
  }
  else {
    if (*(char *)((int)arg + 1) == '\x04') {
      lwip_netconn_do_close_internal((netconn *)arg);
    }
  }
  if (((((*(byte *)((int)arg + 0x24) & 0x10) != 0) && (iVar1 = *(int *)((int)arg + 4), iVar1 != 0))
      && (0xac0 < *(ushort *)(iVar1 + 100))) && (*(ushort *)(iVar1 + 0x66) < 8)) {
    *(byte *)((int)arg + 0x24) = *(byte *)((int)arg + 0x24) & 0xef;
    if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
      (**(code **)((int)arg + 0x2c))(arg,2,0);
    }
  }
  return '\0';
}



u8_t recv_raw(void *arg,raw_pcb *pcb,pbuf *p,ip_addr_t *addr)

{
  ushort uVar1;
  err_t eVar2;
  int iVar3;
  pbuf *p_00;
  netbuf *buf;
  undefined3 extraout_var;
  u16_t len;
  
  if (arg != (void *)0x0) {
    iVar3 = sys_mbox_valid((sys_mbox_t *)((int)arg + 0x10));
    if ((iVar3 != 0) && (p_00 = pbuf_clone(PBUF_RAW,PBUF_RAM,p), p_00 != (pbuf *)0x0)) {
      buf = (netbuf *)memp_malloc(MEMP_NETBUF);
      if (buf == (netbuf *)0x0) {
        pbuf_free(p_00);
      }
      else {
        buf->p = p_00;
        buf->ptr = p_00;
        (buf->addr).addr = ip_data.current_iphdr_src;
        buf->port = (ushort)pcb->protocol;
        uVar1 = p_00->tot_len;
        eVar2 = sys_mbox_trypost((sys_mbox_t *)((int)arg + 0x10),buf);
        if (CONCAT31(extraout_var,eVar2) == 0) {
          if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
            (**(code **)((int)arg + 0x2c))(arg,0,(uint)uVar1);
          }
        }
        else {
          netbuf_delete(buf);
        }
      }
    }
    return '\0';
  }
  return '\0';
}



err_t sent_tcp(void *arg,tcp_pcb *pcb,u16_t len)

{
  undefined2 in_register_00002032;
  int iVar1;
  
  if (arg != (void *)0x0) {
    if (*(char *)((int)arg + 1) == '\x01') {
      lwip_netconn_do_writemore((netconn *)arg);
    }
    else {
      if (*(char *)((int)arg + 1) == '\x04') {
        lwip_netconn_do_close_internal((netconn *)arg);
      }
    }
    iVar1 = *(int *)((int)arg + 4);
    if (((iVar1 != 0) && (0xac0 < *(ushort *)(iVar1 + 100))) && (*(ushort *)(iVar1 + 0x66) < 8)) {
      *(byte *)((int)arg + 0x24) = *(byte *)((int)arg + 0x24) & 0xef;
      if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
        (**(code **)((int)arg + 0x2c))(arg,2,CONCAT22(in_register_00002032,len));
      }
    }
    return '\0';
  }
  return '\0';
}



err_t recv_tcp(void *arg,tcp_pcb *pcb,pbuf *p,err_t err)

{
  err_t eVar1;
  int iVar2;
  undefined3 extraout_var;
  uint uVar3;
  
  if (arg == (void *)0x0) {
    return -6;
  }
  iVar2 = sys_mbox_valid((sys_mbox_t *)((int)arg + 0x10));
  if (iVar2 == 0) {
    if (p != (pbuf *)0x0) {
      tcp_recved(pcb,p->tot_len);
      pbuf_free(p);
    }
  }
  else {
    if (p == (pbuf *)0x0) {
      uVar3 = 0;
      p = (pbuf *)"";
    }
    else {
      uVar3 = (uint)p->tot_len;
    }
    eVar1 = sys_mbox_trypost((sys_mbox_t *)((int)arg + 0x10),p);
    if (CONCAT31(extraout_var,eVar1) != 0) {
      return -1;
    }
    if (*(code **)((int)arg + 0x2c) != (code *)0x0) {
      (**(code **)((int)arg + 0x2c))(arg,0,uVar3);
      return eVar1;
    }
  }
  return '\0';
}



int lwip_netconn_is_err_msg(void *msg,err_t *err)

{
  err_t eVar1;
  
  if ((u8_t *)msg == "") {
    eVar1 = -0xd;
  }
  else {
    if ((u8_t *)msg == "") {
      eVar1 = -0xe;
    }
    else {
      if ((u8_t *)msg != "") {
        return 0;
      }
      eVar1 = -0xf;
    }
  }
  *err = eVar1;
  return 1;
}



void lwip_netconn_do_newconn(void *m)

{
  byte *pbVar1;
  tcp_pcb *ptVar2;
  raw_pcb *pcb;
  udp_pcb *puVar3;
  byte bVar4;
  undefined uVar5;
  int iVar6;
  
  pbVar1 = *(byte **)m;
  *(undefined *)((int)m + 4) = 0;
  if (*(int *)(pbVar1 + 4) != 0) goto LAB_23046b1c;
  bVar4 = *pbVar1 & 0xf0;
  if (bVar4 == 0x20) {
    puVar3 = udp_new_ip_type();
    *(udp_pcb **)(pbVar1 + 4) = puVar3;
    iVar6 = *(int *)(*(char **)m + 4);
    if (iVar6 != 0) {
      if (**(char **)m == '\"') {
        *(undefined *)(iVar6 + 0x10) = 1;
      }
      udp_recv(*(udp_pcb **)((int)*(void **)m + 4),recv_udp,*(void **)m);
LAB_23046b16:
      if (*(int *)(*(int *)m + 4) != 0) goto LAB_23046b1c;
    }
LAB_23046b66:
    uVar5 = 0xff;
  }
  else {
    if (bVar4 == 0x40) {
      pcb = raw_new_ip_type('\0',*(u8_t *)((int)m + 8));
      *(raw_pcb **)(pbVar1 + 4) = pcb;
      pcb = *(raw_pcb **)((int)*(void **)m + 4);
      if (pcb != (raw_pcb *)0x0) {
        raw_recv(pcb,recv_raw,*(void **)m);
        goto LAB_23046b16;
      }
      goto LAB_23046b66;
    }
    if (bVar4 == 0x10) {
      ptVar2 = tcp_new_ip_type('\0');
      *(tcp_pcb **)(pbVar1 + 4) = ptVar2;
      if ((*(netconn **)m)->pcb != 0) {
        setup_tcp(*(netconn **)m);
        goto LAB_23046b16;
      }
      goto LAB_23046b66;
    }
    uVar5 = 0xfa;
  }
  *(undefined *)((int)m + 4) = uVar5;
LAB_23046b1c:
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



netconn * netconn_alloc(netconn_type t,netconn_callback *callback)

{
  err_t eVar1;
  netconn *mem;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int size;
  
  mem = (netconn *)memp_malloc(MEMP_NETCONN);
  if (mem == (netconn *)0x0) {
    return (netconn *)0x0;
  }
  mem->pending_err = '\0';
  mem->type = t;
  mem->pcb = 0;
  t = t & 0xf0;
  if (t == NETCONN_UDP) {
LAB_23046ba8:
    size = 2000;
  }
  else {
    if (t != NETCONN_RAW) {
      if (t != NETCONN_TCP) goto free_and_return;
      goto LAB_23046ba8;
    }
    size = 0;
  }
  eVar1 = sys_mbox_new(&mem->recvmbox,size);
  if (CONCAT31(extraout_var,eVar1) == 0) {
    eVar1 = sys_sem_new(&mem->op_completed,'\0');
    if (CONCAT31(extraout_var_00,eVar1) == 0) {
      sys_mbox_set_invalid(&mem->acceptmbox);
      mem->state = NETCONN_NONE;
      mem->socket = -1;
      mem->callback = callback;
      mem->current_msg = (api_msg *)0x0;
      mem->send_timeout = 0;
      mem->recv_timeout = 0;
      mem->flags = '\0';
      return mem;
    }
    sys_mbox_free(&mem->recvmbox);
  }
free_and_return:
  memp_free(MEMP_NETCONN,mem);
  return (netconn *)0x0;
}



