pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void netconn_free(netconn *conn)

{
  sys_mbox_valid(&conn->recvmbox);
  sys_mbox_valid(&conn->acceptmbox);
  sys_sem_free(&conn->op_completed);
  sys_sem_set_invalid(&conn->op_completed);
  memp_free(MEMP_NETCONN,conn);
  return;
}



// WARNING: Could not reconcile some variable overlaps

void netconn_drain(netconn *conn)

{
  netconn *conn_00;
  sys_mbox_t *mbox;
  int iVar1;
  u32_t uVar2;
  err_t eStack37;
  err_t err;
  netconn *pnStack36;
  void *mem;
  
  mbox = &conn->recvmbox;
  iVar1 = sys_mbox_valid(mbox);
  if (iVar1 != 0) {
    while (uVar2 = sys_arch_mbox_tryfetch(mbox,(void **)&stack0xffffffdc), uVar2 != 0xffffffff) {
      if ((conn->type & 0xf0) == NETCONN_TCP) {
        iVar1 = lwip_netconn_is_err_msg(pnStack36,&eStack37);
        if (iVar1 == 0) {
          pbuf_free((pbuf *)pnStack36);
        }
      }
      else {
        netbuf_delete((netbuf *)pnStack36);
      }
    }
    sys_mbox_free(mbox);
    sys_mbox_set_invalid(mbox);
  }
  mbox = &conn->acceptmbox;
  iVar1 = sys_mbox_valid(mbox);
  if (iVar1 != 0) {
    while (uVar2 = sys_arch_mbox_tryfetch(mbox,(void **)&stack0xffffffdc), uVar2 != 0xffffffff) {
      iVar1 = lwip_netconn_is_err_msg(pnStack36,&eStack37);
      conn_00 = pnStack36;
      if (iVar1 == 0) {
        netconn_drain(pnStack36);
        if ((tcp_pcb *)conn_00->pcb != (tcp_pcb *)0x0) {
          tcp_abort((tcp_pcb *)conn_00->pcb);
          conn_00->pcb = 0;
        }
        netconn_free(conn_00);
      }
    }
    sys_mbox_free(mbox);
    sys_mbox_set_invalid(mbox);
  }
  return;
}



err_t accept_function(void *arg,tcp_pcb *newpcb,err_t err)

{
  tcp_pcb *pcb;
  err_t eVar1;
  err_t eVar2;
  int iVar3;
  undefined3 extraout_var;
  netconn *conn;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 in_register_00002031;
  sys_mbox_t *mbox;
  
  if (arg != (void *)0x0) {
    mbox = (sys_mbox_t *)((int)arg + 0x14);
    iVar3 = sys_mbox_valid(mbox,CONCAT31(in_register_00002031,err));
    if (iVar3 != 0) {
      if (newpcb != (tcp_pcb *)0x0) {
        conn = netconn_alloc(*(netconn_type *)arg,*(netconn_callback **)((int)arg + 0x2c));
        if (conn == (netconn *)0x0) {
          eVar2 = sys_mbox_trypost(mbox,"");
          eVar1 = -1;
          if (CONCAT31(extraout_var_00,eVar2) != 0) {
            return -1;
          }
        }
        else {
          *(tcp_pcb **)&conn->pcb = newpcb;
          setup_tcp(conn);
          eVar1 = sys_mbox_trypost(mbox,conn);
          if (CONCAT31(extraout_var_01,eVar1) != 0) {
            pcb = (tcp_pcb *)conn->pcb;
            tcp_arg(pcb,(void *)0x0);
            tcp_recv(pcb,(tcp_recv_fn *)0x0);
            tcp_sent(pcb,(tcp_sent_fn *)0x0);
            tcp_poll(pcb,(tcp_poll_fn *)0x0,'\0');
            tcp_err(pcb,(tcp_err_fn *)0x0);
            conn->pcb = 0;
            sys_mbox_free(&conn->recvmbox);
            sys_mbox_set_invalid(&conn->recvmbox);
            netconn_free(conn);
            return -1;
          }
        }
        if (*(code **)((int)arg + 0x2c) == (code *)0x0) {
          return eVar1;
        }
        (**(code **)((int)arg + 0x2c))(arg,0,0);
        return eVar1;
      }
      eVar1 = sys_mbox_trypost(mbox,"");
      if ((CONCAT31(extraout_var,eVar1) == 0) && (*(code **)((int)arg + 0x2c) != (code *)0x0)) {
        (**(code **)((int)arg + 0x2c))(arg,0,0);
      }
    }
  }
  return -6;
}



void lwip_netconn_do_delconn(void *m)

{
  netconn *conn;
  int iVar1;
  raw_pcb *pcb;
  byte *pbVar2;
  byte bVar3;
  
  conn = *(netconn **)m;
  if (((conn->state & ~NETCONN_LISTEN) == NETCONN_NONE) ||
     ((conn->state == NETCONN_CONNECT && ((conn->flags & 4) != 0)))) {
    *(undefined *)((int)m + 4) = 0;
    netconn_drain(conn);
    pbVar2 = *(byte **)m;
    pcb = *(raw_pcb **)(pbVar2 + 4);
    if (pcb != (raw_pcb *)0x0) {
      bVar3 = *pbVar2 & 0xf0;
      if (bVar3 == 0x20) {
        *(undefined4 *)&pcb[1].netif_idx = 0;
        udp_remove(*(udp_pcb **)(*(int *)m + 4));
      }
      else {
        if (bVar3 == 0x40) {
          raw_remove(pcb);
        }
        else {
          if (bVar3 == 0x10) {
            pbVar2[1] = 4;
            *(undefined *)((int)m + 8) = 3;
            *(void **)(*(int *)m + 0x28) = m;
            lwip_netconn_do_close_internal(*(netconn **)m);
            return;
          }
        }
      }
      *(undefined4 *)(*(int *)m + 4) = 0;
    }
    if (*(code **)(*(int *)m + 0x2c) != (code *)0x0) {
      (**(code **)(*(int *)m + 0x2c))(0,0);
    }
    if (*(code **)(*(int *)m + 0x2c) != (code *)0x0) {
      (**(code **)(*(int *)m + 0x2c))(2,0);
    }
  }
  else {
    *(undefined *)((int)m + 4) = 0xfb;
  }
  iVar1 = sys_sem_valid((sys_sem_t *)(*(int *)m + 0xc));
  if (iVar1 != 0) {
    sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
    return;
  }
  return;
}



void lwip_netconn_do_bind(void *m)

{
  err_t eVar1;
  tcp_pcb *pcb;
  byte bVar2;
  
  eVar1 = -6;
  pcb = *(tcp_pcb **)(*(byte **)m + 4);
  if (pcb != (tcp_pcb *)0x0) {
    bVar2 = **(byte **)m & 0xf0;
    if (bVar2 == 0x20) {
      eVar1 = udp_bind((udp_pcb *)pcb,*(ip_addr_t **)((int)m + 8),*(u16_t *)((int)m + 0xc));
    }
    else {
      if (bVar2 == 0x40) {
        eVar1 = raw_bind((raw_pcb *)pcb,*(ip_addr_t **)((int)m + 8));
      }
      else {
        if (bVar2 == 0x10) {
          eVar1 = tcp_bind(pcb,*(ip_addr_t **)((int)m + 8),*(u16_t *)((int)m + 0xc));
        }
        else {
          eVar1 = -6;
        }
      }
    }
  }
  *(err_t *)((int)m + 4) = eVar1;
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_connect(void *m)

{
  err_t eVar1;
  udp_pcb *pcb;
  undefined3 extraout_var;
  netconn *conn;
  netconn_type nVar2;
  int iVar3;
  int iVar4;
  
  conn = *(netconn **)m;
  pcb = (udp_pcb *)conn->pcb;
  if (pcb == (udp_pcb *)0x0) {
    eVar1 = -0xf;
  }
  else {
    nVar2 = conn->type & 0xf0;
    if (nVar2 == NETCONN_UDP) {
      eVar1 = udp_connect(pcb,*(ip_addr_t **)((int)m + 8),*(u16_t *)((int)m + 0xc));
    }
    else {
      if (nVar2 == NETCONN_RAW) {
        eVar1 = raw_connect((raw_pcb *)pcb,*(ip_addr_t **)((int)m + 8));
      }
      else {
        eVar1 = -6;
        if (nVar2 == NETCONN_TCP) {
          if (conn->state == NETCONN_CONNECT) {
            eVar1 = -9;
          }
          else {
            eVar1 = -10;
            if (conn->state == NETCONN_NONE) {
              setup_tcp(conn);
              eVar1 = tcp_connect(*(tcp_pcb **)(*(int *)m + 4),*(ip_addr_t **)((int)m + 8),
                                  *(u16_t *)((int)m + 0xc),lwip_netconn_do_connected);
              if (CONCAT31(extraout_var,eVar1) == 0) {
                iVar3 = *(int *)m;
                *(undefined *)(iVar3 + 1) = 3;
                iVar4 = *(int *)m;
                if ((*(byte *)(iVar3 + 0x24) & 2) == 0) {
                  *(byte *)(iVar4 + 0x24) = *(byte *)(iVar4 + 0x24) & 0xfb;
                  *(void **)(*(int *)m + 0x28) = m;
                  return;
                }
                eVar1 = -5;
                *(byte *)(iVar4 + 0x24) = *(byte *)(iVar4 + 0x24) | 4;
              }
            }
          }
        }
      }
    }
  }
  *(err_t *)((int)m + 4) = eVar1;
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_disconnect(void *m)

{
  if ((**(byte **)m & 0xf0) == 0x20) {
    udp_disconnect(*(udp_pcb **)(*(byte **)m + 4));
    *(undefined *)((int)m + 4) = 0;
  }
  else {
    *(undefined *)((int)m + 4) = 0xfa;
  }
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_listen(void *m)

{
  tcp_pcb *pcb;
  int iVar1;
  byte *pbVar2;
  err_t aeStack17 [4];
  err_t err;
  
  pbVar2 = *(byte **)m;
  pcb = *(tcp_pcb **)(pbVar2 + 4);
  if (pcb != (tcp_pcb *)0x0) {
    if ((*pbVar2 & 0xf0) != 0x10) {
      aeStack17[0] = -0x10;
      goto LAB_2304709c;
    }
    if (pbVar2[1] == 0) {
      if (pcb->state == CLOSED) {
        pcb = tcp_listen_with_backlog_and_err(pcb,-1,aeStack17);
        if (pcb != (tcp_pcb *)0x0) {
          iVar1 = sys_mbox_valid(*(int *)m + 0x10);
          if (iVar1 != 0) {
            sys_mbox_free((sys_mbox_t *)(*(int *)m + 0x10));
            sys_mbox_set_invalid(*(int *)m + 0x10);
          }
          aeStack17[0] = '\0';
          iVar1 = sys_mbox_valid(*(int *)m + 0x14);
          if (iVar1 == 0) {
            aeStack17[0] = sys_mbox_new((sys_mbox_t *)(*(int *)m + 0x14),2000);
          }
          if (aeStack17[0] == '\0') {
            *(undefined *)(*(int *)m + 1) = 2;
            *(tcp_pcb **)(*(int *)m + 4) = pcb;
            tcp_arg(*(tcp_pcb **)((int)*(void **)m + 4),*(void **)m);
            tcp_accept(*(tcp_pcb **)(*(int *)m + 4),accept_function);
          }
          else {
            tcp_close(pcb);
            *(undefined4 *)(*(int *)m + 4) = 0;
          }
        }
      }
      else {
        aeStack17[0] = -6;
      }
      goto LAB_2304709c;
    }
    if (pbVar2[1] == 2) {
      aeStack17[0] = '\0';
      goto LAB_2304709c;
    }
  }
  aeStack17[0] = -0xb;
LAB_2304709c:
  *(char *)((int)m + 4) = aeStack17[0];
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



// WARNING: Type propagation algorithm not settling

void lwip_netconn_do_send(void *m)

{
  err_t eVar1;
  undefined3 extraout_var;
  byte have_chksum;
  pbuf *ppVar2;
  udp_pcb *pcb;
  
  eVar1 = netconn_err(*(netconn **)m);
  if (CONCAT31(extraout_var,eVar1) == 0) {
    eVar1 = -0xb;
    pcb = *(udp_pcb **)(*(byte **)m + 4);
    if (pcb != (udp_pcb *)0x0) {
      have_chksum = **(byte **)m & 0xf0;
      if (have_chksum == 0x20) {
        ppVar2 = *(pbuf **)((int)m + 8);
        have_chksum = ppVar2->ref & 2;
        if (((ip_addr_t *)&ppVar2->tot_len == (ip_addr_t *)0x0) ||
           (*(pbuf **)&ppVar2->tot_len == (pbuf *)0x0)) {
          eVar1 = udp_send_chksum(pcb,ppVar2->next,have_chksum,*(u16_t *)&ppVar2[1].next);
        }
        else {
          eVar1 = udp_sendto_chksum(pcb,ppVar2->next,(ip_addr_t *)&ppVar2->tot_len,
                                    *(u16_t *)&ppVar2->type_internal,have_chksum,
                                    *(u16_t *)&ppVar2[1].next);
        }
      }
      else {
        if (have_chksum == 0x40) {
          ppVar2 = *(pbuf **)((int)m + 8);
          if (((ip_addr_t *)&ppVar2->tot_len == (ip_addr_t *)0x0) ||
             (*(pbuf **)&ppVar2->tot_len == (pbuf *)0x0)) {
            eVar1 = raw_send((raw_pcb *)pcb,ppVar2->next);
          }
          else {
            eVar1 = raw_sendto((raw_pcb *)pcb,ppVar2->next,(ip_addr_t *)&ppVar2->tot_len);
          }
        }
      }
    }
  }
  *(err_t *)((int)m + 4) = eVar1;
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_recv(void *m)

{
  uint uVar1;
  uint uVar2;
  
  *(undefined *)((int)m + 4) = 0;
  if ((*(int *)(*(byte **)m + 4) != 0) && ((**(byte **)m & 0xf0) == 0x10)) {
    uVar1 = *(uint *)((int)m + 8);
    do {
      uVar2 = uVar1;
      if (0xffff < uVar1) {
        uVar2 = 0xffff;
      }
      uVar1 = uVar1 - uVar2;
      tcp_recved(*(tcp_pcb **)(*(int *)m + 4),(u16_t)uVar2);
    } while (uVar1 != 0);
  }
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



