pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void lwip_netconn_do_write(void *m)

{
  err_t eVar1;
  undefined3 extraout_var;
  byte *pbVar2;
  
  eVar1 = netconn_err(*(netconn **)m);
  pbVar2 = *(byte **)m;
  if ((CONCAT31(extraout_var,eVar1) == 0) && (eVar1 = -6, (*pbVar2 & 0xf0) == 0x10)) {
    if (pbVar2[1] == 0) {
      eVar1 = -0xb;
      if (*(int *)(pbVar2 + 4) != 0) {
        pbVar2[1] = 1;
        *(void **)(*(int *)m + 0x28) = m;
        lwip_netconn_do_writemore(*(netconn **)m);
        return;
      }
    }
    else {
      eVar1 = -5;
    }
  }
  *(err_t *)((int)m + 4) = eVar1;
  sys_sem_signal((sys_mutex_t *)(pbVar2 + 0xc));
  return;
}



void lwip_netconn_do_getaddr(void *m)

{
  byte *pbVar1;
  undefined2 *puVar2;
  byte bVar3;
  undefined2 uVar4;
  undefined4 *puVar5;
  undefined4 uVar6;
  int iVar7;
  
  puVar5 = *(undefined4 **)(*(int *)m + 4);
  if (puVar5 == (undefined4 *)0x0) {
LAB_23047272:
    *(undefined *)((int)m + 4) = 0xf5;
  }
  else {
    if (*(char *)((int)m + 0x10) == '\0') {
      uVar6 = puVar5[1];
    }
    else {
      uVar6 = *puVar5;
    }
    **(undefined4 **)((int)m + 8) = uVar6;
    pbVar1 = *(byte **)m;
    *(undefined *)((int)m + 4) = 0;
    bVar3 = *pbVar1 & 0xf0;
    if (bVar3 == 0x20) {
      iVar7 = *(int *)(pbVar1 + 4);
      if (*(char *)((int)m + 0x10) == '\0') {
        if ((*(byte *)(iVar7 + 0x10) & 4) == 0) goto LAB_23047272;
        puVar2 = *(undefined2 **)((int)m + 0xc);
        uVar4 = *(undefined2 *)(iVar7 + 0x14);
      }
      else {
        puVar2 = *(undefined2 **)((int)m + 0xc);
        uVar4 = *(undefined2 *)(iVar7 + 0x12);
      }
    }
    else {
      if (bVar3 == 0x40) {
        if (*(char *)((int)m + 0x10) != '\0') {
          **(ushort **)((int)m + 0xc) = (ushort)*(byte *)(*(int *)(pbVar1 + 4) + 0x10);
          goto LAB_23047290;
        }
        goto LAB_23047272;
      }
      if (bVar3 != 0x10) goto LAB_23047290;
      iVar7 = *(int *)(pbVar1 + 4);
      if (*(char *)((int)m + 0x10) == '\0') {
        if (*(byte *)(iVar7 + 0x14) < 2) goto LAB_23047272;
        uVar4 = *(undefined2 *)(iVar7 + 0x18);
      }
      else {
        uVar4 = *(undefined2 *)(iVar7 + 0x16);
      }
      puVar2 = *(undefined2 **)((int)m + 0xc);
    }
    *puVar2 = uVar4;
  }
LAB_23047290:
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_close(void *m)

{
  netconn_state nVar1;
  netconn *conn;
  undefined uVar2;
  
  conn = *(netconn **)m;
  if ((conn->pcb != 0) && ((conn->type & 0xf0) == NETCONN_TCP)) {
    nVar1 = conn->state;
    if (((*(byte *)((int)m + 8) == 3) || (nVar1 != NETCONN_LISTEN)) && (nVar1 != NETCONN_CONNECT)) {
      if (nVar1 != NETCONN_WRITE) {
        if ((*(byte *)((int)m + 8) & 1) != 0) {
          netconn_drain(conn);
        }
        *(undefined *)(*(int *)m + 1) = 4;
        *(void **)(*(int *)m + 0x28) = m;
        lwip_netconn_do_close_internal(*(netconn **)m);
        return;
      }
      uVar2 = 0xfb;
      goto LAB_23047302;
    }
  }
  uVar2 = 0xf5;
LAB_23047302:
  *(undefined *)((int)m + 4) = uVar2;
  sys_sem_signal((sys_mutex_t *)&conn->op_completed);
  return;
}



void lwip_netconn_do_join_leave_group(void *m)

{
  err_t eVar1;
  
  *(undefined *)((int)m + 4) = 0xf5;
  if (*(int *)(*(byte **)m + 4) != 0) {
    if ((**(byte **)m & 0xf0) == 0x20) {
      if (*(char *)((int)m + 0x11) == '\0') {
        eVar1 = igmp_joingroup(*(ip4_addr_t **)((int)m + 0xc),*(ip4_addr_t **)((int)m + 8));
      }
      else {
        eVar1 = igmp_leavegroup(*(ip4_addr_t **)((int)m + 0xc),*(ip4_addr_t **)((int)m + 8));
      }
      *(err_t *)((int)m + 4) = eVar1;
    }
    else {
      *(undefined *)((int)m + 4) = 0xfa;
    }
  }
  sys_sem_signal((sys_mutex_t *)(*(int *)m + 0xc));
  return;
}



void lwip_netconn_do_gethostbyname(void *arg)

{
  err_t *peVar1;
  err_t eVar2;
  
  peVar1 = *(err_t **)((int)arg + 0xc);
  eVar2 = dns_gethostbyname_addrtype
                    (*(char **)arg,*(ip_addr_t **)((int)arg + 4),lwip_netconn_do_dns_found,arg,'\0')
  ;
  *peVar1 = eVar2;
  if (**(char **)((int)arg + 0xc) != -5) {
    sys_sem_signal((sys_mutex_t *)*(sys_mutex_t *)((int)arg + 8));
    return;
  }
  return;
}



int err_to_errno(err_t err)

{
  undefined3 in_register_00002029;
  
  if ((CONCAT31(in_register_00002029,err) + 0x10U & 0xff) < 0x11) {
    return err_to_errno_table[CONCAT31(in_register_00002029,err) * 0x3fffffff];
  }
  return 5;
}



void netbuf_delete(netbuf *buf)

{
  if (buf == (netbuf *)0x0) {
    return;
  }
  if (buf->p != (pbuf *)0x0) {
    pbuf_free(buf->p);
    buf->ptr = (pbuf *)0x0;
    buf->p = (pbuf *)0x0;
  }
  memp_free(MEMP_NETBUF,buf);
  return;
}



void * netbuf_alloc(netbuf *buf,u16_t size)

{
  pbuf *ppVar1;
  void *pvVar2;
  
  if (buf == (netbuf *)0x0) {
    return (void *)0x0;
  }
  if (buf->p != (pbuf *)0x0) {
    pbuf_free(buf->p);
  }
  ppVar1 = pbuf_alloc(PBUF_TRANSPORT,size,PBUF_RAM);
  buf->p = ppVar1;
  if (ppVar1 == (pbuf *)0x0) {
    pvVar2 = (void *)0x0;
  }
  else {
    buf->ptr = ppVar1;
    pvVar2 = ppVar1->payload;
  }
  return pvVar2;
}



void netbuf_free(netbuf *buf)

{
  if (buf != (netbuf *)0x0) {
    if (buf->p != (pbuf *)0x0) {
      pbuf_free(buf->p);
    }
    buf->ptr = (pbuf *)0x0;
    buf->p = (pbuf *)0x0;
    buf->flags = '\0';
    buf->toport_chksum = 0;
    return;
  }
  return;
}



void icmp_input(pbuf *p,netif *inp)

{
  ip_hdr *__src;
  u32_t uVar1;
  uint uVar2;
  uint __n;
  void *dataptr;
  u8_t uVar3;
  err_t eVar4;
  u16_t uVar5;
  undefined3 extraout_var;
  undefined2 extraout_var_05;
  undefined3 extraout_var_00;
  pbuf *p_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  uint uVar6;
  short sVar7;
  undefined *puVar8;
  
  __src = ip_data.current_ip4_header;
  lwip_stats.icmp.recv = lwip_stats.icmp.recv + 1;
  uVar2 = (uint)(ip_data.current_ip4_header)->_v_hl & 0xf;
  __n = uVar2 * 4;
  if ((__n < 0x14) || (p->len < 4)) {
lenerr:
    pbuf_free(p);
    lwip_stats.icmp.lenerr = lwip_stats.icmp.lenerr + 1;
  }
  else {
    if (*(char *)p->payload == '\0') goto LAB_2304767c;
    if (*(char *)p->payload != '\b') {
      lwip_stats.icmp.proterr = lwip_stats.icmp.proterr + 1;
      lwip_stats.icmp.drop = lwip_stats.icmp.drop + 1;
      goto LAB_2304767c;
    }
    if (((ip_data.current_iphdr_dest & 0xf0) != 0xe0) &&
       (uVar3 = ip4_addr_isbroadcast_u32(ip_data.current_iphdr_dest,ip_data.current_netif),
       CONCAT31(extraout_var,uVar3) == 0)) {
      if (p->tot_len < 8) goto lenerr;
      uVar5 = inet_chksum_pbuf(p);
      if (CONCAT22(extraout_var_05,uVar5) != 0) {
        pbuf_free(p);
        lwip_stats.icmp.chkerr = lwip_stats.icmp.chkerr + 1;
        return;
      }
      uVar2 = uVar2 << 0x12;
      uVar3 = pbuf_add_header(p,__n + 0x8e);
      if (CONCAT31(extraout_var_00,uVar3) == 0) {
        uVar3 = pbuf_remove_header(p,__n + 0x8e);
        if (CONCAT31(extraout_var_04,uVar3) == 0) {
LAB_230475c4:
          puVar8 = (undefined *)p->payload;
          uVar3 = pbuf_add_header(p,__n);
          uVar1 = ip_data.current_iphdr_dest;
          if (CONCAT31(extraout_var_03,uVar3) == 0) {
            dataptr = p->payload;
            *(undefined *)((int)dataptr + 0xc) = (char)ip_data.current_iphdr_dest;
            *(undefined *)((int)dataptr + 0xd) = (char)(uVar1 >> 8);
            *(undefined *)((int)dataptr + 0xe) = (char)(uVar1 >> 0x10);
            *(undefined *)((int)dataptr + 0xf) = (char)(uVar1 >> 0x18);
            uVar1 = ip_data.current_iphdr_src;
            *(undefined *)((int)dataptr + 0x10) = (char)ip_data.current_iphdr_src;
            *(undefined *)((int)dataptr + 0x11) = (char)(uVar1 >> 8);
            *(undefined *)((int)dataptr + 0x12) = (char)(uVar1 >> 0x10);
            *(undefined *)((int)dataptr + 0x13) = (char)(uVar1 >> 0x18);
            *puVar8 = 0;
            if (*(ushort *)(puVar8 + 2) < 0xfff8) {
              sVar7 = 8;
            }
            else {
              sVar7 = 9;
            }
            sVar7 = *(ushort *)(puVar8 + 2) + sVar7;
            puVar8[2] = (char)sVar7;
            puVar8[3] = (char)((ushort)sVar7 >> 8);
            *(undefined *)((int)dataptr + 8) = 0xff;
            *(undefined *)((int)dataptr + 10) = 0;
            *(undefined *)((int)dataptr + 0xb) = 0;
            uVar5 = inet_chksum(dataptr,(u16_t)(uVar2 >> 0x10));
            *(undefined *)((int)dataptr + 10) = (char)uVar5;
            *(undefined *)((int)dataptr + 0xb) = (char)(uVar5 >> 8);
            lwip_stats.icmp.xmit = lwip_stats.icmp.xmit + 1;
            ip4_output_if(p,(ip4_addr_t *)&ip_data.current_iphdr_dest,(ip4_addr_t *)0x0,-1,'\0',
                          '\x01',inp);
          }
LAB_2304767c:
          pbuf_free(p);
          return;
        }
      }
      else {
        uVar6 = (uint)p->tot_len + (uVar2 >> 0x10);
        if (((uint)p->tot_len <= (uVar6 & 0xffff)) &&
           (p_00 = pbuf_alloc(PBUF_LINK,(u16_t)(uVar6 * 0x10000 >> 0x10),PBUF_RAM),
           p_00 != (pbuf *)0x0)) {
          if (__n + 8 <= (uint)p_00->len) {
            memcpy(p_00->payload,__src,__n);
            uVar3 = pbuf_remove_header(p_00,__n);
            if ((CONCAT31(extraout_var_01,uVar3) == 0) &&
               (eVar4 = pbuf_copy(p_00,p), CONCAT31(extraout_var_02,eVar4) == 0)) {
              pbuf_free(p);
              p = p_00;
              goto LAB_230475c4;
            }
          }
          pbuf_free(p_00);
        }
      }
    }
    pbuf_free(p);
    lwip_stats.icmp.err = lwip_stats.icmp.err + 1;
  }
  return;
}



// WARNING: Type propagation algorithm not settling

