pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void icmp_dest_unreach(pbuf *p,icmp_dur_type t)

{
  undefined *dataptr;
  u16_t uVar1;
  pbuf *p_00;
  netif *netif;
  void *pvVar2;
  ip4_addr_t iStack36;
  ip4_addr_t iphdr_src;
  
  p_00 = pbuf_alloc(PBUF_IP,0x24,PBUF_RAM);
  if (p_00 != (pbuf *)0x0) {
    dataptr = (undefined *)p_00->payload;
    pvVar2 = p->payload;
    *dataptr = 3;
    dataptr[1] = t;
    dataptr[4] = 0;
    dataptr[5] = 0;
    dataptr[6] = 0;
    dataptr[7] = 0;
    memcpy((void *)((int)p_00->payload + 8),p->payload,0x1c);
    iStack36 = (ip4_addr_t)((ip4_addr_t *)((int)pvVar2 + 0xc))->addr;
    netif = ip4_route(&iStack36);
    if (netif != (netif *)0x0) {
      dataptr[2] = 0;
      dataptr[3] = 0;
      uVar1 = inet_chksum(dataptr,p_00->len);
      dataptr[2] = (char)uVar1;
      dataptr[3] = (char)(uVar1 >> 8);
      lwip_stats.icmp.xmit = lwip_stats.icmp.xmit + 1;
      ip4_output_if(p_00,(ip4_addr_t *)0x0,&iStack36,-1,'\0','\x01',netif);
    }
    pbuf_free(p_00);
  }
  return;
}



u8_t * dhcp_server_option_find(u8_t *buf,u16_t len,u8_t option)

{
  undefined2 in_register_0000202e;
  byte *pbVar1;
  undefined3 in_register_00002031;
  
  pbVar1 = buf + CONCAT22(in_register_0000202e,len);
  while ((buf < pbVar1 && (*buf != 0xff))) {
    if ((uint)*buf == CONCAT31(in_register_00002031,option)) {
      return buf;
    }
    buf = buf + (uint)buf[1] + 2;
  }
  return (u8_t *)0x0;
}



// WARNING: Type propagation algorithm not settling

dhcp_client_node * dhcp_client_find_by_ip(uint8_t *ip)

{
  dhcp_client_node *pdVar1;
  void *in_a1;
  ip4_addr_t iStack20;
  uint32_t ipval;
  
  memcpy(&iStack20,in_a1,4);
  pdVar1 = *(dhcp_client_node **)ip;
  while ((pdVar1 != (dhcp_client_node *)0x0 && (iStack20 != (ip4_addr_t)(pdVar1->ipaddr).addr))) {
    pdVar1 = pdVar1->next;
  }
  return pdVar1;
}



// WARNING: Type propagation algorithm not settling

void dhcp_server_recv(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *recv_addr,u16_t port)

{
  byte bVar1;
  u8_t uVar2;
  char *pcVar3;
  pbuf *p_to;
  u8_t *puVar4;
  u32_t n;
  u32_t uVar5;
  int iVar6;
  u16_t len;
  undefined4 *puVar7;
  dhcp_client_node *pdVar8;
  undefined4 *puVar9;
  undefined4 *puVar10;
  u8_t *buf;
  ip_addr_t iStack56;
  ip_addr_t addr;
  u32_t tmp;
  
  iStack56 = (ip_addr_t)recv_addr->addr;
  if (((p->len < 0x2c) || (p_to = pbuf_alloc(PBUF_TRANSPORT,0x5dc,PBUF_RAM), p_to == (pbuf *)0x0))
     || (p_to->tot_len < p->tot_len)) goto LAB_2304781c;
  pbuf_copy(p_to,p);
  pbuf_free(p);
  pcVar3 = (char *)p_to->payload;
  p = p_to;
  if (((*pcVar3 != '\x01') || (*(int *)(pcVar3 + 0xec) != 0x63538263)) ||
     (bVar1 = pcVar3[2], 6 < bVar1)) goto LAB_2304781c;
  buf = (u8_t *)(pcVar3 + 0xf0);
  len = (u16_t)(((uint)p_to->tot_len - 0xf0) * 0x10000 >> 0x10);
  puVar4 = dhcp_server_option_find(buf,len,'5');
  if (puVar4 == (u8_t *)0x0) goto LAB_2304781c;
  uVar2 = puVar4[2];
  if (uVar2 == '\x01') {
    pdVar8 = *(dhcp_client_node **)((int)arg + 0xc);
    while (pdVar8 != (dhcp_client_node *)0x0) {
      iVar6 = memcmp(pdVar8->chaddr,pcVar3 + 0x1c,(uint)bVar1);
      if (iVar6 == 0) goto LAB_23047970;
      pdVar8 = pdVar8->next;
    }
    puVar4 = dhcp_server_option_find(buf,len,'2');
    if ((puVar4 == (u8_t *)0x0) ||
       (pdVar8 = dhcp_client_find_by_ip((uint8_t *)((int)arg + 0xc)),
       pdVar8 == (dhcp_client_node *)0x0)) {
      while (pdVar8 = dhcp_client_find_by_ip((uint8_t *)((int)arg + 0xc)),
            pdVar8 != (dhcp_client_node *)0x0) {
        n = lwip_htonl(*(u32_t *)((int)arg + 0x18));
        n = n + 1;
        uVar5 = lwip_htonl(*(u32_t *)((int)arg + 0x14));
        if (uVar5 < n) {
          n = lwip_htonl(*(u32_t *)((int)arg + 0x10));
        }
        uVar5 = lwip_htonl(n);
        *(u32_t *)((int)arg + 0x18) = uVar5;
      }
      pdVar8 = (dhcp_client_node *)mem_malloc(0x14);
      if (pdVar8 == (dhcp_client_node *)0x0) goto LAB_2304781c;
      memcpy(pdVar8->chaddr,pcVar3 + 0x1c,(uint)(byte)pcVar3[2]);
      (pdVar8->ipaddr).addr = *(u32_t *)((int)arg + 0x18);
      pdVar8->next = *(dhcp_client_node **)((int)arg + 0xc);
      *(dhcp_client_node **)((int)arg + 0xc) = pdVar8;
    }
LAB_23047970:
    pdVar8->lease_end = 0x80510100;
    *pcVar3 = '\x02';
    pcVar3[3] = '\0';
    pcVar3[8] = '\0';
    pcVar3[9] = '\0';
    memcpy(pcVar3 + 0x14,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0xed] = -0x7e;
    pcVar3[0xec] = 'c';
    pcVar3[0xef] = 'c';
    pcVar3[0x2c] = '\0';
    pcVar3[0x6c] = '\0';
    pcVar3[0xee] = 'S';
    memcpy(pcVar3 + 0x10,&pdVar8->ipaddr,4);
    pcVar3[0xf0] = '5';
    pcVar3[0xf1] = '\x01';
    pcVar3[0xf2] = '\x02';
LAB_230479e0:
    pcVar3[0xf3] = '6';
    pcVar3[0xf4] = '\x04';
    memcpy(pcVar3 + 0xf5,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0xf9] = '3';
    pcVar3[0xfa] = '\x04';
    addr = 0x15180;
    memcpy(pcVar3 + 0xfb,&addr,4);
    pcVar3[0xff] = '\x01';
    pcVar3[0x100] = '\x04';
    memcpy(pcVar3 + 0x101,(void *)(*(int *)((int)arg + 4) + 8),4);
    pcVar3[0x105] = '\x06';
    pcVar3[0x106] = '\x04';
    memcpy(pcVar3 + 0x107,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0x10b] = '\x03';
    pcVar3[0x10c] = '\x04';
    memcpy(pcVar3 + 0x10d,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0x111] = -1;
    if (0x112 < p_to->tot_len) {
      len = 0x112;
LAB_23047a78:
      pbuf_realloc(p_to,len);
    }
  }
  else {
    if (uVar2 != '\x03') {
      if (uVar2 == '\a') {
        puVar7 = *(undefined4 **)((int)arg + 0xc);
        puVar10 = (undefined4 *)0x0;
        while (puVar9 = puVar7, puVar9 != (undefined4 *)0x0) {
          iVar6 = memcmp(puVar9 + 1,pcVar3 + 0x1c,(uint)(byte)pcVar3[2]);
          puVar7 = (undefined4 *)*puVar9;
          if (iVar6 == 0) {
            if (*(undefined4 **)((int)arg + 0xc) == puVar9) {
              *(undefined4 **)((int)arg + 0xc) = puVar7;
            }
            else {
              *(undefined4 **)puVar10 = puVar7;
            }
            mem_free(puVar9);
            break;
          }
          puVar7 = (undefined4 *)*puVar7;
          puVar10 = puVar9;
        }
      }
      goto LAB_2304781c;
    }
    pdVar8 = *(dhcp_client_node **)((int)arg + 0xc);
    while (pdVar8 != (dhcp_client_node *)0x0) {
      iVar6 = memcmp(pdVar8->chaddr,pcVar3 + 0x1c,(uint)bVar1);
      if (iVar6 == 0) goto LAB_23047bd2;
      pdVar8 = pdVar8->next;
    }
    puVar4 = dhcp_server_option_find(buf,len,'2');
    if ((puVar4 != (u8_t *)0x0) &&
       (pdVar8 = dhcp_client_find_by_ip((uint8_t *)((int)arg + 0xc)),
       pdVar8 != (dhcp_client_node *)0x0)) {
      iVar6 = memcmp(pdVar8->chaddr,pcVar3 + 0x1c,(uint)(byte)pcVar3[2]);
      if (iVar6 == 0) {
LAB_23047bd2:
        pdVar8->lease_end = 0x80510100;
        *pcVar3 = '\x02';
        pcVar3[3] = '\0';
        pcVar3[8] = '\0';
        pcVar3[9] = '\0';
        memcpy(pcVar3 + 0x14,(void *)(*(int *)((int)arg + 4) + 4),4);
        pcVar3[0xed] = -0x7e;
        pcVar3[0xec] = 'c';
        pcVar3[0xef] = 'c';
        pcVar3[0x2c] = '\0';
        pcVar3[0x6c] = '\0';
        pcVar3[0xee] = 'S';
        memcpy(pcVar3 + 0x10,&pdVar8->ipaddr,4);
        pcVar3[0xf0] = '5';
        pcVar3[0xf1] = '\x01';
        pcVar3[0xf2] = '\x05';
        goto LAB_230479e0;
      }
      puts("IP Found, but MAC address is NOT the same\r\n");
    }
    *pcVar3 = '\x02';
    pcVar3[3] = '\0';
    pcVar3[8] = '\0';
    pcVar3[9] = '\0';
    memcpy(pcVar3 + 0x14,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0xed] = -0x7e;
    pcVar3[0xee] = 'S';
    pcVar3[0xec] = 'c';
    pcVar3[0xef] = 'c';
    pcVar3[0x2c] = '\0';
    pcVar3[0x6c] = '\0';
    memset(pcVar3 + 0x10,0,4);
    pcVar3[0xf0] = '5';
    pcVar3[0xf1] = '\x01';
    pcVar3[0xf2] = '\x06';
    pcVar3[0xf3] = '6';
    pcVar3[0xf4] = '\x04';
    memcpy(pcVar3 + 0xf5,(void *)(*(int *)((int)arg + 4) + 4),4);
    pcVar3[0xf9] = -1;
    if (0xfa < p_to->tot_len) {
      len = 0xfa;
      goto LAB_23047a78;
    }
  }
  iStack56 = (ip_addr_t)0xffffffff;
  udp_sendto_if(pcb,p_to,&iStack56,port,*(netif **)((int)arg + 4));
LAB_2304781c:
  pbuf_free(p);
  return;
}



err_t dhcp_server_start(netif *netif,ip4_addr_t *start,ip4_addr_t *end)

{
  udp_pcb *puVar1;
  dhcp_server *__s;
  
  __s = lw_dhcp_server;
  while (__s != (dhcp_server *)0x0) {
    if (__s->netif == netif) {
      (__s->start).addr = start->addr;
      (__s->end).addr = end->addr;
      (__s->current).addr = start->addr;
      return '\0';
    }
    __s = __s->next;
  }
  __s = (dhcp_server *)mem_malloc(0x1c);
  if (__s != (dhcp_server *)0x0) {
    memset(__s,0,0x1c);
    __s->netif = netif;
    __s->node_list = (dhcp_client_node *)0x0;
    __s->next = lw_dhcp_server;
    lw_dhcp_server = __s;
    (__s->start).addr = start->addr;
    (__s->end).addr = end->addr;
    (__s->current).addr = start->addr;
    puVar1 = udp_new();
    __s->pcb = puVar1;
    if (puVar1 != (udp_pcb *)0x0) {
      puVar1->so_options = puVar1->so_options | 0x20;
      udp_bind(__s->pcb,&ip_addr_any,0x43);
      udp_recv(__s->pcb,dhcp_server_recv,__s);
      return '\0';
    }
  }
  return -1;
}



