pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
err_t dhcp_server_stop(netif *netif)

{
  dhcp_server *pdVar1;
  
  pdVar1 = lw_dhcp_server;
  while( true ) {
    if (pdVar1 == (dhcp_server *)0x0) {
      printf("[DHCP] [DHCPD] CRITICAL: no dhcp_server instance found\r\n");
      return -6;
    }
    if (pdVar1->netif == netif) break;
    pdVar1 = pdVar1->next;
  }
  if (pdVar1->pcb != (udp_pcb *)0x0) {
    udp_remove(pdVar1->pcb);
  }
  lw_dhcp_server = (dhcp_server *)0x0;
  mem_free(pdVar1);
  return '\0';
}



void dhcpd_start(netif *netif)

{
  err_t eVar1;
  char *__format;
  undefined3 extraout_var;
  ip4_addr_t *piVar2;
  ip4_addr_t iStack60;
  ip4_addr_t ip_start;
  ip4_addr_t ip_end;
  char str_tmp [20];
  
  dhcp_stop(netif);
  set_if(netif,"192.168.169.1","0.0.0.0","255.255.255.0");
  netif_set_up(netif);
  memcpy(&ip_end,"192.168.169.1",0xe);
  __format = strchr((char *)&ip_end,0x2e);
  if (((__format == (char *)0x0) || (__format = strchr(__format + 1,0x2e), __format == (char *)0x0))
     || (__format = strchr(__format + 1,0x2e), __format == (char *)0x0)) {
    piVar2 = &ip_end;
    __format = "[DHCP] DHCPD_SERVER_IP: %s error!\r\n";
  }
  else {
    sprintf(__format + 1,"%d",2);
    ip4addr_aton((char *)&ip_end,&iStack60);
    printf("[DHCP] ip_start: [%s]\r\n",&ip_end);
    sprintf(__format + 1,"%d",0xfe);
    ip4addr_aton((char *)&ip_end,&ip_start);
    printf("[DHCP] ip_start: [%s]\r\n",&ip_end);
    eVar1 = dhcp_server_start(netif,&iStack60,&ip_start);
    piVar2 = (ip4_addr_t *)CONCAT31(extraout_var,eVar1);
    if (piVar2 == (ip4_addr_t *)0x0) {
      return;
    }
    __format = "[DHCP] dhcp_server_start res: %d.\r\n";
  }
  printf(__format,piVar2);
  return;
}



void tcpc_entry(void *arg)

{
  int iVar1;
  int counter_shared;
  char *__s;
  int s;
  int iVar2;
  ssize_t sVar3;
  char *__format;
  undefined4 uStack68;
  int flag;
  sockaddr_in addr;
  
  iVar1 = counter_shared;
  counter_shared = counter_shared + 1;
  printf("[TCPC] [THREAD] [%d] host is %s, counter is %d\r\n",iVar1,arg,iVar1);
  __s = (char *)pvPortMalloc(0x400);
  if (__s == (char *)0x0) {
    printf("[TCPC] [THREAD] [%d] [%d] NO mem for holding data\r\n",iVar1,counter_shared);
  }
  else {
    s = lwip_socket(2,1,6);
    if (s < 0) {
      printf("[TCPC] [THREAD] [%d] [%d] create socket failed, ret is sock %d!\r\n",iVar1,
             counter_shared,s);
    }
    else {
      flag._1_1_ = '\x02';
      flag._2_2_ = lwip_htons(7000);
      ipaddr_addr((char *)arg);
      iVar2 = lwip_connect(s,(sockaddr *)&flag,0x10);
      if (iVar2 < 0) {
        printf("[TCPC] [THREAD] [%d] [%d] Connect failed!\n",iVar1,counter_shared);
      }
      else {
        printf("[TCPC] [THREAD] [%d] [%d] Connect to iperf server successful!\n",iVar1,
               counter_shared);
        uStack68 = 1;
        lwip_setsockopt(s,6,1,&uStack68,4);
        memset(__s,0,0x400);
        iVar2 = 0;
        while( true ) {
          snprintf(__s,0x400,"Data Seq %d",iVar2);
          sVar3 = lwip_write(s,__s,0x400);
          if (sVar3 < 0) break;
          printf("[TCPC] [THREAD] [%d] [%d] send success with ret %d, %s\r\n",iVar1,counter_shared,
                 sVar3,__s);
          sVar3 = lwip_read(s,__s,0x400);
          if (sVar3 < 0) {
            __format = "[TCPC] [THREAD] [%d] [%d] recv failed with ret %d\r\n";
            goto LAB_23047f9a;
          }
          printf("[TCPC] [THREAD] [%d] [%d] recv success with ret %d, %s\r\n",iVar1,counter_shared,
                 sVar3,__s);
          vTaskDelay(1000);
          iVar2 = iVar2 + 1;
        }
        __format = "[TCPC] [THREAD] [%d] [%d] send failed with ret %d\r\n";
LAB_23047f9a:
        printf(__format,iVar1,counter_shared,sVar3);
      }
      lwip_close(s);
    }
    vPortFree(__s);
  }
  vPortFree(arg);
  return;
}



void tcpclient_cmd(char *buf,int len,int argc,char **argv)

{
  size_t sVar1;
  char *__dest;
  char acStack48 [4];
  char names [32];
  
  if (argc == 2) {
    sVar1 = strlen(argv[1]);
    __dest = (char *)pvPortMalloc(sVar1 + 4);
    if (__dest == (char *)0x0) {
      printf("[TCPC] run out of mem for host alloc\r\n");
    }
    strcpy(__dest,argv[1]);
    counter_4093 = counter_4093 + '\x01';
    snprintf(acStack48,0x20,"tcp%u");
    aos_task_new(acStack48,tcpc_entry,__dest,0x800);
  }
  else {
    printf("[TCPC] host IP address is required. Ex. 192.168.1.1\r\n");
  }
  return;
}



int network_netutils_tcpclinet_cli_register(void)

{
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

void TCP_Server(void *pvParameters)

{
  uint *puVar1;
  u16_t uVar2;
  void *__s;
  uint uVar3;
  int iVar4;
  char *__format;
  TickType_t TVar5;
  int iVar6;
  size_t size;
  ssize_t sVar7;
  undefined2 extraout_var;
  TickType_t *pTVar8;
  int *piVar9;
  uint s;
  int iVar10;
  uint uVar11;
  uint s_00;
  uint *puVar12;
  socklen_t sStack208;
  uint32_t client_addrlen;
  int yes;
  _types_fd_set fdsr;
  timeval tv;
  sockaddr_in server_addr;
  sockaddr_in client_addr;
  int connect_time [5];
  int time_diff [5];
  int time_last [5];
  int client_fd [5];
  
  client_addrlen = 1;
  __s = pvPortMalloc(0x2800);
  memset(__s,0,0x2800);
  memset(time_last + 4,0,0x14);
  memset(connect_time + 4,0,0x14);
  memset(time_diff + 4,0,0x14);
  memset(client_addr.sin_zero + 4,0,0x14);
  uVar3 = lwip_socket(2,1,6);
  s_00 = uVar3 >> 0x1f;
  if ((int)uVar3 < 0) {
    printf("socket creat failed\r\n");
    vPortFree(__s);
    vTaskDelete((TaskHandle_t)0x0);
  }
  else {
    printf("socket:%d\r\n",0);
  }
  iVar4 = lwip_setsockopt(s_00,0xfff,4,&client_addrlen,4);
  if (iVar4 == -1) {
    __format = "setsockopt failed\r\n";
  }
  else {
    tv._13_1_ = 2;
    tv._14_2_ = lwip_htons(0x141e);
    server_addr._0_4_ = lwip_htonl(0);
    iVar4 = lwip_bind(s_00,(sockaddr *)&tv.field_0xc,0x10);
    if (iVar4 < 0) {
      __format = "bind failed\r\n";
    }
    else {
      iVar4 = lwip_listen(s_00,5);
      if (iVar4 < 0) {
        __format = "listen failed\r\n";
      }
      else {
        printf("We are waiting a connection on port 5150.\r\n");
        printf("Listen(正在监听)...\r\n");
        sStack208 = 0x10;
        TVar5 = xTaskGetTickCount();
        iVar4 = 0;
        do {
          *(TickType_t *)((int)time_diff + iVar4 + 0x10) = TVar5;
          iVar6 = atoi((char *)pvParameters);
          *(int *)(client_addr.sin_zero + iVar4 + 4) = iVar6;
          iVar4 = iVar4 + 4;
        } while (iVar4 != 0x14);
        iVar4 = 0;
        uVar3 = s_00;
LAB_23048202:
        iVar6 = 0;
        do {
          *(undefined *)((int)&yes + iVar6) = 0;
          iVar6 = iVar6 + 1;
        } while (iVar6 != 8);
        fdsr.fds_bits[1] = 1;
        tv.tv_sec._0_4_ = 0;
        yes = yes | 1 << s_00;
        tv.tv_sec._4_4_ = 0;
        iVar6 = 0;
        do {
          puVar1 = (uint *)((int)time_last + iVar6 + 0x10);
          s = *puVar1;
          if (s != 0) {
            (&yes)[s >> 5] = 1 << (s & 0x1f) | (&yes)[s >> 5];
            TVar5 = xTaskGetTickCount();
            pTVar8 = (TickType_t *)((int)time_diff + iVar6 + 0x10);
            s = TVar5 - *pTVar8;
            *(uint *)((int)connect_time + iVar6 + 0x10) = s;
            if (999 < s) {
              *pTVar8 = TVar5;
              piVar9 = (int *)(client_addr.sin_zero + iVar6 + 4);
              iVar10 = *piVar9;
              *piVar9 = iVar10 + -1;
              if (iVar10 + -1 < 1) {
                iVar4 = iVar4 + -1;
                lwip_close(*puVar1);
                iVar10 = atoi((char *)pvParameters);
                uVar11 = *puVar1;
                *puVar1 = 0;
                *piVar9 = iVar10;
                s = uVar11 >> 5;
                (&yes)[s] = ~(1 << (uVar11 & 0x1f)) & (&yes)[s];
                printf("disconnect becase time out\r\n");
              }
            }
          }
          iVar6 = iVar6 + 4;
        } while (iVar6 != 0x14);
        iVar6 = lwip_select(uVar3 + 1,(_types_fd_set *)&yes,(_types_fd_set *)0x0,
                            (_types_fd_set *)0x0,(timeval *)(fdsr.fds_bits + 1));
        if (-1 < iVar6) {
          if (iVar6 != 0) {
            puVar12 = (uint *)(time_last + 4);
            iVar6 = 0;
            puVar1 = puVar12;
            do {
              s = *puVar1;
              if ((s != s_00) && ((1 << (s & 0x1f) & (&yes)[s >> 5]) != 0)) {
                TVar5 = xTaskGetTickCount();
                memset(__s,0,0x2800);
                size = lwip_recv(*puVar1,__s,0x2800,0);
                if ((int)size < 1) {
                  printf("recv failed:%d\r\n",size);
                  lwip_close(*puVar1);
                  iVar10 = atoi((char *)pvParameters);
                  *(int *)(client_addr.sin_zero + iVar6 * 4 + 4) = iVar10;
                  s = *puVar1 >> 5;
                  (&yes)[s] = ~(1 << (*puVar1 & 0x1f)) & (&yes)[s];
                }
                else {
                  iVar10 = atoi((char *)pvParameters);
                  *(int *)(client_addr.sin_zero + iVar6 * 4 + 4) = iVar10;
                  time_diff[iVar6 + 4] = TVar5;
                  printf("We successfully received %d bytes from %d client\r\n",size,iVar6);
                  printf("%s\r\n",__s);
                  sVar7 = lwip_send(*puVar1,__s,size,0);
                  if (0 < sVar7) {
                    printf("We successfully send %d bytes to %d client\r\n",sVar7,iVar6);
                    printf("\r\n");
                    goto LAB_2304837e;
                  }
                  printf("send failed\r\n",sVar7);
                  lwip_close(*puVar1);
                  iVar10 = atoi((char *)pvParameters);
                  s = *puVar1;
                  *(int *)(client_addr.sin_zero + iVar6 * 4 + 4) = iVar10;
                  uVar11 = s >> 5;
                  (&yes)[uVar11] = ~(1 << (s & 0x1f)) & (&yes)[uVar11];
                }
                *puVar1 = 0;
                iVar4 = iVar4 + -1;
              }
LAB_2304837e:
              iVar6 = iVar6 + 1;
              puVar1 = puVar1 + 1;
            } while (iVar6 != 5);
            if ((yes & 1 << s_00) != 0) {
              s = lwip_accept(s_00,(sockaddr *)(server_addr.sin_zero + 4),&sStack208);
              if ((int)s < 1) {
                printf("accept failed\r\n");
              }
              else {
                printf("new_sock:%d\r\n",s);
                __format = ip4addr_ntoa((ip4_addr_t *)&client_addr);
                uVar2 = lwip_htons(server_addr.sin_zero._6_2_);
                printf("We successfully got a connection from %s:%d\r\n",__format,
                       CONCAT22(extraout_var,uVar2));
                printf("We are waiting to receive data\r\n");
                if (iVar4 < 5) {
                  iVar6 = 0;
                  do {
                    if (*puVar12 == 0) {
                      TVar5 = xTaskGetTickCount();
                      time_diff[iVar6 + 4] = TVar5;
                      iVar10 = atoi((char *)pvParameters);
                      *(int *)(client_addr.sin_zero + iVar6 * 4 + 4) = iVar10;
                      time_last[iVar6 + 4] = s;
                      if ((int)uVar3 < (int)s) {
                        uVar3 = s;
                      }
                      iVar4 = iVar4 + 1;
                      printf("amount:%d\r\n",iVar4);
                      break;
                    }
                    iVar6 = iVar6 + 1;
                    puVar12 = puVar12 + 1;
                  } while (iVar6 != 5);
                }
                else {
                  printf("Max connections arrived!\r\n");
                  lwip_send(s,&DAT_23086a6c,4,0);
                  lwip_close(s);
                }
              }
            }
          }
          goto LAB_23048202;
        }
        __format = "select failed\r\n";
      }
    }
  }
  printf(__format);
  vPortFree(__s);
  lwip_close(s_00);
  vTaskDelete((TaskHandle_t)0x0);
  return;
}



void cmd_tcp_server(char *buf,int len,int argc,char **argv)

{
  if (argc != 2) {
    printf("Please Input Parameter!\r\n");
    return;
  }
  xTaskCreate(TCP_Server,"TCP Server",0x400,argv[1],0x14,(TaskHandle_t *)0x0);
  return;
}



int network_netutils_tcpserver_cli_register(void)

{
  return 0;
}



void iperf_server_udp_entry(char *name)

{
  size_t sVar1;
  char *__dest;
  
  sVar1 = strlen(name);
  __dest = (char *)pvPortMalloc(sVar1 + 1);
  strcpy(__dest,name);
  aos_task_new("ipus",iperf_server_udp,__dest,0x1000);
  return;
}



void iperf_client_udp_entry(char *name)

{
  size_t sVar1;
  char *__dest;
  
  sVar1 = strlen(name);
  __dest = (char *)pvPortMalloc(sVar1 + 4);
  strcpy(__dest,name);
  aos_task_new("ipu",iperf_client_udp,__dest,0x1000);
  return;
}



void iperf_server_entry(char *name)

{
  size_t sVar1;
  char *__dest;
  
  sVar1 = strlen(name);
  __dest = (char *)pvPortMalloc(sVar1 + 4);
  strcpy(__dest,name);
  aos_task_new("ips",iperf_server,__dest,0x1000);
  return;
}



void iperf_client_tcp_entry(char *name)

{
  size_t sVar1;
  char *__dest;
  
  sVar1 = strlen(name);
  __dest = (char *)pvPortMalloc(sVar1 + 4);
  strcpy(__dest,name);
  aos_task_new("ipc",iperf_client_tcp,__dest,0x1000);
  return;
}



