pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Control flow encountered bad instruction data

void iperf_server_udp(void *arg)

{
  err_t eVar1;
  udp_pcb *pcb;
  undefined3 extraout_var;
  ip_addr_t iStack84;
  ip_addr_t source_ip;
  iperf_server_udp_ctx context;
  
  if (arg == (void *)0x0) {
    vAssertCalled();
  }
  pcb = udp_new();
  if (pcb == (udp_pcb *)0x0) {
    printf("Create UDP Control block failed!\r\n");
  }
  else {
    iStack84 = (ip_addr_t)ipaddr_addr((char *)arg);
    eVar1 = udp_bind(pcb,&iStack84,0x1389);
    if (CONCAT31(extraout_var,eVar1) == 0) {
      printf("bind UDP socket successfully!\r\n");
      memset(&source_ip,0,0x40);
                    // WARNING: Bad instruction - Truncating control flow here
      halt_baddata();
    }
    printf("Bind failed!\r\n");
    udp_remove(pcb);
  }
  vPortFree(arg);
  return;
}



// WARNING: Control flow encountered bad instruction data

void iperf_server_udp_recv_fn(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  char speed [32];
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Control flow encountered bad instruction data

void iperf_client_udp(void *arg)

{
  sockaddr_in laddr;
  sockaddr_in raddr;
  char speed [64];
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Control flow encountered bad instruction data

void iperf_server(void *arg)

{
  uint32_t sin_size;
  int flag;
  sockaddr_in server_addr;
  sockaddr_in client_addr;
  char speed [32];
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Control flow encountered bad instruction data

void iperf_client_tcp(void *arg)

{
  int flag;
  sockaddr_in addr;
  char speed [32];
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



void ipus_test_cmd(char *buf,int len,int argc,char **argv)

{
  char *name;
  
  if (argc == 1) {
    printf("[NET] [IPC] [IPUS] Connecting with default address 0.0.0.0\r\n");
    name = "0.0.0.0";
  }
  else {
    if (argc != 2) {
      printf("[NET] [IPC] [IPUS] illegal address\r\n");
      return;
    }
    name = argv[1];
  }
  iperf_server_udp_entry(name);
  return;
}



void ipu_test_cmd(char *buf,int len,int argc,char **argv)

{
  char *name;
  
  if (argc == 1) {
    printf("[NET] [IPC] [IPU] Connecting with default address 192.168.11.1\r\n");
    name = "192.168.11.1";
  }
  else {
    if (argc != 2) {
      printf("[NET] [IPC] [IPU] illegal address\r\n");
      return;
    }
    name = argv[1];
  }
  iperf_client_udp_entry(name);
  return;
}



void ipc_test_cmd(char *buf,int len,int argc,char **argv)

{
  char *name;
  
  if (argc == 1) {
    printf("[NET] [IPC] [IPC] Connecting with default address 192.168.11.1\r\n");
    name = "192.168.11.1";
  }
  else {
    if (argc != 2) {
      printf("[NET] [IPC] [IPC] illegal address\r\n");
      return;
    }
    name = argv[1];
  }
  iperf_client_tcp_entry(name);
  return;
}



void ips_test_cmd(char *buf,int len,int argc,char **argv)

{
  char *name;
  
  if (argc == 1) {
    puts("[NET] [IPC] [IPS] Starting iperf server on 0.0.0.0\r\n");
    name = "192.168.11.1";
  }
  else {
    if (argc != 2) {
      printf("[NET] [IPC] [IPS] illegal address\r\n");
      return;
    }
    name = argv[1];
  }
  iperf_server_entry(name);
  return;
}



int network_netutils_iperf_cli_register(void)

{
  return 0;
}



void cmd_netstat(char *buf,int len,int argc,char **argv)

{
  tcpip_callback(stats_netstat,(void *)0x0);
  return;
}



int network_netutils_netstat_cli_register(void)

{
  return 0;
}



void ping_usage(void)

{
  printf("%s");
  return;
}



void ping_free(void *arg)

{
  u16_t uVar1;
  undefined2 extraout_var;
  utils_list_hdr *node;
  utils_memp_pool_t *pool;
  
  while (*(int *)((int)arg + 0x20) != 0) {
    uVar1 = lwip_htons(*(u16_t *)(*(int *)((int)arg + 0x20) + 4));
    printf("The sequence number %d timed out\r\n",CONCAT22(extraout_var,uVar1));
    pool = *(utils_memp_pool_t **)((int)arg + 0x18);
    node = utils_list_pop_front((utils_list *)((int)arg + 0x20));
    utils_memp_free(pool,node);
    *(char *)((int)arg + 0x12) = *(char *)((int)arg + 0x12) + -1;
  }
  raw_remove(*(raw_pcb **)((int)arg + 0x1c));
  utils_memp_deinit(*(utils_memp_pool_t **)((int)arg + 0x18));
  vPortFree(arg);
  return;
}



void ping_timeout(void *arg)

{
  undefined2 uVar1;
  utils_memp_pool_t *pool;
  undefined *dataptr;
  u16_t n;
  u16_t length;
  utils_list_hdr *list_hdr;
  pbuf *p;
  utils_list_hdr *puVar2;
  TickType_t TVar3;
  undefined2 extraout_var;
  uint uVar4;
  uint uVar5;
  
  while (*(int *)((int)arg + 0x20) != 0) {
    TVar3 = sys_now();
    if (TVar3 - *(int *)(*(int *)((int)arg + 0x20) + 8) <= (uint)*(ushort *)((int)arg + 0x10))
    break;
    length = lwip_htons(*(u16_t *)(*(int *)((int)arg + 0x20) + 4));
    printf("The sequence number %d timed out\r\n",CONCAT22(extraout_var,length));
    pool = *(utils_memp_pool_t **)((int)arg + 0x18);
    list_hdr = utils_list_pop_front((utils_list *)((int)arg + 0x20));
    utils_memp_free(pool,list_hdr);
    *(char *)((int)arg + 0x12) = *(char *)((int)arg + 0x12) + -1;
  }
  if (*(char *)((int)arg + 0x12) == '\n') {
    pool = *(utils_memp_pool_t **)((int)arg + 0x18);
    list_hdr = utils_list_pop_front((utils_list *)((int)arg + 0x20));
    utils_memp_free(pool,list_hdr);
    *(char *)((int)arg + 0x12) = *(char *)((int)arg + 0x12) + -1;
  }
  uVar5 = (uint)*(ushort *)((int)arg + 10) + 8;
  length = (u16_t)(uVar5 * 0x10000 >> 0x10);
  p = pbuf_alloc(PBUF_IP,length,PBUF_RAM);
  if (p != (pbuf *)0x0) {
    if ((p->len == p->tot_len) && (p->next == (pbuf *)0x0)) {
      dataptr = (undefined *)p->payload;
      list_hdr = (utils_list_hdr *)utils_memp_malloc(*(utils_memp_pool_t **)((int)arg + 0x18));
      if (list_hdr != (utils_list_hdr *)0x0) {
        *dataptr = 8;
        dataptr[1] = 0;
        dataptr[2] = 0;
        dataptr[3] = 0;
        uVar1 = *(undefined2 *)((int)arg + 0xe);
        dataptr[4] = (char)uVar1;
        dataptr[5] = (char)((ushort)uVar1 >> 8);
        n = (u16_t)(((uint)*(ushort *)((int)arg + 0xc) + 1) * 0x10000 >> 0x10);
        *(u16_t *)((int)arg + 0xc) = n;
        n = lwip_htons(n);
        dataptr[6] = (char)n;
        dataptr[7] = (char)(n >> 8);
        uVar4 = 0;
        while (uVar4 < (uVar5 & 0xffff) - 8) {
          dataptr[uVar4 + 8] = (char)uVar4;
          uVar4 = uVar4 + 1;
        }
        length = inet_chksum(dataptr,length);
        dataptr[2] = (char)length;
        dataptr[3] = (char)(length >> 8);
        *(undefined2 *)&list_hdr[1].next = *(undefined2 *)(dataptr + 6);
        raw_sendto(*(raw_pcb **)((int)arg + 0x1c),p,(ip_addr_t *)((int)arg + 0x14));
        puVar2 = (utils_list_hdr *)sys_now();
        list_hdr[2].next = puVar2;
        utils_list_push_back((utils_list *)((int)arg + 0x20),list_hdr);
        *(char *)((int)arg + 0x12) = *(char *)((int)arg + 0x12) + '\x01';
        *(int *)((int)arg + 4) = *(int *)((int)arg + 4) + 1;
      }
    }
    pbuf_free(p);
  }
  sys_timeout((uint)*(ushort *)((int)arg + 8),ping_timeout,arg);
  if (*(int *)((int)arg + 4) == *(int *)arg) {
    sys_untimeout(ping_timeout,arg);
    sys_timeout((uint)*(ushort *)((int)arg + 0x10),ping_free,arg);
    return;
  }
  return;
}



