pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: echo_hdr
// WARNING: Could not reconcile some variable overlaps

u8_t ping_recv(void *arg,raw_pcb *pcb,pbuf *p,ip_addr_t *addr)

{
  byte bVar1;
  ushort uVar2;
  void **node;
  void **ppvVar3;
  u16_t uVar4;
  char *pcVar5;
  undefined2 extraout_var;
  TickType_t TVar6;
  byte bStack24;
  byte bStack23;
  icmp_echo_hdr echo_hdr;
  
  if (((uint)p->tot_len != (uint)*(ushort *)((int)arg + 10) + 0x1c) ||
     (*(u32_t *)((int)arg + 0x14) != addr->addr)) {
    return '\0';
  }
  memcpy(&bStack24,(void *)((int)p->payload + 0x14),8);
  bStack24 = bStack24 | bStack23;
  if (bStack24 == 0) {
    if ((((echo_hdr._0_2_ == *(short *)((int)arg + 0xe)) && (*(char *)((int)arg + 0x12) != '\0')) &&
        (node = *(void ***)((int)arg + 0x20), node != (void **)0x0)) &&
       (*(ushort *)(node + 1) <= echo_hdr.chksum)) {
      if (echo_hdr.chksum == *(ushort *)(node + 1)) {
        *(void **)((int)arg + 0x20) = *node;
      }
      else {
        do {
          ppvVar3 = node;
          node = (void **)*ppvVar3;
          if (node == (void **)0x0) {
            return '\0';
          }
        } while (*(ushort *)(node + 1) < echo_hdr.chksum);
        if (echo_hdr.chksum != *(ushort *)(node + 1)) {
          return '\0';
        }
        if (node == *(void ***)((int)arg + 0x24)) {
          *(void ***)((int)arg + 0x24) = ppvVar3;
        }
        node = (void **)*ppvVar3;
        *ppvVar3 = *node;
      }
      uVar2 = p->tot_len;
      pcVar5 = ip4addr_ntoa((ip4_addr_t *)((int)arg + 0x14));
      uVar4 = lwip_htons(echo_hdr.chksum);
      bVar1 = *(byte *)((int)p->payload + 8);
      TVar6 = sys_now();
      printf("%d bytes from %s: icmp_seq=%d ttl=%d time=%lu ms\r\n ",(uint)uVar2,pcVar5,
             CONCAT22(extraout_var,uVar4),(uint)bVar1,TVar6 - (int)node[2]);
      utils_memp_free(*(utils_memp_pool_t **)((int)arg + 0x18),node);
      *(char *)((int)arg + 0x12) = *(char *)((int)arg + 0x12) + -1;
      pbuf_free(p);
      bStack24 = 1;
    }
  }
  else {
    bStack24 = 0;
  }
  return (u8_t)bStack24;
}



ping_var * ping_api_init(u16_t interval,u16_t size,u32_t count,u16_t timeout,ip_addr_t *dest)

{
  ping_var *recv_arg;
  int iVar1;
  char *__format;
  raw_pcb *pcb;
  
  recv_arg = (ping_var *)pvPortMalloc(0x28);
  if (recv_arg == (ping_var *)0x0) {
    printf("mem malloc failed!\r\n");
  }
  else {
    recv_arg->total_count = count;
    recv_arg->data_size = size;
    recv_arg->requests_count = 0;
    recv_arg->interval = interval;
    recv_arg->seq_num = 0;
    iVar1 = bl_rand();
    recv_arg->id = (u16_t)iVar1;
    recv_arg->timeout = timeout;
    recv_arg->node_num = '\0';
    (recv_arg->dest).addr = dest->addr;
    iVar1 = utils_memp_init(&recv_arg->pool,0xc,10,'\x04');
    if (iVar1 == 0) {
      utils_list_init(&recv_arg->req_list);
      pcb = raw_new('\x01');
      if (pcb != (raw_pcb *)0x0) {
        recv_arg->pcb = pcb;
        raw_recv(pcb,ping_recv,recv_arg);
        raw_bind(pcb,&ip_addr_any);
        sys_timeout(0,ping_timeout,recv_arg);
        return recv_arg;
      }
      __format = "pcb null, maybe the pcb pool or sys_timeout pool is empty\r\n";
    }
    else {
      __format = "pool_alloc failed\n";
    }
    printf(__format);
    printf("ping_init failed\r\n");
    vPortFree(recv_arg);
  }
  return recv_arg;
}



// WARNING: Type propagation algorithm not settling

void ping_cmd(char *buf,int len,int argc,char **argv)

{
  uint uVar1;
  int iVar2;
  hostent *phVar3;
  char *__format;
  char *pcVar4;
  uint uVar5;
  uint uVar6;
  u32_t count;
  char *pcStack84;
  getopt_env_t getopt_env;
  
  uVar1 = 5000;
  utils_getopt_init((getopt_env_t *)&pcStack84,0);
  count = 0;
  uVar6 = 0x20;
  uVar5 = 1000;
  do {
    while( true ) {
      while( true ) {
        while( true ) {
          iVar2 = utils_getopt((getopt_env_t *)&pcStack84,argc,argv,":i:s:c:W:h");
          if (iVar2 == -1) {
            if (getopt_env.optarg + 1 == (char *)argc) {
              phVar3 = lwip_gethostbyname(argv[(int)getopt_env.optarg]);
              if (phVar3 == (hostent *)0x0) {
                printf("Failed to resolve domain name\r\n");
                return;
              }
              ping_api_init((u16_t)uVar5,(u16_t)uVar6,count,(u16_t)uVar1,
                            (ip_addr_t *)((ip_addr_t *)phVar3->h_addr_list)->addr);
              return;
            }
            printf("Need target address\r\n");
            goto LAB_23049676;
          }
          if (iVar2 != 99) break;
          count = atoi(pcStack84);
        }
        if (iVar2 < 100) break;
        if (iVar2 == 0x69) {
          uVar5 = atoi(pcStack84);
          uVar5 = uVar5 & 0xffff;
        }
        else {
          if (iVar2 == 0x73) {
            uVar6 = atoi(pcStack84);
            uVar6 = uVar6 & 0xffff;
          }
          else {
            if (iVar2 == 0x68) goto LAB_23049676;
          }
        }
      }
      if (iVar2 == 0x3f) {
        pcVar4 = *argv;
        __format = "%s: unknown option %c\r\n";
        goto LAB_23049664;
      }
      if (iVar2 != 0x57) break;
      uVar1 = atoi(pcStack84);
      uVar1 = uVar1 & 0xffff;
    }
  } while (iVar2 != 0x3a);
  pcVar4 = *argv;
  __format = "%s: %c requires an argument\r\n";
LAB_23049664:
  printf(__format,pcVar4,getopt_env.opterr);
LAB_23049676:
  ping_usage();
  return;
}



int network_netutils_ping_cli_register(void)

{
  return 0;
}



int dirent_type(void *addr)

{
  int iVar1;
  byte bVar2;
  
  bVar2 = *(byte *)((int)addr + 3) & 7;
  if ((*(byte *)((int)addr + 3) & 7) == 0) {
    iVar1 = 0;
  }
  else {
    iVar1 = 2;
    if ((bVar2 != 2) && (iVar1 = 3, bVar2 == 1)) {
      return 1;
    }
  }
  return iVar1;
}



uint32_t dirent_hardfh(void *addr)

{
  uint uVar1;
  
  uVar1 = *(uint *)addr;
  return uVar1 << 0x18 | uVar1 >> 0x18 & 0xfffffff0 | (uVar1 & 0xff00) << 8 | uVar1 >> 8 & 0xff00;
}



uint32_t dirent_childaddr(void *addr)

{
  uint uVar1;
  
  uVar1 = *(uint *)((int)addr + 4);
  return uVar1 << 0x18 | uVar1 >> 0x18 & 0xfffffff0 | (uVar1 & 0xff00) << 8 | uVar1 >> 8 & 0xff00;
}



