pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint32_t dirent_size(void *addr)

{
  uint uVar1;
  
  uVar1 = *(uint *)((int)addr + 8);
  return uVar1 << 0x18 | uVar1 >> 0x18 | (uVar1 & 0xff00) << 8 | uVar1 >> 8 & 0xff00;
}



int romfs_close(file_t *fp)

{
  fp->f_arg = (void *)0x0;
  fp->offset = 0;
  return -1;
}



int romfs_ioctl(file_t *fp,int cmd,ulong arg)

{
  size_t sVar1;
  uint32_t uVar2;
  int iVar3;
  void *pvVar4;
  
  iVar3 = -2;
  if (((fp != (file_t *)0x0) && (arg != 0)) && (iVar3 = -3, cmd == 1)) {
    pvVar4 = fp->f_arg;
    sVar1 = strlen((char *)((int)pvVar4 + 0x10));
    *(size_t *)arg = (sVar1 + 0x10 & 0xfffffff0) + 0x10 + (int)pvVar4;
    uVar2 = dirent_size(fp->f_arg);
    *(uint32_t *)(arg + 4) = uVar2;
    return 0;
  }
  return iVar3;
}



ssize_t romfs_read(file_t *fp,char *buf,size_t length)

{
  size_t sVar1;
  uint32_t uVar2;
  uint uVar3;
  void *__src;
  
  __src = fp->f_arg;
  sVar1 = strlen((char *)((int)__src + 0x10));
  uVar2 = dirent_size(fp->f_arg);
  uVar3 = fp->offset;
  if (uVar3 < uVar2) {
    __src = (void *)((sVar1 + 0x10 & 0xfffffff0) + 0x10 + uVar3 + (int)__src);
    if (uVar3 + length < uVar2) {
      memcpy(buf,__src,length);
      fp->offset = fp->offset + length;
    }
    else {
      length = uVar2 - uVar3;
      memcpy(buf,__src,length);
      fp->offset = uVar2;
    }
  }
  else {
    length = 0;
  }
  return length;
}



undefined4 file_info(char *param_1,char **param_2,char **param_3)

{
  char *addr;
  char *pcVar1;
  char *pcVar2;
  size_t __n;
  int iVar3;
  uint32_t uVar4;
  TickType_t TVar5;
  
  addr = *param_2;
  pcVar1 = *param_3;
  __n = strlen(param_1);
  if (__n < 0x41) {
    if (romfs_root == addr) {
      __n = strlen(addr + 0x10);
      addr = addr + (__n + 0x10 & 0xfffffff0) + 0x50;
    }
    do {
      iVar3 = dirent_type(addr);
      if (iVar3 == 1) {
        __n = strlen(param_1);
        iVar3 = memcmp(param_1,addr + 0x10,__n);
        if ((iVar3 == 0) && (__n = strlen(param_1), addr[__n + 0x10] == '\0')) {
          uVar4 = dirent_hardfh(addr);
          pcVar2 = romfs_root;
          if (uVar4 == 0) goto LAB_230498ec;
LAB_230498ea:
          pcVar1 = pcVar2 + uVar4;
LAB_230498ec:
          *param_2 = addr;
          *param_3 = pcVar1;
          return 0;
        }
      }
      else {
        if (iVar3 == 2) {
          __n = strlen(param_1);
          iVar3 = memcmp(param_1,addr + 0x10,__n);
          if ((iVar3 == 0) && (__n = strlen(param_1), pcVar2 = romfs_root, addr[__n + 0x10] == '\0')
             ) {
            uVar4 = dirent_hardfh(addr);
            goto LAB_230498ea;
          }
        }
        else {
          if (iVar3 != 0) {
            if (TrapNetCounter == 0) {
              TVar5 = xTaskGetTickCount();
            }
            else {
              TVar5 = xTaskGetTickCountFromISR();
            }
            iVar3 = dirent_type(addr);
            bl_printk("[%10u][%s: %s:%4d] addr_start = %p, dirent_type(addr_start) = %d\r\n",TVar5,
                      &DAT_23072bcc,"bl_romfs.c",0xe6,addr,iVar3);
            log_buf_out("bl_romfs.c",0xe7,addr,8,LOG_BUF_OUT_DATA_TYPE_HEX);
            if (TrapNetCounter == 0) {
              xTaskGetTickCount();
            }
            else {
              xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] unknow the dirent_type.\r\n",&DAT_23072bcc,"bl_romfs.c",
                      0xe8);
            return 0xffffffff;
          }
        }
      }
      pcVar2 = romfs_root;
      uVar4 = dirent_hardfh(addr);
      addr = pcVar2 + uVar4;
    } while (addr < pcVar1);
    if (TrapNetCounter == 0) {
      xTaskGetTickCount();
    }
    else {
      xTaskGetTickCountFromISR();
    }
    bl_printk(
              "[%10u][%s: %s:%4d] start >= end, not found path = %s, addr_start = %p, addr_end = %p\r\n"
              ,&DAT_23081ce8,"bl_romfs.c",0xef,param_1,addr,pcVar1);
  }
  return 0xffffffff;
}



int romfs_closedir(file_t *fp,aos_dir_t *dir)

{
  if (dir != (aos_dir_t *)0x0) {
    aos_free(dir);
    return 0;
  }
  return -1;
}



off_t romfs_lseek(file_t *fp,off_t off,int whence)

{
  size_t sVar1;
  uint32_t uVar2;
  
  if (fp == (file_t *)0x0) {
    return -1;
  }
  uVar2 = dirent_size(fp->f_arg);
  if (whence == 0) {
    if (off < 0) {
      printf("not support whence.\r\n");
      return -2;
    }
  }
  else {
    if (whence == 2) {
      sVar1 = uVar2;
      if (0 < off) {
        printf("not support whence.\r\n");
        return -3;
      }
    }
    else {
      if (whence != 1) {
        printf("not support whence.\r\n");
        return -4;
      }
      sVar1 = fp->offset;
    }
    off = off + sVar1;
    if (off < 0) goto LAB_23049a8a;
  }
  if ((uint)off <= uVar2) {
    fp->offset = off;
    return off;
  }
LAB_23049a8a:
  printf("not support whence.\r\n");
  return -5;
}



aos_dirent_t * romfs_readdir(file_t *fp,aos_dir_t *dir)

{
  uint32_t uVar1;
  int iVar2;
  char *pcVar3;
  uint uVar4;
  void *addr;
  void *addr_00;
  
  if (dir == (aos_dir_t *)0x0) {
    return (aos_dirent_t *)0x0;
  }
LAB_23049af6:
  do {
    pcVar3 = romfs_root;
    if ((void *)dir[2].dd_vfs_fd == (void *)0x0) {
      dir[2].dd_vfs_fd = dir[1].dd_vfs_fd;
    }
    else {
      addr_00 = (void *)dir[1].dd_rsv;
      if (addr_00 <= (void *)dir[2].dd_vfs_fd) {
        return (aos_dirent_t *)0x0;
      }
      while( true ) {
        addr = (void *)dir[2].dd_vfs_fd;
        if (addr_00 <= addr) {
          return (aos_dirent_t *)0x0;
        }
        uVar1 = dirent_hardfh(addr);
        if (uVar1 == 0) break;
        if (addr == (void *)0x0) {
          return (aos_dirent_t *)0x0;
        }
        iVar2 = dirent_type(addr);
        if (iVar2 - 1U < 2) break;
        *(char **)&dir[2].dd_vfs_fd = pcVar3 + uVar1;
      }
    }
    strncpy((char *)((int)&dir[3].dd_vfs_fd + 1),(char *)(dir[2].dd_vfs_fd + 0x10),0x40);
    addr_00 = (void *)dir[2].dd_vfs_fd;
    *(undefined *)((int)&dir[0xb].dd_vfs_fd + 1) = 0;
    uVar1 = dirent_hardfh(addr_00);
    if (uVar1 == 0) {
      pcVar3 = (char *)dir[1].dd_rsv;
    }
    else {
      pcVar3 = romfs_root + uVar1;
    }
    *(char **)&dir[2].dd_vfs_fd = pcVar3;
    uVar4 = dir[3].dd_vfs_fd & 0xffff00;
    if (uVar4 == 0x2e2e00) {
      if (*(char *)((int)&dir[3].dd_vfs_fd + 3) != '\0') goto LAB_23049b2c;
      goto LAB_23049af6;
    }
    if (uVar4 != 0x2e00) {
LAB_23049b2c:
      return (aos_dirent_t *)&dir[2].dd_rsv;
    }
  } while( true );
}



uint32_t dirent_file(char *path,void **p_addr_start_input,void **p_addr_end_input)

{
  bool bVar1;
  char *pcVar2;
  size_t __n;
  size_t sVar3;
  int iVar4;
  TickType_t TVar5;
  char *format;
  char *pcVar6;
  uint32_t uVar7;
  undefined4 uVar8;
  uint uVar9;
  char *pcStack124;
  char *addr_start;
  char *addr_end;
  char name [65];
  
  __n = strlen(path);
  sVar3 = strlen("/romfs");
  if (sVar3 <= __n) {
    __n = strlen("/romfs");
    iVar4 = memcmp(path,"/romfs",__n);
    if (iVar4 == 0) {
      __n = strlen("/romfs");
      path = path + __n;
      if (*path == '/') {
        path = path + 1;
LAB_23049c4c:
        bVar1 = false;
        uVar9 = *(uint *)(romfs_root + 8);
        pcStack124 = romfs_root;
        addr_start = romfs_root +
                     (uVar9 >> 8 & 0xff00 | uVar9 << 0x18 | uVar9 >> 0x18 | (uVar9 & 0xff00) << 8);
        do {
          if (*path == '\0') {
LAB_23049da2:
            *(char **)p_addr_start_input = pcStack124;
            *(char **)p_addr_end_input = addr_start;
            return 0;
          }
          pcVar6 = strchr(path,0x2f);
          pcVar2 = pcStack124;
          format = romfs_root;
          if (bVar1) {
            uVar7 = dirent_childaddr(pcStack124);
            pcStack124 = format + uVar7;
            if (pcVar2 == pcStack124) {
              return 0xfffffffe;
            }
          }
          if (pcVar6 == (char *)0x0) {
            __n = strlen(path);
            if (0x40 < __n) {
              if (TrapNetCounter == 0) {
                TVar5 = xTaskGetTickCount();
              }
              else {
                TVar5 = xTaskGetTickCountFromISR();
              }
              uVar8 = 0x138;
              format = "[%10u][%s: %s:%4d] name too long!\r\n";
              goto LAB_23049c0a;
            }
            iVar4 = file_info(path,&pcStack124,&addr_start);
            if (iVar4 != 0) {
              if (TrapNetCounter == 0) {
                TVar5 = xTaskGetTickCount();
              }
              else {
                TVar5 = xTaskGetTickCountFromISR();
              }
              bl_printk(
                        "[%10u][%s: %s:%4d] file info error, p_name = %s, addr_start = %p, addr_end = %p\r\n"
                        ,TVar5,&DAT_23081ce8,"bl_romfs.c",0x13c,path,pcStack124,addr_start);
              return 0xffffffff;
            }
            goto LAB_23049da2;
          }
          memset(&addr_end,0,0x41);
          memcpy(&addr_end,path,(size_t)(pcVar6 + -(int)path));
          iVar4 = file_info(&addr_end,&pcStack124,&addr_start);
          if (iVar4 != 0) {
            if (TrapNetCounter == 0) {
              TVar5 = xTaskGetTickCount();
            }
            else {
              TVar5 = xTaskGetTickCountFromISR();
            }
            uVar8 = 0x147;
            format = "[%10u][%s: %s:%4d] file info error.\r\n";
            goto LAB_23049c0a;
          }
          path = pcVar6 + 1;
          bVar1 = true;
        } while( true );
      }
      if (*path == '\0') goto LAB_23049c4c;
      if (TrapNetCounter == 0) {
        TVar5 = xTaskGetTickCount();
      }
      else {
        TVar5 = xTaskGetTickCountFromISR();
      }
      uVar8 = 0x11a;
    }
    else {
      if (TrapNetCounter == 0) {
        TVar5 = xTaskGetTickCount();
      }
      else {
        TVar5 = xTaskGetTickCountFromISR();
      }
      uVar8 = 0x115;
    }
    format = "[%10u][%s: %s:%4d] not support path.\r\n";
LAB_23049c0a:
    bl_printk(format,TVar5,&DAT_23072bcc,"bl_romfs.c",uVar8);
  }
  return 0xffffffff;
}



// WARNING: Variable defined which should be unmapped: end_addr

aos_dir_t * romfs_opendir(file_t *fp,char *path)

{
  char *pcVar1;
  TickType_t TVar2;
  aos_dir_t *__s;
  uint32_t uVar3;
  size_t sVar4;
  char *pcStack24;
  char *start_addr;
  char *end_addr;
  
  if (romfs_root == (char *)0x0) {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] romfs_root is null.\r\n",TVar2,&DAT_23072bcc,"bl_romfs.c",0x20d);
    return (aos_dir_t *)0x0;
  }
  __s = (aos_dir_t *)aos_malloc(0x5d);
  if (__s != (aos_dir_t *)0x0) {
    memset(__s,0,0x5d);
    uVar3 = dirent_file(path,&pcStack24,&start_addr);
    pcVar1 = romfs_root;
    if (uVar3 == 0) {
      if (pcStack24 == romfs_root) {
        sVar4 = strlen(pcStack24 + 0x10);
        *(char **)&__s[1].dd_vfs_fd = pcStack24 + (sVar4 + 0x10 & 0xfffffff0) + 0x50;
      }
      else {
        uVar3 = dirent_childaddr(pcStack24);
        if (uVar3 == 0) {
          return (aos_dir_t *)0x0;
        }
        *(char **)&__s[1].dd_vfs_fd = pcVar1 + uVar3;
      }
      __s[2].dd_vfs_fd = 0;
      *(char **)&__s[1].dd_rsv = start_addr;
      return __s;
    }
    aos_free(__s);
  }
  return (aos_dir_t *)0x0;
}



// WARNING: Variable defined which should be unmapped: end_addr

int romfs_stat(file_t *fp,char *path,stat *st)

{
  char *addr;
  uint32_t uVar1;
  TickType_t TVar2;
  int iVar3;
  uint32_t uVar4;
  mode_t mVar5;
  char *pcStack24;
  char *start_addr;
  char *end_addr;
  
  pcStack24 = (char *)0x0;
  start_addr = (char *)0x0;
  uVar1 = dirent_file(path,&pcStack24,&start_addr);
  addr = pcStack24;
  if (uVar1 == 0) {
    if (pcStack24 == romfs_root) {
      st->st_size = 0;
    }
    else {
      iVar3 = dirent_type(pcStack24);
      if (iVar3 == 1) {
        st->st_size = 0;
        mVar5 = 0x4000;
      }
      else {
        if (iVar3 != 2) {
          if (TrapNetCounter == 0) {
            TVar2 = xTaskGetTickCount();
          }
          else {
            TVar2 = xTaskGetTickCountFromISR();
          }
          bl_printk("[%10u][%s: %s:%4d] dirent_type err.\r\n",TVar2,&DAT_23081ce8,"bl_romfs.c",0x1fa
                   );
          return -2;
        }
        uVar4 = dirent_size(addr);
        st->st_size = uVar4;
        mVar5 = 0x8000;
      }
      st->st_mode = mVar5;
    }
  }
  else {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] dirent_file res = %d\r\n",TVar2,&DAT_23081ce8,"bl_romfs.c",0x1ea,
              uVar1);
    uVar1 = 0xffffffff;
  }
  return uVar1;
}



int romfs_open(file_t *fp,char *path,int flags)

{
  bool bVar1;
  char cVar2;
  TickType_t TVar3;
  char *format;
  size_t sVar4;
  size_t __n;
  int iVar5;
  uint32_t uVar6;
  undefined4 uVar7;
  size_t unaff_s4;
  void *pvStack40;
  char *start_addr;
  char *end_addr;
  
  if (romfs_root == (char *)0x0) {
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar7 = 0x162;
    format = "[%10u][%s: %s:%4d] romfs_root is null.\r\n";
  }
  else {
    sVar4 = strlen(path);
    __n = strlen("/romfs");
    iVar5 = strncmp(path,"/romfs",__n);
    if (iVar5 == 0) {
      __n = 0;
      do {
        if (sVar4 == __n) {
          uVar6 = dirent_file(path,&pvStack40,&start_addr);
          if (uVar6 != 0) {
            return -2;
          }
          fp->offset = 0;
          fp->f_arg = pvStack40;
          return 0;
        }
        cVar2 = path[__n];
        if (0x19 < (byte)(cVar2 + 0x9fU)) {
          if (((byte)(cVar2 + 0xbfU) < 0x1a) || ((byte)(cVar2 - 0x30U) < 10)) {
            if (cVar2 == '/') goto LAB_2304a102;
          }
          else {
            if (cVar2 == '/') {
LAB_2304a102:
              if (__n == 0) {
                unaff_s4 = 0;
              }
              else {
                bVar1 = __n == unaff_s4;
                unaff_s4 = __n;
                if (bVar1) {
                  if (TrapNetCounter == 0) {
                    TVar3 = xTaskGetTickCount();
                  }
                  else {
                    TVar3 = xTaskGetTickCountFromISR();
                  }
                  uVar7 = 0x73;
                  format = "[%10u][%s: %s:%4d] format error.\r\n";
                  goto LAB_2304a048;
                }
              }
            }
            else {
              if ((cVar2 != '_') && (1 < (byte)(cVar2 - 0x2dU))) {
                if (TrapNetCounter == 0) {
                  TVar3 = xTaskGetTickCount();
                }
                else {
                  TVar3 = xTaskGetTickCountFromISR();
                }
                bl_printk("[%10u][%s: %s:%4d] is_path_ch. i = %d\r\n",TVar3,&DAT_23072bcc,
                          "bl_romfs.c",0x69,__n);
                goto LAB_2304a0d4;
              }
            }
          }
        }
        __n = __n + 1;
      } while( true );
    }
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar7 = 0x61;
    format = "[%10u][%s: %s:%4d] format is error.\r\n";
LAB_2304a048:
    bl_printk(format,TVar3,&DAT_23072bcc,"bl_romfs.c",uVar7);
LAB_2304a0d4:
    if (TrapNetCounter == 0) {
      TVar3 = xTaskGetTickCount();
    }
    else {
      TVar3 = xTaskGetTickCountFromISR();
    }
    uVar7 = 0x168;
    format = "[%10u][%s: %s:%4d] path format is error.\r\n";
  }
  bl_printk(format,TVar3,&DAT_23072bcc,"bl_romfs.c",uVar7);
  return -1;
}



