pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: info

int romfs_register(void)

{
  uint __s1;
  int iVar1;
  TickType_t TVar2;
  char *format;
  size_t __n;
  undefined4 uVar3;
  undefined auStack44 [4];
  bl_mtd_info_t info;
  
  iVar1 = bl_mtd_open("media",&handle_romfs,2);
  if (iVar1 == 0) {
    memset(auStack44,0,0x1c);
    bl_mtd_info(handle_romfs,(bl_mtd_info_t *)auStack44);
    __s1 = info.size;
    if ((void *)info.size == (void *)0x0) {
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar3 = 0x8d;
      format = "[%10u][%s: %s:%4d] romfs has no XIP-Addr\r\n";
    }
    else {
      __n = strlen("-rom1fs-");
      iVar1 = memcmp((void *)__s1,"-rom1fs-",__n);
      if (iVar1 == 0) {
        romfs_root = (char *)info.size;
        log_buf_out("bl_romfs.c",0x98,(void *)info.size,0x40,LOG_BUF_OUT_DATA_TYPE_HEX);
        iVar1 = aos_register_fs("/romfs",&romfs_ops,(void *)0x0);
        return iVar1;
      }
      if (TrapNetCounter == 0) {
        TVar2 = xTaskGetTickCount();
      }
      else {
        TVar2 = xTaskGetTickCountFromISR();
      }
      uVar3 = 0x92;
      format = "[%10u][%s: %s:%4d] romfs magic is NOT correct\r\n";
    }
    bl_printk(format,TVar2,&DAT_23072bcc,"bl_romfs.c",uVar3);
  }
  else {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] [EF] [PART] [XIP] error when get romfs partition %d\r\n",TVar2,
              &DAT_23072bcc,"bl_romfs.c",0x86,iVar1);
  }
  return -1;
}



void _startup_sntp(void *arg)

{
  puts("--------------------------------------- Start NTP now\r\n");
  sntp_setoperatingmode('\0');
  sntp_setservername('\0',"0.asia.pool.ntp.org");
  sntp_init();
  puts("--------------------------------------- Start NTP Done\r\n");
  return;
}



// WARNING: Could not reconcile some variable overlaps

void cmd_sntp_date(char *buf,int len,int argc,char **argv)

{
  uint32_t uStack44;
  uint32_t seconds;
  uint32_t frags;
  utils_time_date_t date;
  
  uStack44 = 0;
  seconds = 0;
  puts("test epoch from 1581863713 --->>>\r\n");
  puts("Should be Sunday, February 16, 2020 2:35:13 PM\r\n");
  utils_time_date_from_epoch(0x5e495321,&frags);
  printf("Date & time is: %u-%02u-%02u %02u:%02u:%02u (Day %u of week, Day %u of Year)\r\n",
         date._4_4_,(uint)date.ntp_minute,(uint)date.ntp_hour,(uint)(byte)frags,(uint)frags._1_1_,
         (uint)frags._2_1_,(uint)frags._3_1_);
  puts("SNTP GMT time is\r\n");
  sntp_get_time(&uStack44,&seconds);
  utils_time_date_from_epoch(uStack44,&frags);
  printf("Date & time is: %u-%02u-%02u %02u:%02u:%02u (Day %u of week, Day %u of Year)\r\n",
         date._4_4_,(uint)date.ntp_minute,(uint)date.ntp_hour,(uint)(byte)frags,(uint)frags._1_1_,
         (uint)frags._2_1_,(uint)frags._3_1_);
  return;
}



void cmd_sntp_time(char *buf,int len,int argc,char **argv)

{
  uint32_t uStack24;
  uint32_t seconds;
  uint32_t frags;
  
  uStack24 = 0;
  seconds = 0;
  sntp_get_time(&uStack24,&seconds);
  printf("[NTP] time is %lu:%lu\r\n",uStack24,seconds);
  return;
}



void cmd_sntp_start(char *buf,int len,int argc,char **argv)

{
  tcpip_callback(_startup_sntp,(void *)0x0);
  return;
}



int sntp_cli_init(void)

{
  return 0;
}



void sntp_retry(void *arg)

{
  uint uVar1;
  
  sys_timeout(sntp_retry_timeout,sntp_request,(void *)0x0);
  uVar1 = sntp_retry_timeout << 1;
  if ((uVar1 < 0x249f1) && (sntp_retry_timeout < uVar1)) {
    sntp_retry_timeout = uVar1;
  }
  return;
}



void sntp_recv(void *arg,udp_pcb *pcb,pbuf *p,ip_addr_t *addr,u16_t port)

{
  int iVar1;
  byte bVar2;
  u8_t uVar3;
  undefined3 extraout_var;
  u32_t uVar4;
  u32_t uVar5;
  uint uVar6;
  undefined2 in_register_0000203a;
  u32_t uStack40;
  sntp_timestamps timestamps;
  
  printf("SNTP time now\r\n",CONCAT22(in_register_0000203a,port));
  iVar1 = -0x10;
  if (p->tot_len == 0x30) {
    bVar2 = pbuf_get_at(p,0);
    if (sntp_opmode == '\0') {
      iVar1 = -3;
      if ((bVar2 & 7) != 4) goto LAB_2304a444;
    }
    else {
      iVar1 = -3;
      if ((sntp_opmode != '\x01') || ((bVar2 & 7) != 5)) goto LAB_2304a444;
    }
    uVar3 = pbuf_get_at(p,1);
    if (CONCAT31(extraout_var,uVar3) == 0) {
      printf("sntp_recv: Received Kiss-of-Death\r\n");
      iVar1 = 1;
    }
    else {
      pbuf_copy_partial(p,&uStack40,8,0x28);
      iVar1 = 0;
    }
  }
LAB_2304a444:
  pbuf_free(p);
  printf("Try process\r\n");
  if (iVar1 == 0) {
    uVar4 = lwip_htonl(uStack40);
    uVar5 = lwip_htonl(timestamps.xmit.sec);
    printf("Processing...\r\n");
    vTaskEnterCritical();
    ntp_frag = uVar5;
    ntp_sec = uVar4 + 0x7c558180;
    time_obtained = xTaskGetTickCount();
    uVar6 = ntp_frag / 1000 + ntp_sec * 1000;
    bl_sys_time_update(uVar6,(int)((ulonglong)ntp_sec * 1000 >> 0x20) +
                             (uint)(uVar6 < ntp_sec * 1000));
    vTaskExitCritical();
    printf("sntp_process: %ld, %lu us\r\n",uVar4 + 0x7c558180,
           (int)((ulonglong)uVar5 * 1000000 >> 0x20));
    sntp_servers[0].reachability = sntp_servers[0].reachability | 1;
    if (sntp_opmode == '\0') {
      sys_untimeout(sntp_retry,(void *)0x0);
      sys_untimeout(sntp_request,(void *)0x0);
      sntp_retry_timeout = 15000;
      sys_timeout(3600000,sntp_request,(void *)0x0);
    }
  }
  else {
    if ((iVar1 == 1) && (sntp_opmode == '\0')) {
      sntp_retry((void *)0x0);
    }
  }
  return;
}



void sntp_send_request(ip_addr_t *server_addr)

{
  undefined *__s;
  pbuf *p;
  code *handler;
  
  p = pbuf_alloc(PBUF_TRANSPORT,0x30,PBUF_RAM);
  if (p == (pbuf *)0x0) {
    handler = sntp_request;
  }
  else {
    __s = (undefined *)p->payload;
    memset(__s,0,0x30);
    *__s = 0x23;
    udp_sendto(sntp_pcb,p,server_addr,0x7b);
    pbuf_free(p);
    sntp_servers[0].reachability = sntp_servers[0].reachability << 1;
    handler = sntp_retry;
  }
  sys_timeout(15000,handler,(void *)0x0);
  return;
}



