pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void sntp_request(void *arg)

{
  err_t eVar1;
  undefined3 extraout_var;
  ip_addr_t iStack20;
  ip_addr_t sntp_server_address;
  
  if (sntp_servers[0].name == (char *)0x0) {
    iStack20 = (ip_addr_t)sntp_servers[0].addr;
    if (sntp_servers[0].addr == 0) goto LAB_2304a64e;
  }
  else {
    sntp_servers[0].addr = 0;
    eVar1 = dns_gethostbyname(sntp_servers[0].name,&iStack20,sntp_dns_found,(void *)0x0);
    if (CONCAT31(extraout_var,eVar1) == -5) {
      return;
    }
    if (CONCAT31(extraout_var,eVar1) != 0) {
LAB_2304a64e:
      sys_timeout(15000,sntp_retry,(void *)0x0);
      return;
    }
  }
  sntp_servers[0].addr = (u32_t)iStack20;
  sntp_send_request(&iStack20);
  return;
}



void sntp_dns_found(char *hostname,ip_addr_t *ipaddr,void *arg)

{
  if (ipaddr != (ip_addr_t *)0x0) {
    sntp_servers[0].addr = ipaddr->addr;
    sntp_send_request(ipaddr);
    return;
  }
  sntp_retry((void *)0x0);
  return;
}



void sntp_init(void)

{
  udp_pcb *pcb;
  uint uVar1;
  
  if (sntp_pcb == (udp_pcb *)0x0) {
    sntp_pcb = udp_new_ip_type();
    printf("[SNTP] pcb isready, %p\r\n");
    if (sntp_pcb != (udp_pcb *)0x0) {
      udp_recv(sntp_pcb,sntp_recv,(void *)0x0);
      pcb = sntp_pcb;
      if (sntp_opmode == '\0') {
        sntp_retry_timeout = 15000;
        uVar1 = bl_rand();
        sys_timeout(uVar1 % 5000,sntp_request,(void *)0x0);
        return;
      }
      if (sntp_opmode == '\x01') {
        sntp_pcb->so_options = sntp_pcb->so_options | 0x20;
        udp_bind(pcb,&ip_addr_any,0x7b);
        return;
      }
    }
  }
  return;
}



void sntp_setoperatingmode(u8_t operating_mode)

{
  sntp_opmode = operating_mode;
  return;
}



int sntp_get_time(uint32_t *seconds,uint32_t *frags)

{
  TickType_t TVar1;
  int iVar2;
  uint uVar3;
  
  vTaskEnterCritical();
  if (ntp_sec == 0) {
    *seconds = 0;
    *frags = 0;
  }
  else {
    TVar1 = xTaskGetTickCount();
    iVar2 = TVar1 - time_obtained;
    uVar3 = ntp_frag / 1000;
    *seconds = iVar2 / 1000 + ntp_sec;
    *frags = iVar2 % 1000 + uVar3;
  }
  vTaskExitCritical();
  return 0;
}



void sntp_setservername(u8_t idx,char *server)

{
  undefined3 in_register_00002029;
  
  if (CONCAT31(in_register_00002029,idx) == 0) {
    sntp_servers[0].name = server;
  }
  return;
}



char * utils_bin2hex(char *dst,void *src,size_t count)

{
  char cVar1;
  byte *pbVar2;
  char *pcVar3;
  
  pbVar2 = (byte *)src;
  pcVar3 = dst;
  while (pbVar2 != (byte *)((int)src + count)) {
    cVar1 = "0123456789ABCDEF"[(uint)*pbVar2 & 0xf];
    *pcVar3 = "0123456789ABCDEF"[*pbVar2 >> 4];
    pcVar3[1] = cVar1;
    pbVar2 = pbVar2 + 1;
    pcVar3 = pcVar3 + 2;
  }
  return dst + count * 2;
}



void utils_sha256_init(iot_sha256_context *ctx)

{
  memset(ctx,0,0x6c);
  return;
}



void utils_sha256_free(iot_sha256_context *ctx)

{
  iot_sha256_context *piVar1;
  
  piVar1 = ctx + 1;
  if (ctx != (iot_sha256_context *)0x0) {
    while (ctx != piVar1) {
      *(undefined *)ctx->total = 0;
      ctx = (iot_sha256_context *)((int)ctx->total + 1);
    }
  }
  return;
}



void utils_sha256_starts(iot_sha256_context *ctx)

{
  ctx->state[0] = 0x6a09e667;
  ctx->state[1] = 0xbb67ae85;
  ctx->state[2] = 0x3c6ef372;
  ctx->state[3] = 0xa54ff53a;
  ctx->state[4] = 0x510e527f;
  ctx->state[5] = 0x9b05688c;
  ctx->state[6] = 0x1f83d9ab;
  ctx->total[0] = 0;
  ctx->total[1] = 0;
  ctx->state[7] = 0x5be0cd19;
  ctx->is224 = 0;
  return;
}



void utils_sha256_process(iot_sha256_context *ctx,uchar *data)

{
  uint uVar1;
  uint32_t *puVar2;
  byte *pbVar3;
  byte *pbVar4;
  uint uVar5;
  uint uVar6;
  uint32_t uVar7;
  uint uVar8;
  uint32_t *puVar9;
  uint uVar10;
  uint32_t *puVar11;
  uint uVar12;
  int iVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  uint uVar17;
  uint32_t *puVar18;
  uint uVar19;
  uint uVar20;
  uint uVar21;
  uint32_t *puVar22;
  uint uVar23;
  uint32_t uVar24;
  uint uVar25;
  uint32_t *puVar26;
  uint32_t uVar27;
  uint32_t local_150;
  uint32_t A [8];
  uint32_t W [64];
  
  puVar18 = &local_150;
  puVar9 = &local_150;
  puVar11 = ctx->state;
  do {
    uVar7 = *puVar11;
    puVar11 = puVar11 + 1;
    *puVar9 = uVar7;
    puVar9 = puVar9 + 1;
  } while ((uint32_t *)ctx->buffer != puVar11);
  puVar11 = A + 7;
  pbVar3 = data;
  puVar9 = puVar11;
  do {
    pbVar4 = pbVar3 + 4;
    *puVar9 = (uint)*pbVar3 << 0x18 | (uint)pbVar3[1] << 0x10 | (uint)pbVar3[3] |
              (uint)pbVar3[2] << 8;
    pbVar3 = pbVar4;
    puVar9 = puVar9 + 1;
  } while (data + 0x40 != pbVar4);
  puVar2 = K;
  puVar9 = K;
  puVar26 = puVar11;
  do {
    puVar22 = puVar9 + 8;
    iVar13 = A[6] + ((A[3] >> 6 | A[3] << 0x1a) ^ (A[3] >> 0xb | A[3] << 0x15) ^
                    (A[3] << 7 | A[3] >> 0x19)) + *puVar9 + *puVar26 + ((A[5] ^ A[4]) & A[3] ^ A[5])
    ;
    uVar12 = A[2] + iVar13;
    uVar14 = iVar13 + ((local_150 >> 2 | local_150 << 0x1e) ^ (local_150 >> 0xd | local_150 << 0x13)
                      ^ (local_150 << 10 | local_150 >> 0x16)) +
                      ((local_150 | A[0]) & A[1] | local_150 & A[0]);
    iVar13 = ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19)) +
             A[5] + puVar9[1] + puVar26[1] + ((A[3] ^ A[4]) & uVar12 ^ A[4]);
    uVar1 = ((uVar14 >> 2 | uVar14 * 0x40000000) ^ (uVar14 >> 0xd | uVar14 * 0x80000) ^
            (uVar14 * 0x400 | uVar14 >> 0x16)) + ((uVar14 | local_150) & A[0] | uVar14 & local_150)
            + iVar13;
    uVar10 = A[1] + iVar13;
    iVar13 = ((uVar10 >> 6 | uVar10 * 0x4000000) ^ (uVar10 >> 0xb | uVar10 * 0x200000) ^
             (uVar10 * 0x80 | uVar10 >> 0x19)) +
             A[4] + puVar9[2] + puVar26[2] + ((uVar12 ^ A[3]) & uVar10 ^ A[3]);
    uVar5 = ((uVar1 >> 2 | uVar1 * 0x40000000) ^ (uVar1 >> 0xd | uVar1 * 0x80000) ^
            (uVar1 * 0x400 | uVar1 >> 0x16)) + ((uVar14 | uVar1) & local_150 | uVar14 & uVar1) +
            iVar13;
    uVar8 = A[0] + iVar13;
    iVar13 = ((uVar8 >> 6 | uVar8 * 0x4000000) ^ (uVar8 >> 0xb | uVar8 * 0x200000) ^
             (uVar8 * 0x80 | uVar8 >> 0x19)) +
             A[3] + puVar9[3] + puVar26[3] + ((uVar12 ^ uVar10) & uVar8 ^ uVar12);
    uVar16 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
             (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar1 | uVar5) & uVar14 | uVar1 & uVar5) + iVar13;
    uVar6 = local_150 + iVar13;
    iVar13 = ((uVar6 >> 6 | uVar6 * 0x4000000) ^ (uVar6 >> 0xb | uVar6 * 0x200000) ^
             (uVar6 * 0x80 | uVar6 >> 0x19)) +
             uVar12 + puVar9[4] + puVar26[4] + ((uVar10 ^ uVar8) & uVar6 ^ uVar10);
    A[2] = ((uVar16 >> 2 | uVar16 * 0x40000000) ^ (uVar16 >> 0xd | uVar16 * 0x80000) ^
           (uVar16 * 0x400 | uVar16 >> 0x16)) + ((uVar5 | uVar16) & uVar1 | uVar5 & uVar16) + iVar13
    ;
    A[6] = uVar14 + iVar13;
    iVar13 = ((A[6] >> 6 | A[6] * 0x4000000) ^ (A[6] >> 0xb | A[6] * 0x200000) ^
             (A[6] * 0x80 | A[6] >> 0x19)) +
             uVar10 + puVar9[5] + puVar26[5] + ((uVar8 ^ uVar6) & A[6] ^ uVar8);
    A[1] = ((A[2] >> 2 | A[2] * 0x40000000) ^ (A[2] >> 0xd | A[2] * 0x80000) ^
           (A[2] * 0x400 | A[2] >> 0x16)) + ((uVar16 | A[2]) & uVar5 | uVar16 & A[2]) + iVar13;
    A[5] = uVar1 + iVar13;
    iVar13 = ((A[5] >> 6 | A[5] * 0x4000000) ^ (A[5] >> 0xb | A[5] * 0x200000) ^
             (A[5] * 0x80 | A[5] >> 0x19)) +
             uVar8 + puVar9[6] + puVar26[6] + ((uVar6 ^ A[6]) & A[5] ^ uVar6);
    A[0] = ((A[1] >> 2 | A[1] * 0x40000000) ^ (A[1] >> 0xd | A[1] * 0x80000) ^
           (A[1] * 0x400 | A[1] >> 0x16)) + ((A[2] | A[1]) & uVar16 | A[2] & A[1]) + iVar13;
    A[4] = uVar5 + iVar13;
    iVar13 = ((A[4] >> 6 | A[4] * 0x4000000) ^ (A[4] >> 0xb | A[4] * 0x200000) ^
             (A[4] * 0x80 | A[4] >> 0x19)) +
             uVar6 + puVar9[7] + puVar26[7] + ((A[6] ^ A[5]) & A[4] ^ A[6]);
    A[3] = uVar16 + iVar13;
    local_150 = ((A[0] >> 2 | A[0] * 0x40000000) ^ (A[0] >> 0xd | A[0] * 0x80000) ^
                (A[0] * 0x400 | A[0] >> 0x16)) + ((A[1] | A[0]) & A[2] | A[1] & A[0]) + iVar13;
    puVar9 = puVar22;
    puVar26 = puVar26 + 8;
  } while (puVar22 != K + 0x10);
  do {
    uVar19 = puVar11[0xe];
    uVar1 = puVar11[1];
    uVar20 = puVar11[0xf];
    uVar23 = ((uVar19 << 0xf | uVar19 >> 0x11) ^ (uVar19 << 0xd | uVar19 >> 0x13) ^ uVar19 >> 10) +
             puVar11[9] + *puVar11 +
             ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    uVar10 = puVar11[3];
    iVar13 = A[6] + ((A[3] >> 6 | A[3] << 0x1a) ^ (A[3] >> 0xb | A[3] << 0x15) ^
                    (A[3] << 7 | A[3] >> 0x19)) + ((A[5] ^ A[4]) & A[3] ^ A[5]) + puVar2[0x10] +
                    uVar23;
    uVar16 = A[2] + iVar13;
    uVar15 = iVar13 + ((local_150 >> 2 | local_150 << 0x1e) ^ (local_150 >> 0xd | local_150 << 0x13)
                      ^ (local_150 << 10 | local_150 >> 0x16)) +
                      ((local_150 | A[0]) & A[1] | local_150 & A[0]);
    uVar6 = puVar11[2];
    uVar1 = ((uVar20 << 0xf | uVar20 >> 0x11) ^ (uVar20 << 0xd | uVar20 >> 0x13) ^ uVar20 >> 10) +
            uVar1 + puVar11[10] +
            ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((A[3] ^ A[4]) & uVar16 ^ A[4]) + A[5] + puVar2[0x11] + uVar1 +
             ((uVar16 >> 6 | uVar16 * 0x4000000) ^ (uVar16 >> 0xb | uVar16 * 0x200000) ^
             (uVar16 * 0x80 | uVar16 >> 0x19));
    uVar5 = ((uVar15 >> 2 | uVar15 * 0x40000000) ^ (uVar15 >> 0xd | uVar15 * 0x80000) ^
            (uVar15 * 0x400 | uVar15 >> 0x16)) + ((local_150 | uVar15) & A[0] | local_150 & uVar15)
            + iVar13;
    uVar14 = A[1] + iVar13;
    uVar6 = ((uVar23 * 0x8000 | uVar23 >> 0x11) ^ (uVar23 * 0x2000 | uVar23 >> 0x13) ^ uVar23 >> 10)
            + uVar6 + puVar11[0xb] +
            ((uVar10 >> 7 | uVar10 << 0x19) ^ (uVar10 << 0xe | uVar10 >> 0x12) ^ uVar10 >> 3);
    iVar13 = ((A[3] ^ uVar16) & uVar14 ^ A[3]) + A[4] + puVar2[0x12] + uVar6 +
             ((uVar14 >> 6 | uVar14 * 0x4000000) ^ (uVar14 >> 0xb | uVar14 * 0x200000) ^
             (uVar14 * 0x80 | uVar14 >> 0x19));
    puVar11[0x11] = uVar1;
    uVar8 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
            (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar15 | uVar5) & local_150 | uVar15 & uVar5) +
            iVar13;
    uVar12 = A[0] + iVar13;
    uVar25 = puVar11[4];
    uVar1 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
            uVar10 + puVar11[0xc] +
            ((uVar25 >> 7 | uVar25 << 0x19) ^ (uVar25 << 0xe | uVar25 >> 0x12) ^ uVar25 >> 3);
    iVar13 = ((uVar16 ^ uVar14) & uVar12 ^ uVar16) + A[3] + puVar2[0x13] + uVar1 +
             ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19));
    uVar17 = ((uVar8 >> 2 | uVar8 * 0x40000000) ^ (uVar8 >> 0xd | uVar8 * 0x80000) ^
             (uVar8 * 0x400 | uVar8 >> 0x16)) + ((uVar5 | uVar8) & uVar15 | uVar5 & uVar8) + iVar13;
    uVar10 = local_150 + iVar13;
    puVar11[0x12] = uVar6;
    uVar21 = puVar11[5];
    uVar25 = ((uVar6 * 0x8000 | uVar6 >> 0x11) ^ (uVar6 * 0x2000 | uVar6 >> 0x13) ^ uVar6 >> 10) +
             uVar25 + puVar11[0xd] +
             ((uVar21 >> 7 | uVar21 << 0x19) ^ (uVar21 << 0xe | uVar21 >> 0x12) ^ uVar21 >> 3);
    iVar13 = ((uVar10 >> 6 | uVar10 * 0x4000000) ^ (uVar10 >> 0xb | uVar10 * 0x200000) ^
             (uVar10 * 0x80 | uVar10 >> 0x19)) +
             ((uVar14 ^ uVar12) & uVar10 ^ uVar14) + uVar16 + puVar2[0x14] + uVar25;
    A[2] = ((uVar17 >> 2 | uVar17 * 0x40000000) ^ (uVar17 >> 0xd | uVar17 * 0x80000) ^
           (uVar17 * 0x400 | uVar17 >> 0x16)) + ((uVar8 | uVar17) & uVar5 | uVar8 & uVar17) + iVar13
    ;
    A[6] = uVar15 + iVar13;
    uVar6 = puVar11[6];
    puVar11[0x13] = uVar1;
    uVar16 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
             uVar19 + uVar21 +
             ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((A[6] >> 6 | A[6] * 0x4000000) ^ (A[6] >> 0xb | A[6] * 0x200000) ^
             (A[6] * 0x80 | A[6] >> 0x19)) +
             ((uVar12 ^ uVar10) & A[6] ^ uVar12) + uVar14 + puVar2[0x15] + uVar16;
    A[1] = ((A[2] >> 2 | A[2] * 0x40000000) ^ (A[2] >> 0xd | A[2] * 0x80000) ^
           (A[2] * 0x400 | A[2] >> 0x16)) + ((uVar17 | A[2]) & uVar8 | uVar17 & A[2]) + iVar13;
    A[5] = uVar5 + iVar13;
    uVar1 = puVar11[7];
    puVar11[0x14] = uVar25;
    uVar7 = uVar20 + uVar6 +
            ((uVar25 * 0x8000 | uVar25 >> 0x11) ^ (uVar25 * 0x2000 | uVar25 >> 0x13) ^ uVar25 >> 10)
            + ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    iVar13 = ((A[5] >> 6 | A[5] * 0x4000000) ^ (A[5] >> 0xb | A[5] * 0x200000) ^
             (A[5] * 0x80 | A[5] >> 0x19)) +
             ((uVar10 ^ A[6]) & A[5] ^ uVar10) + uVar12 + puVar2[0x16] + uVar7;
    A[0] = ((A[1] >> 2 | A[1] * 0x40000000) ^ (A[1] >> 0xd | A[1] * 0x80000) ^
           (A[1] * 0x400 | A[1] >> 0x16)) + ((A[2] | A[1]) & uVar17 | A[2] & A[1]) + iVar13;
    A[4] = uVar8 + iVar13;
    uVar5 = puVar11[8];
    puVar11[0x15] = uVar16;
    puVar11[0x10] = uVar23;
    uVar27 = puVar2[0x17];
    uVar24 = uVar23 + uVar1 +
             ((uVar16 * 0x8000 | uVar16 >> 0x11) ^ (uVar16 * 0x2000 | uVar16 >> 0x13) ^ uVar16 >> 10
             ) + ((uVar5 >> 7 | uVar5 << 0x19) ^ (uVar5 << 0xe | uVar5 >> 0x12) ^ uVar5 >> 3);
    puVar11[0x17] = uVar24;
    iVar13 = ((A[4] >> 6 | A[4] * 0x4000000) ^ (A[4] >> 0xb | A[4] * 0x200000) ^
             (A[4] * 0x80 | A[4] >> 0x19)) +
             uVar10 + uVar27 + uVar24 + ((A[6] ^ A[5]) & A[4] ^ A[6]);
    puVar11[0x16] = uVar7;
    puVar11 = puVar11 + 8;
    A[3] = uVar17 + iVar13;
    local_150 = ((A[0] >> 2 | A[0] * 0x40000000) ^ (A[0] >> 0xd | A[0] * 0x80000) ^
                (A[0] * 0x400 | A[0] >> 0x16)) + ((A[1] | A[0]) & A[2] | A[1] & A[0]) + iVar13;
    puVar2 = puVar2 + 8;
  } while (W + 0x2f != puVar11);
  puVar9 = ctx->state;
  do {
    iVar13 = *puVar18;
    puVar11 = puVar9 + 1;
    puVar18 = (uint32_t *)((int *)puVar18 + 1);
    *puVar9 = *puVar9 + iVar13;
    puVar9 = puVar11;
  } while ((uint32_t *)ctx->buffer != puVar11);
  return;
}



void utils_sha256_update(iot_sha256_context *ctx,uchar *input,uint32_t ilen)

{
  size_t __n;
  uint uVar1;
  uint uVar2;
  uint __n_00;
  
