pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar2 = ctx->total[0] & 0x3f;
  uVar1 = ctx->total[0] + ilen;
  ctx->total[0] = uVar1;
  if (uVar1 < ilen) {
    ctx->total[1] = ctx->total[1] + 1;
  }
  uVar1 = ilen;
  if ((uVar2 != 0) && (__n_00 = 0x40 - uVar2, __n_00 <= ilen)) {
    memcpy(ctx->buffer + uVar2,input,__n_00);
    ilen = (ilen - 0x40) + uVar2;
    utils_sha256_process(ctx,ctx->buffer);
    input = input + __n_00;
    uVar2 = 0;
    uVar1 = ilen;
  }
  while (0x3f < ilen) {
    utils_sha256_process(ctx,input + (uVar1 - ilen));
    ilen = ilen - 0x40;
  }
  __n = (uVar1 >> 6) * -0x40 + uVar1;
  if (__n == 0) {
    return;
  }
  memcpy(ctx->buffer + uVar2,input + (uVar1 & 0xffffffc0),__n);
  return;
}



void utils_sha256_update(iot_sha256_context *ctx,uchar *input,uint32_t ilen)

{
  if (ilen != 0) {
    utils_sha256_update(ctx,input,ilen);
    return;
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void utils_sha256_finish(iot_sha256_context *ctx,uint8_t *output)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uchar uStack24;
  undefined uStack23;
  ushort uStack22;
  uchar msglen [8];
  
  uVar1 = ctx->total[0];
  uVar2 = ctx->total[1] << 3;
  uStack24 = (uchar)(uVar2 >> 0x18);
  uStack23 = (undefined)(uVar2 >> 0x10);
  uStack22 = (ushort)(uVar2 >> 8) & 0xff | (ushort)((uVar2 | uVar1 >> 0x1d) << 8);
  msglen[0] = (uchar)((uVar1 << 3) >> 0x18);
  msglen[1] = (uchar)((uVar1 << 3) >> 0x10);
  msglen._2_2_ = (ushort)((uVar1 << 0x13) >> 0x18) | (ushort)(uVar1 << 0xb);
  if ((uVar1 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  utils_sha256_update(ctx,sha256_padding,iVar3 - (uVar1 & 0x3f));
  utils_sha256_update(ctx,&uStack24,8);
  *output = *(uint8_t *)((int)ctx->state + 3);
  output[1] = (uint8_t)*(undefined2 *)((int)ctx->state + 2);
  output[2] = (uint8_t)(ctx->state[0] >> 8);
  output[3] = (uint8_t)ctx->state[0];
  output[4] = *(uint8_t *)((int)ctx->state + 7);
  output[5] = (uint8_t)*(undefined2 *)((int)ctx->state + 6);
  output[6] = (uint8_t)(ctx->state[1] >> 8);
  output[7] = (uint8_t)ctx->state[1];
  output[8] = *(uint8_t *)((int)ctx->state + 0xb);
  output[9] = (uint8_t)*(undefined2 *)((int)ctx->state + 10);
  output[10] = (uint8_t)(ctx->state[2] >> 8);
  output[0xb] = (uint8_t)ctx->state[2];
  output[0xc] = *(uint8_t *)((int)ctx->state + 0xf);
  output[0xd] = (uint8_t)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xe] = (uint8_t)(ctx->state[3] >> 8);
  output[0xf] = (uint8_t)ctx->state[3];
  output[0x10] = *(uint8_t *)((int)ctx->state + 0x13);
  output[0x11] = (uint8_t)*(undefined2 *)((int)ctx->state + 0x12);
  output[0x12] = (uint8_t)(ctx->state[4] >> 8);
  output[0x13] = (uint8_t)ctx->state[4];
  output[0x14] = *(uint8_t *)((int)ctx->state + 0x17);
  output[0x15] = (uint8_t)*(undefined2 *)((int)ctx->state + 0x16);
  output[0x16] = (uint8_t)(ctx->state[5] >> 8);
  output[0x17] = (uint8_t)ctx->state[5];
  output[0x18] = *(uint8_t *)((int)ctx->state + 0x1b);
  output[0x19] = (uint8_t)*(undefined2 *)((int)ctx->state + 0x1a);
  output[0x1a] = (uint8_t)(ctx->state[6] >> 8);
  output[0x1b] = (uint8_t)ctx->state[6];
  if (ctx->is224 == 0) {
    output[0x1c] = *(uint8_t *)((int)ctx->state + 0x1f);
    output[0x1d] = (uint8_t)*(undefined2 *)((int)ctx->state + 0x1e);
    output[0x1e] = (uint8_t)(ctx->state[7] >> 8);
    output[0x1f] = (uint8_t)ctx->state[7];
  }
  return;
}



void bl_printk(char *format,...)

{
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list args;
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  if (sys_log_all_enable != false) {
    uStack28 = in_a1;
    uStack24 = in_a2;
    uStack20 = in_a3;
    uStack16 = in_a4;
    uStack12 = in_a5;
    uStack8 = in_a6;
    uStack4 = in_a7;
    vprint(format,&uStack28);
  }
  return;
}



int log_buf_out(char *file,int line,void *inbuf,int len,LOG_BUF_OUT_DATA_TYPE_T type)

{
  bool bVar1;
  int iVar2;
  int iVar3;
  TickType_t TVar4;
  char *__format;
  uint uVar5;
  undefined3 in_register_00002039;
  int iVar6;
  int iVar7;
  int iVar8;
  int iVar9;
  void *pvVar10;
  
  iVar6 = CONCAT31(in_register_00002039,type);
  if (len < 1) {
    return -1;
  }
  iVar9 = len / 0x32;
  if (len % 0x32 == 0) {
    pvVar10 = (void *)(iVar9 * 0x32 + (int)inbuf);
    while (pvVar10 != inbuf) {
      iVar7 = 0;
      iVar9 = 0;
      do {
        uVar5 = (uint)*(byte *)((int)inbuf + iVar9);
        if (iVar6 == 1) {
          uVar5 = SEXT14((char)*(byte *)((int)inbuf + iVar9));
          __format = "%3d ";
        }
        else {
          __format = "%3u ";
          if (iVar6 != 2) {
            __format = "%02x ";
          }
        }
        iVar3 = sprintf(log_buf + iVar7,__format,uVar5);
        iVar9 = iVar9 + 1;
        iVar7 = iVar7 + iVar3;
      } while (iVar9 != 0x32);
      if (TrapNetCounter == 0) {
        TVar4 = xTaskGetTickCount();
      }
      else {
        TVar4 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] %.*s\r\n",TVar4,&UNK_2308789c,file,line,iVar7,log_buf);
      inbuf = (void *)((int)inbuf + 0x32);
    }
  }
  else {
    iVar7 = 0;
    do {
      iVar3 = 0;
      iVar8 = 0;
      if (iVar9 == iVar7) {
        do {
          uVar5 = (uint)*(byte *)((int)inbuf + iVar8);
          if (iVar6 == 1) {
            uVar5 = SEXT14((char)*(byte *)((int)inbuf + iVar8));
            __format = "%3d ";
          }
          else {
            __format = "%3u ";
            if (iVar6 != 2) {
              __format = "%02x ";
            }
          }
          iVar2 = sprintf(log_buf + iVar3,__format,uVar5);
          iVar8 = iVar8 + 1;
          iVar3 = iVar3 + iVar2;
        } while (len % 0x32 != iVar8);
      }
      else {
        do {
          uVar5 = (uint)*(byte *)((int)inbuf + iVar8);
          if (iVar6 == 1) {
            uVar5 = SEXT14((char)*(byte *)((int)inbuf + iVar8));
            __format = "%3d ";
          }
          else {
            __format = "%3u ";
            if (iVar6 != 2) {
              __format = "%02x ";
            }
          }
          iVar2 = sprintf(log_buf + iVar3,__format,uVar5);
          iVar8 = iVar8 + 1;
          iVar3 = iVar3 + iVar2;
        } while (iVar8 != 0x32);
      }
      if (TrapNetCounter == 0) {
        TVar4 = xTaskGetTickCount();
      }
      else {
        TVar4 = xTaskGetTickCountFromISR();
      }
      bl_printk("[%10u][%s: %s:%4d] %.*s\r\n",TVar4,&UNK_2308789c,file,line,iVar3,log_buf);
      inbuf = (void *)((int)inbuf + 0x32);
      bVar1 = iVar7 < iVar9;
      iVar7 = iVar7 + 1;
    } while (bVar1);
  }
  return 0;
}



int utils_dns_domain_get(uint8_t *records,uint8_t *buf,int *len)

{
  int iVar1;
  int iVar2;
  uint uVar3;
  int iVar4;
  int iVar5;
  int iVar6;
  
  iVar6 = *len;
  uVar3 = (uint)*records;
  iVar2 = 1;
  iVar5 = 0;
  while ((iVar4 = iVar5, iVar1 = iVar2, uVar3 != 0 && (0 < iVar6))) {
    uVar3 = uVar3 - 1;
    buf[iVar4] = records[iVar1];
    iVar2 = iVar1 + 1;
    iVar5 = iVar4 + 1;
    iVar6 = iVar6 + -1;
    if ((uVar3 == 0) && (iVar6 != 0)) {
      buf[iVar5] = '.';
      uVar3 = (uint)records[iVar2];
      iVar2 = iVar1 + 2;
      iVar5 = iVar4 + 2;
    }
  }
  *len = iVar4;
  return 0;
}



void utils_list_init(utils_list *list)

{
  list->first = (utils_list_hdr *)0x0;
  list->last = (utils_list_hdr *)0x0;
  return;
}



void utils_list_push_back(utils_list *list,utils_list_hdr *list_hdr)

{
  if (list->first == (utils_list_hdr *)0x0) {
    list->first = list_hdr;
  }
  else {
    list->last->next = list_hdr;
  }
  list->last = list_hdr;
  list_hdr->next = (utils_list_hdr *)0x0;
  return;
}



utils_list_hdr * utils_list_pop_front(utils_list *list)

{
  utils_list_hdr *puVar1;
  
  puVar1 = list->first;
  if (puVar1 != (utils_list_hdr *)0x0) {
    list->first = puVar1->next;
  }
  return puVar1;
}



void utils_hexdump(void *mem,uint len)

{
  uint uVar1;
  int iVar2;
  uint c;
  int iVar3;
  uint uVar4;
  uint uVar5;
  
  iVar2 = 0;
  if ((len & 0xf) != 0) {
    iVar2 = 0x10 - (len & 0xf);
  }
  uVar4 = 0;
  while (uVar1 = uVar4, iVar2 + len != uVar1) {
    if ((uVar1 & 0xf) == 0) {
      printf("0x%06x: ",uVar1);
    }
    if (uVar1 < len) {
      printf("%02x ",(uint)*(byte *)((int)mem + uVar1));
    }
    else {
      printf("   ");
    }
    uVar4 = uVar1 + 1;
    if ((uVar1 & 0xf) == 0xf) {
      uVar5 = uVar1 - 0xf;
      iVar3 = 0x11;
      if (uVar4 < uVar5) {
        iVar3 = 1;
      }
      while (uVar5 != (uVar1 - 0x10) + iVar3) {
        c = 0x20;
        if ((uVar5 < len) && (c = (uint)*(byte *)((int)mem + uVar5), (_ctype_[c + 1] & 0x97) == 0))
        {
          c = 0x2e;
        }
        bl_putchar(c);
        uVar5 = uVar5 + 1;
      }
      puts("\r\n");
    }
  }
  return;
}



