pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
undefined4 utils_time_date_from_epoch(uint param_1,undefined *param_2)

{
  byte bVar1;
  byte bVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  undefined4 uStack20;
  undefined2 uStack16;
  undefined uStack14;
  char cStack13;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack12 = 0x1e1f1c1f;
  uStack8 = 0x1f1f1e1f;
  uStack4 = 0x1f1e1f1e;
  uStack20 = 0x60504;
  uStack16 = 0x201;
  uStack14 = 3;
  *(undefined2 *)(param_2 + 6) = 0;
  param_2[2] = (char)(param_1 % 0x3c);
  param_2[1] = (char)((param_1 / 0x3c) % 0x3c);
  *param_2 = (char)((param_1 / 0xe10) % 0x18);
  uVar5 = param_1 / 0x15180;
  *(uint *)(param_2 + 0xc) = uVar5;
  param_2[3] = *(undefined *)((int)&uStack20 + uVar5 % 7);
  uVar4 = 0x7b4;
  uVar3 = param_1 / 0x1e13380 + 0x7b2;
  *(uint *)(param_2 + 8) = uVar3;
  while (uVar4 < uVar3) {
    if (((int)uVar4 % 100 != 0) || ((int)uVar4 % 400 == 0)) {
      param_2[6] = param_2[6] + '\x01';
    }
    uVar4 = uVar4 + 4;
  }
  uVar3 = (uVar5 - (byte)param_2[6]) / 0x16d + 0x7b2;
  *(uint *)(param_2 + 8) = uVar3;
  uVar4 = (uVar5 - (byte)param_2[6]) % 0x16d + 1;
  *(uint *)(param_2 + 0x10) = uVar4;
  if ((((uVar3 & 3) == 0) && (uVar3 % 100 != 0)) || (uVar3 % 400 == 0)) {
    uStack12 = 0x1e1f1d1f;
    param_2[7] = 1;
  }
  param_2[5] = 0;
  uVar3 = 0;
  while( true ) {
    bVar1 = param_2[5];
    if ((0xb < bVar1) || (uVar4 <= uVar3)) break;
    bVar2 = *(byte *)((int)&uStack12 + (uint)bVar1);
    param_2[5] = bVar1 + 1;
    uVar3 = uVar3 + bVar2 & 0xffff;
  }
  param_2[4] = (char)uVar4 - ((char)uVar3 - (&cStack13)[(uint)bVar1]);
  return 0;
}



int utils_getopt_init(getopt_env_t *env,int opterr)

{
  if (env != (getopt_env_t *)0x0) {
    env->optarg = (char *)0x0;
    env->optind = 1;
    env->opterr = opterr;
    env->optopt = 0;
    env->__optpos = 0;
    return 0;
  }
  return -1;
}



int utils_getopt(getopt_env_t *env,int argc,char **argv,char *optstring)

{
  byte bVar1;
  byte bVar2;
  int iVar3;
  uint uVar4;
  char **ppcVar5;
  int iVar6;
  byte *pbVar7;
  char *pcVar8;
  byte *pbVar9;
  
  if (env == (getopt_env_t *)0x0) {
    return -1;
  }
  iVar6 = env->optind;
  if (argc <= iVar6) {
    return -1;
  }
  ppcVar5 = argv + iVar6;
  pcVar8 = *ppcVar5;
  if (pcVar8 == (char *)0x0) {
    return -1;
  }
  if (*pcVar8 != '-') {
    if (*optstring == '-') {
      env->optind = iVar6 + 1;
      env->optarg = *ppcVar5;
      return 1;
    }
    return -1;
  }
  if (pcVar8[1] == '\0') {
    return -1;
  }
  if ((pcVar8[1] == '-') && (pcVar8[2] == '\0')) {
    env->optind = iVar6 + 1;
    return -1;
  }
  if (env->__optpos == 0) {
    env->__optpos = 1;
  }
  pbVar9 = (byte *)(*ppcVar5 + env->__optpos);
  bVar1 = *pbVar9;
  uVar4 = (uint)bVar1;
  iVar3 = (uint)(bVar1 != 0) + env->__optpos;
  env->__optpos = iVar3;
  if ((*ppcVar5)[iVar3] == '\0') {
    env->optind = iVar6 + 1;
    env->__optpos = 0;
  }
  if ((*optstring - 0x2bU & 0xfd) == 0) {
    optstring = optstring + 1;
  }
  iVar6 = 0;
  do {
    iVar3 = iVar6 + 1;
    pbVar7 = (byte *)(optstring + iVar6);
    bVar2 = *pbVar7;
    if (bVar2 == 0) {
      if (bVar1 == 0) goto LAB_2304bcb4;
      goto LAB_2304bc96;
    }
    iVar6 = iVar3;
  } while (uVar4 != (uint)bVar2);
  if (bVar1 == 0x3a) {
LAB_2304bc96:
    env->optopt = uVar4;
    if (*optstring == ':') {
      return 0x3f;
    }
    if (env->opterr == 0) {
      return 0x3f;
    }
    bVar1 = *pbVar9;
    pcVar8 = *argv;
    iVar6 = -0x728;
  }
  else {
LAB_2304bcb4:
    if (optstring[iVar3] != ':') {
      return uVar4;
    }
    env->optarg = (char *)0x0;
    iVar6 = env->__optpos;
    if ((pbVar7[2] != 0x3a) || (iVar6 != 0)) {
      iVar3 = env->optind;
      env->optind = iVar3 + 1;
      pcVar8 = argv[iVar3];
      env->__optpos = 0;
      env->optarg = pcVar8 + iVar6;
    }
    if (env->optind <= argc) {
      return uVar4;
    }
    env->optopt = uVar4;
    if (*optstring == ':') {
      return 0x3a;
    }
    if (env->opterr == 0) {
      return 0x3f;
    }
    bVar1 = *pbVar9;
    pcVar8 = *argv;
    iVar6 = -0x708;
  }
  printf("ERROR failed! net_set_(non)block() returned -0x%x\r\n" + iVar6 + 0x14,pcVar8,(uint)bVar1);
  return 0x3f;
}



// WARNING: Variable defined which should be unmapped: pTemp

void Bl_F_fast(uchar *digest,uchar *digest1,char *password,uchar *ssid,int ssidlength,int count,
              uchar *output)

{
  int iVar1;
  size_t key_len;
  byte *pbVar2;
  uchar *puVar3;
  byte *pbVar4;
  int iVar5;
  int iStack40;
  int tmpLen;
  uchar *pTemp;
  
  key_len = strlen(password);
  iStack40 = ssidlength + 4;
  tmpLen = (int)digest;
  memcpy(digest,ssid,ssidlength);
  puVar3 = digest + ssidlength;
  *puVar3 = '\0';
  puVar3[3] = (uchar)count;
  puVar3[1] = '\0';
  puVar3[2] = '\0';
  bl_sha_mutex_take();
  utils_hmac_sha1_fast((uchar **)&tmpLen,&iStack40,1,(uchar *)password,key_len,digest1,0x14);
  memcpy(output,digest1,0x14);
  iVar1 = 0xfff;
  tmpLen = (int)digest1;
  do {
    iStack40 = 0x14;
    utils_hmac_sha1_fast((uchar **)&tmpLen,&iStack40,1,(uchar *)password,key_len,digest,0x14);
    memcpy(digest1,digest,0x14);
    iVar5 = 0;
    do {
      pbVar2 = output + iVar5;
      pbVar4 = digest + iVar5;
      iVar5 = iVar5 + 1;
      *pbVar2 = *pbVar4 ^ *pbVar2;
    } while (iVar5 != 0x14);
    iVar1 = iVar1 + -1;
  } while (iVar1 != 0);
  bl_sha_mutex_give();
  return;
}



int utils_wifi_psk_cal_fast_bin(char *password,uchar *ssid,int ssidlength,uchar *output)

{
  size_t sVar1;
  int iVar2;
  uchar auStack88 [4];
  uchar digest1 [20];
  uchar digest [36];
  
  sVar1 = strlen(password);
  if (sVar1 < 0x40) {
    iVar2 = -1;
    if (ssidlength < 0x21) {
      Bl_F_fast(digest1 + 0x10,auStack88,password,ssid,ssidlength,2,output);
      memcpy(output + 0x14,output,0xc);
      Bl_F_fast(digest1 + 0x10,auStack88,password,ssid,ssidlength,1,output);
      iVar2 = 0;
    }
  }
  else {
    iVar2 = -1;
  }
  return iVar2;
}



// WARNING: Type propagation algorithm not settling

int utils_memp_init(utils_memp_pool_t **pool,uint16_t node_size,uint16_t pool_cap,uint8_t align_req)

{
  uint uVar1;
  uint uVar2;
  utils_memp_pool_t *puVar3;
  int iVar4;
  undefined2 in_register_0000202e;
  undefined2 in_register_00002032;
  uint32_t uVar5;
  utils_memp_node uVar6;
  uint32_t uVar7;
  utils_memp_node uVar8;
  uint uVar9;
  
  uVar5 = CONCAT22(in_register_00002032,pool_cap);
  uVar9 = (uint)align_req + 3 & 0xfc;
  uVar2 = CONCAT22(in_register_0000202e,node_size) + 3 + uVar9 & -uVar9 & 0xffff;
  uVar1 = -uVar9 & uVar9 + 0x1f;
  puVar3 = (utils_memp_pool_t *)pvPortMalloc(uVar2 * uVar5 + uVar1);
  if (puVar3 == (utils_memp_pool_t *)0x0) {
    iVar4 = -1;
  }
  else {
    uVar8 = (utils_memp_node)((int)&puVar3->node_size + uVar1);
    *(utils_memp_node *)&((utils_memp_node *)&puVar3->first_node)->next = uVar8;
    puVar3->node_size = CONCAT22(in_register_0000202e,node_size);
    puVar3->pool_cap = uVar5;
    puVar3->pool_size = 0;
    puVar3->align_req = (uint8_t)uVar9;
    puVar3->padded_node_size = uVar2;
    puVar3->mem = (utils_memp_node *)0x0;
    uVar7 = 0;
    uVar6 = (utils_memp_node)0x0;
    while (uVar7 != uVar5) {
      *(utils_memp_node *)uVar8 = uVar6;
      uVar7 = uVar7 + 1 & 0xffff;
      uVar6 = uVar8;
      uVar8 = (utils_memp_node)((int)uVar8 + uVar2);
    }
    *(utils_memp_node *)&((utils_memp_node *)&puVar3->mem)->next = uVar6;
    *(utils_memp_node *)&((utils_memp_node *)&puVar3->last_node)->next = uVar6;
    *pool = puVar3;
    iVar4 = 0;
  }
  return iVar4;
}



