pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int utils_memp_deinit(utils_memp_pool_t *pool)

{
  if (pool != (utils_memp_pool_t *)0x0) {
    vPortFree(pool);
    return 0;
  }
  return -1;
}



void * utils_memp_malloc(utils_memp_pool_t *pool)

{
  utils_memp_node *puVar1;
  utils_memp_node *puVar2;
  
  puVar2 = (utils_memp_node *)0x0;
  if (pool != (utils_memp_pool_t *)0x0) {
    puVar2 = (utils_memp_node *)0x0;
    if ((pool->pool_size != pool->pool_cap) &&
       (puVar2 = pool->mem, puVar2 != (utils_memp_node *)0x0)) {
      puVar1 = puVar2->next;
      pool->pool_size = pool->pool_size + 1;
      pool->mem = puVar1;
      puVar2->next = (utils_memp_node *)0xa5;
      puVar2 = puVar2 + 1;
    }
  }
  return puVar2;
}



int utils_memp_free(utils_memp_pool_t *pool,void *node)

{
  utils_memp_node *puVar1;
  
  puVar1 = (utils_memp_node *)((int)node + -4);
  if ((((pool != (utils_memp_pool_t *)0x0) && (puVar1 != (utils_memp_node *)0x0)) &&
      (pool->pool_size != 0)) &&
     ((((utils_memp_node *)pool->first_node <= puVar1 &&
       (puVar1 <= (utils_memp_node *)pool->last_node)) &&
      (((uint)((int)puVar1 - (int)(utils_memp_node *)pool->first_node) % pool->padded_node_size == 0
       && (*(int *)((int)node + -4) == 0xa5)))))) {
    *(utils_memp_node **)((int)node + -4) = pool->mem;
    pool->mem = puVar1;
    pool->pool_size = pool->pool_size - 1;
    return 0;
  }
  return -1;
}



int utils_tlv_bl_pack_auto(uint32_t *buf,int buf_sz,uint16_t type,void *arg1)

{
  undefined2 in_register_00002032;
  uint32_t uVar1;
  int iVar2;
  
  if (CONCAT22(in_register_00002032,type) == 1) {
    uVar1 = (uint32_t)*(byte *)arg1;
  }
  else {
    if (CONCAT22(in_register_00002032,type) != 7) {
      return -2;
    }
    uVar1 = *(uint32_t *)arg1;
  }
  iVar2 = -1;
  if (3 < buf_sz) {
    *buf = uVar1;
    iVar2 = 4;
  }
  return iVar2;
}



int utils_tlv_bl_unpack_auto(uint32_t *buf,int buf_sz,uint16_t type,void *arg1)

{
  int iVar1;
  undefined2 in_register_00002032;
  bool bVar2;
  uint32_t uVar3;
  
  if (CONCAT22(in_register_00002032,type) == 1) {
    if (buf_sz < 4) {
      bVar2 = true;
      iVar1 = -1;
    }
    else {
      iVar1 = 4;
      bVar2 = *buf != 0;
    }
    *(bool *)arg1 = bVar2;
    return iVar1;
  }
  if (CONCAT22(in_register_00002032,type) != 7) {
    return -2;
  }
  if (buf_sz < 4) {
    uVar3 = 0;
    iVar1 = -1;
  }
  else {
    uVar3 = *buf;
    iVar1 = 4;
  }
  *(uint32_t *)arg1 = uVar3;
  return iVar1;
}



void utils_hmac_sha1_fast
               (uchar **ppText,int *pTextLen,int textNum,uchar *key,int key_len,uchar *output,
               int outputLen)

{
  uint *puVar1;
  uint32_t *puVar2;
  uint *__src;
  uchar **ppuVar3;
  int iVar4;
  uint *hash;
  uint local_120;
  uint64_t pBuf [11];
  undefined auStack196 [4];
  bl_sha_ctx_t sha_ctx;
  
  if (0x40 < key_len) {
    bl_sha_init((bl_sha_ctx_t *)auStack196,BL_SHA1);
    bl_sha_update((bl_sha_ctx_t *)auStack196,key,key_len);
    bl_sha_finish((bl_sha_ctx_t *)auStack196,key);
    key_len = 0x14;
  }
  memset(&local_120,0,0x40);
  memcpy(&local_120,key,key_len);
  hash = (uint *)((int)pBuf + 0x3c);
  puVar1 = &local_120;
  do {
    __src = puVar1 + 2;
    *puVar1 = *puVar1 ^ 0x36363636;
    puVar1[1] = puVar1[1] ^ 0x36363636;
    puVar1 = __src;
  } while (__src != hash);
  bl_sha_init((bl_sha_ctx_t *)auStack196,BL_SHA1);
  bl_sha_update((bl_sha_ctx_t *)auStack196,(uint8_t *)&local_120,0x40);
  iVar4 = 0;
  while (iVar4 < textNum) {
    puVar2 = (uint32_t *)(pTextLen + iVar4);
    ppuVar3 = ppText + iVar4;
    iVar4 = iVar4 + 1;
    bl_sha_update((bl_sha_ctx_t *)auStack196,*ppuVar3,*puVar2);
  }
  bl_sha_finish((bl_sha_ctx_t *)auStack196,(uint8_t *)hash);
  memset(&local_120,0,0x40);
  memcpy(&local_120,key,key_len);
  puVar1 = &local_120;
  do {
    __src = puVar1 + 2;
    *puVar1 = *puVar1 ^ 0x5c5c5c5c;
    puVar1[1] = puVar1[1] ^ 0x5c5c5c5c;
    puVar1 = __src;
  } while (__src != hash);
  bl_sha_init((bl_sha_ctx_t *)auStack196,BL_SHA1);
  bl_sha_update((bl_sha_ctx_t *)auStack196,(uint8_t *)&local_120,0x40);
  bl_sha_update((bl_sha_ctx_t *)auStack196,(uint8_t *)__src,0x14);
  bl_sha_finish((bl_sha_ctx_t *)auStack196,(uint8_t *)__src);
  memcpy(output,__src,outputLen);
  return;
}



int vfs_init(void)

{
  int iVar1;
  
  iVar1 = 0;
  if (g_vfs_init != '\x01') {
    g_vfs_mutex = (SemaphoreHandle_t)xQueueCreateMutexStatic('\x01',(StaticQueue_t *)&xMutexBuffer);
    iVar1 = -1;
    if (g_vfs_mutex != (SemaphoreHandle_t)0x0) {
      inode_init();
      iVar1 = 0;
      g_vfs_init = '\x01';
    }
  }
  return iVar1;
}



int aos_open(char *path,int flags)

{
  size_t sVar1;
  BaseType_t BVar2;
  inode_t *node;
  file_t *file;
  int iVar3;
  code *pcVar4;
  
  if (path == (char *)0x0) {
    iVar3 = -0x16;
  }
  else {
    sVar1 = strlen(path);
    if (0x400 < sVar1) {
      return -0x5b;
    }
    BVar2 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
    if (BVar2 != 1) {
      return -1;
    }
    node = inode_open(path);
    if (node == (inode_t *)0x0) {
      xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      return -2;
    }
    node->i_flags = flags;
    file = new_file(node);
    xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    if (file == (file_t *)0x0) {
      return -0x17;
    }
    pcVar4 = *(code **)node->ops;
    if (node->type == '\x03') {
      if (pcVar4 == (code *)0x0) goto LAB_2304c23a;
      iVar3 = (*pcVar4)(file,path,flags);
    }
    else {
      if (pcVar4 == (code *)0x0) goto LAB_2304c23a;
      iVar3 = (*pcVar4)(node,file);
    }
    if (iVar3 == 0) {
LAB_2304c23a:
      iVar3 = get_fd(file);
      return iVar3;
    }
    del_file(file);
  }
  return iVar3;
}



int aos_close(int fd)

{
  int iVar1;
  file_t *file;
  BaseType_t BVar2;
  code *pcVar3;
  
  file = get_file(fd);
  iVar1 = -2;
  if (file != (file_t *)0x0) {
    iVar1 = 0;
    pcVar3 = *(code **)(file->node->ops + 4);
    if (pcVar3 != (code *)0x0) {
      iVar1 = (*pcVar3)();
    }
    BVar2 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
    if (BVar2 == 1) {
      del_file(file);
      xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    }
    else {
      iVar1 = -1;
    }
  }
  return iVar1;
}



