pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
ssize_t aos_read(int fd,void *buf,size_t nbytes)

{
  code *UNRECOVERED_JUMPTABLE;
  file_t *pfVar1;
  ssize_t sVar2;
  
  pfVar1 = get_file(fd);
  if (pfVar1 == (file_t *)0x0) {
    sVar2 = -2;
  }
  else {
    UNRECOVERED_JUMPTABLE = *(code **)(pfVar1->node->ops + 8);
    if (UNRECOVERED_JUMPTABLE != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304c2d6. Too many branches
                    // WARNING: Treating indirect jump as call
      sVar2 = (*UNRECOVERED_JUMPTABLE)(buf,nbytes);
      return sVar2;
    }
    sVar2 = -1;
  }
  return sVar2;
}



ssize_t aos_write(int fd,void *buf,size_t nbytes)

{
  code *UNRECOVERED_JUMPTABLE;
  file_t *pfVar1;
  ssize_t sVar2;
  
  pfVar1 = get_file(fd);
  if (pfVar1 == (file_t *)0x0) {
    sVar2 = -2;
  }
  else {
    UNRECOVERED_JUMPTABLE = *(code **)(pfVar1->node->ops + 0xc);
    if (UNRECOVERED_JUMPTABLE != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304c304. Too many branches
                    // WARNING: Treating indirect jump as call
      sVar2 = (*UNRECOVERED_JUMPTABLE)(buf,nbytes);
      return sVar2;
    }
    sVar2 = -1;
  }
  return sVar2;
}



int aos_ioctl(int fd,int cmd,ulong arg)

{
  code *UNRECOVERED_JUMPTABLE;
  file_t *pfVar1;
  int iVar2;
  
  if (fd < 0) {
    return -0x16;
  }
  pfVar1 = get_file(fd);
  if (pfVar1 == (file_t *)0x0) {
    iVar2 = -2;
  }
  else {
    iVar2 = pfVar1->node->ops;
    if (pfVar1->node->type == '\x03') {
      UNRECOVERED_JUMPTABLE = *(code **)(iVar2 + 0x44);
    }
    else {
      UNRECOVERED_JUMPTABLE = *(code **)(iVar2 + 0x10);
    }
    if (UNRECOVERED_JUMPTABLE != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304c340. Too many branches
                    // WARNING: Treating indirect jump as call
      iVar2 = (*UNRECOVERED_JUMPTABLE)(cmd,arg);
      return iVar2;
    }
    iVar2 = -0x58;
  }
  return iVar2;
}



off_t aos_lseek(int fd,off_t offset,int whence)

{
  code *UNRECOVERED_JUMPTABLE;
  file_t *pfVar1;
  off_t oVar2;
  
  pfVar1 = get_file(fd);
  if (pfVar1 == (file_t *)0x0) {
    oVar2 = -2;
  }
  else {
    if (pfVar1->node->type == '\x03') {
      UNRECOVERED_JUMPTABLE = *(code **)(pfVar1->node->ops + 0x10);
      if (UNRECOVERED_JUMPTABLE != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304c384. Too many branches
                    // WARNING: Treating indirect jump as call
        oVar2 = (*UNRECOVERED_JUMPTABLE)(offset,whence);
        return oVar2;
      }
    }
    oVar2 = -0x58;
  }
  return oVar2;
}



int aos_stat(char *path,stat *st)

{
  int iVar1;
  BaseType_t BVar2;
  inode_t *node;
  file_t *file;
  code *pcVar3;
  
  if (path == (char *)0x0) {
    return -0x16;
  }
  BVar2 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
  if (BVar2 == 1) {
    node = inode_open(path);
    if (node == (inode_t *)0x0) {
      xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      return -0x13;
    }
    file = new_file(node);
    xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    if (file == (file_t *)0x0) {
      return -2;
    }
    iVar1 = -0x58;
    if ((node->type == '\x03') && (pcVar3 = *(code **)(node->ops + 0x18), pcVar3 != (code *)0x0)) {
      iVar1 = (*pcVar3)(file,path,st);
    }
    BVar2 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
    if (BVar2 == 1) {
      del_file(file);
      xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      return iVar1;
    }
  }
  return -1;
}



aos_dir_t * aos_opendir(char *path)

{
  BaseType_t BVar1;
  inode_t *node;
  file_t *file;
  aos_dir_t *paVar2;
  int iVar3;
  code *pcVar4;
  
  if ((path != (char *)0x0) &&
     (BVar1 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff), BVar1 == 1)) {
    node = inode_open(path);
    if (node == (inode_t *)0x0) {
      xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      return (aos_dir_t *)0x0;
    }
    file = new_file(node);
    xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    if (file != (file_t *)0x0) {
      if (((node->type == '\x03') && (pcVar4 = *(code **)(node->ops + 0x24), pcVar4 != (code *)0x0))
         && (paVar2 = (aos_dir_t *)(*pcVar4)(file,path), paVar2 != (aos_dir_t *)0x0)) {
        iVar3 = get_fd(file);
        paVar2->dd_vfs_fd = iVar3;
        return paVar2;
      }
      BVar1 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
      if (BVar1 == 1) {
        del_file(file);
        xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      }
    }
  }
  return (aos_dir_t *)0x0;
}



int aos_closedir(aos_dir_t *dir)

{
  int iVar1;
  file_t *file;
  BaseType_t BVar2;
  code *pcVar3;
  
  iVar1 = -0x16;
  if (dir != (aos_dir_t *)0x0) {
    iVar1 = -2;
    file = get_file(dir->dd_vfs_fd);
    if (file != (file_t *)0x0) {
      iVar1 = -0x58;
      if ((file->node->type == '\x03') &&
         (pcVar3 = *(code **)(file->node->ops + 0x2c), pcVar3 != (code *)0x0)) {
        iVar1 = (*pcVar3)(dir);
      }
      BVar2 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
      if (BVar2 == 1) {
        del_file(file);
        xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
      }
      else {
        iVar1 = -1;
      }
    }
  }
  return iVar1;
}



aos_dirent_t * aos_readdir(aos_dir_t *dir)

{
  code *UNRECOVERED_JUMPTABLE;
  file_t *pfVar1;
  aos_dirent_t *paVar2;
  
  if (dir == (aos_dir_t *)0x0) {
    return (aos_dirent_t *)0x0;
  }
  pfVar1 = get_file(dir->dd_vfs_fd);
  if (pfVar1 != (file_t *)0x0) {
    if (pfVar1->node->type == '\x03') {
      UNRECOVERED_JUMPTABLE = *(code **)(pfVar1->node->ops + 0x28);
      if (UNRECOVERED_JUMPTABLE != (code *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2304c59a. Too many branches
                    // WARNING: Treating indirect jump as call
        paVar2 = (aos_dirent_t *)(*UNRECOVERED_JUMPTABLE)(dir);
        return paVar2;
      }
    }
  }
  return (aos_dirent_t *)0x0;
}



file_t * new_file(inode_t *node)

{
  file_t *pfVar1;
  int iVar2;
  
  pfVar1 = files;
  iVar2 = 0;
  do {
    if (pfVar1->node == (inode_t *)0x0) {
      files[iVar2].node = node;
      files[iVar2].f_arg = (void *)0x0;
      files[iVar2].offset = 0;
      inode_ref(node);
      return files + iVar2;
    }
    iVar2 = iVar2 + 1;
    pfVar1 = pfVar1 + 1;
  } while (iVar2 != 0x3c);
  return (file_t *)0x0;
}



void del_file(file_t *file)

{
  inode_unref(file->node);
  file->node = (inode_t *)0x0;
  return;
}



int get_fd(file_t *file)

{
  return ((int)(file + -0x5801c68) >> 2) * -0x55555555 + 2;
}



file_t * get_file(int fd)

{
  inode_t *piVar1;
  
  if (fd - 2U < 0x3c) {
    piVar1 = files[fd - 2U].node;
    if (piVar1 != (inode_t *)0x0) {
      return files + (fd - 2U);
    }
  }
  else {
    piVar1 = (inode_t *)0x0;
  }
  return (file_t *)piVar1;
}



int inode_init(void)

{
  memset(g_vfs_dev_nodes,0,600);
  return 0;
}



int inode_alloc(void)

{
  int iVar1;
  inode_t *piVar2;
  
