pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  piVar2 = g_vfs_dev_nodes;
  iVar1 = 0;
  do {
    if (piVar2->type == '\0') {
      return iVar1;
    }
    iVar1 = iVar1 + 1;
    piVar2 = piVar2 + 1;
  } while (iVar1 != 0x1e);
  return -0xc;
}



inode_t * inode_open(char *path)

{
  inode_t *piVar1;
  int iVar2;
  size_t __n;
  char *__s;
  
  piVar1 = g_vfs_dev_nodes;
  do {
    __s = piVar1->i_name;
    if (__s != (char *)0x0) {
      if (piVar1->type == '\x03') {
        __n = strlen(__s);
        iVar2 = strncmp(__s,path,__n);
        if ((iVar2 == 0) && (__n = strlen(piVar1->i_name), path[__n] == '/')) {
          return piVar1;
        }
      }
      iVar2 = strcmp(piVar1->i_name,path);
      if (iVar2 == 0) {
        return piVar1;
      }
    }
    piVar1 = piVar1 + 1;
    if (piVar1 == (inode_t *)deleteAcceptedTopic) {
      return (inode_t *)0x0;
    }
  } while( true );
}



int inode_forearch_name(anon_subr_int_void_ptr_inode_t_ptr *cb,void *arg)

{
  inode_t *piVar1;
  int iVar2;
  int iVar3;
  
  piVar1 = g_vfs_dev_nodes;
  iVar2 = 0;
  do {
    if (piVar1->i_name != (char *)0x0) {
      iVar2 = iVar2 + 1;
      iVar3 = (*cb)(arg,piVar1);
      if (iVar3 != 0) {
        return iVar2;
      }
    }
    piVar1 = piVar1 + 1;
  } while (piVar1 != (inode_t *)deleteAcceptedTopic);
  return iVar2;
}



void inode_ref(inode_t *node)

{
  node->refs = node->refs + '\x01';
  return;
}



void inode_unref(inode_t *node)

{
  if (node->refs != '\0') {
    node->refs = node->refs + -1;
  }
  return;
}



int inode_reserve(char *path,inode_t **inode)

{
  inode_t *piVar1;
  int iVar2;
  size_t __n;
  char *__dest;
  
  if (((path != (char *)0x0) && (inode != (inode_t **)0x0)) &&
     (*inode = (inode_t *)0x0, *path == '/')) {
    iVar2 = inode_alloc();
    if (-1 < iVar2) {
      piVar1 = (inode_t *)0x0;
      if (iVar2 < 0x1e) {
        piVar1 = g_vfs_dev_nodes + iVar2;
      }
      __n = strlen(path);
      __dest = (char *)pvPortMalloc(__n + 1);
      iVar2 = -0xc;
      if (__dest != (char *)0x0) {
        memcpy(__dest,path,__n);
        piVar1->i_name = __dest;
        __dest[__n] = '\0';
        *inode = piVar1;
        iVar2 = 0;
      }
    }
    return iVar2;
  }
  return -0x16;
}



int aos_register_driver(char *path,file_ops_t *ops,void *arg)

{
  BaseType_t BVar1;
  int iVar2;
  inode_t *piStack36;
  inode_t *node;
  
  piStack36 = (inode_t *)0x0;
  BVar1 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
  if (BVar1 == 1) {
    iVar2 = inode_reserve(path,&piStack36);
    if (iVar2 == 0) {
      *(file_ops_t **)&piStack36->ops = ops;
      piStack36->type = '\x01';
      piStack36->i_arg = arg;
    }
    BVar1 = xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    if (BVar1 == 1) {
      return iVar2;
    }
    if (piStack36->i_name != (char *)0x0) {
      vPortFree(piStack36->i_name);
    }
    memset(piStack36,0,0x14);
  }
  return -1;
}



int aos_register_fs(char *path,fs_ops_t *ops,void *arg)

{
  BaseType_t BVar1;
  int iVar2;
  inode_t *piStack36;
  inode_t *node;
  
  piStack36 = (inode_t *)0x0;
  BVar1 = xQueueSemaphoreTake((QueueHandle_t)g_vfs_mutex,0xffffffff);
  if (BVar1 == 1) {
    iVar2 = inode_reserve(path,&piStack36);
    if (iVar2 == 0) {
      *(fs_ops_t **)&piStack36->ops = ops;
      piStack36->type = '\x03';
      piStack36->i_arg = arg;
    }
    BVar1 = xQueueGenericSend((QueueHandle_t)g_vfs_mutex,(void *)0x0,0,0);
    if (BVar1 == 1) {
      return iVar2;
    }
    if (piStack36->i_name != (char *)0x0) {
      vPortFree(piStack36->i_name);
    }
    memset(piStack36,0,0x14);
  }
  return -1;
}



int vfs_uart_open(inode_t *inode,file_t *fp)

{
  uart_dev_t *uart;
  int iVar1;
  StreamBufferHandle_t pSVar2;
  int32_t iVar3;
  inode_t *piVar4;
  
  if ((fp == (file_t *)0x0) || (piVar4 = fp->node, piVar4 == (inode_t *)0x0)) {
    iVar1 = -0x16;
  }
  else {
    iVar1 = 0;
    if (piVar4->refs == '\x01') {
      uart = (uart_dev_t *)piVar4->i_arg;
      aos_mutex_new((aos_mutex_t *)&uart->mutex);
      pSVar2 = xStreamBufferGenericCreate(uart->rx_buf_size,1,0);
      *(StreamBufferHandle_t *)&uart->rx_ringbuf_handle = pSVar2;
      pSVar2 = xStreamBufferGenericCreate(uart->tx_buf_size,1,0);
      *(StreamBufferHandle_t *)&uart->tx_ringbuf_handle = pSVar2;
      if ((uart->rx_ringbuf_handle != (void *)0x0) && (pSVar2 != (StreamBufferHandle_t)0x0)) {
        hal_uart_notify_register(uart,UART_TX_INT,__uart_tx_irq);
        hal_uart_notify_register(uart,UART_RX_INT,__uart_rx_irq);
        iVar3 = hal_uart_init(uart);
        return iVar3;
      }
      return -0x16;
    }
  }
  return iVar1;
}



void __uart_rx_irq(void *p_arg)

{
  uint32_t uStack88;
  uint32_t length;
  BaseType_t xHigherPriorityTaskWoken;
  uint8_t tmp_buf [64];
  
  uStack88 = 0;
  length = 0;
  hal_uart_recv_II((uart_dev_t *)p_arg,&xHigherPriorityTaskWoken,0x40,&uStack88,0);
  if (uStack88 != 0) {
    xStreamBufferSendFromISR
              (*(StreamBufferHandle_t *)((int)p_arg + 0x10),&xHigherPriorityTaskWoken,uStack88,
               (BaseType_t *)&length);
    if (length != 0) {
      vTaskSwitchContext();
    }
  }
  if (*(int *)((int)p_arg + 0x24) != 0) {
    *(ushort *)(*(int *)((int)p_arg + 0x28) + 6) = *(ushort *)(*(int *)((int)p_arg + 0x28) + 6) | 1;
    (**(code **)((int)p_arg + 0x24))
              (*(undefined4 *)((int)p_arg + 0x28),*(undefined4 *)((int)p_arg + 0x2c),
               *(code **)((int)p_arg + 0x24));
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void __uart_tx_irq(void *p_arg)

{
  size_t sVar1;
  undefined uStack21;
  uint8_t ch;
  int iStack20;
  BaseType_t xHigherPriorityTaskWoken;
  
  iStack20 = 0;
  sVar1 = xStreamBufferReceiveFromISR
                    (*(StreamBufferHandle_t *)((int)p_arg + 0x14),&uStack21,1,
                     (BaseType_t *)&stack0xffffffec);
  if (iStack20 != 0) {
    vTaskSwitchContext();
  }
  if (sVar1 == 1) {
    hal_uart_send((uart_dev_t *)p_arg,&uStack21,1,0);
  }
  else {
    hal_uart_send_trigger_off((uart_dev_t *)p_arg);
  }
  return;
}



int vfs_uart_close(file_t *fp)

{
  uart_dev_t *uart;
  int32_t iVar1;
  inode_t *piVar2;
  
  if ((fp == (file_t *)0x0) || (piVar2 = fp->node, piVar2 == (inode_t *)0x0)) {
    return -0x16;
  }
  if (piVar2->refs != '\x01') {
    return 0;
  }
  uart = (uart_dev_t *)piVar2->i_arg;
  if (uart != (uart_dev_t *)0x0) {
    aos_mutex_free((aos_mutex_t *)&uart->mutex);
    vStreamBufferDelete((StreamBufferHandle_t)uart->rx_ringbuf_handle);
    vStreamBufferDelete((StreamBufferHandle_t)uart->tx_ringbuf_handle);
    iVar1 = hal_uart_finalize(uart);
    return iVar1;
  }
  return -0x16;
}



ssize_t vfs_uart_read(file_t *fp,void *buf,size_t nbytes)

{
  size_t sVar1;
  TickType_t xTicksToWait;
  size_t sVar2;
  void *pvVar3;
  
  sVar1 = 0xffffffea;
  if (fp != (file_t *)0x0) {
    sVar1 = 0xffffffea;
    if (((fp->node != (inode_t *)0x0) && (pvVar3 = fp->node->i_arg, nbytes != 0)) &&
       (pvVar3 != (void *)0x0)) {
      aos_mutex_lock((aos_mutex_t *)((int)pvVar3 + 0x20),0xffffffff);
      sVar1 = 0;
      xTicksToWait = -(uint)(*(char *)((int)pvVar3 + 0x34) == '\x01');
      do {
        sVar2 = xStreamBufferReceive
                          (*(StreamBufferHandle_t *)((int)pvVar3 + 0x10),(void *)((int)buf + sVar1),
                           nbytes - sVar1,xTicksToWait);
        sVar1 = sVar1 + sVar2;
        if (sVar1 == nbytes) break;
      } while (xTicksToWait != 0);
      aos_mutex_unlock((aos_mutex_t *)((int)pvVar3 + 0x20));
    }
  }
  return sVar1;
}



