pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
ssize_t vfs_uart_write(file_t *fp,void *buf,size_t nbytes)

{
  size_t sVar1;
  uart_dev_t *uart;
  
  sVar1 = 0xffffffea;
  if (fp != (file_t *)0x0) {
    sVar1 = 0xffffffea;
    if (((fp->node != (inode_t *)0x0) &&
        (uart = (uart_dev_t *)fp->node->i_arg, uart != (uart_dev_t *)0x0)) &&
       (sVar1 = xStreamBufferSend((StreamBufferHandle_t)uart->tx_ringbuf_handle,buf,nbytes,0),
       0 < (int)sVar1)) {
      hal_uart_send_trigger(uart);
    }
  }
  return sVar1;
}



int vfs_uart_poll(file_t *fp,_Bool setup,poll_notify_t *notify,pollfd *fd,void *opa)

{
  void *pvVar1;
  BaseType_t BVar2;
  undefined3 in_register_0000202d;
  
  pvVar1 = fp->node->i_arg;
  aos_mutex_lock((aos_mutex_t *)((int)pvVar1 + 0x20),0xffffffff);
  if (CONCAT31(in_register_0000202d,setup) == 0) {
    vTaskEnterCritical();
    *(undefined4 *)((int)pvVar1 + 0x24) = 0;
    *(undefined4 *)((int)pvVar1 + 0x2c) = 0;
    vTaskExitCritical();
  }
  else {
    vTaskEnterCritical();
    *(poll_notify_t **)((int)pvVar1 + 0x24) = notify;
    *(pollfd **)((int)pvVar1 + 0x28) = fd;
    *(void **)((int)pvVar1 + 0x2c) = opa;
    vTaskExitCritical();
    BVar2 = xStreamBufferIsEmpty(*(StreamBufferHandle_t *)((int)pvVar1 + 0x10));
    if (BVar2 != 1) {
      *(ushort *)(*(int *)((int)pvVar1 + 0x28) + 6) =
           *(ushort *)(*(int *)((int)pvVar1 + 0x28) + 6) | 1;
      (*notify)(fd,opa);
    }
  }
  aos_mutex_unlock((aos_mutex_t *)((int)pvVar1 + 0x20));
  return 0;
}



int vfs_uart_sync(file_t *fp)

{
  uart_dev_t *uart;
  int iVar1;
  
  if (fp == (file_t *)0x0) {
    return -0x16;
  }
  iVar1 = -0x16;
  if (fp->node != (inode_t *)0x0) {
    uart = (uart_dev_t *)fp->node->i_arg;
    if (uart != (uart_dev_t *)0x0) {
      aos_mutex_lock((aos_mutex_t *)&uart->mutex,0xffffffff);
      hal_uart_send_flush(uart,0);
      aos_mutex_unlock((aos_mutex_t *)&uart->mutex);
      iVar1 = 0;
    }
    return iVar1;
  }
  return iVar1;
}



int uart_ioctl_cmd_waimode(uart_dev_t *uart_dev,int cmd,ulong arg)

{
  int iVar1;
  size_t sVar2;
  uint uVar3;
  int iVar4;
  
  iVar1 = -0x16;
  if (arg != 0) {
    iVar4 = *(int *)(arg + 4);
    uVar3 = *(int *)(arg + 8) * 1000;
    iVar1 = 0;
    do {
      sVar2 = xStreamBufferReceive
                        ((StreamBufferHandle_t)uart_dev->rx_ringbuf_handle,
                         (void *)(*(int *)arg + iVar1),iVar4 - iVar1,uVar3 / 1000);
      iVar1 = iVar1 + sVar2;
      if (iVar4 == iVar1) {
        return iVar1;
      }
      if (uVar3 < 1000) {
        return iVar1;
      }
    } while ((cmd != 4) || (iVar1 < 1));
  }
  return iVar1;
}



int uart_ioctl_cmd_setconfig(uart_dev_t *uart_dev,ulong arg)

{
  hal_uart_parity_t parity;
  
  if (arg != 0) {
    parity = *(hal_uart_parity_t *)(arg + 4);
    if ((parity != ODD_PARITY) && (parity != EVEN_PARITY)) {
      parity = NO_PARITY;
    }
    hal_uart_setconfig(uart_dev,*(uint32_t *)arg,parity);
    return 0;
  }
  return -0x16;
}



int vfs_uart_ioctl(file_t *fp,int cmd,ulong arg)

{
  int iVar1;
  uart_dev_t *uart_dev;
  uint8_t uVar2;
  
  if (fp == (file_t *)0x0) {
    return -0x16;
  }
  iVar1 = -0x16;
  if (fp->node == (inode_t *)0x0) {
    return -0x16;
  }
  uart_dev = (uart_dev_t *)fp->node->i_arg;
  if (uart_dev == (uart_dev_t *)0x0) {
    return -0x16;
  }
  aos_mutex_lock((aos_mutex_t *)&uart_dev->mutex,0xffffffff);
  switch(cmd) {
  case 2:
    hal_uart_send_flush(uart_dev,0);
    break;
  case 3:
    hal_uart_setbaud(uart_dev,arg);
    break;
  case 4:
  case 5:
    iVar1 = uart_ioctl_cmd_waimode(uart_dev,cmd,arg);
    goto switchD_2304ccc2_caseD_7;
  case 6:
    uVar2 = '\x01';
    goto LAB_2304cd04;
  case 7:
    uVar2 = '\x02';
LAB_2304cd04:
    uart_dev->read_block_flag = uVar2;
    break;
  case 8:
    iVar1 = uart_ioctl_cmd_setconfig(uart_dev,arg);
  default:
    goto switchD_2304ccc2_caseD_7;
  }
  iVar1 = -1;
switchD_2304ccc2_caseD_7:
  aos_mutex_unlock((aos_mutex_t *)&uart_dev->mutex);
  return iVar1;
}



yloop_ctx_t * get_context(void)

{
  yloop_ctx_t *pyVar1;
  
  pyVar1 = (yloop_ctx_t *)aos_task_getspecific(g_loop_key);
  if (pyVar1 == (yloop_ctx_t *)0x0) {
    aos_task_setspecific(g_loop_key,g_main_ctx);
    pyVar1 = g_main_ctx;
  }
  return pyVar1;
}



void aos_loop_set_eventfd(int fd)

{
  yloop_ctx_t *pyVar1;
  
  pyVar1 = get_context();
  pyVar1->eventfd = fd;
  return;
}



aos_loop_t aos_loop_init(void)

{
  aos_task_key_t key;
  void *pvVar1;
  yloop_ctx_t *__s;
  
  pvVar1 = aos_task_getspecific(g_loop_key);
  if (g_main_ctx == (yloop_ctx_t *)0x0) {
    aos_task_key_create(&g_loop_key);
  }
  else {
    if (pvVar1 != (void *)0x0) {
      printf("yloopyloop already inited");
      return pvVar1;
    }
  }
  __s = (yloop_ctx_t *)pvPortMalloc(0x1c);
  if (__s != (yloop_ctx_t *)0x0) {
    memset(__s,0,0x1c);
  }
  if (g_main_ctx == (yloop_ctx_t *)0x0) {
    g_main_ctx = __s;
  }
  *(yloop_ctx_t **)&(__s->timeouts).prev = __s;
  key = g_loop_key;
  __s->eventfd = -1;
  *(yloop_ctx_t **)&(__s->timeouts).next = __s;
  aos_task_setspecific(key,__s);
  aos_event_service_init();
  return __s;
}



int aos_poll_read_fd(int sock,aos_poll_call_t *cb,void *private_data)

{
  yloop_sock_t *__dest;
  yloop_ctx_t *pyVar1;
  pollfd *__dest_00;
  uint uVar2;
  int iVar3;
  uint uVar4;
  
  pyVar1 = get_context();
  if (sock < 0) {
    iVar3 = -0x16;
  }
  else {
    uVar4 = (uint)pyVar1->reader_count;
    __dest = (yloop_sock_t *)pvPortMalloc((uVar4 + 1) * 0xc);
    __dest_00 = (pollfd *)pvPortMalloc((uVar4 + 1) * 8);
    if ((__dest == (yloop_sock_t *)0x0) || (__dest_00 == (pollfd *)0x0)) {
      printf("yloopout of memory");
      vPortFree(__dest);
      vPortFree(__dest_00);
      iVar3 = -0xc;
    }
    else {
      uVar2 = aos_fcntl(sock,3,0);
      aos_fcntl(sock,4,uVar2 | 0x4000);
      pyVar1->reader_count = pyVar1->reader_count + '\x01';
      memcpy(__dest,pyVar1->readers,uVar4 * 0xc);
      vPortFree(pyVar1->readers);
      pyVar1->readers = __dest;
      memcpy(__dest_00,pyVar1->pollfds,uVar4 << 3);
      __dest = __dest + uVar4;
      vPortFree(pyVar1->pollfds);
      pyVar1->pollfds = __dest_00;
      __dest->sock = sock;
      __dest->private_data = private_data;
      __dest->cb = cb;
      iVar3 = 0;
      if ((int)(uint)pyVar1->max_sock < sock) {
        pyVar1->max_sock = (uint16_t)sock;
        iVar3 = 0;
      }
    }
  }
  return iVar3;
}



int aos_post_delayed_action(int ms,aos_call_t *action,void *param)

{
  yloop_ctx_t *pyVar1;
  dlist_s *pdVar2;
  int iVar3;
  pollfd *ppVar4;
  aos_call_t *paVar5;
  yloop_sock_t *pyVar6;
  dlist_s *pdVar7;
  yloop_ctx_t *pyVar8;
  
