pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (action != (aos_call_t *)0x0) {
    paVar5 = action;
    pyVar1 = get_context();
    pdVar2 = (dlist_s *)pvPortMalloc(0x20);
    iVar3 = -0xc;
    if (pdVar2 != (dlist_s *)0x0) {
      aos_now_ms();
      ppVar4 = (pollfd *)(iVar3 + ms);
      pyVar6 = (yloop_sock_t *)(paVar5 + (uint)(ppVar4 < (uint)ms) + (ms >> 0x1f));
      *(pollfd **)&pdVar2[1].prev = ppVar4;
      *(yloop_sock_t **)&pdVar2[1].next = pyVar6;
      pdVar2[2].prev = param;
      *(aos_call_t **)&pdVar2[2].next = action;
      *(int *)&pdVar2[3].prev = ms;
      pyVar8 = (yloop_ctx_t *)(pyVar1->timeouts).next;
      while (((pyVar8 != pyVar1 && ((int)pyVar8->readers <= (int)pyVar6)) &&
             ((pyVar8->readers != pyVar6 || (pyVar8->pollfds <= ppVar4))))) {
        pyVar8 = (yloop_ctx_t *)(pyVar8->timeouts).next;
      }
      pdVar7 = (pyVar8->timeouts).prev;
      *(yloop_ctx_t **)&pdVar2->next = pyVar8;
      iVar3 = 0;
      pdVar2->prev = pdVar7;
      pdVar7->next = pdVar2;
      (pyVar8->timeouts).prev = pdVar2;
    }
    return iVar3;
  }
  return -0x16;
}



void aos_loop_run(yloop_sock_t *param_1)

{
  yloop_ctx_t *pyVar1;
  yloop_sock_t *pyVar2;
  yloop_ctx_t *pyVar3;
  yloop_ctx_t *pyVar4;
  yloop_sock_t *extraout_a1;
  yloop_sock_t *extraout_a1_00;
  yloop_ctx_t *pv;
  dlist_s *pdVar5;
  int iVar6;
  dlist_s *pdVar7;
  yloop_sock_t *pyVar8;
  yloop_sock_t *nfds;
  undefined4 extraout_fa0;
  longlong lVar9;
  
  pyVar3 = get_context();
  pyVar4 = pyVar3;
  while (pyVar3->terminate == false) {
    pyVar1 = (yloop_ctx_t *)(pyVar3->timeouts).next;
    nfds = (yloop_sock_t *)(uint)pyVar3->reader_count;
    if ((pyVar3 == pyVar1) && (pyVar3->reader_count == 0)) break;
    pv = (yloop_ctx_t *)0xffffffff;
    if (pyVar3 != pyVar1) {
      aos_now_ms();
      if (((int)param_1 < (int)pyVar1->readers) ||
         ((pyVar1->readers == param_1 && (pyVar4 < (yloop_ctx_t *)pyVar1->pollfds)))) {
        pv = (yloop_ctx_t *)((int)(yloop_ctx_t *)pyVar1->pollfds - (int)pyVar4);
      }
      else {
        pv = (yloop_ctx_t *)0x0;
      }
    }
    iVar6 = 0;
    while (iVar6 < (int)nfds) {
      pyVar3->pollfds[iVar6].fd = pyVar3->readers[iVar6].sock;
      pyVar3->pollfds[iVar6].events = 1;
      iVar6 = iVar6 + 1;
    }
    param_1 = nfds;
    pyVar1 = (yloop_ctx_t *)aos_poll(pyVar3->pollfds,(int)nfds,(int)pv);
    pyVar4 = pyVar1;
    if ((int)pyVar1 < 0) {
      pyVar4 = (yloop_ctx_t *)__errno();
      param_1 = extraout_a1;
      if ((pyVar4->timeouts).prev != (dlist_s *)0x4) {
        printf("yloopaos_poll",extraout_fa0);
        return;
      }
    }
    pv = (yloop_ctx_t *)(pyVar3->timeouts).next;
    if (pyVar3 != pv) {
      lVar9 = aos_now_ms();
      if (((int)pv->readers <= (int)param_1) &&
         ((pv->readers != param_1 || ((yloop_ctx_t *)pv->pollfds <= pyVar4)))) {
        pdVar7 = (pv->timeouts).next;
        pdVar5 = (pv->timeouts).prev;
        pdVar5->next = pdVar7;
        pdVar7->prev = pdVar5;
        param_1 = (yloop_sock_t *)
                  (**(code **)&pv->max_sock)(pv->eventfd,*(code **)&pv->max_sock,(int)lVar9);
        vPortFree(pv);
        pyVar4 = pv;
      }
    }
    pyVar2 = (yloop_sock_t *)0x0;
    if (0 < (int)pyVar1) {
      while (pyVar2 != nfds) {
        if ((pyVar3->pollfds[(int)pyVar2].revents & 1U) != 0) {
          pyVar8 = pyVar3->readers + (int)pyVar2;
          pyVar4 = (yloop_ctx_t *)(*pyVar8->cb)(pyVar8->sock,pyVar8->private_data);
          param_1 = extraout_a1_00;
        }
        pyVar2 = (yloop_sock_t *)((int)&pyVar2->sock + 1);
      }
    }
  }
  pyVar3->terminate = false;
  return;
}



void vfs_poll_notify(pollfd *fd,void *arg)

{
  aos_sem_signal((aos_sem_t *)arg);
  return;
}



int aos_poll(pollfd *fds,int nfds,int timeout)

{
  ushort *puVar1;
  int iVar2;
  uint fd;
  file_t *pfVar3;
  ushort *puVar4;
  int iVar5;
  code *pcVar6;
  int iVar7;
  pollfd *ppVar8;
  aos_sem_t aStack60;
  poll_arg parg;
  _types_fd_set rfds;
  
  aos_sem_new(&aStack60,0);
  iVar5 = 0;
  do {
    *(undefined *)((int)&parg.sem.hdl + iVar5) = 0;
    iVar5 = iVar5 + 1;
  } while (iVar5 != 8);
  puVar1 = (ushort *)&fds->revents;
  iVar5 = 0;
  puVar4 = puVar1;
  while (iVar5 < nfds) {
    *puVar4 = 0;
    iVar5 = iVar5 + 1;
    puVar4 = puVar4 + 4;
  }
  iVar5 = 0;
  ppVar8 = fds;
  do {
    if (nfds <= iVar5) {
      if (timeout < 0) {
        timeout = 0xffffffff;
      }
      aos_sem_wait(&aStack60,timeout);
      iVar5 = 0;
      while (iVar5 < nfds) {
        if ((1 << (*(uint *)(puVar1 + -3) & 0x1f) &
            (uint)(&parg)[*(uint *)(puVar1 + -3) >> 5].sem.hdl) != 0) {
          *puVar1 = *puVar1 | 1;
        }
        iVar5 = iVar5 + 1;
        puVar1 = puVar1 + 4;
      }
      iVar5 = 0;
check_poll:
      iVar2 = 0;
      iVar7 = 0;
      while (iVar7 < nfds) {
        if (((1 < fds->fd) && (pfVar3 = get_file(fds->fd), pfVar3 != (file_t *)0x0)) &&
           (pcVar6 = *(code **)(pfVar3->node->ops + 0x14), (*pcVar6)(0,0,0,0,pcVar6),
           fds->revents != 0)) {
          iVar2 = iVar2 + 1;
        }
        iVar7 = iVar7 + 1;
        fds = fds + 1;
      }
      aos_sem_free(&aStack60);
      if (iVar5 != 0) {
        iVar2 = 0;
      }
      return iVar2;
    }
    fd = ppVar8->fd;
    if ((int)fd < 2) {
      (&parg)[fd >> 5].sem.hdl = (void *)(1 << (fd & 0x1f) | (uint)(&parg)[fd >> 5].sem.hdl);
    }
    else {
      pfVar3 = get_file(fd);
      if (pfVar3 == (file_t *)0x0) {
        iVar5 = -1;
        goto check_poll;
      }
      pcVar6 = *(code **)(pfVar3->node->ops + 0x14);
      (*pcVar6)(1,vfs_poll_notify,ppVar8,&aStack60,pcVar6);
    }
    iVar5 = iVar5 + 1;
    ppVar8 = ppVar8 + 1;
  } while( true );
}



int aos_fcntl(int fd,int cmd,int val)

{
  int iVar1;
  
  iVar1 = -0x16;
  if ((-1 < fd) && (iVar1 = 0, fd < 2)) {
    iVar1 = -2;
  }
  return iVar1;
}



void dfl_entry(void *arg)

{
  code *pcVar1;
  undefined4 uVar2;
  
  uVar2 = *(undefined4 *)((int)arg + 8);
  pcVar1 = *(code **)((int)arg + 4);
  vPortFree(arg);
  (*pcVar1)(uVar2);
  vTaskDelete((TaskHandle_t)0x0);
  return;
}



int aos_task_new(char *name,anon_subr_void_void_ptr *fn,void *arg,int stack_size)

{
  StaticTask_t *pxTaskBuffer;
  StaticTask_t **pvParameters;
  StackType_t *puxStackBuffer;
  TaskHandle_t ptVar1;
  int iVar2;
  
  pxTaskBuffer = (StaticTask_t *)pvPortMalloc(0x9c);
  pvParameters = (StaticTask_t **)pvPortMalloc(0xc);
  puxStackBuffer = (StackType_t *)pvPortMalloc(stack_size);
  memset(puxStackBuffer,0,stack_size);
  memset(pxTaskBuffer,0,0x9c);
  pxTaskBuffer[1].pxDummy1 = (void *)0xfffffff0;
  *(StackType_t **)(pxTaskBuffer[1].xDummy3[0].pvDummy3 + 3) = puxStackBuffer;
  strncpy((char *)(pxTaskBuffer[1].xDummy3 + 1),name,0x1f);
  *(undefined4 *)(pxTaskBuffer[1].ucDummy7 + 4) = 0x20171020;
  *pvParameters = pxTaskBuffer;
  *(anon_subr_void_void_ptr **)(pvParameters + 1) = fn;
  pvParameters[2] = arg;
  ptVar1 = xTaskCreateStatic(dfl_entry,name,(uint)stack_size >> 2,pvParameters,10,puxStackBuffer,
                             pxTaskBuffer);
  if (ptVar1 == (TaskHandle_t)0x0) {
    vPortFree(pxTaskBuffer);
    vPortFree(puxStackBuffer);
    vPortFree(pvParameters);
    iVar2 = -1;
  }
  else {
    iVar2 = 0;
  }
  return iVar2;
}



void aos_task_exit(int code)

{
  vTaskDelete((TaskHandle_t)0x0);
  return;
}



