pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int aos_task_key_create(aos_task_key_t *key)

{
  TaskHandle_t ptVar1;
  uint uVar2;
  aos_task_key_t aVar3;
  int iVar4;
  StackType_t *pSVar5;
  
  ptVar1 = xTaskGetCurrentTaskHandle();
  if (*(int *)(ptVar1[1].pcTaskName + 4) == 0x20171020) {
    pSVar5 = ptVar1[1].pxTopOfStack;
    if (((uint)pSVar5 & 1) == 0) {
      aVar3 = 0;
      uVar2 = 1;
    }
    else {
      if (((uint)pSVar5 & 2) == 0) {
        aVar3 = 1;
        uVar2 = 2;
      }
      else {
        if (((uint)pSVar5 & 4) == 0) {
          aVar3 = 2;
          uVar2 = 4;
        }
        else {
          if (((uint)pSVar5 & 8) != 0) {
            return -1;
          }
          aVar3 = 3;
          uVar2 = 8;
        }
      }
    }
    ptVar1[1].pxTopOfStack = (StackType_t *)((uint)pSVar5 | uVar2);
    *key = aVar3;
    iVar4 = 0;
  }
  else {
    iVar4 = -1;
  }
  return iVar4;
}



int aos_task_setspecific(aos_task_key_t key,void *vp)

{
  TaskHandle_t ptVar1;
  int iVar2;
  
  ptVar1 = xTaskGetCurrentTaskHandle();
  if (key < 4) {
    iVar2 = -1;
    if (*(int *)(ptVar1[1].pcTaskName + 4) == 0x20171020) {
      *(void **)(&(ptVar1->xStateListItem).xItemValue + key + 0x18) = vp;
      iVar2 = 0;
    }
  }
  else {
    iVar2 = -1;
  }
  return iVar2;
}



void * aos_task_getspecific(aos_task_key_t key)

{
  TaskHandle_t ptVar1;
  void *pvVar2;
  
  ptVar1 = xTaskGetCurrentTaskHandle();
  if (key < 4) {
    pvVar2 = (void *)0x0;
    if (*(int *)(ptVar1[1].pcTaskName + 4) == 0x20171020) {
      pvVar2 = (void *)(&(ptVar1->xStateListItem).xItemValue)[key + 0x18];
    }
  }
  else {
    pvVar2 = (void *)0x0;
  }
  return pvVar2;
}



int aos_mutex_new(aos_mutex_t *mutex)

{
  QueueHandle_t pQVar1;
  
  pQVar1 = xQueueCreateMutex('\x01');
  *(QueueHandle_t *)&mutex->hdl = pQVar1;
  return -(uint)(pQVar1 == (QueueHandle_t)0x0);
}



void aos_mutex_free(aos_mutex_t *mutex)

{
  vQueueDelete((QueueHandle_t)mutex->hdl);
  return;
}



int aos_mutex_lock(aos_mutex_t *mutex,uint ms)

{
  if (mutex != (aos_mutex_t *)0x0) {
    xQueueSemaphoreTake((QueueHandle_t)mutex->hdl,ms);
    return 0;
  }
  return 0;
}



int aos_mutex_unlock(aos_mutex_t *mutex)

{
  if (mutex != (aos_mutex_t *)0x0) {
    xQueueGenericSend((QueueHandle_t)mutex->hdl,(void *)0x0,0,0);
    return 0;
  }
  return 0;
}



int aos_sem_new(aos_sem_t *sem,int count)

{
  QueueHandle_t pQVar1;
  
  pQVar1 = xQueueCreateCountingSemaphore(0x80,count);
  *(QueueHandle_t *)&sem->hdl = pQVar1;
  return 0;
}



void aos_sem_free(aos_sem_t *sem)

{
  if (sem != (aos_sem_t *)0x0) {
    vQueueDelete((QueueHandle_t)sem->hdl);
    return;
  }
  return;
}



int aos_sem_wait(aos_sem_t *sem,uint ms)

{
  BaseType_t BVar1;
  
  if (sem != (aos_sem_t *)0x0) {
    BVar1 = xQueueSemaphoreTake((QueueHandle_t)sem->hdl,ms);
    return -(uint)(BVar1 != 1);
  }
  return -1;
}



void aos_sem_signal(aos_sem_t *sem)

{
  BaseType_t BStack20;
  BaseType_t xHigherPriorityTaskWoken;
  
  BStack20 = 0;
  if (sem != (aos_sem_t *)0x0) {
    if (TrapNetCounter == 0) {
      xQueueGenericSend((QueueHandle_t)sem->hdl,(void *)0x0,0,0);
    }
    else {
      xQueueGiveFromISR((QueueHandle_t)sem->hdl,&BStack20);
      if (BStack20 != 0) {
        vTaskSwitchContext();
      }
    }
  }
  return;
}



void * aos_malloc(size_t xWantedSize)

{
  size_t sVar1;
  size_t sVar2;
  BlockLink_t *pBVar3;
  A_BLOCK_LINK *pAVar4;
  BlockLink_t *pxBlockToInsert;
  uint uVar5;
  uint uVar6;
  
  if (pxEnd == (BlockLink_t *)0x0) {
    vAssertCalled();
  }
  vTaskSuspendAll();
  sVar2 = xFreeBytesRemaining;
  sVar1 = xBlockAllocatedBit;
  if (((xBlockAllocatedBit & xWantedSize) == 0) && (xWantedSize != 0)) {
    uVar6 = xWantedSize + 8;
    if ((uVar6 & 7) != 0) {
      uVar6 = (uVar6 & 0xfffffff8) + 8;
    }
    if ((uVar6 != 0) && (uVar6 <= xFreeBytesRemaining)) {
      pAVar4 = xStart.pxNextFreeBlock;
      pBVar3 = &xStart;
      do {
        pxBlockToInsert = pBVar3;
        pBVar3 = (BlockLink_t *)pAVar4;
        if (uVar6 <= pBVar3->xBlockSize) break;
        pAVar4 = pBVar3->pxNextFreeBlock;
      } while (pBVar3->pxNextFreeBlock != (A_BLOCK_LINK *)0x0);
      if (pxEnd != pBVar3) {
        pAVar4 = pxBlockToInsert->pxNextFreeBlock;
        pxBlockToInsert->pxNextFreeBlock = pBVar3->pxNextFreeBlock;
        uVar5 = pBVar3->xBlockSize;
        pAVar4 = pAVar4 + 1;
        if (0x10 < uVar5 - uVar6) {
          pxBlockToInsert = (BlockLink_t *)((int)&pBVar3->pxNextFreeBlock + uVar6);
          pxBlockToInsert->xBlockSize = uVar5 - uVar6;
          pBVar3->xBlockSize = uVar6;
          prvInsertBlockIntoFreeList(pxBlockToInsert);
          uVar5 = pBVar3->xBlockSize;
        }
        xFreeBytesRemaining = sVar2 - uVar5;
        if (xFreeBytesRemaining < xMinimumEverFreeBytesRemaining) {
          xMinimumEverFreeBytesRemaining = xFreeBytesRemaining;
        }
        pBVar3->xBlockSize = sVar1 | uVar5;
        pBVar3->pxNextFreeBlock = (A_BLOCK_LINK *)0x0;
        xTaskResumeAll();
        if (pAVar4 != (A_BLOCK_LINK *)0x0) {
          return pAVar4;
        }
        goto LAB_230321be;
      }
    }
  }
  xTaskResumeAll();
LAB_230321be:
  vApplicationMallocFailedHook();
  return (void *)0x0;
}



void aos_free(void *pv)

{
  uint uVar1;
  
  if (pv == (void *)0x0) {
    return;
  }
  uVar1 = *(uint *)((int)pv + -4);
  if ((uVar1 & xBlockAllocatedBit) == 0) {
    vAssertCalled();
    if (*(int *)((int)pv + -8) == 0) {
      uVar1 = *(uint *)((int)pv + -4);
      if ((uVar1 & xBlockAllocatedBit) == 0) {
        return;
      }
      goto LAB_230322ce;
    }
  }
  else {
    if (*(int *)((int)pv + -8) == 0) goto LAB_230322ce;
  }
  vAssertCalled();
  uVar1 = *(uint *)((int)pv + -4);
  if (((uVar1 & xBlockAllocatedBit) == 0) || (*(int *)((int)pv + -8) != 0)) {
    return;
  }
LAB_230322ce:
  *(uint *)((int)pv + -4) = ~xBlockAllocatedBit & uVar1;
  vTaskSuspendAll();
  xFreeBytesRemaining = *(int *)((int)pv + -4) + xFreeBytesRemaining;
  prvInsertBlockIntoFreeList((BlockLink_t *)((int)pv + -8));
  xTaskResumeAll();
  return;
}



longlong aos_now_ms(void)

{
  BaseType_t BVar1;
  longlong in_fa0;
  TickType_t TStack24;
  TickType_t ticks;
  BaseType_t overflow_count;
  
  TStack24 = 0;
  ticks = 0;
  BVar1 = xTaskGetTickCount2(&TStack24,(BaseType_t *)&ticks);
  if (BVar1 != 1) {
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  return in_fa0;
}



int event_poll(file_t *f,_Bool setup,poll_notify_t *notify,pollfd *fd,void *opa)

{
  aos_mutex_t *mutex;
  undefined3 in_register_0000202d;
  
