pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mutex = (aos_mutex_t *)f->f_arg;
  aos_mutex_lock(mutex,0xffffffff);
  if (CONCAT31(in_register_0000202d,setup) == 0) {
    mutex[1].hdl = (void *)0x0;
    mutex[3].hdl = (void *)0x0;
  }
  else {
    *(poll_notify_t **)&mutex[1].hdl = notify;
    *(pollfd **)&mutex[2].hdl = fd;
    mutex[3].hdl = opa;
    if (mutex[4].hdl != (void *)0x0) {
      fd->revents = fd->revents | 1;
      (*notify)(fd,opa);
    }
  }
  aos_mutex_unlock(mutex);
  return 0;
}



int event_open(inode_t *node,file_t *file)

{
  aos_mutex_t *mutex;
  
  mutex = (aos_mutex_t *)aos_malloc(0x28);
  memset(mutex,0,0x28);
  aos_mutex_new(mutex);
  *(aos_mutex_t **)&mutex[5].hdl = mutex + 5;
  *(aos_mutex_t **)&mutex[6].hdl = mutex + 5;
  *(aos_mutex_t **)&mutex[8].hdl = mutex + 8;
  *(aos_mutex_t **)&mutex[9].hdl = mutex + 8;
  *(aos_mutex_t **)&file->f_arg = mutex;
  return 0;
}



ssize_t _event_write(void *buf,size_t len,_Bool urgent)

{
  int *piVar1;
  undefined3 in_register_00002031;
  int in_a3;
  int iVar2;
  int *piVar3;
  int **ppiVar4;
  size_t __n;
  
  __n = CONCAT31(in_register_00002031,urgent);
  aos_mutex_lock((aos_mutex_t *)buf,0xffffffff);
  if ((*(int *)((int)buf + 0x1c) < 1) || (piVar1 = *(int **)((int)buf + 0x24), __n != piVar1[2])) {
    piVar1 = (int *)aos_malloc(__n + 0xc);
    if (piVar1 == (int *)0x0) {
      __n = 0xffffffff;
      goto out;
    }
  }
  else {
    piVar3 = (int *)piVar1[1];
    iVar2 = *piVar1;
    *(int **)(iVar2 + 4) = piVar3;
    *piVar3 = iVar2;
    *(int *)((int)buf + 0x1c) = *(int *)((int)buf + 0x1c) + -1;
  }
  *(int *)((int)buf + 0x10) = *(int *)((int)buf + 0x10) + 1;
  piVar1[2] = __n;
  memcpy(piVar1 + 3,(void *)len,__n);
  if (in_a3 == 0) {
    iVar2 = *(int *)((int)buf + 0x14);
    piVar1[1] = (int)buf + 0x14;
    *piVar1 = iVar2;
    *(int **)(iVar2 + 4) = piVar1;
    *(int **)((int)buf + 0x14) = piVar1;
  }
  else {
    ppiVar4 = *(int ***)((int)buf + 0x18);
    *piVar1 = (int)buf + 0x14;
    *(int ***)(piVar1 + 1) = ppiVar4;
    *(int **)((int)buf + 0x18) = piVar1;
    *ppiVar4 = piVar1;
  }
  if (*(int *)((int)buf + 4) != 0) {
    *(ushort *)(*(int *)((int)buf + 8) + 6) = *(ushort *)(*(int *)((int)buf + 8) + 6) | 1;
    (**(code **)((int)buf + 4))
              (*(undefined4 *)((int)buf + 8),*(undefined4 *)((int)buf + 0xc),
               *(code **)((int)buf + 4));
  }
out:
  aos_mutex_unlock((aos_mutex_t *)buf);
  return __n;
}



int event_ioctl(file_t *f,int cmd,ulong arg)

{
  ssize_t sVar1;
  
  if (((cmd & 0xfU) != 1) && ((cmd & 0xfU) != 2)) {
    return -1;
  }
  sVar1 = _event_write(f->f_arg,arg,SUB41(cmd >> 4,0));
  return sVar1;
}



ssize_t event_write(file_t *f,void *buf,size_t len)

{
  ssize_t sVar1;
  
  sVar1 = _event_write(f->f_arg,(size_t)buf,SUB41(len,0));
  return sVar1;
}



int event_close(file_t *file)

{
  aos_mutex_t *mutex;
  aos_mutex_t *pv;
  void *pvVar1;
  void **ppvVar2;
  
  mutex = (aos_mutex_t *)file->f_arg;
  aos_mutex_free(mutex);
  while (pv = (aos_mutex_t *)mutex[6].hdl, pv != mutex + 5) {
    pvVar1 = pv->hdl;
    ppvVar2 = (void **)pv[1].hdl;
    *(void ***)((int)pvVar1 + 4) = ppvVar2;
    *ppvVar2 = pvVar1;
    aos_free(pv);
  }
  while (pv = (aos_mutex_t *)mutex[9].hdl, pv != mutex + 8) {
    pvVar1 = pv->hdl;
    ppvVar2 = (void **)pv[1].hdl;
    *(void ***)((int)pvVar1 + 4) = ppvVar2;
    *ppvVar2 = pvVar1;
    aos_free(pv);
  }
  aos_free(mutex);
  return 0;
}



// WARNING: Type propagation algorithm not settling

ssize_t event_read(file_t *f,void *buf,size_t len)

{
  aos_mutex_t *mutex;
  void *pv;
  int iVar1;
  int *piVar2;
  void **ppvVar3;
  uint __n;
  
  mutex = (aos_mutex_t *)f->f_arg;
  __n = (uint)mutex[4].hdl;
  if (__n != 0) {
    aos_mutex_lock(mutex,0xffffffff);
    pv = mutex[6].hdl;
    iVar1 = *(int *)pv;
    piVar2 = *(int **)((int)pv + 4);
    *(int **)(iVar1 + 4) = piVar2;
    *piVar2 = iVar1;
    __n = *(uint *)((int)pv + 8);
    if (len < *(uint *)((int)pv + 8)) {
      __n = len;
    }
    memcpy(buf,(void *)((int)pv + 0xc),__n);
    if ((int)mutex[7].hdl < 4) {
      ppvVar3 = (void **)mutex[9].hdl;
      *(aos_mutex_t **)pv = mutex + 8;
      *(void ***)((int)pv + 4) = ppvVar3;
      mutex[9].hdl = pv;
      *ppvVar3 = pv;
      mutex[7].hdl = (void *)((int)mutex[7].hdl + 1);
    }
    else {
      aos_free(pv);
    }
    mutex[4].hdl = (void *)((int)mutex[4].hdl + -1);
    aos_mutex_unlock(mutex);
  }
  return __n;
}



int vfs_device_init(void)

{
  int iVar1;
  
  iVar1 = 0;
  if ((inited != 1) &&
     (iVar1 = aos_register_driver("/dev/event",(file_ops_t *)&event_fops,(void *)0x0), iVar1 == 0))
  {
    inited = 1;
  }
  return iVar1;
}



// WARNING: Could not reconcile some variable overlaps

void event_read_cb(int fd,void *param)

{
  dlist_s *pdVar1;
  ssize_t sVar2;
  undefined auStack32 [4];
  input_event_t event;
  
  sVar2 = aos_read(fd,auStack32,0x10);
  if (sVar2 == 0x10) {
    pdVar1 = g_local_event_list.next;
    if ((short)event.time == 0x100) {
      (*event._4_4_)(event.value,event._4_4_);
    }
    else {
      while (pdVar1 != (dlist_s *)&g_local_event_list) {
        if ((*(short *)&((dlist_t *)pdVar1)[2].prev == 0) ||
           ((short)event.time == *(short *)&((dlist_t *)pdVar1)[2].prev)) {
          (*(code *)((dlist_t *)pdVar1)[1].prev)
                    (auStack32,((dlist_t *)pdVar1)[1].next,((dlist_t *)pdVar1)[1].prev);
        }
        pdVar1 = ((dlist_t *)pdVar1)->next;
      }
    }
  }
  return;
}



int aos_event_service_init(void)

{
  int sock;
  
  sock = aos_open("/dev/event",0);
  if (local_event.fd < 0) {
    local_event.fd = sock;
  }
  aos_poll_read_fd(sock,event_read_cb,(void *)0x0);
  aos_loop_set_eventfd(sock);
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

int aos_post_event(uint16_t type,uint16_t code,ulong value)

{
  undefined2 in_register_0000202a;
  int iVar1;
  undefined4 local_20;
  input_event_t event;
  
  event.time._0_2_ = (ushort)((CONCAT22(in_register_0000202a,type) << 0x11) >> 0x11);
  local_20 = 0;
  event.value = 0;
  event.time._2_2_ = code;
  event._4_4_ = value;
  iVar1 = aos_ioctl(local_event.fd,(CONCAT22(in_register_0000202a,type) >> 0xf) + 0x101,
                    (ulong)&local_20);
  return iVar1;
}



int aos_register_event_filter(uint16_t type,aos_event_cb *cb,void *priv)

{
  dlist_s *pdVar1;
  int iVar2;
  
  if (cb != (aos_event_cb *)0x0) {
    pdVar1 = (dlist_s *)aos_malloc(0x14);
    iVar2 = -0xc;
    if (pdVar1 != (dlist_s *)0x0) {
      *(aos_event_cb **)&pdVar1[1].prev = cb;
      *(uint16_t *)&pdVar1[2].prev = type;
      pdVar1->prev = g_local_event_list.prev;
      pdVar1[1].next = priv;
      *(dlist_t **)&pdVar1->next = &g_local_event_list;
      (g_local_event_list.prev)->next = pdVar1;
      iVar2 = 0;
      g_local_event_list.prev = pdVar1;
    }
    return iVar2;
  }
  return -0x16;
}



