pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

IoT_Error_t aws_iot_shadow_init(AWS_IoT_Client *pClient,ShadowInitParameters_t *pParams)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  _Bool a_Stack68 [4];
  IoT_Client_Init_Params mqttInitParams;
  
  memcpy(a_Stack68,&DAT_230879c0,0x34);
  IVar1 = NULL_VALUE_ERROR;
  if ((pClient != (AWS_IoT_Client *)0x0) && (pParams != (ShadowInitParameters_t *)0x0)) {
    a_Stack68[0] = pParams->enableAutoReconnect;
    mqttInitParams._0_4_ = pParams->pHost;
    mqttInitParams.pHostURL._0_2_ = pParams->port;
    mqttInitParams._8_4_ = pParams->pRootCA;
    mqttInitParams.pRootCALocation = pParams->pClientCRT;
    mqttInitParams.pDeviceCertLocation = pParams->pClientKey;
    mqttInitParams.pDevicePrivateKeyLocation = (char *)0x1388;
    mqttInitParams.tlsHandshakeTimeout_ms._0_1_ = true;
    mqttInitParams._36_4_ = pParams->disconnectHandler;
    IVar1 = aws_iot_mqtt_init(pClient,(IoT_Client_Init_Params *)a_Stack68);
    if (CONCAT31(extraout_var,IVar1) == 0) {
      resetClientTokenSequenceNum();
      shadowJsonVersionNum = 0;
      initDeltaTokens();
    }
  }
  return IVar1;
}



// WARNING: Could not reconcile some variable overlaps

IoT_Error_t
aws_iot_shadow_connect(AWS_IoT_Client *pClient,ShadowConnectParameters_t_conflict6 *pParams)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  size_t sVar2;
  undefined auStack88 [4];
  IoT_Client_Connect_Params ConnectParams;
  
  IVar1 = NULL_VALUE_ERROR;
  memcpy(auStack88,&iotClientConnectParamsDefault,0x38);
  if (((pClient != (AWS_IoT_Client *)0x0) && (pParams != (ShadowConnectParameters_t_conflict6 *)0x0)
      ) && (pParams->pMqttClientId != (char *)0x0)) {
    snprintf(myThingName,0x14,"%s",pParams->pMyThingName);
    snprintf(mqttClientID,0x50,"%s",pParams->pMqttClientId);
    ConnectParams.struct_id[0] = MQTT_3_1_1;
    ConnectParams.pClientID._2_2_ = 600;
    ConnectParams.clientIDLen = 1;
    ConnectParams._4_4_ = pParams->pMqttClientId;
    ConnectParams.pClientID._0_2_ = pParams->mqttClientIdLen;
    ConnectParams._44_4_ = (char *)0x0;
    ConnectParams.will._16_4_ = (char *)0x0;
    IVar1 = aws_iot_mqtt_connect(pClient,(IoT_Client_Connect_Params *)auStack88);
    if (CONCAT31(extraout_var,IVar1) == 0) {
      initializeRecords(pClient);
      if (pParams->deleteActionHandler != (pApplicationHandler_t *)0x0) {
        snprintf(deleteAcceptedTopic,0x50,"$aws/things/%s/shadow/delete/accepted",myThingName);
        sVar2 = strlen(deleteAcceptedTopic);
        IVar1 = aws_iot_mqtt_subscribe
                          (pClient,deleteAcceptedTopic,(uint16_t)sVar2,QOS1,
                           pParams->deleteActionHandler,myThingName);
      }
    }
  }
  return IVar1;
}



IoT_Error_t aws_iot_shadow_register_delta(AWS_IoT_Client *pMqttClient,jsonStruct_t *pStruct)

{
  _Bool _Var1;
  IoT_Error_t IVar2;
  undefined3 extraout_var;
  
  if ((pMqttClient != (AWS_IoT_Client *)0x0) && (pStruct != (jsonStruct_t *)0x0)) {
    _Var1 = aws_iot_mqtt_is_client_connected(pMqttClient);
    if (CONCAT31(extraout_var,_Var1) != 0) {
      IVar2 = registerJsonTokenOnDelta(pStruct);
      return IVar2;
    }
    return MQTT_CONNECTION_ERROR;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t aws_iot_shadow_yield(AWS_IoT_Client *pClient,uint32_t timeout)

{
  IoT_Error_t IVar1;
  
  if (pClient != (AWS_IoT_Client *)0x0) {
    HandleExpiredResponseCallbacks();
    IVar1 = aws_iot_mqtt_yield(pClient,timeout);
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t aws_iot_shadow_disconnect(AWS_IoT_Client *pClient)

{
  ClientState CVar1;
  _Bool _Var2;
  IoT_Error_t IVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar4;
  undefined3 extraout_var_01;
  
  if (pClient != (AWS_IoT_Client *)0x0) {
    CVar1 = aws_iot_mqtt_get_client_state(pClient);
    _Var2 = aws_iot_mqtt_is_client_connected(pClient);
    IVar3 = NETWORK_DISCONNECTED_ERROR;
    if (CONCAT31(extraout_var_00,_Var2) != 0) {
      iVar4 = aws_iot_mqtt_set_client_state(pClient,CONCAT31(extraout_var,CVar1),10);
      IVar3 = (IoT_Error_t)iVar4;
      if (iVar4 == 0) {
        IVar3 = _aws_iot_mqtt_internal_disconnect(pClient);
        if (CONCAT31(extraout_var_01,IVar3) == 0) {
          (pClient->clientStatus).clientState = CLIENT_STATE_DISCONNECTED_MANUALLY;
        }
        else {
          (pClient->clientStatus).clientState = CVar1;
        }
      }
    }
    return IVar3;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t
aws_iot_shadow_update
          (AWS_IoT_Client *pClient,char *pThingName,char *pJsonString,fpActionCallback_t *callback,
          void *pContextData,uint8_t timeout_seconds,_Bool isPersistentSubscribe)

{
  _Bool _Var1;
  IoT_Error_t IVar2;
  undefined3 extraout_var;
  size_t jsonSize;
  undefined3 in_register_0000203d;
  
  if (pClient == (AWS_IoT_Client *)0x0) {
    return NULL_VALUE_ERROR;
  }
  _Var1 = aws_iot_mqtt_is_client_connected(pClient);
  if (CONCAT31(extraout_var,_Var1) != 0) {
    jsonSize = strlen(pJsonString);
    IVar2 = aws_iot_shadow_internal_action
                      (pThingName,SHADOW_UPDATE,pJsonString,jsonSize,callback,pContextData,
                       CONCAT31(in_register_0000203d,timeout_seconds),isPersistentSubscribe);
    return IVar2;
  }
  return MQTT_CONNECTION_ERROR;
}



IoT_Error_t aws_iot_shadow_set_autoreconnect_status(AWS_IoT_Client *pClient,_Bool newStatus)

{
  if (pClient != (AWS_IoT_Client *)0x0) {
    (pClient->clientStatus).isAutoReconnectEnabled = newStatus;
    return SUCCESS;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t
aws_iot_shadow_internal_action
          (char *pThingName,ShadowActions_t action,char *pJsonDocumentToBeSent,size_t jsonSize,
          fpActionCallback_t *callback,void *pCallbackContext,uint32_t timeout_seconds,
          _Bool isSticky)

{
  _Bool _Var1;
  _Bool _Var2;
  _Bool _Var3;
  IoT_Error_t IVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  int iVar5;
  uint8_t uStack141;
  char acStack140 [3];
  uint8_t indexAckWaitList;
  char extractedClientToken [90];
  
  IVar4 = NULL_VALUE_ERROR;
  if ((pThingName != (char *)0x0) && (pJsonDocumentToBeSent != (char *)0x0)) {
    _Var1 = extractClientToken(pJsonDocumentToBeSent,jsonSize,acStack140,0x5a);
    if ((CONCAT31(extraout_var,_Var1) == 0) || (callback == (fpActionCallback_t *)0x0)) {
      iVar5 = 0;
    }
    else {
      _Var2 = getNextFreeIndexOfAckWaitList(&uStack141);
      if (CONCAT31(extraout_var_00,_Var2) == 0) {
        return FAILURE;
      }
      _Var3 = isSubscriptionPresent(pThingName,action);
      iVar5 = CONCAT31(extraout_var_01,_Var3);
      if (iVar5 == 0) {
        IVar4 = subscribeToShadowActionAcks(pThingName,action,isSticky);
        iVar5 = CONCAT31(extraout_var_00,_Var2);
        if (CONCAT31(extraout_var_02,IVar4) != 0) {
          return IVar4;
        }
      }
      else {
        incrementSubscriptionCnt(pThingName,action,isSticky);
      }
    }
    IVar4 = publishToShadowAction(pThingName,action,pJsonDocumentToBeSent);
    if ((((CONCAT31(extraout_var,_Var1) != 0) && (callback != (fpActionCallback_t *)0x0)) &&
        (CONCAT31(extraout_var_03,IVar4) == 0)) && (iVar5 != 0)) {
      addToAckWaitList(uStack141,pThingName,action,acStack140,callback,pCallbackContext,
                       timeout_seconds);
    }
  }
  return IVar4;
}



IoT_Error_t
convertDataToString(char *pStringBuffer,size_t maxSizoStringBuffer,JsonPrimitiveType type,
                   void *pData)

{
  uint uVar1;
  undefined3 in_register_00002031;
  int iVar2;
  char *__format;
  char *pcVar3;
  IoT_Error_t IVar4;
  size_t sVar5;
  
  iVar2 = CONCAT31(in_register_00002031,type);
  if (maxSizoStringBuffer == 0) {
    return SHADOW_JSON_ERROR;
  }
  if (iVar2 == 0) {
    pcVar3 = *(char **)pData;
    __format = "%li,";
LAB_2304db20:
    uVar1 = snprintf(pStringBuffer,maxSizoStringBuffer,__format,pcVar3);
  }
  else {
    if (iVar2 == 1) {
      pcVar3 = (char *)(int)*(short *)pData;
      __format = "%hi,";
      goto LAB_2304db20;
    }
    if (iVar2 == 2) {
      pcVar3 = (char *)(int)*(char *)pData;
      __format = "%hhi,";
      goto LAB_2304db20;
    }
    if (iVar2 == 3) {
      pcVar3 = *(char **)pData;
      __format = "%lu,";
      goto LAB_2304db20;
    }
    if (iVar2 == 4) {
      pcVar3 = (char *)(uint)*(ushort *)pData;
      __format = "%hu,";
      goto LAB_2304db20;
    }
    if (iVar2 == 5) {
      pcVar3 = (char *)(uint)*(byte *)pData;
      __format = "%hhu,";
      goto LAB_2304db20;
    }
    if (iVar2 == 7) {
      pcVar3 = *(char **)pData;
      sVar5 = *(size_t *)((int)pData + 4);
    }
    else {
      if (iVar2 != 6) {
        if (iVar2 == 8) {
          if (*(char *)pData == '\0') {
            pcVar3 = "false";
          }
          else {
            pcVar3 = "true";
          }
LAB_2304dbe6:
          iVar2 = -0x538;
        }
        else {
          pcVar3 = (char *)pData;
          if (iVar2 != 9) {
            uVar1 = 0;
            if (iVar2 != 10) goto LAB_2304dc16;
            goto LAB_2304dbe6;
          }
          iVar2 = -0x534;
        }
        __format = "ERROR failed! net_set_(non)block() returned -0x%x\r\n" + iVar2 + 0x14;
        goto LAB_2304db20;
      }
      pcVar3 = pStringBuffer;
      sVar5 = maxSizoStringBuffer;
      __extendsfdf2((SFtype)pStringBuffer);
    }
    uVar1 = snprintf(pStringBuffer,maxSizoStringBuffer,"%f,",pcVar3,sVar5);
  }
  if ((int)uVar1 < 0) {
    return SHADOW_JSON_ERROR;
  }
LAB_2304dc16:
  IVar4 = SUCCESS;
  if (maxSizoStringBuffer <= uVar1) {
    IVar4 = SHADOW_JSON_BUFFER_TRUNCATED;
  }
  return IVar4;
}



void resetClientTokenSequenceNum(void)

{
  clientTokenNum = 0;
  return;
}



IoT_Error_t aws_iot_shadow_init_json_document(char *pJsonDocument,size_t maxSizeOfJsonDocument)

{
  uint uVar1;
  IoT_Error_t IVar2;
  
  if (pJsonDocument != (char *)0x0) {
    uVar1 = snprintf(pJsonDocument,maxSizeOfJsonDocument,"{\"state\":{");
    IVar2 = SHADOW_JSON_ERROR;
    if ((-1 < (int)uVar1) && (IVar2 = SUCCESS, maxSizeOfJsonDocument <= uVar1)) {
      IVar2 = SHADOW_JSON_BUFFER_TRUNCATED;
    }
    return IVar2;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t
aws_iot_shadow_add_reported(char *pJsonDocument,size_t maxSizeOfJsonDocument,uint8_t count,...)

{
  int *piVar1;
  IoT_Error_t IVar2;
  size_t sVar3;
  uint uVar4;
  undefined3 extraout_var;
  int *in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  int iVar5;
  uint __maxlen;
  int **ppiStack84;
  va_list pArgs;
  int *piStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  ppiStack84 = &piStack20;
  if (pJsonDocument == (char *)0x0) {
LAB_2304dc88:
    IVar2 = NULL_VALUE_ERROR;
  }
  else {
    piStack20 = in_a3;
    uStack16 = in_a4;
    uStack12 = in_a5;
    uStack8 = in_a6;
    uStack4 = in_a7;
    sVar3 = strlen(pJsonDocument);
    __maxlen = maxSizeOfJsonDocument - sVar3;
    if (__maxlen < 2) {
LAB_2304dcb6:
      IVar2 = SHADOW_JSON_ERROR;
    }
    else {
      sVar3 = strlen(pJsonDocument);
      uVar4 = snprintf(pJsonDocument + sVar3,__maxlen,"\"reported\":{");
      IVar2 = SHADOW_JSON_ERROR;
      if (-1 < (int)uVar4) {
        iVar5 = 0;
        if (uVar4 < __maxlen) {
          while (iVar5 < _count) {
            sVar3 = strlen(pJsonDocument);
            __maxlen = maxSizeOfJsonDocument - sVar3;
            if (__maxlen < 2) goto LAB_2304dcb6;
            piVar1 = *ppiStack84;
            ppiStack84 = ppiStack84 + 1;
            if (piVar1 == (int *)0x0) goto LAB_2304dc88;
            sVar3 = strlen(pJsonDocument);
            uVar4 = snprintf(pJsonDocument + sVar3,__maxlen,"\"%s\":",*piVar1);
            if ((int)uVar4 < 0) goto LAB_2304dcb6;
            if (__maxlen <= uVar4) goto LAB_2304dd10;
            if ((*piVar1 == 0) || (piVar1[1] == 0)) goto LAB_2304dc88;
            sVar3 = strlen(pJsonDocument);
            IVar2 = convertDataToString(pJsonDocument + sVar3,__maxlen,
                                        *(JsonPrimitiveType *)(piVar1 + 3),(void *)piVar1[1]);
            if (CONCAT31(extraout_var,IVar2) != 0) {
              return IVar2;
            }
            iVar5 = (iVar5 + 1) * 0x1000000 >> 0x18;
          }
          sVar3 = strlen(pJsonDocument);
          uVar4 = snprintf(pJsonDocument + (sVar3 - 1),__maxlen,"},");
          if ((int)uVar4 < 0) {
            return SHADOW_JSON_ERROR;
          }
          if (uVar4 < __maxlen) {
            return SUCCESS;
          }
        }
LAB_2304dd10:
        IVar2 = SHADOW_JSON_BUFFER_TRUNCATED;
      }
    }
  }
  return IVar2;
}



int32_t FillWithClientTokenSize
                  (char *pBufferToBeUpdatedWithClientToken,size_t maxSizeOfJsonDocument)

{
  int iVar1;
  
  clientTokenNum = clientTokenNum + 1;
  iVar1 = snprintf(pBufferToBeUpdatedWithClientToken,maxSizeOfJsonDocument,"%s-%d",mqttClientID);
  return iVar1;
}



