pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
IoT_Error_t aws_iot_finalize_json_document(char *pJsonDocument,size_t maxSizeOfJsonDocument)

{
  size_t sVar1;
  uint uVar2;
  uint __maxlen;
  
  if (pJsonDocument == (char *)0x0) {
    return NULL_VALUE_ERROR;
  }
  sVar1 = strlen(pJsonDocument);
  __maxlen = maxSizeOfJsonDocument - sVar1;
  if (1 < __maxlen) {
    sVar1 = strlen(pJsonDocument);
    uVar2 = snprintf(pJsonDocument + (sVar1 - 1),__maxlen,"}, \"%s\":\"","clientToken");
    if (-1 < (int)uVar2) {
      if (__maxlen <= uVar2) {
        return SHADOW_JSON_BUFFER_TRUNCATED;
      }
      sVar1 = strlen(pJsonDocument);
      __maxlen = maxSizeOfJsonDocument - sVar1;
      if (1 < __maxlen) {
        sVar1 = strlen(pJsonDocument);
        uVar2 = FillWithClientTokenSize(pJsonDocument + sVar1,__maxlen);
        if (-1 < (int)uVar2) {
          if (__maxlen <= uVar2) {
            return SHADOW_JSON_BUFFER_TRUNCATED;
          }
          sVar1 = strlen(pJsonDocument);
          __maxlen = maxSizeOfJsonDocument - sVar1;
          if (1 < __maxlen) {
            sVar1 = strlen(pJsonDocument);
            uVar2 = snprintf(pJsonDocument + sVar1,__maxlen,"\"}");
            if (-1 < (int)uVar2) {
              if (__maxlen <= uVar2) {
                return SHADOW_JSON_BUFFER_TRUNCATED;
              }
              return SUCCESS;
            }
          }
        }
      }
    }
  }
  return SHADOW_JSON_ERROR;
}



_Bool isJsonValidAndParse(char *pJsonDocument,size_t jsonSize,void *pJsonHandler,
                         int32_t *pTokenCount)

{
  int iVar1;
  undefined uVar2;
  
  jsmn_init(&shadowJsonParser);
  iVar1 = jsmn_parse(&shadowJsonParser,pJsonDocument,jsonSize,jsonTokenStruct,0x78);
  uVar2 = 0;
  if ((0 < iVar1) && (uVar2 = 0, jsonTokenStruct[0].type == JSMN_OBJECT)) {
    *pTokenCount = iVar1;
    uVar2 = 1;
  }
  return (_Bool)uVar2;
}



_Bool isJsonKeyMatchingAndUpdateValue
                (char *pJsonDocument,void *pJsonHandler,int32_t tokenCount,jsonStruct_t *pDataStruct
                ,uint32_t *pDataLength,int32_t *pDataPosition)

{
  JsonPrimitiveType JVar1;
  int8_t iVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint uVar3;
  int iVar4;
  uint32_t uVar5;
  undefined auStack80 [4];
  int iStack76;
  int iStack72;
  jsmntok_t jStack64;
  
  iVar4 = 1;
  while( true ) {
    if (tokenCount <= iVar4) {
      return false;
    }
    iVar2 = jsoneq(pJsonDocument,jsonTokenStruct + iVar4,pDataStruct->pKey);
    if (CONCAT31(extraout_var,iVar2) == 0) break;
    iVar2 = jsoneq(pJsonDocument,jsonTokenStruct + iVar4,"metadata");
    if (CONCAT31(extraout_var_00,iVar2) == 0) {
      return false;
    }
    iVar4 = iVar4 + 1;
  }
  iVar4 = iVar4 + 1;
  memcpy(auStack80,jsonTokenStruct + iVar4,0x10);
  iStack72 = jsonTokenStruct[iVar4].end;
  iVar4 = jsonTokenStruct[iVar4].start;
  uVar5 = iStack72 - iVar4;
  iStack76 = iVar4;
  memcpy(&jStack64,auStack80,0x10);
  JVar1 = pDataStruct->type;
  uVar3 = (uint)JVar1;
  if (JVar1 == SHADOW_JSON_BOOL) {
    if (pDataStruct->dataLength != 0) {
      parseBooleanValue((_Bool *)pDataStruct->pData,pJsonDocument,&jStack64);
    }
  }
  else {
    if (JVar1 == SHADOW_JSON_INT32) {
      if (3 < pDataStruct->dataLength) {
        parseInteger32Value((int32_t *)pDataStruct->pData,pJsonDocument,&jStack64);
      }
    }
    else {
      if (JVar1 == SHADOW_JSON_INT16) {
        if (uVar3 < pDataStruct->dataLength) {
          parseInteger16Value((int16_t *)pDataStruct->pData,pJsonDocument,&jStack64);
        }
      }
      else {
        if (JVar1 == SHADOW_JSON_INT8) {
          if (pDataStruct->dataLength != 0) {
            parseInteger8Value((int8_t *)pDataStruct->pData,pJsonDocument,&jStack64);
          }
        }
        else {
          if (JVar1 == SHADOW_JSON_UINT32) {
            if (uVar3 < pDataStruct->dataLength) {
              parseUnsignedInteger32Value((uint32_t *)pDataStruct->pData,pJsonDocument,&jStack64);
            }
          }
          else {
            if (JVar1 == SHADOW_JSON_UINT16) {
              if (1 < pDataStruct->dataLength) {
                parseUnsignedInteger16Value((uint16_t *)pDataStruct->pData,pJsonDocument,&jStack64);
              }
            }
            else {
              if (JVar1 == SHADOW_JSON_UINT8) {
                if (pDataStruct->dataLength != 0) {
                  parseUnsignedInteger8Value((uint8_t *)pDataStruct->pData,pJsonDocument,&jStack64);
                }
              }
              else {
                if (JVar1 == SHADOW_JSON_FLOAT) {
                  if (3 < pDataStruct->dataLength) {
                    parseFloatValue((float *)pDataStruct->pData,pJsonDocument,&jStack64);
                  }
                }
                else {
                  if (JVar1 == SHADOW_JSON_DOUBLE) {
                    if (uVar3 < pDataStruct->dataLength) {
                      parseDoubleValue((double *)pDataStruct->pData,pJsonDocument,&jStack64);
                    }
                  }
                  else {
                    if (JVar1 == SHADOW_JSON_STRING) {
                      parseStringValue((char *)pDataStruct->pData,pDataStruct->dataLength,
                                       pJsonDocument,&jStack64);
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
  *pDataPosition = iVar4;
  *pDataLength = uVar5;
  return true;
}



_Bool extractClientToken(char *pJsonDocument,size_t jsonSize,char *pExtractedClientToken,
                        size_t clientTokenSize)

{
  uint __n;
  int iVar1;
  int8_t iVar2;
  int iVar3;
  undefined3 extraout_var;
  
  jsmn_init(&shadowJsonParser);
  iVar3 = jsmn_parse(&shadowJsonParser,pJsonDocument,jsonSize,jsonTokenStruct,0x78);
  if ((0 < iVar3) && (jsonTokenStruct[0].type == JSMN_OBJECT)) {
    iVar1 = 1;
    do {
      if (iVar1 == iVar3) {
        return false;
      }
      iVar2 = jsoneq(pJsonDocument,jsonTokenStruct + iVar1,"clientToken");
      iVar1 = iVar1 + 1;
    } while (CONCAT31(extraout_var,iVar2) != 0);
    __n = jsonTokenStruct[iVar1].end - jsonTokenStruct[iVar1].start & 0xff;
    if (__n + 1 <= clientTokenSize) {
      strncpy(pExtractedClientToken,pJsonDocument + jsonTokenStruct[iVar1].start,__n);
      pExtractedClientToken[__n] = '\0';
      return true;
    }
  }
  return false;
}



