pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
_Bool extractVersionNumber
                (char *pJsonDocument,void *pJsonHandler,int32_t tokenCount,uint32_t *pVersionNumber)

{
  int iVar1;
  int iVar2;
  int8_t iVar3;
  IoT_Error_t IVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  
  iVar1 = 1;
  do {
    iVar2 = iVar1;
    if (tokenCount <= iVar2) {
      return false;
    }
    iVar3 = jsoneq(pJsonDocument,jsonTokenStruct + iVar2,"version");
    iVar1 = iVar2 + 1;
  } while ((CONCAT31(extraout_var,iVar3) != 0) ||
          (IVar4 = parseUnsignedInteger32Value
                             (pVersionNumber,pJsonDocument,jsonTokenStruct + iVar2 + 1),
          CONCAT31(extraout_var_00,IVar4) != 0));
  return true;
}



void shadow_delta_callback
               (AWS_IoT_Client *pClient,char *topicName,uint16_t topicNameLen,
               IoT_Publish_Message_Params *params,void *pData)

{
  JsonTokenTable_t *pJVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint uVar3;
  int32_t local_30;
  int32_t tokenCount;
  int32_t DataPosition;
  uint32_t dataLength;
  uint32_t tempVersionNumber;
  
  dataLength = 0;
  if (params->payloadLen < 0x201) {
    memcpy(shadowRxBuf,params->payload,params->payloadLen);
    shadowRxBuf[params->payloadLen] = '\0';
    _Var2 = isJsonValidAndParse(shadowRxBuf,0x201,(void *)0x0,&local_30);
    if (CONCAT31(extraout_var,_Var2) != 0) {
      if ((shadowDiscardOldDeltaFlag != false) &&
         (_Var2 = extractVersionNumber(shadowRxBuf,(void *)0x0,local_30,&dataLength),
         CONCAT31(extraout_var_00,_Var2) != 0)) {
        if (dataLength <= shadowJsonVersionNum) {
          return;
        }
        shadowJsonVersionNum = dataLength;
      }
      pJVar1 = tokenTable;
      uVar3 = 0;
      while (uVar3 < tokenTableIndex) {
        if (((pJVar1->isFree == false) &&
            (_Var2 = isJsonKeyMatchingAndUpdateValue
                               (shadowRxBuf,(void *)0x0,local_30,(jsonStruct_t *)pJVar1->pStruct,
                                (uint32_t *)&DataPosition,&tokenCount),
            CONCAT31(extraout_var_01,_Var2) != 0)) &&
           (pJVar1->callback != (jsonStructCallback_t *)0x0)) {
          (*pJVar1->callback)(shadowRxBuf + tokenCount,DataPosition,(jsonStruct_t *)pJVar1->pStruct)
          ;
        }
        uVar3 = uVar3 + 1;
        pJVar1 = pJVar1 + 1;
      }
    }
  }
  return;
}



int16_t findIndexOfSubscriptionList(char *pTopic)

{
  ushort uVar1;
  SubscriptionRecord_t *__s2;
  int iVar2;
  
  __s2 = SubscriptionList;
  uVar1 = 0;
  while ((__s2->isFree != false || (iVar2 = strcmp(pTopic,(char *)__s2), iVar2 != 0))) {
    uVar1 = uVar1 + 1 & 0xff;
    __s2 = __s2 + 1;
    if (uVar1 == 0x14) {
      return -1;
    }
  }
  return uVar1;
}



// WARNING: Variable defined which should be unmapped: ackTypeBuf

void topicNameFromThingAndAction
               (char *pTopic,char *pThingName,ShadowActions_t action,ShadowAckTopicTypes_t ackType)

{
  char *__src;
  undefined3 in_register_00002031;
  int iVar1;
  undefined3 in_register_00002035;
  char acStack40 [4];
  char actionBuf [10];
  char ackTypeBuf [10];
  
  iVar1 = CONCAT31(in_register_00002031,action);
  if (iVar1 == 0) {
    __src = "get";
  }
  else {
    if (iVar1 == 1) {
      __src = "update";
    }
    else {
      if (iVar1 != 2) goto LAB_2304e29c;
      __src = "delete";
    }
  }
  strncpy(acStack40,__src,10);
LAB_2304e29c:
  if (CONCAT31(in_register_00002035,ackType) == 0) {
    __src = "accepted";
  }
  else {
    if (CONCAT31(in_register_00002035,ackType) != 1) {
      snprintf(pTopic,0x50,"$aws/things/%s/shadow/%s",pThingName,acStack40);
      return;
    }
    __src = "rejected";
  }
  strncpy(actionBuf + 8,__src,10);
  snprintf(pTopic,0x50,"$aws/things/%s/shadow/%s/%s",pThingName,acStack40,actionBuf + 8);
  return;
}



// WARNING: Variable defined which should be unmapped: TemporaryTopicNameRejected

void unsubscribeFromAcceptedAndRejected(uint8_t index)

{
  byte bVar1;
  AWS_IoT_Client *pClient;
  IoT_Error_t IVar2;
  int16_t iVar3;
  undefined3 in_register_00002029;
  int iVar4;
  short extraout_var_01;
  size_t sVar5;
  undefined3 extraout_var;
  short extraout_var_02;
  undefined3 extraout_var_00;
  char acStack176 [4];
  char TemporaryTopicNameAccepted [80];
  char TemporaryTopicNameRejected [80];
  
  iVar4 = CONCAT31(in_register_00002029,index);
  topicNameFromThingAndAction
            (acStack176,AckWaitList[iVar4].thingName,AckWaitList[iVar4].action,SHADOW_ACCEPTED);
  topicNameFromThingAndAction
            (TemporaryTopicNameAccepted + 0x4c,AckWaitList[iVar4].thingName,
             AckWaitList[iVar4].action,SHADOW_REJECTED);
  iVar3 = findIndexOfSubscriptionList(acStack176);
  pClient = pMqttClient;
  iVar4 = CONCAT22(extraout_var_01,iVar3);
  if (-1 < extraout_var_01) {
    bVar1 = SubscriptionList[iVar4].count;
    if ((SubscriptionList[iVar4].isSticky == false) && (bVar1 == 1)) {
      sVar5 = strlen(acStack176);
      IVar2 = aws_iot_mqtt_unsubscribe(pClient,acStack176,(uint16_t)sVar5);
      if (CONCAT31(extraout_var,IVar2) == 0) {
        SubscriptionList[iVar4].isFree = true;
      }
    }
    else {
      if (1 < bVar1) {
        SubscriptionList[iVar4].count = bVar1 - 1;
      }
    }
  }
  iVar3 = findIndexOfSubscriptionList(TemporaryTopicNameAccepted + 0x4c);
  pClient = pMqttClient;
  iVar4 = CONCAT22(extraout_var_02,iVar3);
  if (-1 < extraout_var_02) {
    bVar1 = SubscriptionList[iVar4].count;
    if ((SubscriptionList[iVar4].isSticky == false) && (bVar1 == 1)) {
      sVar5 = strlen(TemporaryTopicNameAccepted + 0x4c);
      IVar2 = aws_iot_mqtt_unsubscribe(pClient,TemporaryTopicNameAccepted + 0x4c,(uint16_t)sVar5);
      if (CONCAT31(extraout_var_00,IVar2) == 0) {
        SubscriptionList[iVar4].isFree = true;
      }
    }
    else {
      if (1 < bVar1) {
        SubscriptionList[iVar4].count = bVar1 - 1;
      }
    }
  }
  return;
}



