pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void AckStatusCallback(AWS_IoT_Client *pClient,char *topicName,uint16_t topicNameLen,
                      IoT_Publish_Message_Params *params,void *pData)

{
  int iVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  char *pcVar3;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  int iVar4;
  Shadow_Ack_Status_t SVar5;
  ToBeReceivedAckRecord_t *__s1;
  int32_t iStack164;
  int32_t tokenCount;
  char temporaryClientToken [110];
  
  if (0x200 < params->payloadLen) {
    return;
  }
  memcpy(shadowRxBuf,params->payload,params->payloadLen);
  shadowRxBuf[params->payloadLen] = '\0';
  _Var2 = isJsonValidAndParse(shadowRxBuf,0x201,(void *)0x0,&iStack164);
  if (CONCAT31(extraout_var,_Var2) != 0) {
    pcVar3 = strstr(topicName,myThingName);
    if ((pcVar3 != (char *)0x0) &&
       ((pcVar3 = strstr(topicName,"get/accepted"), pcVar3 != (char *)0x0 ||
        (pcVar3 = strstr(topicName,"delta"), pcVar3 != (char *)0x0)))) {
      tokenCount = 0;
      _Var2 = extractVersionNumber(shadowRxBuf,(void *)0x0,iStack164,(uint32_t *)&tokenCount);
      if ((CONCAT31(extraout_var_00,_Var2) != 0) && (shadowJsonVersionNum < (uint)tokenCount)) {
        shadowJsonVersionNum = tokenCount;
      }
    }
    _Var2 = extractClientToken(shadowRxBuf,0x201,(char *)&tokenCount,0x6e);
    if (CONCAT31(extraout_var_01,_Var2) != 0) {
      __s1 = AckWaitList;
      iVar1 = 0;
      do {
        if (__s1->isFree == false) {
          iVar4 = strcmp((char *)__s1,(char *)&tokenCount);
          if (iVar4 == 0) {
            pcVar3 = strstr(topicName,"accepted");
            SVar5 = SHADOW_ACK_ACCEPTED;
            if (pcVar3 == (char *)0x0) {
              strstr(topicName,"rejected");
              SVar5 = SHADOW_ACK_REJECTED;
            }
            if (AckWaitList[iVar1].callback != (fpActionCallback_t *)0x0) {
              (*AckWaitList[iVar1].callback)
                        ((char *)(iVar1 * 0x88 + 0x4202086e),AckWaitList[iVar1].action,SVar5,
                         shadowRxBuf,AckWaitList[iVar1].pCallbackContext);
            }
            unsubscribeFromAcceptedAndRejected((uint8_t)iVar1);
            AckWaitList[iVar1].isFree = true;
            return;
          }
        }
        iVar1 = iVar1 + 1;
        __s1 = __s1 + 1;
      } while (iVar1 != 10);
    }
  }
  return;
}



void initDeltaTokens(void)

{
  JsonTokenTable_t *pJVar1;
  
  pJVar1 = tokenTable;
  do {
    pJVar1->isFree = true;
    pJVar1 = pJVar1 + 1;
  } while (pJVar1 != (JsonTokenTable_t *)pUsernameTemp);
  deltaTopicSubscribedFlag = false;
  tokenTableIndex = 0;
  return;
}



IoT_Error_t registerJsonTokenOnDelta(jsonStruct_t *pStruct)

{
  AWS_IoT_Client *pClient;
  IoT_Error_t IVar1;
  size_t sVar2;
  jsonStructCallback_t *pjVar3;
  
  IVar1 = SUCCESS;
  if (deltaTopicSubscribedFlag == false) {
    snprintf(shadowDeltaTopic,0x50,"$aws/things/%s/shadow/update/delta",myThingName);
    pClient = pMqttClient;
    sVar2 = strlen(shadowDeltaTopic);
    IVar1 = aws_iot_mqtt_subscribe
                      (pClient,shadowDeltaTopic,(uint16_t)sVar2,QOS0,shadow_delta_callback,
                       (void *)0x0);
    deltaTopicSubscribedFlag = true;
  }
  if (tokenTableIndex < 0x78) {
    tokenTable[tokenTableIndex].pKey = pStruct->pKey;
    pjVar3 = pStruct->cb;
    *(jsonStruct_t **)&tokenTable[tokenTableIndex].pStruct = pStruct;
    tokenTable[tokenTableIndex].callback = pjVar3;
    tokenTable[tokenTableIndex].isFree = false;
    tokenTableIndex = tokenTableIndex + 1;
  }
  else {
    IVar1 = FAILURE;
  }
  return IVar1;
}



void initializeRecords(AWS_IoT_Client *pClient)

{
  ToBeReceivedAckRecord_t *pTVar1;
  SubscriptionRecord_t *pSVar2;
  
  pTVar1 = AckWaitList;
  do {
    pTVar1->isFree = true;
    pTVar1 = pTVar1 + 1;
  } while (pTVar1 != (ToBeReceivedAckRecord_t *)&_fsymc_level_bloop);
  pSVar2 = SubscriptionList;
  do {
    pSVar2->isFree = true;
    pSVar2->count = '\0';
    pSVar2->isSticky = false;
    pSVar2 = pSVar2 + 1;
  } while (pSVar2 != (SubscriptionRecord_t *)&pMqttClient);
  pMqttClient = pClient;
  return;
}



_Bool isSubscriptionPresent(char *pThingName,ShadowActions_t action)

{
  bool bVar1;
  bool bVar2;
  SubscriptionRecord_t *__s2;
  int iVar3;
  char acStack192 [4];
  char TemporaryTopicNameAccepted [80];
  char TemporaryTopicNameRejected [80];
  
  topicNameFromThingAndAction(acStack192,pThingName,action,SHADOW_ACCEPTED);
  __s2 = SubscriptionList;
  topicNameFromThingAndAction(TemporaryTopicNameAccepted + 0x4c,pThingName,action,SHADOW_REJECTED);
  bVar1 = false;
  bVar2 = false;
  do {
    if (__s2->isFree == false) {
      iVar3 = strcmp(acStack192,(char *)__s2);
      if (iVar3 == 0) {
        bVar2 = true;
      }
      else {
        iVar3 = strcmp(TemporaryTopicNameAccepted + 0x4c,(char *)__s2);
        if (iVar3 == 0) {
          bVar1 = true;
        }
      }
    }
    __s2 = __s2 + 1;
  } while (__s2 != (SubscriptionRecord_t *)&pMqttClient);
  if (bVar1) {
    bVar1 = bVar2;
  }
  return (_Bool)bVar1;
}



IoT_Error_t subscribeToShadowActionAcks(char *pThingName,ShadowActions_t action,_Bool isSticky)

{
  uint8_t uVar1;
  AWS_IoT_Client *pClient;
  IoT_Error_t IVar2;
  _Bool _Var3;
  size_t sVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  SubscriptionRecord_t *pTopic;
  SubscriptionRecord_t *pTopic_00;
  int iVar5;
  int iVar6;
  int iVar7;
  undefined auStack76 [4];
  Timer subSettlingtimer;
  
  pTopic_00 = SubscriptionList;
  pTopic = SubscriptionList;
  iVar5 = 0;
  do {
    if (pTopic->isFree != false) {
      iVar6 = (int)(short)((ushort)iVar5 & 0xff);
      SubscriptionList[iVar5].isFree = false;
      goto LAB_2304e79a;
    }
    iVar5 = iVar5 + 1;
    pTopic = pTopic + 1;
  } while (iVar5 != 0x14);
  iVar6 = -1;
LAB_2304e79a:
  iVar5 = 0;
LAB_2304e79e:
  if (pTopic_00->isFree == false) goto LAB_2304e886;
  iVar7 = (int)(short)((ushort)iVar5 & 0xff);
  IVar2 = SUCCESS;
  pTopic = SubscriptionList + iVar5;
  SubscriptionList[iVar5].isFree = false;
  if (iVar6 == -1) goto LAB_2304e8d6;
  pTopic_00 = SubscriptionList + iVar6;
  topicNameFromThingAndAction((char *)pTopic_00,pThingName,action,SHADOW_ACCEPTED);
  pClient = pMqttClient;
  sVar4 = strlen((char *)pTopic_00);
  IVar2 = aws_iot_mqtt_subscribe
                    (pClient,(char *)pTopic_00,(uint16_t)sVar4,QOS0,AckStatusCallback,(void *)0x0);
  if (CONCAT31(extraout_var,IVar2) == 0) {
    SubscriptionList[iVar6].count = '\x01';
    *(_Bool *)(iVar6 * 0x53 + 0x420201d2) = isSticky;
    topicNameFromThingAndAction((char *)pTopic,pThingName,action,SHADOW_REJECTED);
    pClient = pMqttClient;
    sVar4 = strlen((char *)pTopic);
    IVar2 = aws_iot_mqtt_subscribe
                      (pClient,(char *)pTopic,(uint16_t)sVar4,QOS0,AckStatusCallback,(void *)0x0);
    if (CONCAT31(extraout_var_00,IVar2) == 0) {
      SubscriptionList[iVar5].count = '\x01';
      *(_Bool *)(iVar5 * 0x53 + 0x420201d2) = isSticky;
      init_timer((Timer *)auStack76);
      countdown_sec((Timer *)auStack76,2);
      do {
        _Var3 = has_timer_expired((Timer *)auStack76);
      } while (CONCAT31(extraout_var_01,_Var3) == 0);
      goto LAB_2304e856;
    }
  }
  goto LAB_2304e89a;
LAB_2304e886:
  iVar5 = iVar5 + 1;
  pTopic_00 = pTopic_00 + 1;
  if (iVar5 == 0x14) {
    if (iVar6 == -1) {
LAB_2304e856:
      IVar2 = SUCCESS;
    }
    else {
      iVar7 = -1;
      IVar2 = SUCCESS;
LAB_2304e89a:
      uVar1 = SubscriptionList[iVar6].count;
      SubscriptionList[iVar6].isFree = true;
      pClient = pMqttClient;
      if (uVar1 == '\x01') {
        sVar4 = strlen((char *)(SubscriptionList + iVar6));
        aws_iot_mqtt_unsubscribe(pClient,(char *)(SubscriptionList + iVar6),(uint16_t)sVar4);
      }
      if (iVar7 != -1) {
LAB_2304e8d6:
        SubscriptionList[iVar7].isFree = true;
      }
    }
    return IVar2;
  }
  goto LAB_2304e79e;
}



