pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: TemporaryTopicNameRejected

void incrementSubscriptionCnt(char *pThingName,ShadowActions_t action,_Bool isSticky)

{
  SubscriptionRecord_t *__s2;
  int iVar1;
  char acStack176 [4];
  char TemporaryTopicNameAccepted [80];
  char TemporaryTopicNameRejected [80];
  
  topicNameFromThingAndAction(acStack176,pThingName,action,SHADOW_ACCEPTED);
  __s2 = SubscriptionList;
  topicNameFromThingAndAction(TemporaryTopicNameAccepted + 0x4c,pThingName,action,SHADOW_REJECTED);
  do {
    if ((__s2->isFree == false) &&
       ((iVar1 = strcmp(acStack176,(char *)__s2), iVar1 == 0 ||
        (iVar1 = strcmp(TemporaryTopicNameAccepted + 0x4c,(char *)__s2), iVar1 == 0)))) {
      __s2->isSticky = isSticky;
      __s2->count = __s2->count + '\x01';
    }
    __s2 = __s2 + 1;
  } while (__s2 != (SubscriptionRecord_t *)&pMqttClient);
  return;
}



// WARNING: Could not reconcile some variable overlaps

IoT_Error_t
publishToShadowAction(char *pThingName,ShadowActions_t action,char *pJsonDocumentToBeSent)

{
  AWS_IoT_Client *pClient;
  IoT_Error_t IVar1;
  size_t sVar2;
  undefined2 local_70 [2];
  IoT_Publish_Message_Params msgParams;
  char TemporaryTopicName [80];
  
  if (pThingName == (char *)0x0) {
    return NULL_VALUE_ERROR;
  }
  if (pJsonDocumentToBeSent != (char *)0x0) {
    topicNameFromThingAndAction((char *)&msgParams.payloadLen,pThingName,action,SHADOW_ACTION);
    local_70[0] = 0;
    msgParams.payload = (void *)strlen(pJsonDocumentToBeSent);
    pClient = pMqttClient;
    msgParams._4_4_ = pJsonDocumentToBeSent;
    sVar2 = strlen((char *)&msgParams.payloadLen);
    IVar1 = aws_iot_mqtt_publish
                      (pClient,(char *)&msgParams.payloadLen,(uint16_t)sVar2,
                       (IoT_Publish_Message_Params *)local_70);
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



_Bool getNextFreeIndexOfAckWaitList(uint8_t *pIndex)

{
  _Bool _Var1;
  ToBeReceivedAckRecord_t *pTVar2;
  uint8_t uVar3;
  
  _Var1 = false;
  if (pIndex != (uint8_t *)0x0) {
    pTVar2 = AckWaitList;
    uVar3 = '\0';
    do {
      _Var1 = pTVar2->isFree;
      if (_Var1 != false) {
        *pIndex = uVar3;
        return _Var1;
      }
      uVar3 = uVar3 + '\x01';
      pTVar2 = pTVar2 + 1;
    } while (uVar3 != '\n');
  }
  return _Var1;
}



void addToAckWaitList(uint8_t indexAckWaitList,char *pThingName,ShadowActions_t action,
                     char *pExtractedClientToken,fpActionCallback_t *callback,void *pCallbackContext
                     ,uint32_t timeout_seconds)

{
  undefined3 in_register_00002029;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_00002029,indexAckWaitList);
  AckWaitList[iVar1].callback = callback;
  memcpy(AckWaitList + iVar1,pExtractedClientToken,0x5a);
  memcpy(AckWaitList[iVar1].thingName,pThingName,0x14);
  AckWaitList[iVar1].pCallbackContext = pCallbackContext;
  AckWaitList[iVar1].action = action;
  init_timer(&AckWaitList[iVar1].timer);
  countdown_sec(&AckWaitList[iVar1].timer,timeout_seconds);
  AckWaitList[iVar1].isFree = false;
  return;
}



void HandleExpiredResponseCallbacks(void)

{
  ToBeReceivedAckRecord_t *pTVar1;
  uint8_t index;
  _Bool _Var2;
  undefined3 extraout_var;
  
  pTVar1 = AckWaitList;
  index = '\0';
  do {
    if ((pTVar1->isFree == false) &&
       (_Var2 = has_timer_expired(&pTVar1->timer), CONCAT31(extraout_var,_Var2) != 0)) {
      if (pTVar1->callback != (fpActionCallback_t *)0x0) {
        (*pTVar1->callback)(pTVar1->thingName,pTVar1->action,SHADOW_ACK_TIMEOUT,shadowRxBuf,
                            pTVar1->pCallbackContext);
      }
      pTVar1->isFree = true;
      unsubscribeFromAcceptedAndRejected(index);
    }
    index = index + '\x01';
    pTVar1 = pTVar1 + 1;
  } while (index != '\n');
  return;
}



_Bool has_timer_expired(Timer *timer)

{
  TickType_t TVar1;
  uint uVar2;
  uint uVar3;
  
  TVar1 = xTaskGetTickCount();
  uVar2 = timer->timeout_ticks;
  uVar3 = TVar1 - timer->start_ticks;
  if ((uVar3 < uVar2) && (timer->last_polled_ticks == TVar1)) {
    vTaskDelay(1);
  }
  timer->last_polled_ticks = TVar1;
  return (_Bool)(uVar2 <= uVar3);
}



void countdown_ms(Timer *timer,uint32_t timeout)

{
  TickType_t TVar1;
  
  TVar1 = xTaskGetTickCount();
  timer->start_ticks = TVar1;
  timer->last_polled_ticks = 0;
  timer->timeout_ticks = timeout;
  return;
}



uint32_t left_ms(Timer *timer)

{
  TickType_t TVar1;
  uint32_t uVar2;
  
  TVar1 = xTaskGetTickCount();
  if (TVar1 - timer->start_ticks < timer->timeout_ticks) {
    uVar2 = (timer->start_ticks + timer->timeout_ticks) - TVar1;
  }
  else {
    uVar2 = 0;
  }
  return uVar2;
}



void countdown_sec(Timer *timer,uint32_t timeout)

{
  if (0x418937 < timeout) {
    puts("aws_timer");
    printf("ERRORtimeout is out of range: %lus\r\n",timeout);
  }
  countdown_ms(timer,timeout * 1000);
  return;
}



void init_timer(Timer *timer)

{
  timer->start_ticks = 0;
  timer->timeout_ticks = 0;
  timer->last_polled_ticks = 0;
  return;
}



int jsmn_parse(jsmn_parser *parser,char *js,size_t len,jsmntok_t *tokens,uint num_tokens)

{
  byte bVar1;
  char cVar2;
  uint uVar3;
  int iVar4;
  uint uVar5;
  uint uVar6;
  jsmntok_t *pjVar7;
  jsmntype_t jVar8;
  jsmntok_t *pjVar9;
  uint uVar10;
  
  uVar5 = parser->toknext;
LAB_2304ebda:
  uVar6 = parser->pos;
  if ((len <= uVar6) || (bVar1 = js[uVar6], bVar1 == 0)) {
    if (tokens != (jsmntok_t *)0x0) {
      uVar6 = parser->toknext;
      tokens = tokens + uVar6;
      while (uVar6 = uVar6 - 1, -1 < (int)uVar6) {
        if ((tokens[-1].start != -1) && (tokens[-1].end == -1)) {
          return -3;
        }
        tokens = tokens + -1;
      }
    }
    return uVar5;
  }
  if (bVar1 != 0x2c) {
    if (0x2c < bVar1) {
      if (bVar1 == 0x5d) {
LAB_2304ed06:
        if (tokens != (jsmntok_t *)0x0) {
          jVar8 = JSMN_OBJECT;
          if (bVar1 != 0x7d) {
            jVar8 = JSMN_ARRAY;
          }
          uVar10 = parser->toknext;
          pjVar7 = tokens + uVar10;
          do {
            pjVar9 = pjVar7;
            uVar10 = uVar10 - 1;
            if ((int)uVar10 < 0) {
              if (uVar10 == 0xffffffff) {
                return -2;
              }
              goto LAB_2304ed68;
            }
            pjVar7 = pjVar9 + -1;
          } while ((pjVar9[-1].start == -1) || (pjVar9[-1].end != -1));
          if (pjVar7->type != jVar8) {
            return -2;
          }
          parser->toksuper = -1;
          pjVar9[-1].end = uVar6 + 1;
          pjVar7 = tokens + uVar10;
          do {
            if ((pjVar7->start != -1) && (pjVar7->end == -1)) {
              parser->toksuper = uVar10;
              break;
            }
            uVar10 = uVar10 - 1;
            pjVar7 = pjVar7 + -1;
          } while (uVar10 != 0xffffffff);
        }
      }
      else {
        if (bVar1 < 0x5e) {
          if (bVar1 != 0x3a) {
            if (bVar1 != 0x5b) goto LAB_2304ef0c;
            goto LAB_2304ec9c;
          }
        }
        else {
          if (bVar1 != 0x7b) {
            if (bVar1 != 0x7d) goto LAB_2304ef0c;
            goto LAB_2304ed06;
          }
LAB_2304ec9c:
          uVar5 = uVar5 + 1;
          if (tokens == (jsmntok_t *)0x0) goto LAB_2304ed68;
          uVar6 = parser->toknext;
          if (num_tokens <= uVar6) {
            return -1;
          }
          parser->toknext = uVar6 + 1;
          pjVar7 = tokens + uVar6;
          pjVar7->end = -1;
          pjVar7->start = -1;
          pjVar7->size = 0;
          if (parser->toksuper != -1) {
            tokens[parser->toksuper].size = tokens[parser->toksuper].size + 1;
          }
          jVar8 = JSMN_OBJECT;
          if (bVar1 != 0x7b) {
            jVar8 = JSMN_ARRAY;
          }
          pjVar7->type = jVar8;
          pjVar7->start = parser->pos;
        }
        parser->toksuper = parser->toknext - 1;
      }
      goto LAB_2304ed68;
    }
    if (bVar1 == 0xd) goto LAB_2304ed68;
    if (bVar1 < 0xe) {
      if (1 < (byte)(bVar1 - 9)) {
LAB_2304ef0c:
        do {
          uVar10 = parser->pos;
          if (((len <= uVar10) || (bVar1 = js[uVar10], bVar1 == 0)) || (bVar1 == 0x20)) goto found;
          if (bVar1 < 0x21) {
            if ((8 < bVar1) && ((bVar1 < 0xb || (bVar1 == 0xd)))) goto found;
          }
          else {
            if (bVar1 == 0x3a) goto found;
            if (bVar1 < 0x3b) {
              if (bVar1 == 0x2c) goto found;
            }
            else {
              if ((bVar1 == 0x5d) || (bVar1 == 0x7d)) goto found;
            }
          }
          if (0x5e < (byte)(bVar1 - 0x20)) goto LAB_2304ee20;
          parser->pos = uVar10 + 1;
        } while( true );
      }
      goto LAB_2304ed68;
    }
    if (bVar1 == 0x20) goto LAB_2304ed68;
    if (bVar1 != 0x22) goto LAB_2304ef0c;
    parser->pos = uVar6 + 1;
    while( true ) {
      uVar10 = parser->pos;
      if ((len <= uVar10) || (cVar2 = js[uVar10], cVar2 == '\0')) {
        parser->pos = uVar6;
        return -3;
      }
      if (cVar2 == '\"') break;
      if ((cVar2 == '\\') && (uVar3 = uVar10 + 1, uVar3 < len)) {
        parser->pos = uVar3;
        bVar1 = js[uVar3];
        if (bVar1 != 0x66) {
          if (bVar1 < 0x67) {
            if (bVar1 != 0x2f) {
              if (bVar1 < 0x30) {
                if (bVar1 != 0x22) goto LAB_2304ee20;
              }
              else {
                if ((bVar1 != 0x5c) && (bVar1 != 0x62)) goto LAB_2304ee20;
              }
            }
          }
          else {
            if (bVar1 != 0x72) {
              if (bVar1 < 0x73) {
                if (bVar1 != 0x6e) goto LAB_2304ee20;
              }
              else {
                if (bVar1 != 0x74) {
                  if (bVar1 != 0x75) {
LAB_2304ee20:
                    parser->pos = uVar6;
                    return -2;
                  }
                  parser->pos = uVar10 + 2;
                  iVar4 = 4;
                  do {
                    uVar10 = parser->pos;
                    if ((len <= uVar10) || (bVar1 = js[uVar10], bVar1 == 0)) break;
                    if ((9 < (byte)(bVar1 - 0x30)) && (5 < (byte)((bVar1 & 0xdf) + 0xbf)))
                    goto LAB_2304ee20;
                    parser->pos = uVar10 + 1;
                    iVar4 = iVar4 + -1;
                  } while (iVar4 != 0);
                  parser->pos = parser->pos - 1;
                }
              }
            }
          }
        }
      }
      parser->pos = parser->pos + 1;
    }
    if (tokens != (jsmntok_t *)0x0) {
      uVar10 = parser->toknext;
      if (num_tokens <= uVar10) goto LAB_2304ed92;
      parser->toknext = uVar10 + 1;
      pjVar7 = tokens + uVar10;
      pjVar7->end = -1;
      pjVar7->start = -1;
      pjVar7->size = 0;
      uVar10 = parser->pos;
      pjVar7->type = JSMN_STRING;
      pjVar7->start = uVar6 + 1;
      pjVar7->end = uVar10;
    }
    goto LAB_2304edc6;
  }
  if (((tokens != (jsmntok_t *)0x0) && (parser->toksuper != -1)) &&
     (1 < (byte)(tokens[parser->toksuper].type + ~JSMN_UNDEFINED))) {
    uVar6 = parser->toknext;
    pjVar7 = tokens + uVar6;
    while (uVar6 = uVar6 - 1, -1 < (int)uVar6) {
      if ((((byte)(pjVar7[-1].type + ~JSMN_UNDEFINED) < 2) && (pjVar7[-1].start != -1)) &&
         (pjVar7[-1].end == -1)) {
        parser->toksuper = uVar6;
        break;
      }
      pjVar7 = pjVar7 + -1;
    }
  }
  goto LAB_2304ed68;
found:
  if (tokens == (jsmntok_t *)0x0) {
    parser->pos = uVar10 - 1;
  }
  else {
    uVar10 = parser->toknext;
    if (num_tokens <= uVar10) {
LAB_2304ed92:
      parser->pos = uVar6;
      return -1;
    }
    parser->toknext = uVar10 + 1;
    pjVar7 = tokens + uVar10;
    pjVar7->end = -1;
    pjVar7->start = -1;
    pjVar7->size = 0;
    uVar10 = parser->pos;
    pjVar7->type = JSMN_PRIMITIVE;
    pjVar7->start = uVar6;
    pjVar7->end = uVar10;
    parser->pos = parser->pos - 1;
  }
LAB_2304edc6:
  uVar5 = uVar5 + 1;
  if ((parser->toksuper != -1) && (tokens != (jsmntok_t *)0x0)) {
    tokens[parser->toksuper].size = tokens[parser->toksuper].size + 1;
  }
LAB_2304ed68:
  parser->pos = parser->pos + 1;
  goto LAB_2304ebda;
}



void jsmn_init(jsmn_parser *parser)

{
  parser->pos = 0;
  parser->toknext = 0;
  parser->toksuper = -1;
  return;
}



int8_t jsoneq(char *json,jsmntok_t *tok,char *s)

{
  int8_t iVar1;
  size_t __n;
  int iVar2;
  
  if (tok->type != JSMN_STRING) {
    return -1;
  }
  __n = strlen(s);
  if (__n == tok->end - tok->start) {
    iVar2 = strncmp(json + tok->start,s,__n);
    iVar1 = -(iVar2 != 0);
  }
  else {
    iVar1 = -1;
  }
  return iVar1;
}



IoT_Error_t parseUnsignedInteger32Value(uint32_t *i,char *jsonString,jsmntok_t *token)

{
  int iVar1;
  IoT_Error_t IVar2;
  
  if (token->type == JSMN_PRIMITIVE) {
    if (jsonString[token->start] != '-') {
      iVar1 = sscanf(jsonString + token->start,"%lu",i);
      IVar2 = SUCCESS;
      if (iVar1 != 1) {
        IVar2 = JSON_PARSE_ERROR;
      }
      return IVar2;
    }
  }
  return JSON_PARSE_ERROR;
}



