pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
IoT_Error_t parseUnsignedInteger16Value(uint16_t *i,char *jsonString,jsmntok_t *token)

{
  int iVar1;
  IoT_Error_t IVar2;
  
  if (token->type == JSMN_PRIMITIVE) {
    if (jsonString[token->start] != '-') {
      iVar1 = sscanf(jsonString + token->start,"%hu",i);
      IVar2 = SUCCESS;
      if (iVar1 != 1) {
        IVar2 = JSON_PARSE_ERROR;
      }
      return IVar2;
    }
  }
  return JSON_PARSE_ERROR;
}



IoT_Error_t parseUnsignedInteger8Value(uint8_t *i,char *jsonString,jsmntok_t *token)

{
  IoT_Error_t IVar1;
  int iVar2;
  uint uStack20;
  uint32_t i_word;
  
  if (token->type == JSMN_PRIMITIVE) {
    if (jsonString[token->start] != '-') {
      iVar2 = sscanf(jsonString + token->start,"%lu",&uStack20);
      if ((iVar2 == 1) && (uStack20 < 0x100)) {
        *i = (uint8_t)uStack20;
        IVar1 = SUCCESS;
      }
      else {
        IVar1 = JSON_PARSE_ERROR;
      }
      return IVar1;
    }
  }
  return JSON_PARSE_ERROR;
}



IoT_Error_t parseInteger32Value(int32_t *i,char *jsonString,jsmntok_t *token)

{
  int iVar1;
  IoT_Error_t IVar2;
  
  if (token->type == JSMN_PRIMITIVE) {
    iVar1 = sscanf(jsonString + token->start,"%ld",i);
    IVar2 = SUCCESS;
    if (iVar1 != 1) {
      IVar2 = JSON_PARSE_ERROR;
    }
    return IVar2;
  }
  return JSON_PARSE_ERROR;
}



IoT_Error_t parseInteger16Value(int16_t *i,char *jsonString,jsmntok_t *token)

{
  IoT_Error_t IVar1;
  int iVar2;
  int iStack20;
  int32_t i_word;
  
  if (token->type != JSMN_PRIMITIVE) {
    return JSON_PARSE_ERROR;
  }
  iVar2 = sscanf(jsonString + token->start,"%li",&iStack20);
  if ((iVar2 == 1) && (iStack20 + 0x8000U < 0x10000)) {
    *i = (int16_t)iStack20;
    IVar1 = SUCCESS;
  }
  else {
    IVar1 = JSON_PARSE_ERROR;
  }
  return IVar1;
}



IoT_Error_t parseInteger8Value(int8_t *i,char *jsonString,jsmntok_t *token)

{
  IoT_Error_t IVar1;
  int iVar2;
  int iStack20;
  int32_t i_word;
  
  if (token->type != JSMN_PRIMITIVE) {
    return JSON_PARSE_ERROR;
  }
  iVar2 = sscanf(jsonString + token->start,"%li",&iStack20);
  if ((iVar2 == 1) && (iStack20 + 0x80U < 0x100)) {
    *i = (int8_t)iStack20;
    IVar1 = SUCCESS;
  }
  else {
    IVar1 = JSON_PARSE_ERROR;
  }
  return IVar1;
}



IoT_Error_t parseFloatValue(float *f,char *jsonString,jsmntok_t *token)

{
  int iVar1;
  IoT_Error_t IVar2;
  
  if (token->type == JSMN_PRIMITIVE) {
    iVar1 = sscanf(jsonString + token->start,"%f",f);
    IVar2 = SUCCESS;
    if (iVar1 != 1) {
      IVar2 = JSON_PARSE_ERROR;
    }
    return IVar2;
  }
  return JSON_PARSE_ERROR;
}



IoT_Error_t parseDoubleValue(double *d,char *jsonString,jsmntok_t *token)

{
  int iVar1;
  IoT_Error_t IVar2;
  
  if (token->type == JSMN_PRIMITIVE) {
    iVar1 = sscanf(jsonString + token->start,"%lf",d);
    IVar2 = SUCCESS;
    if (iVar1 != 1) {
      IVar2 = JSON_PARSE_ERROR;
    }
    return IVar2;
  }
  return JSON_PARSE_ERROR;
}



IoT_Error_t parseBooleanValue(_Bool *b,char *jsonString,jsmntok_t *token)

{
  IoT_Error_t IVar1;
  
  if (token->type != JSMN_PRIMITIVE) {
    return JSON_PARSE_ERROR;
  }
  _IVar1 = strncmp(jsonString + token->start,"true",4);
  IVar1 = (IoT_Error_t)_IVar1;
  if (_IVar1 == 0) {
    *b = true;
  }
  else {
    _IVar1 = strncmp(jsonString + token->start,"false",5);
    IVar1 = (IoT_Error_t)_IVar1;
    if (_IVar1 == 0) {
      *b = false;
    }
    else {
      IVar1 = JSON_PARSE_ERROR;
    }
  }
  return IVar1;
}



IoT_Error_t parseStringValue(char *buf,size_t bufLen,char *jsonString,jsmntok_t *token)

{
  size_t __n;
  IoT_Error_t IVar1;
  
  __n = token->end - token->start;
  if (token->type == JSMN_STRING) {
    IVar1 = SHADOW_JSON_ERROR;
    if (__n + 1 <= bufLen) {
      strncpy(buf,jsonString + token->start,__n);
      buf[__n] = '\0';
      IVar1 = SUCCESS;
    }
  }
  else {
    IVar1 = JSON_PARSE_ERROR;
  }
  return IVar1;
}



ClientState aws_iot_mqtt_get_client_state(AWS_IoT_Client *pClient)

{
  if (pClient != (AWS_IoT_Client *)0x0) {
    return (pClient->clientStatus).clientState;
  }
  return CLIENT_STATE_INVALID;
}



IoT_Error_t aws_iot_mqtt_client_lock_mutex(AWS_IoT_Client *pClient,IoT_Mutex_t *pMutex)

{
  IoT_Error_t IVar1;
  
  if ((pClient != (AWS_IoT_Client *)0x0) && (pMutex != (IoT_Mutex_t *)0x0)) {
    if ((pClient->clientData).isBlockOnThreadLockEnabled == false) {
      IVar1 = aws_iot_thread_mutex_trylock(pMutex);
      return IVar1;
    }
    IVar1 = aws_iot_thread_mutex_lock(pMutex);
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t aws_iot_mqtt_client_unlock_mutex(AWS_IoT_Client *pClient,IoT_Mutex_t *pMutex)

{
  IoT_Error_t IVar1;
  
  if ((pClient != (AWS_IoT_Client *)0x0) && (pMutex != (IoT_Mutex_t *)0x0)) {
    IVar1 = aws_iot_thread_mutex_unlock(pMutex);
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



int aws_iot_mqtt_set_client_state(AWS_IoT_Client *param_1,uint param_2,ClientState param_3)

{
  int iVar1;
  IoT_Error_t IVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar3;
  IoT_Mutex_t *pMutex;
  
  if (param_1 != (AWS_IoT_Client *)0x0) {
    pMutex = &(param_1->clientData).state_change_mutex;
    IVar2 = aws_iot_mqtt_client_lock_mutex(param_1,pMutex);
    iVar3 = CONCAT31(extraout_var,IVar2);
    if (CONCAT31(extraout_var,IVar2) == 0) {
      iVar1 = -0x1d;
      if ((uint)(param_1->clientStatus).clientState == param_2) {
        (param_1->clientStatus).clientState = param_3;
        iVar1 = 0;
      }
      IVar2 = aws_iot_mqtt_client_unlock_mutex(param_1,pMutex);
      iVar3 = CONCAT31(extraout_var_00,IVar2);
      if (iVar1 != 0) {
        iVar3 = iVar1;
      }
    }
    return iVar3;
  }
  return 0xfffffffe;
}



IoT_Error_t
aws_iot_mqtt_set_connect_params
          (AWS_IoT_Client *pClient,IoT_Client_Connect_Params *pNewConnectParams)

{
  IoT_Error_t IVar1;
  size_t sVar2;
  
