pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (pClient != (AWS_IoT_Client *)0x0) {
    IVar1 = NULL_VALUE_ERROR;
    if (pNewConnectParams != (IoT_Client_Connect_Params *)0x0) {
      (pClient->clientData).options.isWillMsgPresent = pNewConnectParams->isWillMsgPresent;
      (pClient->clientData).options.MQTTVersion = pNewConnectParams->MQTTVersion;
      (pClient->clientData).options.pClientID = pNewConnectParams->pClientID;
      (pClient->clientData).options.clientIDLen = pNewConnectParams->clientIDLen;
      sVar2 = strlen(pUsernameTemp);
      if (sVar2 == 0) {
        snprintf(pUsernameTemp,0x19,"?SDK=C&Version=%d.%d.%d",3,0,1);
      }
      (pClient->clientData).options.pUsername = pUsernameTemp;
      sVar2 = strlen(pUsernameTemp);
      (pClient->clientData).options.usernameLen = (uint16_t)sVar2;
      IVar1 = SUCCESS;
      (pClient->clientData).options.pPassword = pNewConnectParams->pPassword;
      (pClient->clientData).options.passwordLen = pNewConnectParams->passwordLen;
      (pClient->clientData).options.will.pTopicName = (pNewConnectParams->will).pTopicName;
      (pClient->clientData).options.will.topicNameLen = (pNewConnectParams->will).topicNameLen;
      (pClient->clientData).options.will.pMessage = (pNewConnectParams->will).pMessage;
      (pClient->clientData).options.will.msgLen = (pNewConnectParams->will).msgLen;
      (pClient->clientData).options.will.qos = (pNewConnectParams->will).qos;
      (pClient->clientData).options.will.isRetained = (pNewConnectParams->will).isRetained;
      (pClient->clientData).options.keepAliveIntervalInSec =
           pNewConnectParams->keepAliveIntervalInSec;
      (pClient->clientData).options.isCleanSession = pNewConnectParams->isCleanSession;
    }
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



// WARNING: Variable defined which should be unmapped: default_options

IoT_Error_t aws_iot_mqtt_init(AWS_IoT_Client *pClient,IoT_Client_Init_Params *pInitParams)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  MessageHandlers_conflict40 *pMVar2;
  uint32_t uVar3;
  void *pvVar4;
  IoT_Mutex_t *pMutex;
  IoT_Mutex_t *pMutex_00;
  IoT_Mutex_t *pMutex_01;
  undefined auStack88 [4];
  IoT_Client_Connect_Params default_options;
  
  IVar1 = NULL_VALUE_ERROR;
  memcpy(auStack88,&DAT_23087bdc,0x38);
  if ((((pClient != (AWS_IoT_Client *)0x0) && (pInitParams != (IoT_Client_Init_Params *)0x0)) &&
      (pInitParams->pHostURL != (char *)0x0)) &&
     (((pInitParams->port != 0 && (pInitParams->pRootCALocation != (char *)0x0)) &&
      ((pInitParams->pDevicePrivateKeyLocation != (char *)0x0 &&
       (pInitParams->pDeviceCertLocation != (char *)0x0)))))) {
    pMVar2 = (pClient->clientData).messageHandlers;
    do {
      pMVar2->topicName = (char *)0x0;
      pMVar2->pApplicationHandler = (pApplicationHandler_t *)0x0;
      pMVar2->pApplicationHandlerData = (void *)0x0;
      pMVar2->qos = QOS0;
      pMVar2 = pMVar2 + 1;
    } while (pMVar2 != (MessageHandlers_conflict40 *)&(pClient->clientData).disconnectHandler);
    (pClient->clientData).packetTimeoutMs = pInitParams->mqttPacketTimeout_ms;
    uVar3 = pInitParams->mqttCommandTimeout_ms;
    (pClient->clientData).counterNetworkDisconnected = 0;
    (pClient->clientData).commandTimeoutMs = uVar3;
    (pClient->clientData).writeBufSize = 0x200;
    (pClient->clientData).readBufSize = 0x200;
    (pClient->clientData).disconnectHandler = pInitParams->disconnectHandler;
    pvVar4 = pInitParams->disconnectHandlerData;
    (pClient->clientData).nextPacketId = 1;
    (pClient->clientData).disconnectHandlerData = pvVar4;
    IVar1 = aws_iot_mqtt_set_connect_params(pClient,(IoT_Client_Connect_Params *)auStack88);
    if (CONCAT31(extraout_var,IVar1) == 0) {
      pMutex = &(pClient->clientData).state_change_mutex;
      (pClient->clientData).isBlockOnThreadLockEnabled = pInitParams->isBlockOnThreadLockEnabled;
      IVar1 = aws_iot_thread_mutex_init(pMutex);
      if (CONCAT31(extraout_var_00,IVar1) == 0) {
        pMutex_00 = &(pClient->clientData).tls_read_mutex;
        IVar1 = aws_iot_thread_mutex_init(pMutex_00);
        if (CONCAT31(extraout_var_01,IVar1) == 0) {
          pMutex_01 = &(pClient->clientData).tls_write_mutex;
          IVar1 = aws_iot_thread_mutex_init(pMutex_01);
          if (CONCAT31(extraout_var_02,IVar1) == 0) {
            (pClient->clientStatus).isPingOutstanding = false;
            (pClient->clientStatus).isAutoReconnectEnabled = pInitParams->enableAutoReconnect;
            IVar1 = iot_tls_init((Network *)&pClient->networkStack,pInitParams->pRootCALocation,
                                 pInitParams->pDeviceCertLocation,
                                 pInitParams->pDevicePrivateKeyLocation,pInitParams->pHostURL,
                                 pInitParams->port,pInitParams->tlsHandshakeTimeout_ms,
                                 pInitParams->isSSLHostnameVerify);
            if (CONCAT31(extraout_var_03,IVar1) != 0) {
              aws_iot_thread_mutex_destroy(pMutex_00);
              aws_iot_thread_mutex_destroy(pMutex);
              aws_iot_thread_mutex_destroy(pMutex_01);
              (pClient->clientStatus).clientState = CLIENT_STATE_INVALID;
              return IVar1;
            }
            init_timer((Timer *)pClient);
            init_timer(&pClient->reconnectDelayTimer);
            (pClient->clientStatus).clientState = CLIENT_STATE_INITIALIZED;
            return IVar1;
          }
          aws_iot_thread_mutex_destroy(pMutex_00);
        }
        aws_iot_thread_mutex_destroy(pMutex);
      }
    }
  }
  return IVar1;
}



uint16_t aws_iot_mqtt_get_next_packet_id(AWS_IoT_Client *pClient)

{
  uint16_t uVar1;
  
  uVar1 = (pClient->clientData).nextPacketId;
  if (uVar1 == 0xffff) {
    uVar1 = 1;
  }
  else {
    uVar1 = uVar1 + 1;
  }
  (pClient->clientData).nextPacketId = uVar1;
  return uVar1;
}



_Bool aws_iot_mqtt_is_client_connected(AWS_IoT_Client *pClient)

{
  if (pClient != (AWS_IoT_Client *)0x0) {
    return (_Bool)((uint)(pClient->clientStatus).clientState - 3 < 7);
  }
  return false;
}



