pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
IoT_Error_t aws_iot_mqtt_autoreconnect_set_status(AWS_IoT_Client *pClient,_Bool newStatus)

{
  if (pClient != (AWS_IoT_Client *)0x0) {
    (pClient->clientStatus).isAutoReconnectEnabled = newStatus;
    return SUCCESS;
  }
  return NULL_VALUE_ERROR;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

IoT_Error_t aws_iot_mqtt_connect(AWS_IoT_Client *pClient,IoT_Client_Connect_Params *pConnectParams)

{
  ushort uVar1;
  uint uVar2;
  ClientState CVar3;
  IoT_Error_t IVar4;
  IoT_Error_t IVar5;
  uchar uVar6;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint32_t uVar7;
  undefined3 extraout_var_02;
  size_t sVar8;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined3 extraout_var_05;
  undefined3 extraout_var_06;
  undefined3 extraout_var_07;
  undefined3 extraout_var_08;
  byte c;
  char *string;
  undefined4 uVar9;
  uint32_t rem_len;
  Network *pNVar10;
  uchar *puVar11;
  uchar *puStack56;
  uchar *curdata;
  MQTTHeader header;
  uchar *ptr;
  Timer connect_timer;
  
  if (pClient == (AWS_IoT_Client *)0x0) {
    return NULL_VALUE_ERROR;
  }
  aws_iot_mqtt_internal_flushBuffers(pClient);
  CVar3 = aws_iot_mqtt_get_client_state(pClient);
  _CVar3 = CONCAT31(extraout_var,CVar3);
  if (_CVar3 != 1) {
    if (CVar3 == CLIENT_STATE_INVALID) {
      return NETWORK_ALREADY_CONNECTED_ERROR;
    }
    if (2 < (_CVar3 - 0xbU & 0xff)) {
      return NETWORK_ALREADY_CONNECTED_ERROR;
    }
  }
  aws_iot_mqtt_set_client_state(pClient,_CVar3,2);
  pNVar10 = (Network *)&pClient->networkStack;
  if ((pConnectParams == (IoT_Client_Connect_Params *)0x0) ||
     (IVar4 = aws_iot_mqtt_set_connect_params(pClient,pConnectParams),
     CONCAT31(extraout_var_01,IVar4) == 0)) {
    IVar4 = (*(pClient->networkStack).connect)(pNVar10,(TLSConnectParams *)0x0);
    if (CONCAT31(extraout_var_00,IVar4) == 0) {
      init_timer((Timer *)&ptr);
      puVar11 = (pClient->clientData).writeBuf;
      countdown_ms((Timer *)&ptr,(pClient->clientData).commandTimeoutMs);
      curdata = (uchar *)((uint)curdata & 0xffffff00);
      uVar2 = (pClient->clientData).writeBufSize;
      (pClient->clientData).keepAliveInterval = (pClient->clientData).options.keepAliveIntervalInSec
      ;
      uVar1 = (pClient->clientData).options.clientIDLen;
      if (uVar1 == 0) {
        IVar4 = NULL_VALUE_ERROR;
      }
      else {
        IVar4 = MQTT_CONNACK_UNACCEPTABLE_PROTOCOL_VERSION_ERROR;
        if ((pClient->clientData).options.MQTTVersion == MQTT_3_1_1) {
          rem_len = (uint)uVar1 + 0xc;
          if ((pClient->clientData).options.isWillMsgPresent != false) {
            rem_len = rem_len + (uint)(pClient->clientData).options.will.topicNameLen +
                                (uint)(pClient->clientData).options.will.msgLen + 4;
          }
          if ((pClient->clientData).options.pUsername != (char *)0x0) {
            rem_len = rem_len + (uint)(pClient->clientData).options.usernameLen + 2;
          }
          if ((pClient->clientData).options.pPassword != (char *)0x0) {
            rem_len = rem_len + (uint)(pClient->clientData).options.passwordLen + 2;
          }
          _header = puVar11;
          uVar7 = aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(rem_len);
          if (uVar2 < uVar7) {
            IVar4 = MQTT_TX_BUFFER_TOO_SHORT_ERROR;
          }
          else {
            IVar5 = aws_iot_mqtt_internal_init_header((MQTTHeader *)&curdata,CONNECT,QOS0,'\0','\0')
            ;
            IVar4 = IVar5;
            if (CONCAT31(extraout_var_02,IVar5) == 0) {
              aws_iot_mqtt_internal_write_char((uchar **)&header,(uchar)curdata);
              sVar8 = aws_iot_mqtt_internal_write_len_to_buffer(_header,rem_len);
              _header = _header + sVar8;
              aws_iot_mqtt_internal_write_utf8_string((uchar **)&header,"MQTT",4);
              aws_iot_mqtt_internal_write_char
                        ((uchar **)&header,(pClient->clientData).options.MQTTVersion);
              c = ((pClient->clientData).options.isCleanSession != false) << 1;
              if ((pClient->clientData).options.isWillMsgPresent != false) {
                c = c | 4 | (pClient->clientData).options.will.qos << 3 |
                            (pClient->clientData).options.will.isRetained << 5;
              }
              if ((pClient->clientData).options.pPassword != (char *)0x0) {
                c = c | 0x40;
              }
              if ((pClient->clientData).options.pUsername != (char *)0x0) {
                c = c | 0x80;
              }
              aws_iot_mqtt_internal_write_char((uchar **)&header,c);
              aws_iot_mqtt_internal_write_uint_16
                        ((uchar **)&header,(pClient->clientData).options.keepAliveIntervalInSec);
              string = (pClient->clientData).options.pClientID;
              if (string == (char *)0x0) {
                aws_iot_mqtt_internal_write_uint_16((uchar **)&header,0);
              }
              else {
                aws_iot_mqtt_internal_write_utf8_string
                          ((uchar **)&header,string,(pClient->clientData).options.clientIDLen);
              }
              if ((pClient->clientData).options.isWillMsgPresent != false) {
                aws_iot_mqtt_internal_write_utf8_string
                          ((uchar **)&header,(pClient->clientData).options.will.pTopicName,
                           (pClient->clientData).options.will.topicNameLen);
                aws_iot_mqtt_internal_write_utf8_string
                          ((uchar **)&header,(pClient->clientData).options.will.pMessage,
                           (pClient->clientData).options.will.msgLen);
              }
              string = (pClient->clientData).options.pUsername;
              if (string != (char *)0x0) {
                aws_iot_mqtt_internal_write_utf8_string
                          ((uchar **)&header,string,(pClient->clientData).options.usernameLen);
              }
              string = (pClient->clientData).options.pPassword;
              if (string != (char *)0x0) {
                aws_iot_mqtt_internal_write_utf8_string
                          ((uchar **)&header,string,(pClient->clientData).options.passwordLen);
              }
              if (_header + -(int)puVar11 == (uchar *)0x0) {
LAB_2304f84e:
                uVar9 = 3;
                goto LAB_2304f850;
              }
              IVar4 = aws_iot_mqtt_internal_send_packet
                                (pClient,(size_t)(_header + -(int)puVar11),(Timer *)&ptr);
              if ((CONCAT31(extraout_var_03,IVar4) == 0) &&
                 (IVar4 = aws_iot_mqtt_internal_wait_for_read(pClient,'\x02',(Timer *)&ptr),
                 CONCAT31(extraout_var_04,IVar4) == 0)) {
                IVar4 = MQTT_RX_BUFFER_TOO_SHORT_ERROR;
                if (3 < (pClient->clientData).readBufSize) {
                  curdata = (uchar *)0x0;
                  _header = (uchar *)0x0;
                  puStack56 = (pClient->clientData).readBuf;
                  uVar6 = aws_iot_mqtt_internal_read_char(&puStack56);
                  IVar4 = FAILURE;
                  if (((CONCAT31(extraout_var_05,uVar6) >> 4 & 0xff) == 2) &&
                     (IVar4 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer
                                        (puStack56,(uint32_t *)&curdata,(uint32_t *)&header),
                     CONCAT31(extraout_var_06,IVar4) == 0)) {
                    puStack56 = puStack56 + (int)_header;
                    IVar4 = MQTT_DECODE_REMAINING_LENGTH_ERROR;
                    if (curdata == (uchar *)0x2) {
                      aws_iot_mqtt_internal_read_char(&puStack56);
                      uVar6 = aws_iot_mqtt_internal_read_char(&puStack56);
                      switch(CONCAT31(extraout_var_07,uVar6)) {
                      case 0:
                        uVar1 = (pClient->clientData).keepAliveInterval;
                        (pClient->clientStatus).isPingOutstanding = false;
                        countdown_sec((Timer *)pClient,(uint)uVar1);
                        goto LAB_2304f84e;
                      case 1:
                        IVar4 = MQTT_CONNACK_UNACCEPTABLE_PROTOCOL_VERSION_ERROR;
                        break;
                      case 2:
                        IVar4 = MQTT_CONNACK_IDENTIFIER_REJECTED_ERROR;
                        break;
                      case 3:
                        IVar4 = MQTT_CONNACK_SERVER_UNAVAILABLE_ERROR;
                        break;
                      case 4:
                        IVar4 = MQTT_CONNACK_BAD_USERDATA_ERROR;
                        break;
                      case 5:
                        IVar4 = MQTT_CONNACK_NOT_AUTHORIZED_ERROR;
                        break;
                      default:
                        IVar4 = MQTT_CONNACK_UNKNOWN_ERROR;
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
  else {
    IVar4 = MQTT_CONNECTION_ERROR;
  }
  IVar5 = IVar4;
  (*(pClient->networkStack).disconnect)(pNVar10);
  IVar4 = (*(pClient->networkStack).destroy)(pNVar10);
  uVar9 = 0xb;
  if (CONCAT31(extraout_var_08,IVar4) != 0) {
    return NETWORK_DISCONNECTED_ERROR;
  }
LAB_2304f850:
  aws_iot_mqtt_set_client_state(pClient,2,uVar9);
  return IVar5;
}



IoT_Error_t _aws_iot_mqtt_internal_disconnect(AWS_IoT_Client *pClient)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  size_t local_20;
  size_t serialized_len;
  Timer timer;
  
  local_20 = 0;
  IVar1 = aws_iot_mqtt_internal_serialize_zero
                    ((pClient->clientData).writeBuf,(pClient->clientData).writeBufSize,DISCONNECT,
                     &local_20);
  if (CONCAT31(extraout_var,IVar1) == 0) {
    init_timer((Timer *)&serialized_len);
    countdown_ms((Timer *)&serialized_len,(pClient->clientData).commandTimeoutMs);
    if (local_20 != 0) {
      aws_iot_mqtt_internal_send_packet(pClient,local_20,(Timer *)&serialized_len);
    }
    (*(pClient->networkStack).disconnect)((Network *)&pClient->networkStack);
    IVar1 = (*(pClient->networkStack).destroy)((Network *)&pClient->networkStack);
    IVar1 = -(CONCAT31(extraout_var_00,IVar1) != 0);
  }
  return IVar1;
}



IoT_Error_t aws_iot_mqtt_disconnect(AWS_IoT_Client *pClient)

{
  ClientState CVar1;
  _Bool _Var2;
  IoT_Error_t IVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar4;
  undefined3 extraout_var_01;
  
