pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (pClient != (AWS_IoT_Client *)0x0) {
    CVar1 = aws_iot_mqtt_get_client_state(pClient);
    _Var2 = aws_iot_mqtt_is_client_connected(pClient);
    IVar3 = NETWORK_DISCONNECTED_ERROR;
    if (CONCAT31(extraout_var_00,_Var2) != 0) {
      iVar4 = aws_iot_mqtt_set_client_state(pClient,CONCAT31(extraout_var,CVar1),10);
      IVar3 = (IoT_Error_t)iVar4;
      if (iVar4 == 0) {
        IVar3 = _aws_iot_mqtt_internal_disconnect(pClient);
        if (CONCAT31(extraout_var_01,IVar3) == 0) {
          (pClient->clientStatus).clientState = CLIENT_STATE_DISCONNECTED_MANUALLY;
        }
        else {
          (pClient->clientStatus).clientState = CVar1;
        }
      }
    }
    return IVar3;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t aws_iot_mqtt_attempt_reconnect(AWS_IoT_Client *pClient)

{
  _Bool _Var1;
  ClientState CVar2;
  IoT_Error_t IVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  
  if (pClient != (AWS_IoT_Client *)0x0) {
    _Var1 = aws_iot_mqtt_is_client_connected(pClient);
    IVar3 = NETWORK_ALREADY_CONNECTED_ERROR;
    if (CONCAT31(extraout_var,_Var1) == 0) {
      aws_iot_mqtt_connect(pClient,(IoT_Client_Connect_Params *)0x0);
      CVar2 = aws_iot_mqtt_get_client_state(pClient);
      if (CONCAT31(extraout_var_00,CVar2) == 3) {
        IVar3 = aws_iot_mqtt_resubscribe(pClient);
        if (CONCAT31(extraout_var_01,IVar3) == 0) {
          IVar3 = NETWORK_RECONNECTED;
        }
      }
      else {
        aws_iot_mqtt_set_client_state(pClient,0xb,0xd);
        IVar3 = NETWORK_ATTEMPTING_RECONNECT;
      }
    }
    return IVar3;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t
aws_iot_mqtt_internal_serialize_ack
          (uchar *pTxBuf,size_t txBufLen,MessageTypes msgType,uint8_t dup,uint16_t packetId,
          uint32_t *pSerializedLen)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  size_t sVar2;
  undefined3 in_register_00002031;
  uchar auStack40 [4];
  MQTTHeader header;
  uchar *ptr;
  
  auStack40[0] = '\0';
  IVar1 = NULL_VALUE_ERROR;
  if ((pTxBuf != (uchar *)0x0) && (pSerializedLen != (uint32_t *)0x0)) {
    IVar1 = MQTT_TX_BUFFER_TOO_SHORT_ERROR;
    if ((3 < txBufLen) &&
       (_header = pTxBuf,
       IVar1 = aws_iot_mqtt_internal_init_header
                         (auStack40,msgType,CONCAT31(in_register_00002031,msgType) == 6,dup,'\0'),
       CONCAT31(extraout_var,IVar1) == 0)) {
      aws_iot_mqtt_internal_write_char((uchar **)&header,auStack40[0]);
      sVar2 = aws_iot_mqtt_internal_write_len_to_buffer(_header,2);
      _header = _header + sVar2;
      aws_iot_mqtt_internal_write_uint_16((uchar **)&header,packetId);
      *(uchar **)pSerializedLen = _header + -(int)pTxBuf;
    }
  }
  return IVar1;
}



IoT_Error_t
aws_iot_mqtt_internal_deserialize_publish
          (uint8_t *dup,QoS *qos,uint8_t *retained,uint16_t *pPacketId,char **pTopicName,
          uint16_t *topicNameLen,uchar **payload,size_t *payloadLen,uchar *pRxBuf,size_t rxBufLen)

{
  uchar *puVar1;
  byte bVar2;
  IoT_Error_t IVar3;
  uint16_t uVar4;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined2 extraout_var_01;
  uchar *in_stack_00000000;
  uint in_stack_00000004;
  uchar *puStack60;
  uchar *curData;
  uint32_t decodedLen;
  uint32_t readBytesLen;
  
  puStack60 = in_stack_00000000;
  curData = (uchar *)0x0;
  decodedLen = 0;
  if ((((dup != (uint8_t *)0x0) && (qos != (QoS *)0x0)) && (retained != (uint8_t *)0x0)) &&
     (pPacketId != (uint16_t *)0x0)) {
    if (in_stack_00000004 < 4) {
      return MQTT_RX_BUFFER_TOO_SHORT_ERROR;
    }
    bVar2 = aws_iot_mqtt_internal_read_char(&puStack60);
    _bVar2 = CONCAT31(extraout_var,bVar2);
    if ((_bVar2 >> 4 & 0xff) == 3) {
      *dup = (byte)((int)_bVar2 >> 3) & 1;
      *qos = (byte)((int)_bVar2 >> 1) & 3;
      *retained = bVar2 & 1;
      IVar3 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer
                        (puStack60,(uint32_t *)&curData,&decodedLen);
      if (CONCAT31(extraout_var_00,IVar3) != 0) {
        return IVar3;
      }
      puStack60 = puStack60 + decodedLen;
      puVar1 = puStack60 + (int)curData;
      if (1 < (int)curData) {
        uVar4 = aws_iot_mqtt_internal_read_uint16_t(&puStack60);
        *topicNameLen = uVar4;
        if (puStack60 + CONCAT22(extraout_var_01,uVar4) <= puVar1) {
          *(uchar **)pTopicName = puStack60;
          puStack60 = puStack60 + *topicNameLen;
          if (-1 < (int)(puVar1 + -(int)puStack60)) {
            if (*qos != QOS0) {
              uVar4 = aws_iot_mqtt_internal_read_uint16_t(&puStack60);
              *pPacketId = uVar4;
            }
            *(uchar **)payloadLen = puVar1 + -(int)puStack60;
            *payload = puStack60;
            return IVar3;
          }
        }
      }
    }
  }
  return FAILURE;
}



// WARNING: Variable defined which should be unmapped: readBytesLen

IoT_Error_t
aws_iot_mqtt_internal_deserialize_ack
          (uchar *pPacketType,uchar *dup,uint16_t *pPacketId,uchar *pRxBuf,size_t rxBuflen)

{
  uchar uVar1;
  IoT_Error_t IVar2;
  uint16_t uVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uchar *puStack28;
  uchar *curdata;
  uint32_t decodedLen;
  uint32_t readBytesLen;
  
  curdata = (uchar *)0x0;
  decodedLen = 0;
  IVar2 = NULL_VALUE_ERROR;
  if ((((pPacketType != (uchar *)0x0) && (dup != (uchar *)0x0)) && (pPacketId != (uint16_t *)0x0))
     && ((pRxBuf != (uchar *)0x0 && (IVar2 = MQTT_RX_BUFFER_TOO_SHORT_ERROR, 3 < rxBuflen)))) {
    puStack28 = pRxBuf;
    uVar1 = aws_iot_mqtt_internal_read_char(&puStack28);
    *dup = (byte)((int)CONCAT31(extraout_var,uVar1) >> 3) & 1;
    *pPacketType = (uchar)(CONCAT31(extraout_var,uVar1) >> 4);
    IVar2 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer
                      (puStack28,(uint32_t *)&curdata,&decodedLen);
    if (CONCAT31(extraout_var_00,IVar2) == 0) {
      puStack28 = puStack28 + decodedLen;
      if ((int)curdata < 2) {
        IVar2 = FAILURE;
      }
      else {
        uVar3 = aws_iot_mqtt_internal_read_uint16_t(&puStack28);
        *pPacketId = uVar3;
      }
    }
  }
  return IVar2;
}



IoT_Error_t
aws_iot_mqtt_publish
          (AWS_IoT_Client *pClient,char *pTopicName,uint16_t topicNameLen,
          IoT_Publish_Message_Params *pParams)

{
  QoS qos;
  uint8_t retained;
  _Bool _Var1;
  ClientState CVar2;
  IoT_Error_t IVar3;
  uint16_t anInt;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar4;
  uint32_t uVar5;
  undefined3 extraout_var_01;
  size_t sVar6;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined2 in_register_00002032;
  uint uVar7;
  size_t __n;
  uchar *puVar8;
  void *__src;
  uint32_t rem_len;
  uchar uStack85;
  uchar auStack84 [3];
  uchar dup;
  uchar type;
  uint16_t packet_id;
  Timer timer;
  
  if ((((pClient != (AWS_IoT_Client *)0x0) && (pTopicName != (char *)0x0)) &&
      (CONCAT22(in_register_00002032,topicNameLen) != 0)) &&
     (pParams != (IoT_Publish_Message_Params *)0x0)) {
    _Var1 = aws_iot_mqtt_is_client_connected(pClient);
    IVar3 = NETWORK_DISCONNECTED_ERROR;
    if (CONCAT31(extraout_var,_Var1) != 0) {
      CVar2 = aws_iot_mqtt_get_client_state(pClient);
      _CVar2 = CONCAT31(extraout_var_00,CVar2);
      if ((_CVar2 != 3) && (_CVar2 != 9)) {
        return MQTT_CLIENT_NOT_IDLE_ERROR;
      }
      iVar4 = aws_iot_mqtt_set_client_state(pClient,_CVar2,5);
      IVar3 = (IoT_Error_t)iVar4;
      if (iVar4 == 0) {
        init_timer((Timer *)&packet_id);
        countdown_ms((Timer *)&packet_id,(pClient->clientData).commandTimeoutMs);
        if (pParams->qos == QOS1) {
          anInt = aws_iot_mqtt_get_next_packet_id(pClient);
          pParams->id = anInt;
        }
        __src = pParams->payload;
        auStack84[0] = '\0';
        puVar8 = (pClient->clientData).writeBuf;
        uVar7 = (pClient->clientData).writeBufSize;
        qos = pParams->qos;
        retained = pParams->isRetained;
        anInt = pParams->id;
        __n = pParams->payloadLen;
        iVar4 = -2;
        if (__src != (void *)0x0) {
          iVar4 = CONCAT22(in_register_00002032,topicNameLen) + __n;
          rem_len = iVar4 + 4;
          if (qos == QOS0) {
            rem_len = iVar4 + 2;
          }
          _type = puVar8;
          uVar5 = aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(rem_len);
          iVar4 = -0x21;
          if (uVar5 <= uVar7) {
            IVar3 = aws_iot_mqtt_internal_init_header(auStack84,PUBLISH,qos,'\0',retained);
            iVar4 = CONCAT31(extraout_var_01,IVar3);
            if (iVar4 == 0) {
              aws_iot_mqtt_internal_write_char((uchar **)&type,auStack84[0]);
              sVar6 = aws_iot_mqtt_internal_write_len_to_buffer(_type,rem_len);
              _type = _type + sVar6;
              aws_iot_mqtt_internal_write_utf8_string((uchar **)&type,pTopicName,topicNameLen);
              if (qos != QOS0) {
                aws_iot_mqtt_internal_write_uint_16((uchar **)&type,anInt);
              }
              memcpy(_type,__src,__n);
              IVar3 = aws_iot_mqtt_internal_send_packet
                                (pClient,(size_t)(_type + (__n - (int)puVar8)),(Timer *)&packet_id);
              iVar4 = CONCAT31(extraout_var_02,IVar3);
              if ((iVar4 == 0) && (pParams->qos == QOS1)) {
                IVar3 = aws_iot_mqtt_internal_wait_for_read(pClient,'\x04',(Timer *)&packet_id);
                iVar4 = CONCAT31(extraout_var_03,IVar3);
                if (iVar4 == 0) {
                  IVar3 = aws_iot_mqtt_internal_deserialize_ack
                                    (auStack84,&uStack85,(uint16_t *)&type,
                                     (pClient->clientData).readBuf,(pClient->clientData).readBufSize
                                    );
                  iVar4 = CONCAT31(extraout_var_04,IVar3);
                }
              }
            }
          }
        }
        IVar3 = aws_iot_mqtt_set_client_state(pClient,5,_CVar2);
        if (iVar4 != 0) {
          IVar3 = (IoT_Error_t)iVar4;
        }
      }
    }
    return IVar3;
  }
  return NULL_VALUE_ERROR;
}



IoT_Error_t
_aws_iot_mqtt_deserialize_suback
          (uint16_t *pPacketId,uint32_t *pGrantedQoSCount,QoS *pGrantedQoSs,uchar *pRxBuf,
          size_t rxBufLen)

{
  uchar *puVar1;
  uchar uVar2;
  IoT_Error_t IVar3;
  QoS QVar4;
  uint16_t uVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint uVar6;
  uchar *puStack44;
  uchar *curData;
  uint32_t decodedLen;
  uint32_t readBytesLen;
  
