pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  curData = (uchar *)0x0;
  decodedLen = 0;
  if (rxBufLen < 5) {
    return MQTT_RX_BUFFER_TOO_SHORT_ERROR;
  }
  puStack44 = pRxBuf;
  uVar2 = aws_iot_mqtt_internal_read_char(&puStack44);
  if ((CONCAT31(extraout_var,uVar2) >> 4 & 0xff) == 9) {
    IVar3 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer
                      (puStack44,(uint32_t *)&curData,&decodedLen);
    if (CONCAT31(extraout_var_00,IVar3) != 0) {
      return IVar3;
    }
    puStack44 = puStack44 + decodedLen;
    puVar1 = puStack44 + (int)curData;
    if (1 < (int)curData) {
      uVar5 = aws_iot_mqtt_internal_read_uint16_t(&puStack44);
      *pPacketId = uVar5;
      *pGrantedQoSCount = 0;
      while( true ) {
        if (puVar1 <= puStack44) {
          return IVar3;
        }
        uVar6 = *pGrantedQoSCount;
        if (1 < uVar6) break;
        *pGrantedQoSCount = uVar6 + 1;
        QVar4 = aws_iot_mqtt_internal_read_char(&puStack44);
        pGrantedQoSs[uVar6] = QVar4;
      }
    }
  }
  return FAILURE;
}



IoT_Error_t
_aws_iot_mqtt_serialize_subscribe
          (uchar *pTxBuf,size_t txBufLen,uint16_t packetId,char **pTopicNameList,
          uint16_t *pTopicNameLenList,QoS *pRequestedQoSs,uint32_t *pSerializedLen)

{
  ushort uVar1;
  IoT_Error_t IVar2;
  uint32_t uVar3;
  undefined3 extraout_var;
  size_t sVar4;
  uchar auStack56 [4];
  MQTTHeader header;
  uchar *ptr;
  
  uVar1 = *pTopicNameLenList;
  auStack56[0] = '\0';
  _header = pTxBuf;
  uVar3 = aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length((uint)uVar1 + 5);
  IVar2 = MQTT_TX_BUFFER_TOO_SHORT_ERROR;
  if ((uVar3 <= txBufLen) &&
     (IVar2 = aws_iot_mqtt_internal_init_header(auStack56,SUBSCRIBE,QOS1,'\0','\0'),
     CONCAT31(extraout_var,IVar2) == 0)) {
    aws_iot_mqtt_internal_write_char((uchar **)&header,auStack56[0]);
    sVar4 = aws_iot_mqtt_internal_write_len_to_buffer(_header,(uint)uVar1 + 5);
    _header = _header + sVar4;
    aws_iot_mqtt_internal_write_uint_16((uchar **)&header,packetId);
    aws_iot_mqtt_internal_write_utf8_string((uchar **)&header,*pTopicNameList,*pTopicNameLenList);
    aws_iot_mqtt_internal_write_char((uchar **)&header,*pRequestedQoSs);
    *(uchar **)pSerializedLen = _header + -(int)pTxBuf;
  }
  return IVar2;
}



// WARNING: Variable defined which should be unmapped: timer
// WARNING: Could not reconcile some variable overlaps

IoT_Error_t
aws_iot_mqtt_subscribe
          (AWS_IoT_Client *pClient,char *pTopicName,uint16_t topicNameLen,QoS qos,
          pApplicationHandler_t *pApplicationHandler,void *pApplicationHandlerData)

{
  int iVar1;
  _Bool _Var2;
  ClientState CVar3;
  IoT_Error_t IVar4;
  uint16_t packetId;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar5;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  Timer *pTVar6;
  MessageHandlers_conflict40 *pMVar7;
  QoS QStack65;
  uint16_t uStack64;
  uint16_t uStack62;
  undefined2 uStack60;
  uint16_t rxPacketId;
  QoS grantedQoS [3];
  uint32_t uStack52;
  uint32_t serializedLen;
  uint32_t count;
  Timer timer;
  
  if (((pClient == (AWS_IoT_Client *)0x0) || (pTopicName == (char *)0x0)) ||
     (pApplicationHandler == (pApplicationHandler_t *)0x0)) {
    return NULL_VALUE_ERROR;
  }
  _Var2 = aws_iot_mqtt_is_client_connected(pClient);
  IVar4 = NETWORK_DISCONNECTED_ERROR;
  if (CONCAT31(extraout_var,_Var2) != 0) {
    CVar3 = aws_iot_mqtt_get_client_state(pClient);
    _CVar3 = CONCAT31(extraout_var_00,CVar3);
    if ((_CVar3 != 3) && (_CVar3 != 9)) {
      return MQTT_CLIENT_NOT_IDLE_ERROR;
    }
    iVar5 = aws_iot_mqtt_set_client_state(pClient,_CVar3,6);
    IVar4 = (IoT_Error_t)iVar5;
    if (iVar5 == 0) {
      uStack60 = 0;
      rxPacketId._0_1_ = 0;
      QStack65 = qos;
      uStack64 = topicNameLen;
      _grantedQoS = pTopicName;
      init_timer((Timer *)&count);
      countdown_ms((Timer *)&count,(pClient->clientData).commandTimeoutMs);
      uStack52 = 0;
      serializedLen = 0;
      packetId = aws_iot_mqtt_get_next_packet_id(pClient);
      uStack62 = 0;
      IVar4 = _aws_iot_mqtt_serialize_subscribe
                        ((pClient->clientData).writeBuf,(pClient->clientData).writeBufSize,packetId,
                         (char **)grantedQoS,&uStack64,&QStack65,&uStack52);
      iVar5 = CONCAT31(extraout_var_01,IVar4);
      if (iVar5 == 0) {
        pMVar7 = (pClient->clientData).messageHandlers;
        iVar1 = 0;
        do {
          if (pMVar7->topicName == (char *)0x0) {
            IVar4 = aws_iot_mqtt_internal_send_packet(pClient,uStack52,(Timer *)&count);
            iVar5 = CONCAT31(extraout_var_02,IVar4);
            if (iVar5 == 0) {
              IVar4 = aws_iot_mqtt_internal_wait_for_read(pClient,'\t',(Timer *)&count);
              iVar5 = CONCAT31(extraout_var_03,IVar4);
              if (iVar5 == 0) {
                IVar4 = _aws_iot_mqtt_deserialize_suback
                                  (&uStack62,&serializedLen,(QoS *)&uStack60,
                                   (pClient->clientData).readBuf,(pClient->clientData).readBufSize);
                iVar5 = CONCAT31(extraout_var_04,IVar4);
                if (iVar5 == 0) {
                  pTVar6 = (Timer *)((int)&pClient->pingTimer + iVar1 * 0x10);
                  *(char **)&pTVar6[0x60].last_polled_ticks = _grantedQoS;
                  *(pApplicationHandler_t **)&pTVar6[0x61].timeout_ticks = pApplicationHandler;
                  *(void **)&pTVar6[0x61].last_polled_ticks = pApplicationHandlerData;
                  *(uint16_t *)&pTVar6[0x61].start_ticks = uStack64;
                  *(QoS *)((int)&pTVar6[0x61].start_ticks + 2) = QStack65;
                }
              }
            }
            goto LAB_2304ff0e;
          }
          iVar1 = iVar1 + 1;
          pMVar7 = pMVar7 + 1;
        } while (iVar1 != 5);
        iVar5 = -0x22;
      }
LAB_2304ff0e:
      IVar4 = aws_iot_mqtt_set_client_state(pClient,6,_CVar3);
      if (iVar5 != 0) {
        IVar4 = (IoT_Error_t)iVar5;
      }
    }
  }
  return IVar4;
}



