pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: timer
// WARNING: Could not reconcile some variable overlaps

IoT_Error_t aws_iot_mqtt_resubscribe(AWS_IoT_Client *pClient)

{
  int iVar1;
  _Bool _Var2;
  ClientState CVar3;
  IoT_Error_t IVar4;
  uint16_t packetId_00;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar5;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  size_t txBufLen;
  MessageHandlers_conflict40 *pMVar6;
  MessageHandlers_conflict40 *pTopicNameList;
  int iVar7;
  uint16_t uStack58;
  undefined2 uStack56;
  uint16_t packetId;
  QoS grantedQoS [3];
  uint32_t len;
  uint32_t count;
  Timer timer;
  
  if (pClient == (AWS_IoT_Client *)0x0) {
    return NULL_VALUE_ERROR;
  }
  _Var2 = aws_iot_mqtt_is_client_connected(pClient);
  IVar4 = NETWORK_DISCONNECTED_ERROR;
  if (CONCAT31(extraout_var,_Var2) != 0) {
    CVar3 = aws_iot_mqtt_get_client_state(pClient);
    IVar4 = MQTT_CLIENT_NOT_IDLE_ERROR;
    if (CONCAT31(extraout_var_00,CVar3) == 3) {
      iVar5 = aws_iot_mqtt_set_client_state(pClient,3,8);
      IVar4 = (IoT_Error_t)iVar5;
      if (iVar5 == 0) {
        pTopicNameList = (pClient->clientData).messageHandlers;
        uStack56 = 0;
        packetId._0_1_ = 0;
        uStack58 = 0;
        _grantedQoS = 0;
        len = 0;
        iVar5 = 0;
        pMVar6 = pTopicNameList;
        do {
          if (pMVar6->topicName == (char *)0x0) break;
          iVar5 = iVar5 + 1;
          pMVar6 = pMVar6 + 1;
        } while (iVar5 != 5);
        iVar7 = 0;
        while (iVar5 != iVar7) {
          if (pTopicNameList->topicName != (char *)0x0) {
            init_timer((Timer *)&count);
            countdown_ms((Timer *)&count,(pClient->clientData).commandTimeoutMs);
            txBufLen = (pClient->clientData).writeBufSize;
            packetId_00 = aws_iot_mqtt_get_next_packet_id(pClient);
            IVar4 = _aws_iot_mqtt_serialize_subscribe
                              ((pClient->clientData).writeBuf,txBufLen,packetId_00,
                               (char **)pTopicNameList,&pTopicNameList->topicNameLen,
                               &pTopicNameList->qos,(uint32_t *)grantedQoS);
            iVar1 = CONCAT31(extraout_var_01,IVar4);
            if (iVar1 != 0) goto LAB_23050076;
            IVar4 = aws_iot_mqtt_internal_send_packet(pClient,_grantedQoS,(Timer *)&count);
            iVar1 = CONCAT31(extraout_var_02,IVar4);
            if (iVar1 != 0) goto LAB_23050076;
            IVar4 = aws_iot_mqtt_internal_wait_for_read(pClient,'\t',(Timer *)&count);
            iVar1 = CONCAT31(extraout_var_03,IVar4);
            if (iVar1 != 0) goto LAB_23050076;
            IVar4 = _aws_iot_mqtt_deserialize_suback
                              (&uStack58,&len,(QoS *)&uStack56,(pClient->clientData).readBuf,
                               (pClient->clientData).readBufSize);
            iVar1 = CONCAT31(extraout_var_04,IVar4);
            if (iVar1 != 0) goto LAB_23050076;
          }
          iVar7 = iVar7 + 1;
          pTopicNameList = pTopicNameList + 1;
        }
        iVar1 = 0;
LAB_23050076:
        IVar4 = aws_iot_mqtt_set_client_state(pClient,8,3);
        if (iVar1 != 0) {
          IVar4 = (IoT_Error_t)iVar1;
        }
      }
    }
  }
  return IVar4;
}



// WARNING: Variable defined which should be unmapped: timer

IoT_Error_t
aws_iot_mqtt_unsubscribe(AWS_IoT_Client *pClient,char *pTopicFilter,uint16_t topicFilterLen)

{
  MessageHandlers_conflict40 *pMVar1;
  _Bool _Var2;
  ClientState CVar3;
  IoT_Error_t IVar4;
  uint16_t anInt;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  int iVar5;
  uint32_t uVar6;
  undefined3 extraout_var_01;
  size_t sVar7;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  int iVar8;
  undefined2 in_register_00002032;
  MessageHandlers_conflict40 *pMVar9;
  uint32_t rem_len;
  uchar *puVar10;
  MessageHandlers_conflict40 *pMVar11;
  uint uVar12;
  uchar uStack69;
  uchar auStack68 [3];
  uchar type;
  uchar dup;
  uint16_t packet_id;
  Timer timer;
  
  if ((pClient == (AWS_IoT_Client *)0x0) || (pTopicFilter == (char *)0x0)) {
    return NULL_VALUE_ERROR;
  }
  _Var2 = aws_iot_mqtt_is_client_connected(pClient);
  if (CONCAT31(extraout_var,_Var2) == 0) {
    return NETWORK_DISCONNECTED_ERROR;
  }
  CVar3 = aws_iot_mqtt_get_client_state(pClient);
  _CVar3 = CONCAT31(extraout_var_00,CVar3);
  if ((_CVar3 != 3) && (_CVar3 != 9)) {
    return MQTT_CLIENT_NOT_IDLE_ERROR;
  }
  iVar5 = aws_iot_mqtt_set_client_state(pClient,_CVar3,7);
  if (iVar5 != 0) {
    IVar4 = aws_iot_mqtt_set_client_state(pClient,7,_CVar3);
    return IVar4;
  }
  pMVar9 = (pClient->clientData).messageHandlers;
  pMVar11 = (MessageHandlers_conflict40 *)&(pClient->clientData).disconnectHandler;
  pMVar1 = pMVar9;
  do {
    if ((pMVar1->topicName != (char *)0x0) &&
       (iVar5 = strcmp(pMVar1->topicName,pTopicFilter), iVar5 == 0)) {
      init_timer((Timer *)&packet_id);
      rem_len = CONCAT22(in_register_00002032,topicFilterLen) + 4;
      countdown_ms((Timer *)&packet_id,(pClient->clientData).commandTimeoutMs);
      uVar12 = (pClient->clientData).writeBufSize;
      anInt = aws_iot_mqtt_get_next_packet_id(pClient);
      puVar10 = (pClient->clientData).writeBuf;
      auStack68[0] = '\0';
      _dup = puVar10;
      uVar6 = aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(rem_len);
      iVar5 = -0x21;
      if (uVar12 < uVar6) goto LAB_23050136;
      IVar4 = aws_iot_mqtt_internal_init_header(auStack68,UNSUBSCRIBE,QOS1,'\0','\0');
      iVar5 = CONCAT31(extraout_var_01,IVar4);
      if (iVar5 != 0) goto LAB_23050136;
      aws_iot_mqtt_internal_write_char((uchar **)&dup,auStack68[0]);
      sVar7 = aws_iot_mqtt_internal_write_len_to_buffer(_dup,rem_len);
      _dup = _dup + sVar7;
      aws_iot_mqtt_internal_write_uint_16((uchar **)&dup,anInt);
      aws_iot_mqtt_internal_write_utf8_string((uchar **)&dup,pTopicFilter,topicFilterLen);
      IVar4 = aws_iot_mqtt_internal_send_packet
                        (pClient,(size_t)(_dup + -(int)puVar10),(Timer *)&packet_id);
      iVar5 = CONCAT31(extraout_var_02,IVar4);
      if (iVar5 != 0) goto LAB_23050136;
      IVar4 = aws_iot_mqtt_internal_wait_for_read(pClient,'\v',(Timer *)&packet_id);
      iVar5 = CONCAT31(extraout_var_03,IVar4);
      if (iVar5 != 0) goto LAB_23050136;
      uStack69 = '\0';
      auStack68[0] = '\0';
      IVar4 = aws_iot_mqtt_internal_deserialize_ack
                        (&uStack69,auStack68,(uint16_t *)&dup,(pClient->clientData).readBuf,
                         (pClient->clientData).readBufSize);
      iVar5 = CONCAT31(extraout_var_04,IVar4);
      if (iVar5 != 0) goto LAB_23050136;
      if (uStack69 == '\v') goto LAB_2305020a;
      break;
    }
    pMVar1 = pMVar1 + 1;
  } while (pMVar1 != pMVar11);
  iVar5 = -1;
LAB_23050136:
  IVar4 = aws_iot_mqtt_set_client_state(pClient,7,_CVar3);
  if (iVar5 != 0) {
    IVar4 = (IoT_Error_t)iVar5;
  }
  return IVar4;
LAB_2305020a:
  do {
    if ((pMVar9->topicName != (char *)0x0) &&
       (iVar8 = strcmp(pMVar9->topicName,pTopicFilter), iVar8 == 0)) {
      pMVar9->topicName = (char *)0x0;
    }
    pMVar9 = pMVar9 + 1;
  } while (pMVar9 != pMVar11);
  goto LAB_23050136;
}



IoT_Error_t _aws_iot_mqtt_handle_disconnect(AWS_IoT_Client *pClient)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  iot_disconnect_handler *piVar2;
  
  IVar1 = aws_iot_mqtt_disconnect(pClient);
  if (CONCAT31(extraout_var,IVar1) != 0) {
    (pClient->clientStatus).clientState = CLIENT_STATE_DISCONNECTED_ERROR;
    (*(pClient->networkStack).disconnect)((Network *)&pClient->networkStack);
    (*(pClient->networkStack).destroy)((Network *)&pClient->networkStack);
  }
  piVar2 = (pClient->clientData).disconnectHandler;
  if (piVar2 != (iot_disconnect_handler *)0x0) {
    (*piVar2)(pClient,(pClient->clientData).disconnectHandlerData);
  }
  (pClient->clientStatus).clientState = CLIENT_STATE_DISCONNECTED_ERROR;
  return NETWORK_DISCONNECTED_ERROR;
}



// WARNING: Variable defined which should be unmapped: timer_1
// WARNING: Could not reconcile some variable overlaps

IoT_Error_t aws_iot_mqtt_yield(AWS_IoT_Client *pClient,uint32_t timeout_ms)

{
  ushort uVar1;
  ClientState CVar2;
  _Bool _Var3;
  IoT_Error_t IVar4;
  byte bVar5;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  int iVar6;
  undefined3 extraout_var_04;
  undefined3 extraout_var_05;
  undefined3 extraout_var_06;
  undefined3 extraout_var_07;
  undefined3 extraout_var_08;
  undefined3 extraout_var_09;
  undefined3 extraout_var_10;
  uint timeout;
  anon_subr_IoT_Error_t_Network_ptr_for_isConnected *paVar7;
  int iVar8;
  Timer *timer_00;
  uint8_t uStack61;
  uint8_t packet_type;
  size_t sStack60;
  size_t serialized_len;
  Timer timer;
  Timer timer_1;
  
  if (pClient == (AWS_IoT_Client *)0x0) {
    return NULL_VALUE_ERROR;
  }
  if (timeout_ms == 0) {
    return NULL_VALUE_ERROR;
  }
  CVar2 = aws_iot_mqtt_get_client_state(pClient);
  iVar6 = CONCAT31(extraout_var,CVar2);
  if (iVar6 == 0xc) {
    return NETWORK_MANUALLY_DISCONNECTED;
  }
  if (iVar6 != 0xd) {
    _Var3 = aws_iot_mqtt_is_client_connected(pClient);
    if (CONCAT31(extraout_var_05,_Var3) == 0) {
      return NETWORK_DISCONNECTED_ERROR;
    }
    if (iVar6 != 3) {
      return MQTT_CLIENT_NOT_IDLE_ERROR;
    }
    iVar6 = aws_iot_mqtt_set_client_state(pClient,3,4);
    if (iVar6 != 0) {
      return (IoT_Error_t)iVar6;
    }
  }
  init_timer((Timer *)&serialized_len);
  countdown_ms((Timer *)&serialized_len,timeout_ms);
  timer_00 = &pClient->reconnectDelayTimer;
  do {
    CVar2 = aws_iot_mqtt_get_client_state(pClient);
    if (CONCAT31(extraout_var_00,CVar2) == 0xd) {
      if (0x1f400 < (pClient->clientData).currentReconnectWaitInterval) {
        iVar6 = -0xe;
        goto LAB_2305042e;
      }
      _Var3 = has_timer_expired(timer_00);
      iVar6 = 4;
      if (CONCAT31(extraout_var_01,_Var3) != 0) {
        paVar7 = (pClient->networkStack).isConnected;
        if (paVar7 == (anon_subr_IoT_Error_t_Network_ptr_for_isConnected *)0x0) {
          iVar8 = -0x12;
        }
        else {
          IVar4 = (*paVar7)((Network *)&pClient->networkStack);
          iVar8 = CONCAT31(extraout_var_02,IVar4);
          if (iVar8 == 6) {
            IVar4 = aws_iot_mqtt_attempt_reconnect(pClient);
            iVar8 = CONCAT31(extraout_var_03,IVar4);
            if (iVar8 == 3) {
              iVar6 = aws_iot_mqtt_set_client_state(pClient,3,4);
              if (iVar6 == 0) {
                iVar6 = 3;
              }
              goto LAB_2305030e;
            }
          }
        }
        timeout = (pClient->clientData).currentReconnectWaitInterval << 1;
        (pClient->clientData).currentReconnectWaitInterval = timeout;
        iVar6 = -0xe;
        if (timeout < 0x1f401) {
          countdown_ms(timer_00,timeout);
          iVar6 = iVar8;
        }
      }
    }
    else {
      bVar5 = aws_iot_mqtt_internal_cycle_read(pClient,(Timer *)&serialized_len,&uStack61);
      iVar6 = CONCAT31(extraout_var_06,bVar5);
      if (iVar6 == 0) {
        if (((pClient->clientData).keepAliveInterval == 0) ||
           (_Var3 = has_timer_expired((Timer *)pClient), CONCAT31(extraout_var_07,_Var3) == 0))
        goto LAB_2305030e;
        if ((pClient->clientStatus).isPingOutstanding == false) {
          init_timer((Timer *)&timer.last_polled_ticks);
          countdown_ms((Timer *)&timer.last_polled_ticks,(pClient->clientData).commandTimeoutMs);
          sStack60 = 0;
          IVar4 = aws_iot_mqtt_internal_serialize_zero
                            ((pClient->clientData).writeBuf,(pClient->clientData).writeBufSize,
                             PINGREQ,(size_t *)&stack0xffffffc4);
          iVar6 = CONCAT31(extraout_var_09,IVar4);
          if (iVar6 == 0) {
            IVar4 = aws_iot_mqtt_internal_send_packet
                              (pClient,sStack60,(Timer *)&timer.last_polled_ticks);
            iVar6 = CONCAT31(extraout_var_10,IVar4);
            if (iVar6 == 0) {
              uVar1 = (pClient->clientData).keepAliveInterval;
              (pClient->clientStatus).isPingOutstanding = true;
              countdown_sec((Timer *)pClient,(uint)uVar1);
              goto LAB_2305030e;
            }
            goto LAB_23050392;
          }
        }
        else {
LAB_23050392:
          IVar4 = _aws_iot_mqtt_handle_disconnect(pClient);
          iVar6 = CONCAT31(extraout_var_08,IVar4);
        }
        if (iVar6 != -0xd) {
          if (iVar6 == 0) goto LAB_2305030e;
          goto LAB_2305042e;
        }
      }
      else {
        if (((bVar5 & 0xfd) == 0xf4) || (iVar6 == -7)) goto LAB_23050392;
        if (iVar6 != -0xd) goto LAB_2305042e;
      }
      (pClient->clientData).counterNetworkDisconnected =
           (pClient->clientData).counterNetworkDisconnected + 1;
      if ((pClient->clientStatus).isAutoReconnectEnabled == false) {
        return NETWORK_DISCONNECTED_ERROR;
      }
      iVar6 = aws_iot_mqtt_set_client_state(pClient,0xb,0xd);
      if (iVar6 != 0) break;
      (pClient->clientData).currentReconnectWaitInterval = 1000;
      countdown_ms(timer_00,1000);
      iVar6 = 4;
    }
LAB_2305030e:
    _Var3 = has_timer_expired((Timer *)&serialized_len);
  } while (CONCAT31(extraout_var_04,_Var3) == 0);
  if (iVar6 == -0xd) {
    return NETWORK_DISCONNECTED_ERROR;
  }
LAB_2305042e:
  if (iVar6 == 4) {
    return (IoT_Error_t)iVar6;
  }
  IVar4 = aws_iot_mqtt_set_client_state(pClient,4,3);
  if (iVar6 == 0) {
    return IVar4;
  }
  return (IoT_Error_t)iVar6;
}



IoT_Error_t iot_tls_is_connected(Network *pNetwork)

{
  return NETWORK_PHYSICAL_LAYER_CONNECTED;
}



