pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: info_buf

IoT_Error_t iot_tls_connect(Network *pNetwork,TLSConnectParams *params)

{
  _Bool _Var1;
  mbedtls_ssl_context *ssl;
  size_t len;
  int authmode;
  uint uVar2;
  mbedtls_x509_crt *crt;
  uchar *buf;
  char *__format;
  char *pcVar3;
  uint32_t uVar4;
  char *pcVar5;
  char *pcVar6;
  IoT_Error_t IVar7;
  mbedtls_ssl_config *conf;
  mbedtls_net_context *ctx;
  mbedtls_pk_context *ctx_00;
  mbedtls_x509_crt *crt_00;
  mbedtls_ctr_drbg_context_conflict *ctx_01;
  char acStack312 [4];
  char portBuffer [6];
  char info_buf [256];
  
  if (pNetwork == (Network *)0x0) {
    return NULL_VALUE_ERROR;
  }
  if (params != (TLSConnectParams *)0x0) {
    pcVar3 = params->pRootCALocation;
    pcVar5 = params->pDeviceCertLocation;
    __format = params->pDevicePrivateKeyLocation;
    pcVar6 = params->pDestinationURL;
    uVar4 = params->timeout_ms;
    _Var1 = params->ServerVerificationFlag;
    (pNetwork->tlsConnectParams).DestinationPort = params->DestinationPort;
    (pNetwork->tlsConnectParams).pDestinationURL = pcVar6;
    (pNetwork->tlsConnectParams).pDeviceCertLocation = pcVar5;
    (pNetwork->tlsConnectParams).pDevicePrivateKeyLocation = __format;
    (pNetwork->tlsConnectParams).pRootCALocation = pcVar3;
    (pNetwork->tlsConnectParams).timeout_ms = uVar4;
    (pNetwork->tlsConnectParams).ServerVerificationFlag = _Var1;
  }
  ctx = &(pNetwork->tlsDataParams).server_fd;
  mbedtls_net_init(ctx);
  ssl = (mbedtls_ssl_context *)&(pNetwork->tlsDataParams).ssl;
  mbedtls_ssl_init(ssl);
  conf = (mbedtls_ssl_config *)&(pNetwork->tlsDataParams).conf;
  mbedtls_ssl_config_init(conf);
  ctx_01 = (mbedtls_ctr_drbg_context_conflict *)&(pNetwork->tlsDataParams).ctr_drbg;
  mbedtls_ctr_drbg_init(ctx_01);
  crt_00 = &(pNetwork->tlsDataParams).cacert;
  mbedtls_x509_crt_init(crt_00);
  crt = &(pNetwork->tlsDataParams).clicert;
  mbedtls_x509_crt_init(crt);
  ctx_00 = &(pNetwork->tlsDataParams).pkey;
  mbedtls_pk_init(ctx_00);
  printf("DEBUG Seeding the random number generator...\r\n");
  mbedtls_entropy_init((mbedtls_entropy_context *)&pNetwork->tlsDataParams);
  __format = TAG;
  len = strlen(TAG);
  authmode = mbedtls_ctr_drbg_seed
                       (ctx_01,mbedtls_entropy_func,&pNetwork->tlsDataParams,(uchar *)__format,len);
  if (authmode != 0) {
    printf("ERROR failed! mbedtls_ctr_drbg_seed returned -0x%x\r\n",-authmode);
    return NETWORK_MBEDTLS_ERR_CTR_DRBG_ENTROPY_SOURCE_FAILED;
  }
  if (*(pNetwork->tlsConnectParams).pRootCALocation == '/') {
    printf("DEBUG Loading CA root certificate from file ...\r\n");
    authmode = mbedtls_x509_crt_parse_file(crt_00,(pNetwork->tlsConnectParams).pRootCALocation);
  }
  else {
    printf("DEBUG Loading embedded CA root certificate ...\r\n");
    buf = (uchar *)(pNetwork->tlsConnectParams).pRootCALocation;
    len = strlen((char *)buf);
    authmode = mbedtls_x509_crt_parse(crt_00,buf,len + 1);
  }
  if (authmode < 0) {
    printf("ERROR failed!  mbedtls_x509_crt_parse returned -0x%x while parsing root cert\r\n",
           -authmode);
    return NETWORK_X509_ROOT_CRT_PARSE_ERROR;
  }
  printf("DEBUG ok (%d skipped)\r\n",authmode);
  if (*(pNetwork->tlsConnectParams).pDeviceCertLocation == '/') {
    printf("DEBUG Loading client cert from file...\r\n");
    authmode = mbedtls_x509_crt_parse_file(crt,(pNetwork->tlsConnectParams).pDeviceCertLocation);
  }
  else {
    printf("DEBUG Loading embedded client certificate...\r\n");
    buf = (uchar *)(pNetwork->tlsConnectParams).pDeviceCertLocation;
    len = strlen((char *)buf);
    authmode = mbedtls_x509_crt_parse(crt,buf,len + 1);
  }
  if (authmode != 0) {
    printf("ERROR failed!  mbedtls_x509_crt_parse returned -0x%x while parsing device cert\r\n",
           -authmode);
    return NETWORK_X509_DEVICE_CRT_PARSE_ERROR;
  }
  if (*(pNetwork->tlsConnectParams).pDevicePrivateKeyLocation == '/') {
    printf("DEBUG Loading client private key from file...\r\n");
    authmode = mbedtls_pk_parse_keyfile
                         (ctx_00,(pNetwork->tlsConnectParams).pDevicePrivateKeyLocation,"");
  }
  else {
    printf("DEBUG Loading embedded client private key...\r\n");
    buf = (uchar *)(pNetwork->tlsConnectParams).pDevicePrivateKeyLocation;
    len = strlen((char *)buf);
    authmode = mbedtls_pk_parse_key(ctx_00,buf,len + 1,"",0);
  }
  if (authmode != 0) {
    printf("ERROR failed!  mbedtls_pk_parse_key returned -0x%x while parsing private key\r\n",
           -authmode);
    return NETWORK_PK_PRIVATE_KEY_PARSE_ERROR;
  }
  printf("DEBUG ok\r\n");
  snprintf(acStack312,6,"%d",(uint)(pNetwork->tlsConnectParams).DestinationPort);
  printf("DEBUG Connecting to %s/%s...\r\n",(pNetwork->tlsConnectParams).pDestinationURL,acStack312)
  ;
  authmode = mbedtls_net_connect(ctx,(pNetwork->tlsConnectParams).pDestinationURL,acStack312,0);
  if (authmode != 0) {
    printf("ERROR failed! mbedtls_net_connect returned -0x%x\r\n",-authmode);
    if (authmode == -0x52) {
      return NETWORK_ERR_NET_UNKNOWN_HOST;
    }
    if (authmode == -0x42) {
      return NETWORK_ERR_NET_SOCKET_FAILED;
    }
    return NETWORK_ERR_NET_CONNECT_FAILED;
  }
  authmode = mbedtls_net_set_block(ctx);
  if (authmode != 0) {
    authmode = -authmode;
    __format = "ERROR failed! net_set_(non)block() returned -0x%x\r\n";
LAB_2305072e:
    printf(__format,authmode);
    return SSL_CONNECTION_ERROR;
  }
  printf("DEBUG ok\r\n");
  printf("DEBUG Setting up the SSL/TLS structure...\r\n");
  authmode = mbedtls_ssl_config_defaults(conf,0,0,0);
  if (authmode != 0) {
    authmode = -authmode;
    __format = "ERROR failed! mbedtls_ssl_config_defaults returned -0x%x\r\n";
    goto LAB_2305072e;
  }
  mbedtls_ssl_conf_verify(conf,_iot_tls_verify_cert,(void *)0x0);
  authmode = 2;
  if ((pNetwork->tlsConnectParams).ServerVerificationFlag == false) {
    authmode = 1;
  }
  mbedtls_ssl_conf_authmode(conf,authmode);
  mbedtls_ssl_conf_rng(conf,mbedtls_ctr_drbg_random,ctx_01);
  mbedtls_ssl_conf_ca_chain(conf,crt_00,(mbedtls_x509_crl *)0x0);
  authmode = mbedtls_ssl_conf_own_cert(conf,crt,ctx_00);
  if (authmode != 0) {
    __format = "ERROR failed! mbedtls_ssl_conf_own_cert returned %d\r\n";
    goto LAB_2305072e;
  }
  mbedtls_ssl_conf_read_timeout(conf,(pNetwork->tlsConnectParams).timeout_ms);
  if ((pNetwork->tlsConnectParams).DestinationPort == 0x1bb) {
    stack0xfffffed0 = "x-amzn-mqtt-ca";
    authmode = mbedtls_ssl_conf_alpn_protocols(conf,(char **)(portBuffer + 4));
    if (authmode != 0) {
      authmode = -authmode;
      __format = "ERROR failed! mbedtls_ssl_conf_alpn_protocols returned -0x%x\r\n";
      goto LAB_2305072e;
    }
  }
  authmode = mbedtls_ssl_setup(ssl,conf);
  if (authmode != 0) {
    authmode = -authmode;
    __format = "ERROR failed! mbedtls_ssl_setup returned -0x%x\r\n";
    goto LAB_2305072e;
  }
  authmode = mbedtls_ssl_set_hostname(ssl,(pNetwork->tlsConnectParams).pDestinationURL);
  if (authmode != 0) {
    __format = "ERROR failed! mbedtls_ssl_set_hostname returned %d\r\n";
    goto LAB_2305072e;
  }
  printf("DEBUG SSL state connect : %d \r\n",(pNetwork->tlsDataParams).ssl.state);
  mbedtls_ssl_set_bio(ssl,ctx,mbedtls_net_send,(mbedtls_ssl_recv_t *)0x0,mbedtls_net_recv_timeout);
  printf("DEBUG ok\r\n");
  printf("DEBUG SSL state connect : %d \r\n",(pNetwork->tlsDataParams).ssl.state);
  printf("DEBUG Performing the SSL/TLS handshake...\r\n");
  while( true ) {
    uVar2 = mbedtls_ssl_handshake(ssl);
    IVar7 = (IoT_Error_t)uVar2;
    if (uVar2 == 0) break;
    if ((uVar2 & 0xffffff7f) != 0xffff9700) {
      printf("ERROR failed! mbedtls_ssl_handshake returned -0x%x\r\n",-uVar2);
      if (uVar2 != 0xffffd900) {
        return SSL_CONNECTION_ERROR;
      }
      printf("ERROR     Unable to verify the server\'s certificate. \r\n");
      return SSL_CONNECTION_ERROR;
    }
  }
  __format = mbedtls_ssl_get_version(ssl);
  pcVar3 = mbedtls_ssl_get_ciphersuite(ssl);
  printf("DEBUG ok [ Protocol is %s ]    [ Ciphersuite is %s ]\r\n",__format,pcVar3);
  authmode = mbedtls_ssl_get_record_expansion(ssl);
  if (authmode < 0) {
    printf("DEBUG  [ Record expansion is unknown (compression) ]\r\n",authmode);
  }
  else {
    printf("DEBUG  [ Record expansion is %d ]\r\n",authmode);
  }
  printf("DEBUG Verifying peer X.509 certificate...\r\n");
  if ((pNetwork->tlsConnectParams).ServerVerificationFlag == false) {
    __format = "WARNN  Server Verification skipped\r\n";
  }
  else {
    uVar4 = mbedtls_ssl_get_verify_result(ssl);
    (pNetwork->tlsDataParams).flags = uVar4;
    if (uVar4 != 0) {
      printf("ERROR failed\r\n");
      mbedtls_x509_crt_verify_info(portBuffer + 4,0x100,"  ! ",(pNetwork->tlsDataParams).flags);
      printf("ERROR %s\r\n",portBuffer + 4);
      IVar7 = SSL_CONNECTION_ERROR;
      goto LAB_23050902;
    }
    __format = "DEBUG ok\r\n";
  }
  printf(__format);
LAB_23050902:
  crt = mbedtls_ssl_get_peer_cert(ssl);
  if (crt == (mbedtls_x509_crt *)0x0) {
    return IVar7;
  }
  printf("DEBUG Peer certificate information:\r\n");
  crt = mbedtls_ssl_get_peer_cert(ssl);
  mbedtls_x509_crt_info(portBuffer + 4,0xff,"      ",crt);
  printf("DEBUG %s\r\n",portBuffer + 4);
  return IVar7;
}



int _iot_tls_verify_cert(void *data,mbedtls_x509_crt *crt,int depth,uint32_t *flags)

{
  char acStack272 [4];
  char buf [256];
  
  printf("DEBUG Verify requested for (Depth %d):\r\n",depth);
  mbedtls_x509_crt_info(acStack272,0xff,"",crt);
  printf("DEBUG %s\r\n",acStack272);
  if (*flags == 0) {
    printf("DEBUG   This certificate has no flags\r\n");
  }
  else {
    printf("DEBUG Verify result:%s\r\n",acStack272);
  }
  return 0;
}



IoT_Error_t iot_tls_write(Network *pNetwork,uchar *pMsg,size_t len,Timer *timer,size_t *written_len)

{
  uint uVar1;
  int iVar2;
  _Bool _Var3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  IoT_Error_t IVar4;
  
  iVar2 = 0;
  uVar1 = 0;
  do {
    if ((len <= uVar1) || (_Var3 = has_timer_expired(timer), CONCAT31(extraout_var,_Var3) != 0)) {
      *written_len = uVar1;
      _Var3 = has_timer_expired(timer);
      IVar4 = SUCCESS;
      if ((CONCAT31(extraout_var_01,_Var3) != 0) && (IVar4 = SUCCESS, uVar1 != len)) {
        IVar4 = NETWORK_SSL_WRITE_TIMEOUT_ERROR;
      }
      return IVar4;
    }
    while ((_Var3 = has_timer_expired(timer), CONCAT31(extraout_var_00,_Var3) == 0 &&
           (iVar2 = mbedtls_ssl_write((mbedtls_ssl_context *)&(pNetwork->tlsDataParams).ssl,
                                      pMsg + uVar1,len - uVar1), iVar2 < 1))) {
      if ((iVar2 != -0x6900) && (iVar2 != -0x6880)) {
        printf("ERROR failed! mbedtls_ssl_write returned -0x%x\r\n",-iVar2);
        *written_len = uVar1;
        return NETWORK_SSL_WRITE_ERROR;
      }
    }
    uVar1 = uVar1 + iVar2;
  } while( true );
}



