pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
IoT_Error_t iot_tls_read(Network *pNetwork,uchar *pMsg,size_t len,Timer *timer,size_t *read_len)

{
  IoT_Error_t IVar1;
  _Bool _Var2;
  uint32_t timeout;
  uint32_t uVar3;
  uint uVar4;
  undefined3 extraout_var;
  uint timeout_00;
  size_t sVar5;
  mbedtls_ssl_config *conf;
  
  timeout_00 = (pNetwork->tlsDataParams).conf.read_timeout;
  conf = (mbedtls_ssl_config *)&(pNetwork->tlsDataParams).conf;
  sVar5 = 0;
  do {
    if (len == 0) goto LAB_23050b08;
    timeout = left_ms(timer);
    uVar3 = timeout_00;
    if (timeout <= timeout_00) {
      uVar3 = left_ms(timer);
    }
    timeout = 1;
    if ((uVar3 != 0) && (uVar3 = left_ms(timer), timeout = timeout_00, uVar3 <= timeout_00)) {
      timeout = left_ms(timer);
    }
    mbedtls_ssl_conf_read_timeout(conf,timeout);
    uVar4 = mbedtls_ssl_read((mbedtls_ssl_context *)&(pNetwork->tlsDataParams).ssl,pMsg,len);
    mbedtls_ssl_conf_read_timeout(conf,timeout_00);
    if ((int)uVar4 < 1) {
      if ((uVar4 == 0) || (((uVar4 & 0xffffff7f) != 0xffff9700 && (uVar4 != 0xffff9800)))) {
        return NETWORK_SSL_READ_ERROR;
      }
    }
    else {
      sVar5 = sVar5 + uVar4;
      pMsg = pMsg + uVar4;
      len = len - uVar4;
    }
    _Var2 = has_timer_expired(timer);
  } while (CONCAT31(extraout_var,_Var2) == 0);
  if (len == 0) {
LAB_23050b08:
    *read_len = sVar5;
    IVar1 = SUCCESS;
  }
  else {
    IVar1 = NETWORK_SSL_NOTHING_TO_READ;
    if (sVar5 != 0) {
      IVar1 = NETWORK_SSL_READ_TIMEOUT_ERROR;
    }
  }
  return IVar1;
}



IoT_Error_t iot_tls_disconnect(Network *pNetwork)

{
  int iVar1;
  
  do {
    iVar1 = mbedtls_ssl_close_notify((mbedtls_ssl_context *)&(pNetwork->tlsDataParams).ssl);
  } while (iVar1 == -0x6880);
  return SUCCESS;
}



IoT_Error_t iot_tls_destroy(Network *pNetwork)

{
  mbedtls_net_free(&(pNetwork->tlsDataParams).server_fd);
  mbedtls_x509_crt_free(&(pNetwork->tlsDataParams).clicert);
  mbedtls_x509_crt_free(&(pNetwork->tlsDataParams).cacert);
  mbedtls_pk_free(&(pNetwork->tlsDataParams).pkey);
  mbedtls_ssl_free((mbedtls_ssl_context *)&(pNetwork->tlsDataParams).ssl);
  mbedtls_ssl_config_free((mbedtls_ssl_config *)&(pNetwork->tlsDataParams).conf);
  mbedtls_ctr_drbg_free((mbedtls_ctr_drbg_context_conflict *)&(pNetwork->tlsDataParams).ctr_drbg);
  mbedtls_entropy_free((mbedtls_entropy_context *)&pNetwork->tlsDataParams);
  return SUCCESS;
}



IoT_Error_t
iot_tls_init(Network *pNetwork,char *pRootCALocation,char *pDeviceCertLocation,
            char *pDevicePrivateKeyLocation,char *pDestinationURL,uint16_t destinationPort,
            uint32_t timeout_ms,_Bool ServerVerificationFlag)

{
  (pNetwork->tlsConnectParams).DestinationPort = destinationPort;
  pNetwork->connect = iot_tls_connect;
  pNetwork->read = iot_tls_read;
  pNetwork->write = iot_tls_write;
  pNetwork->disconnect = iot_tls_disconnect;
  pNetwork->isConnected = iot_tls_is_connected;
  (pNetwork->tlsConnectParams).pDestinationURL = pDestinationURL;
  (pNetwork->tlsConnectParams).pDeviceCertLocation = pDeviceCertLocation;
  (pNetwork->tlsConnectParams).pDevicePrivateKeyLocation = pDevicePrivateKeyLocation;
  (pNetwork->tlsConnectParams).pRootCALocation = pRootCALocation;
  (pNetwork->tlsConnectParams).timeout_ms = timeout_ms;
  (pNetwork->tlsConnectParams).ServerVerificationFlag = ServerVerificationFlag;
  pNetwork->destroy = iot_tls_destroy;
  (pNetwork->tlsDataParams).flags = 0;
  return SUCCESS;
}



IoT_Error_t aws_iot_thread_mutex_init(IoT_Mutex_t *pMutex)

{
  IoT_Error_t IVar1;
  QueueHandle_t pQVar2;
  
  pQVar2 = xQueueCreateMutex('\x04');
  *(QueueHandle_t *)&pMutex->mutex = pQVar2;
  if (pQVar2 == (QueueHandle_t)0x0) {
    IVar1 = MUTEX_INIT_ERROR;
  }
  else {
    IVar1 = SUCCESS;
  }
  return IVar1;
}



IoT_Error_t aws_iot_thread_mutex_lock(IoT_Mutex_t *pMutex)

{
  xQueueTakeMutexRecursive((QueueHandle_t)pMutex->mutex,0xffffffff);
  return SUCCESS;
}



IoT_Error_t aws_iot_thread_mutex_trylock(IoT_Mutex_t *pMutex)

{
  IoT_Error_t IVar1;
  BaseType_t BVar2;
  
  BVar2 = xQueueTakeMutexRecursive((QueueHandle_t)pMutex->mutex,0);
  if (BVar2 == 0) {
    IVar1 = MUTEX_LOCK_ERROR;
  }
  else {
    IVar1 = SUCCESS;
  }
  return IVar1;
}



IoT_Error_t aws_iot_thread_mutex_unlock(IoT_Mutex_t *pMutex)

{
  IoT_Error_t IVar1;
  BaseType_t BVar2;
  
  BVar2 = xQueueGiveMutexRecursive((QueueHandle_t)pMutex->mutex);
  if (BVar2 == 0) {
    IVar1 = MUTEX_UNLOCK_ERROR;
  }
  else {
    IVar1 = SUCCESS;
  }
  return IVar1;
}



IoT_Error_t aws_iot_thread_mutex_destroy(IoT_Mutex_t *pMutex)

{
  vQueueDelete((QueueHandle_t)pMutex->mutex);
  return SUCCESS;
}



// WARNING: Variable defined which should be unmapped: byteRead

IoT_Error_t
_aws_iot_mqtt_internal_readWrapper
          (AWS_IoT_Client *pClient,size_t offset,size_t size,Timer *pTimer,size_t *read_len)

{
  IoT_Error_t IVar1;
  size_t sVar2;
  size_t sVar3;
  size_t sStack20;
  size_t byteRead;
  
  sVar3 = (pClient->clientData).readBufIndex;
  sStack20 = 0;
  sVar2 = (offset - sVar3) + size;
  if ((int)sVar2 < 1) {
    *read_len = size;
    IVar1 = SUCCESS;
  }
  else {
    IVar1 = (*(pClient->networkStack).read)
                      ((Network *)&pClient->networkStack,(pClient->clientData).readBuf + sVar3,sVar2
                       ,pTimer,&sStack20);
    sStack20 = sStack20 + (pClient->clientData).readBufIndex;
    (pClient->clientData).readBufIndex = sStack20;
    *read_len = sStack20 - offset;
  }
  return IVar1;
}



size_t aws_iot_mqtt_internal_write_len_to_buffer(uchar *buf,uint32_t length)

{
  bool bVar1;
  byte bVar2;
  size_t sVar3;
  size_t sVar4;
  
  sVar3 = 0;
  do {
    bVar2 = (byte)length & 0x7f;
    if (0x7f < length) {
      bVar2 = bVar2 | 0x80;
    }
    sVar4 = sVar3 + 1;
    buf[sVar3] = bVar2;
    bVar1 = 0x7f < length;
    length = length >> 7;
    sVar3 = sVar4;
  } while (bVar1);
  return sVar4;
}



IoT_Error_t
aws_iot_mqtt_internal_decode_remaining_length_from_buffer
          (uchar *buf,uint32_t *decodedLen,uint32_t *readBytesLen)

{
  byte bVar1;
  int iVar2;
  uint32_t uVar3;
  int iVar4;
  
  *decodedLen = 0;
  iVar2 = 1;
  uVar3 = 0;
  do {
    uVar3 = uVar3 + 1;
    if (uVar3 == 5) {
      return MQTT_DECODE_REMAINING_LENGTH_ERROR;
    }
    bVar1 = buf[uVar3];
    iVar4 = ((uint)bVar1 & 0x7f) * iVar2;
    iVar2 = iVar2 << 7;
    *decodedLen = *decodedLen + iVar4;
    uVar3 = uVar3;
  } while ((char)bVar1 < '\0');
  *readBytesLen = uVar3;
  return SUCCESS;
}



uint32_t aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(uint32_t rem_len)

{
  uint32_t uVar1;
  uint uVar2;
  
  uVar2 = rem_len + 1;
  if (uVar2 < 0x80) {
    return rem_len + 2;
  }
  if (uVar2 < 0x4000) {
    return rem_len + 3;
  }
  uVar1 = rem_len + 5;
  if (uVar2 < 0x200000) {
    uVar1 = rem_len + 4;
  }
  return uVar1;
}



uint16_t aws_iot_mqtt_internal_read_uint16_t(uchar **pptr)

{
  uchar uVar1;
  uchar uVar2;
  uchar *puVar3;
  
  puVar3 = *pptr;
  uVar1 = *puVar3;
  uVar2 = puVar3[1];
  *pptr = puVar3 + 2;
  return CONCAT11(uVar1,uVar2);
}



void aws_iot_mqtt_internal_write_uint_16(uchar **pptr,uint16_t anInt)

{
  uchar *puVar1;
  
  **pptr = (uchar)(anInt >> 8);
  puVar1 = *pptr;
  *pptr = puVar1 + 1;
  puVar1[1] = (uchar)anInt;
  *pptr = *pptr + 1;
  return;
}



uchar aws_iot_mqtt_internal_read_char(uchar **pptr)

{
  uchar uVar1;
  
  uVar1 = **pptr;
  *pptr = *pptr + 1;
  return uVar1;
}



void aws_iot_mqtt_internal_write_char(uchar **pptr,uchar c)

{
  **pptr = c;
  *pptr = *pptr + 1;
  return;
}



