pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void aws_iot_mqtt_internal_write_utf8_string(uchar **pptr,char *string,uint16_t stringLen)

{
  undefined2 in_register_00002032;
  size_t __n;
  
  __n = CONCAT22(in_register_00002032,stringLen);
  aws_iot_mqtt_internal_write_uint_16(pptr,stringLen);
  if (__n != 0) {
    memcpy(*pptr,string,__n);
    *pptr = *pptr + __n;
  }
  return;
}



IoT_Error_t
aws_iot_mqtt_internal_init_header
          (MQTTHeader *pHeader,MessageTypes message_type,QoS qos,uint8_t dup,uint8_t retained)

{
  uint uVar1;
  undefined3 in_register_00002031;
  byte bVar2;
  undefined3 in_register_00002039;
  IoT_Error_t IVar3;
  
  IVar3 = NULL_VALUE_ERROR;
  if (pHeader != (MQTTHeader *)0x0) {
    *pHeader = 0;
    uVar1 = (uint)(byte)message_type - 1 & 0xff;
    IVar3 = FAILURE;
    if (uVar1 < 0xe) {
      bVar2 = dup << 3 | CSWTCH_27[uVar1] << 4;
      if (CONCAT31(in_register_00002031,qos) == 1) {
        bVar2 = bVar2 | 2;
      }
      *pHeader = bVar2;
      *pHeader = CONCAT31(in_register_00002039,retained) == 1 | *pHeader;
      IVar3 = SUCCESS;
    }
  }
  return IVar3;
}



IoT_Error_t aws_iot_mqtt_internal_send_packet(AWS_IoT_Client *pClient,size_t length,Timer *pTimer)

{
  IoT_Error_t IVar1;
  _Bool _Var2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  uint uVar3;
  IoT_Mutex_t *pMutex;
  size_t sStack36;
  size_t sentLen;
  
  if ((pClient != (AWS_IoT_Client *)0x0) && (pTimer != (Timer *)0x0)) {
    IVar1 = MQTT_TX_BUFFER_TOO_SHORT_ERROR;
    if (length < (pClient->clientData).writeBufSize) {
      pMutex = &(pClient->clientData).tls_write_mutex;
      IVar1 = aws_iot_mqtt_client_lock_mutex(pClient,pMutex);
      if (CONCAT31(extraout_var,IVar1) == 0) {
        sStack36 = 0;
        uVar3 = 0;
        while (((uVar3 < length &&
                (_Var2 = has_timer_expired(pTimer), CONCAT31(extraout_var_00,_Var2) == 0)) &&
               (IVar1 = (*(pClient->networkStack).write)
                                  ((Network *)&pClient->networkStack,
                                   (pClient->clientData).writeBuf + uVar3,length - uVar3,pTimer,
                                   &sStack36), CONCAT31(extraout_var_01,IVar1) == 0))) {
          uVar3 = uVar3 + sStack36;
        }
        IVar1 = aws_iot_mqtt_client_unlock_mutex(pClient,pMutex);
      }
    }
    return IVar1;
  }
  return NULL_VALUE_ERROR;
}



// WARNING: Could not reconcile some variable overlaps

IoT_Error_t
aws_iot_mqtt_internal_cycle_read(AWS_IoT_Client *pClient,Timer *pTimer,uint8_t *pPacketType)

{
  byte bVar1;
  char cVar2;
  ushort uVar3;
  char *pcVar4;
  IoT_Error_t IVar5;
  uint __n;
  MessageHandlers_conflict40 *pMVar6;
  IoT_Error_t IVar7;
  ClientState CVar8;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  undefined3 extraout_var_04;
  undefined3 extraout_var_05;
  undefined3 extraout_var_06;
  undefined3 extraout_var_07;
  char *pcVar9;
  int iVar10;
  char *__s1;
  size_t sVar11;
  char *pcVar12;
  char *pcVar13;
  IoT_Mutex_t *pMutex;
  size_t offset;
  int iVar14;
  uchar *in_fa0;
  uchar *extraout_fa0;
  size_t in_fa1;
  size_t extraout_fa1;
  uint16_t uStack74;
  uint16_t topicNameLen;
  char *pcStack72;
  size_t read_len;
  size_t read_len_1;
  Timer packetTimer;
  
  IVar7 = NULL_VALUE_ERROR;
  if ((pClient != (AWS_IoT_Client *)0x0) && (pTimer != (Timer *)0x0)) {
    pMutex = &(pClient->clientData).tls_read_mutex;
    IVar7 = aws_iot_mqtt_client_lock_mutex(pClient,pMutex);
    if (CONCAT31(extraout_var,IVar7) == 0) {
      init_timer((Timer *)&read_len_1);
      countdown_ms((Timer *)&read_len_1,(pClient->clientData).packetTimeoutMs);
      pcStack72 = (char *)0x0;
      IVar7 = _aws_iot_mqtt_internal_readWrapper(pClient,0,1,pTimer,(size_t *)&stack0xffffffb8);
      __n = CONCAT31(extraout_var_00,IVar7);
      if (__n == 0xffffffe7) {
        __n = 2;
      }
      else {
        if (__n == 0) {
          __s1 = (char *)0x0;
          iVar14 = 1;
          offset = 0;
          do {
            sVar11 = offset;
            offset = sVar11 + 1;
            if (offset == 5) {
              __n = 0xffffffdd;
              goto LAB_2305102e;
            }
            IVar7 = _aws_iot_mqtt_internal_readWrapper(pClient,offset,1,pTimer,&read_len);
            __n = CONCAT31(extraout_var_01,IVar7);
            if (__n != 0) goto LAB_2305102e;
            bVar1 = (pClient->clientData).readBuf[sVar11 + 1];
            iVar10 = ((uint)bVar1 & 0x7f) * iVar14;
            iVar14 = iVar14 << 7;
            __s1 = __s1 + iVar10;
          } while ((char)bVar1 < '\0');
          pcVar13 = (char *)(pClient->clientData).readBufSize;
          if (__s1 + sVar11 + 2 < pcVar13) {
            if ((__s1 == (char *)0x0) ||
               ((IVar7 = _aws_iot_mqtt_internal_readWrapper
                                   (pClient,sVar11 + 2,(size_t)__s1,pTimer,
                                    (size_t *)&stack0xffffffb8),
                CONCAT31(extraout_var_04,IVar7) == 0 && (pcStack72 == __s1)))) {
              (pClient->clientData).readBufIndex = 0;
              *pPacketType = (pClient->clientData).readBuf[0] >> 4;
            }
            else {
              __n = 0xffffffff;
            }
          }
          else {
            pcVar12 = (char *)0x0;
            do {
              IVar7 = (*(pClient->networkStack).read)
                                ((Network *)&pClient->networkStack,(pClient->clientData).readBuf,
                                 (size_t)pcVar13,pTimer,(size_t *)&stack0xffffffb8);
              __n = CONCAT31(extraout_var_02,IVar7);
              in_fa0 = extraout_fa0;
              in_fa1 = extraout_fa1;
              if (__n != 0) {
                if (pcVar12 < __s1) goto LAB_2305102e;
                break;
              }
              pcVar12 = pcVar12 + (int)pcStack72;
              pcVar9 = (char *)(pClient->clientData).readBufSize;
              pcVar13 = __s1 + -(int)pcVar12;
              if (pcVar9 < __s1 + -(int)pcVar12) {
                pcVar13 = pcVar9;
              }
            } while (pcVar12 < __s1);
            if (__s1 == pcVar12) {
              (pClient->clientData).readBufIndex = 0;
              __n = 0xffffffe0;
            }
          }
        }
      }
LAB_2305102e:
      IVar5 = (IoT_Error_t)__n;
      IVar7 = aws_iot_mqtt_client_unlock_mutex(pClient,pMutex);
      if (CONCAT31(extraout_var_03,IVar7) == 0) {
        if (__n == 2) {
          return SUCCESS;
        }
        if (__n != 0) {
          return IVar5;
        }
        if (0xb < ((uint)*pPacketType - 2 & 0xff)) {
          return MQTT_RX_MESSAGE_PACKET_TYPE_INVALID_ERROR;
        }
        __n = 1 << ((uint)*pPacketType - 2 & 0x1f);
        if ((__n & 0x2ad) != 0) {
          return IVar5;
        }
        if ((int)(__n << 0x14) < 0) {
          uVar3 = (pClient->clientData).keepAliveInterval;
          (pClient->clientStatus).isPingOutstanding = false;
          countdown_sec((Timer *)pClient,(uint)uVar3);
          return IVar5;
        }
        if ((__n & 2) == 0) {
          return MQTT_RX_MESSAGE_PACKET_TYPE_INVALID_ERROR;
        }
        pcStack72 = (char *)0x0;
        uStack74 = 0;
        read_len = 0;
        IVar7 = aws_iot_mqtt_internal_deserialize_publish
                          ((uint8_t *)((int)&read_len_1 + 2),(QoS *)&read_len_1,
                           (uint8_t *)((int)&read_len_1 + 1),(uint16_t *)&packetTimer,
                           (char **)&stack0xffffffb8,&uStack74,(uchar **)&packetTimer.timeout_ticks,
                           &packetTimer.last_polled_ticks,in_fa0,in_fa1);
        __s1 = pcStack72;
        uVar3 = uStack74;
        if (CONCAT31(extraout_var_05,IVar7) != 0) {
          return IVar7;
        }
        __n = (uint)uStack74;
        if (pcStack72 == (char *)0x0) {
          return NULL_VALUE_ERROR;
        }
        CVar8 = aws_iot_mqtt_get_client_state(pClient);
        aws_iot_mqtt_set_client_state(pClient,CONCAT31(extraout_var_06,CVar8),9);
        pMVar6 = (pClient->clientData).messageHandlers;
        pcVar13 = __s1 + __n;
        do {
          if (pMVar6->topicName != (char *)0x0) {
            if (((uint)pMVar6->topicNameLen == __n) &&
               (iVar14 = strncmp(__s1,pMVar6->topicName,__n), iVar14 == 0)) {
LAB_2305118e:
              if (pMVar6->pApplicationHandler != (pApplicationHandler_t *)0x0) {
                (*pMVar6->pApplicationHandler)
                          (pClient,__s1,uVar3,(IoT_Publish_Message_Params *)&read_len_1,
                           pMVar6->pApplicationHandlerData);
              }
            }
            else {
              pcVar9 = pMVar6->topicName;
              pcVar12 = __s1;
              if (pcVar9 != (char *)0x0) {
                while (cVar2 = *pcVar9, cVar2 != '\0') {
                  if (pcVar13 <= pcVar12) goto LAB_23051140;
                  if (*pcVar12 == '/') {
                    if (cVar2 != '/') goto LAB_23051140;
                  }
                  else {
                    pcVar4 = pcVar12;
                    if (cVar2 == '+') {
                      do {
                        pcVar12 = pcVar4;
                        if (pcVar13 == pcVar12 + 1) break;
                        pcVar4 = pcVar12 + 1;
                      } while (pcVar12[1] != '/');
                    }
                    else {
                      if (cVar2 == '#') {
                        pcVar12 = pcVar13 + -1;
                      }
                      else {
                        if (*pcVar12 != cVar2) goto LAB_23051140;
                      }
                    }
                  }
                  pcVar9 = pcVar9 + 1;
                  pcVar12 = pcVar12 + 1;
                }
                if (pcVar13 == pcVar12) goto LAB_2305118e;
              }
            }
          }
LAB_23051140:
          pMVar6 = pMVar6 + 1;
        } while ((MessageHandlers_conflict40 *)&(pClient->clientData).disconnectHandler != pMVar6);
        iVar14 = aws_iot_mqtt_set_client_state(pClient,9,CONCAT31(extraout_var_06,CVar8));
        if (iVar14 != 0) {
          return (IoT_Error_t)iVar14;
        }
        if ((QoS)read_len_1 == QOS0) {
          return (IoT_Error_t)iVar14;
        }
        IVar7 = aws_iot_mqtt_internal_serialize_ack
                          ((pClient->clientData).writeBuf,(pClient->clientData).writeBufSize,PUBACK,
                           '\0',(uint16_t)packetTimer.start_ticks,&read_len);
        if (CONCAT31(extraout_var_07,IVar7) != 0) {
          return IVar7;
        }
        IVar7 = aws_iot_mqtt_internal_send_packet(pClient,read_len,pTimer);
      }
      else {
        if ((__n & 0xfd) != 0) {
          return IVar5;
        }
      }
    }
  }
  return IVar7;
}



IoT_Error_t aws_iot_mqtt_internal_flushBuffers(AWS_IoT_Client *pClient)

{
  (pClient->clientData).readBufIndex = 0;
  return SUCCESS;
}



