pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Variable defined which should be unmapped: read_packet_type

IoT_Error_t
aws_iot_mqtt_internal_wait_for_read(AWS_IoT_Client *pClient,uint8_t packetType,Timer *pTimer)

{
  IoT_Error_t IVar1;
  _Bool _Var2;
  byte bVar3;
  undefined3 extraout_var;
  undefined3 in_register_0000202d;
  byte abStack17 [4];
  uint8_t read_packet_type;
  
  if (pClient == (AWS_IoT_Client *)0x0) {
    return NULL_VALUE_ERROR;
  }
  IVar1 = NULL_VALUE_ERROR;
  if (pTimer != (Timer *)0x0) {
    abStack17[0] = 0;
    while (_Var2 = has_timer_expired(pTimer), CONCAT31(extraout_var,_Var2) == 0) {
      bVar3 = aws_iot_mqtt_internal_cycle_read(pClient,pTimer,abStack17);
      if ((bVar3 & 0xfd) != 0) {
        return bVar3;
      }
      if ((uint)abStack17[0] == CONCAT31(in_register_0000202d,packetType)) {
        return bVar3;
      }
    }
    IVar1 = MQTT_REQUEST_TIMEOUT_ERROR;
  }
  return IVar1;
}



// WARNING: Variable defined which should be unmapped: ptr

IoT_Error_t
aws_iot_mqtt_internal_serialize_zero
          (uchar *pTxBuf,size_t txBufLen,MessageTypes packetType,size_t *pSerializedLength)

{
  IoT_Error_t IVar1;
  undefined3 extraout_var;
  size_t sVar2;
  uchar auStack24 [4];
  MQTTHeader header;
  uchar *ptr;
  
  auStack24[0] = '\0';
  IVar1 = NULL_VALUE_ERROR;
  if (((pTxBuf != (uchar *)0x0) && (pSerializedLength != (size_t *)0x0)) &&
     (IVar1 = MQTT_TX_BUFFER_TOO_SHORT_ERROR, 3 < txBufLen)) {
    _header = pTxBuf;
    IVar1 = aws_iot_mqtt_internal_init_header(auStack24,packetType,QOS0,'\0','\0');
    if (CONCAT31(extraout_var,IVar1) == 0) {
      aws_iot_mqtt_internal_write_char((uchar **)&header,auStack24[0]);
      sVar2 = aws_iot_mqtt_internal_write_len_to_buffer(_header,0);
      *(uchar **)pSerializedLength = _header + (sVar2 - (int)pTxBuf);
    }
  }
  return IVar1;
}



size_t format_int(char *q,size_t n,uint flags,int base,int width,int prec)

{
  char "0123456789abcdef" [17];
  char "0123456789ABCDEF" [17];
  int iVar1;
  uint uVar2;
  uint uVar3;
  char cVar4;
  uint uVar5;
  uint uVar6;
  int in_a6;
  int in_a7;
  int iVar7;
  int iVar8;
  uint uVar9;
  char *pcVar10;
  int iVar11;
  char *pcStack84;
  
  if ((width & 0x80U) == 0) {
    pcStack84 = "0123456789abcdef";
  }
  else {
    pcStack84 = "0123456789ABCDEF";
  }
  uVar9 = 0;
  if (((width & 0x40U) != 0) && (base < 0)) {
    flags = -flags;
    base = -(uint)(flags != 0) - base;
    uVar9 = 1;
  }
  iVar7 = 0;
  uVar2 = flags;
  uVar6 = base;
  while ((uVar2 | uVar6) != 0) {
    __udivdi3();
    iVar7 = iVar7 + 1;
  }
  uVar2 = width & 0x20;
  if ((uVar2 == 0) || (prec != 8)) {
LAB_23051346:
    if ((in_a7 <= iVar7) && (in_a7 = iVar7, (flags | base) == 0)) {
      in_a7 = 1;
    }
  }
  else {
    if (in_a7 <= iVar7) {
      in_a7 = iVar7 + 1;
      goto LAB_23051346;
    }
  }
  iVar7 = in_a7;
  if (((width & 8U) != 0) && (iVar7 = 4, prec != 0x10)) {
    iVar7 = 3;
  }
  iVar8 = (in_a7 + -1) / iVar7 + in_a7;
  iVar1 = (uint)((width & 0x14U | uVar9) != 0) + iVar8;
  if ((uVar2 != 0) && (prec == 0x10)) {
    iVar1 = iVar1 + 2;
  }
  uVar3 = width & 3;
  uVar6 = 0;
  if ((uVar3 == 0) && (uVar6 = uVar3, iVar1 < in_a6)) {
    uVar6 = in_a6 - iVar1;
    uVar5 = 0;
    do {
      if (uVar5 < n) {
        *q = ' ';
        q = q + 1;
      }
      uVar5 = uVar5 + 1;
      in_a6 = iVar1;
    } while (uVar5 != uVar6);
  }
  if (uVar9 == 0) {
    if ((width & 4U) == 0) {
      if ((width & 0x10U) == 0) goto LAB_230513c8;
      if (uVar6 < n) {
        *q = ' ';
        q = q + 1;
      }
    }
    else {
      if (uVar6 < n) {
        *q = '+';
        q = q + 1;
      }
    }
  }
  else {
    if (uVar6 < n) {
      *q = '-';
      q = q + 1;
    }
  }
  uVar6 = uVar6 + 1;
LAB_230513c8:
  if ((uVar2 != 0) && (prec == 0x10)) {
    if (uVar6 < n) {
      *q = '0';
      q = q + 1;
    }
    if (uVar6 + 1 < n) {
      cVar4 = 'X';
      if ((width & 0x80U) == 0) {
        cVar4 = 'x';
      }
      *q = cVar4;
      q = q + 1;
    }
    uVar6 = uVar6 + 2;
  }
  if ((uVar3 == 1) && (iVar8 < in_a6)) {
    while (iVar1 < in_a6) {
      if (uVar6 < n) {
        *q = '0';
        q = q + 1;
      }
      uVar6 = uVar6 + 1;
      in_a6 = in_a6 + -1;
    }
  }
  uVar6 = iVar8 + uVar6;
  q = q + iVar8;
  pcVar10 = q;
  uVar9 = uVar6;
  iVar11 = iVar7;
  while (0 < iVar8) {
    if (iVar11 == 0) {
      uVar9 = uVar9 - 1;
      if (uVar9 < n) {
        pcVar10[-1] = '_';
      }
      pcVar10 = pcVar10 + -1;
      iVar8 = iVar8 + -1;
      iVar11 = iVar7;
    }
    iVar11 = iVar11 + -1;
    uVar9 = uVar9 - 1;
    iVar8 = iVar8 + -1;
    if (uVar9 < n) {
      uVar2 = flags;
      __umoddi3();
      pcVar10[-1] = pcStack84[uVar2];
    }
    __udivdi3();
    pcVar10 = pcVar10 + -1;
  }
  iVar7 = in_a6 + uVar6;
  while (((width & 2U) != 0 && (iVar1 < (int)(iVar7 - uVar6)))) {
    if (uVar6 < n) {
      *q = ' ';
      q = q + 1;
    }
    uVar6 = uVar6 + 1;
  }
  return uVar6;
}



char * cvt(int ndigits,int *decpt,int *sign,char *buf,int eflag)

{
  int *piVar1;
  byte *pbVar2;
  __gcc_CMPtype _Var3;
  double *__iptr;
  SItype SVar4;
  byte *in_a5;
  byte *pbVar5;
  int in_a6;
  byte *pbVar6;
  byte *pbVar7;
  double in_fa1;
  double *pdStack80;
  double fi;
  double fj;
  
  piVar1 = (int *)0x4e;
  if (((int)sign < 0x4f) && (piVar1 = sign, (int)sign < 0)) {
    piVar1 = (int *)0x0;
  }
  _Var3 = __ledf2();
  if (_Var3 < 0) {
    *(undefined4 *)eflag = 1;
  }
  else {
    *(undefined4 *)eflag = 0;
  }
  modf(in_fa1,(double *)ndigits);
  pbVar6 = in_a5 + 0x50;
  _Var3 = __eqdf2();
  pbVar2 = pbVar6;
  pbVar5 = in_a5;
  if (_Var3 == 0) {
    _Var3 = __gedf2();
    pbVar7 = (byte *)0x0;
    if (0 < _Var3) {
      while( true ) {
        __iptr = (double *)ndigits;
        __muldf3();
        _Var3 = __ledf2();
        if (-1 < _Var3) break;
        pbVar7 = pbVar7 + -1;
        ndigits = (int)__iptr;
      }
    }
  }
  else {
    while( true ) {
      _Var3 = __eqdf2();
      pbVar7 = pbVar6 + -(int)pbVar2;
      if (_Var3 == 0) break;
      __iptr = pdStack80;
      __divdf3();
      modf(in_fa1,__iptr);
      __adddf3();
      __muldf3();
      SVar4 = __fixdfsi();
      pbVar2[-1] = (char)SVar4 + 0x30;
      pbVar2 = pbVar2 + -1;
    }
    while (pbVar2 < pbVar6) {
      *pbVar5 = *pbVar2;
      pbVar5 = pbVar5 + 1;
      pbVar2 = pbVar2 + 1;
    }
  }
  pbVar2 = (byte *)((int)piVar1 + (int)in_a5);
  if (in_a6 == 0) {
    pbVar2 = pbVar2 + (int)pbVar7;
  }
  *(byte **)buf = pbVar7;
  if (pbVar2 < in_a5) {
    *in_a5 = 0;
  }
  else {
    while ((pbVar5 <= pbVar2 && (pbVar5 < pbVar6))) {
      __muldf3();
      modf(in_fa1,(double *)ndigits);
      SVar4 = __fixdfsi();
      *pbVar5 = (char)SVar4 + 0x30;
      pbVar5 = pbVar5 + 1;
    }
    if (pbVar2 < pbVar6) {
      *pbVar2 = *pbVar2 + 5;
      pbVar5 = pbVar2;
      while (0x39 < *pbVar5) {
        *pbVar5 = 0x30;
        if (in_a5 < pbVar5) {
          pbVar6 = pbVar5 + -1;
          pbVar5 = pbVar5 + -1;
          *pbVar5 = *pbVar6 + 1;
        }
        else {
          *pbVar5 = 0x31;
          *(int *)buf = *(int *)buf + 1;
          if (in_a6 == 0) {
            if (in_a5 < pbVar2) {
              *pbVar2 = 0x30;
            }
            pbVar2 = pbVar2 + 1;
          }
        }
      }
      *pbVar2 = 0;
    }
    else {
      in_a5[0x4f] = 0;
    }
  }
  return (char *)in_a5;
}



char * ecvtbuf(int ndigits,int *decpt,int *sign,char *buf)

{
  char *pcVar1;
  int in_a4;
  
  pcVar1 = cvt(ndigits,decpt,sign,buf,in_a4);
  return pcVar1;
}



char * fcvtbuf(int ndigits,int *decpt,int *sign,char *buf)

{
  char *pcVar1;
  int in_a4;
  
  pcVar1 = cvt(ndigits,decpt,sign,buf,in_a4);
  return pcVar1;
}



