pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
char * flt(char *str,int size,int precision,char fmt,int flags)

{
  bool bVar1;
  byte bVar2;
  int iVar3;
  __gcc_CMPtype _Var4;
  char *pcVar5;
  undefined *puVar6;
  size_t sVar7;
  int *sign_00;
  undefined3 in_register_00002035;
  char *pcVar8;
  int *piVar9;
  uint uVar10;
  int *__string;
  char cVar11;
  uint in_a5;
  uint uVar12;
  char *pcVar13;
  int iVar14;
  uint in_a6;
  char cVar15;
  char cVar16;
  char *pcVar17;
  char *pcStack232;
  int decpt;
  int sign;
  char tmp [80];
  char cvtbuf [80];
  
  iVar3 = CONCAT31(in_register_00002035,fmt);
  uVar12 = in_a6 & 0x10;
  if (uVar12 == 0) {
    cVar16 = '0';
    if ((in_a6 & 1) == 0) {
      cVar16 = ' ';
    }
  }
  else {
    in_a6 = in_a6 & 0xfffffffe;
    cVar16 = ' ';
  }
  cVar15 = '\0';
  if ((in_a6 & 2) != 0) {
    _Var4 = __ledf2();
    if (_Var4 < 0) {
      precision = precision ^ 0x80000000;
      iVar3 = iVar3 + -1;
      cVar15 = '-';
    }
    else {
      if ((in_a6 & 4) == 0) {
        if ((in_a6 & 8) != 0) {
          iVar3 = iVar3 + -1;
          cVar15 = ' ';
        }
      }
      else {
        iVar3 = iVar3 + -1;
        cVar15 = '+';
      }
    }
  }
  if (flags < 0) {
    flags = 6;
  }
  bVar1 = (in_a5 & 0xfd) != 0x45;
  uVar10 = in_a5;
  if (!bVar1) {
    uVar10 = in_a5 + 0x20 & 0xff;
  }
  if (uVar10 == 0x67) {
    ecvtbuf(size,(int *)precision,(int *)flags,(char *)&pcStack232);
    if ((-5 < (int)(pcStack232 + -1)) && ((int)(pcStack232 + -1) < flags)) {
      sign_00 = (int *)(flags - (int)pcStack232);
LAB_23051924:
      pcVar5 = fcvtbuf(size,(int *)precision,sign_00,(char *)&pcStack232);
      __string = &sign;
      if (decpt != 0) {
        sign._0_1_ = 0x2d;
        __string = (int *)((int)&sign + 1);
      }
      if (*pcVar5 == '\0') {
        *(char *)__string = '0';
        if ((int)sign_00 < 1) {
          __string = (int *)((int)__string + 1);
        }
        else {
          *(char *)((int)__string + 1) = '.';
          pcVar5 = (char *)((int)__string + 2);
          piVar9 = (int *)((int)__string + (int)sign_00);
          do {
            *(char *)((int)__string + 2) = '0';
            __string = (int *)((int)__string + 1);
          } while (piVar9 != __string);
          __string = (int *)(pcVar5 + (int)sign_00);
        }
      }
      else {
        pcVar17 = pcVar5;
        if ((int)pcStack232 < 1) {
          *(char *)__string = '0';
          *(char *)((int)__string + 1) = '.';
          sign_00 = __string;
          while ((int *)((int)__string - (int)pcStack232) != sign_00) {
            *(char *)((int)sign_00 + 2) = '0';
            sign_00 = (int *)((int)sign_00 + 1);
          }
          __string = (int *)((int)__string + (2 - (int)pcStack232));
          while (cVar11 = *pcVar5, cVar11 != '\0') {
            pcVar5 = pcVar5 + 1;
            *(char *)__string = cVar11;
            __string = (int *)((int)__string + 1);
          }
        }
        else {
          do {
            sign_00 = __string;
            if (pcStack232 == pcVar17 + -(int)pcVar5) {
              sign_00 = (int *)((int)__string + 1);
              *(char *)__string = '.';
            }
            pcVar8 = pcVar17 + 1;
            __string = (int *)((int)sign_00 + 1);
            *(char *)sign_00 = *pcVar17;
            pcVar17 = pcVar8;
          } while (*pcVar8 != '\0');
        }
      }
      goto LAB_230518cc;
    }
    __string = (int *)(flags + -1);
  }
  else {
    __string = (int *)flags;
    if (uVar10 != 0x65) {
      __string = &sign;
      sign_00 = (int *)flags;
      if (uVar10 != 0x66) goto LAB_230518cc;
      goto LAB_23051924;
    }
  }
  pcVar5 = ecvtbuf(size,(int *)precision,(int *)((int)__string + 1),(char *)&pcStack232);
  sign_00 = &sign;
  if (decpt != 0) {
    sign._0_1_ = 0x2d;
    sign_00 = (int *)((int)&sign + 1);
  }
  pcVar17 = (char *)((int)sign_00 + 1);
  *(char *)sign_00 = *pcVar5;
  if (0 < (int)__string) {
    pcVar17 = (char *)((int)sign_00 + 2);
    *(undefined *)((int)sign_00 + 1) = 0x2e;
  }
  pcVar8 = pcVar5 + 1;
  pcVar13 = pcVar17;
  while (pcVar5 + 1 + (int)__string != pcVar8) {
    *pcVar13 = *pcVar8;
    pcVar8 = pcVar8 + 1;
    pcVar13 = pcVar13 + 1;
  }
  pcVar17 = pcVar17 + (int)__string;
  cVar11 = 'E';
  if (bVar1) {
    cVar11 = 'e';
  }
  *pcVar17 = cVar11;
  if (pcStack232 == (char *)0x0) {
    _Var4 = __eqdf2();
    if (_Var4 != 0) {
      pcStack232 = (char *)0xffffffff;
      goto LAB_2305188a;
    }
LAB_230519b0:
    cVar11 = '+';
  }
  else {
    pcStack232 = pcStack232 + -1;
    if (-1 < (int)pcStack232) goto LAB_230519b0;
LAB_2305188a:
    pcStack232 = (char *)-(int)pcStack232;
    cVar11 = '-';
  }
  pcVar17[1] = cVar11;
  pcVar17[4] = (char)((int)pcStack232 % 10) + '0';
  pcVar17[2] = (char)(((int)pcStack232 / 100) % 10) + '0';
  pcVar17[3] = (char)(((int)pcStack232 / 10) % 10) + '0';
  __string = (int *)(pcVar17 + 5);
LAB_230518cc:
  *(char *)__string = '\0';
  if ((in_a6 & 0x20) == 0) {
    if (in_a5 == 0x67) {
      __string = &sign;
      do {
        bVar2 = *(byte *)__string;
        __string = (int *)((int)__string + 1);
        if (bVar2 == 0) goto LAB_23051a64;
      } while (bVar2 != 0x2e);
      while ((sign_00 = __string, *(byte *)__string != 0 && ((*(byte *)__string & 0xdf) != 0x45))) {
        __string = (int *)((int)__string + 1);
      }
      do {
        piVar9 = sign_00;
        sign_00 = (int *)((int)piVar9 + -1);
      } while (*(byte *)sign_00 == 0x30);
      if (*(byte *)sign_00 == 0x2e) {
        sign_00 = (int *)((int)piVar9 + -2);
      }
      while (__string != sign_00) {
        sign_00 = (int *)((int)sign_00 + 1);
        *(byte *)sign_00 = 0;
      }
    }
  }
  else {
    if ((int *)flags == (int *)0x0) {
      __string = &sign;
      while (bVar2 = *(byte *)__string, bVar2 != 0) {
        if (bVar2 == 0x2e) goto LAB_23051a64;
        if ((bVar2 & 0xdf) == 0x45) {
          sVar7 = strnlen((char *)__string,0x100);
          puVar6 = (undefined *)(sVar7 + (int)__string);
          while (0 < (int)(puVar6 + -(int)__string)) {
            puVar6[1] = *puVar6;
            puVar6 = puVar6 + -1;
          }
          *(byte *)__string = 0x2e;
          goto LAB_23051a64;
        }
        __string = (int *)((int)__string + 1);
      }
      *(byte *)__string = 0x2e;
      *(byte *)((int)__string + 1) = 0;
    }
  }
LAB_23051a64:
  sVar7 = strnlen((char *)&sign,0x100);
  iVar3 = iVar3 - sVar7;
  pcVar5 = str;
  if ((in_a6 & 0x11) == 0) {
    while (0 < (int)(str + (iVar3 - (int)pcVar5))) {
      *pcVar5 = ' ';
      pcVar5 = pcVar5 + 1;
    }
    iVar14 = iVar3;
    if (iVar3 < 0) {
      iVar14 = 0;
    }
    str = str + iVar14;
    iVar3 = (iVar3 + -1) - iVar14;
  }
  if (cVar15 != '\0') {
    *str = cVar15;
    str = str + 1;
  }
  pcVar5 = str;
  if (uVar12 == 0) {
    while (0 < (int)(str + (iVar3 - (int)pcVar5))) {
      *pcVar5 = cVar16;
      pcVar5 = pcVar5 + 1;
    }
    iVar14 = iVar3;
    if (iVar3 < 0) {
      iVar14 = 0;
    }
    str = str + iVar14;
    iVar3 = (iVar3 + -1) - iVar14;
  }
  iVar14 = 0;
  while (iVar14 < (int)sVar7) {
    pcVar5 = (char *)((int)&sign + iVar14);
    pcVar17 = str + iVar14;
    iVar14 = iVar14 + 1;
    *pcVar17 = *pcVar5;
  }
  if ((int)sVar7 < 0) {
    sVar7 = 0;
  }
  str = str + sVar7;
  pcVar5 = str;
  while (0 < (int)(str + (iVar3 - (int)pcVar5))) {
    *pcVar5 = ' ';
    pcVar5 = pcVar5 + 1;
  }
  if (iVar3 < 0) {
    iVar3 = 0;
  }
  return str + iVar3;
}



int vsnprintf(char *__s,size_t __maxlen,char *__format,__gnuc_va_list __arg)

{
  char *pcVar1;
  size_t n;
  byte *pbVar2;
  int *piVar3;
  undefined4 uVar4;
  char *pcVar5;
  byte bVar6;
  uint uVar7;
  char **ppcVar8;
  int prec;
  char *pcVar9;
  char *pcVar10;
  int iVar11;
  uint width;
  char *flags;
  byte *str;
  char *pcVar12;
  char *pcStack104;
  char *pcStack100;
  char *pcStack88;
  char acStack65 [4];
  char carg;
  
  uVar4 = 0;
  width = 0;
  flags = (char *)0xffffffff;
  iVar11 = 0;
  pcStack104 = (char *)0x0;
  pcStack100 = (char *)0x0;
  pcVar5 = (char *)0x0;
  str = (byte *)__s;
  pcVar12 = (char *)0x0;
switchD_23051c14_caseD_5:
  do {
    pbVar2 = (byte *)__format;
    __format = (char *)(pbVar2 + 1);
    bVar6 = *pbVar2;
    uVar7 = (uint)bVar6;
    if (bVar6 == 0) {
      if (pcVar5 < __maxlen) {
        *str = 0;
      }
      else {
        if (__maxlen != 0) {
          __s[__maxlen - 1] = '\0';
        }
      }
      return (int)pcVar5;
    }
    switch(uVar4) {
    case 0:
      if (bVar6 == 0x25) {
        uVar4 = 1;
        width = 0;
        flags = (char *)0xffffffff;
        iVar11 = 0;
        pcVar12 = (char *)0x0;
      }
      else {
        if (pcVar5 < __maxlen) {
          *str = bVar6;
          str = str + 1;
        }
        pcVar5 = pcVar5 + 1;
      }
      break;
    case 1:
      switch(uVar7 - 0x20 & 0xff) {
      case 0:
        width = width | 0x10;
        break;
      default:
        uVar4 = 2;
        __format = (char *)pbVar2;
        break;
      case 3:
        width = width | 0x20;
        break;
      case 7:
        width = width | 8;
        break;
      case 0xb:
        width = width | 4;
        break;
      case 0xd:
        width = width | 2;
        break;
      case 0x10:
        width = width | 1;
      }
      break;
    case 2:
      if ((uVar7 - 0x30 & 0xff) < 10) {
        pcVar12 = (char *)((int)pcVar12 * 10 + (uVar7 - 0x30));
      }
      else {
        if (bVar6 == 0x2a) {
          ppcVar8 = (char **)__arg + 1;
          pcVar12 = *(char **)__arg;
          __arg = ppcVar8;
          if ((int)pcVar12 < 0) {
            width = width | 2;
            pcVar12 = (char *)-(int)pcVar12;
          }
        }
        else {
          if (bVar6 == 0x2e) {
            uVar4 = 3;
            flags = (char *)0x0;
          }
          else {
            uVar4 = 4;
            __format = (char *)pbVar2;
          }
        }
      }
      break;
    case 3:
      if ((uVar7 - 0x30 & 0xff) < 10) {
        flags = (char *)((int)flags * 10 + (uVar7 - 0x30));
      }
      else {
        if (bVar6 == 0x2a) {
          ppcVar8 = (char **)__arg + 1;
          flags = *(char **)__arg;
          __arg = ppcVar8;
          if ((int)flags < 0) {
            flags = (char *)0xffffffff;
          }
        }
        else {
          uVar4 = 4;
          __format = (char *)pbVar2;
        }
      }
      break;
    case 4:
      switch(uVar7 - 0x4c & 0xff) {
      case 0:
      case 0x25:
        iVar11 = iVar11 + 2;
        break;
      default:
        if (2 < iVar11) {
          iVar11 = 2;
        }
        if (iVar11 < -2) {
          iVar11 = -2;
        }
        switch(uVar7 - 0x50 & 0xff) {
        case 0:
          width = width | 0x80;
          goto switchD_23051d70_caseD_20;
        default:
          if (pcVar5 < __maxlen) {
            *str = bVar6;
            str = str + 1;
          }
          uVar4 = 0;
          pcVar5 = pcVar5 + 1;
          goto switchD_23051c14_caseD_5;
        case 8:
          width = width | 0x80;
          prec = 0x10;
          break;
        case 0x13:
          acStack65[0] = (char)*(char **)__arg;
          pcVar1 = (char *)0x1;
          pcStack88 = acStack65;
          goto is_string;
        case 0x14:
        case 0x19:
          width = width | 0x40;
                    // WARNING: Could not find normalized switch variable to match jumptable
          switch(iVar11) {
          case -2:
            pcStack104 = (char *)(int)*(char *)__arg;
            pcStack100 = (char *)((int)pcStack104 >> 0x1f);
            __arg = (char **)__arg + 1;
            prec = 10;
            break;
          case 0:
            pcStack104 = *(char **)__arg;
            pcStack100 = (char *)((int)pcStack104 >> 0x1f);
            __arg = (char **)__arg + 1;
            prec = 10;
            break;
          case 2:
            ppcVar8 = (char **)((int)__arg + 7U & 0xfffffff8);
            __arg = ppcVar8 + 2;
            pcStack104 = *ppcVar8;
            pcStack100 = ppcVar8[1];
            prec = 10;
            break;
          default:
            prec = 10;
          }
          goto is_integer;
        case 0x16:
          piVar3 = (int *)((int)__arg + 7U & 0xfffffff8);
          str = (byte *)flt((char *)str,*piVar3,piVar3[1],(char)pcVar12,(int)flags);
          uVar4 = 0;
          __arg = piVar3 + 2;
          goto switchD_23051c14_caseD_5;
        case 0x1e:
          if (iVar11 + 2U < 5) {
                    // WARNING: Could not recover jumptable at 0x23051f80. Too many branches
                    // WARNING: Treating indirect jump as call
            iVar11 = (*(code *)(&PTR_LAB_230885a4)[iVar11 + 2U])((&PTR_LAB_230885a4)[iVar11 + 2U]);
            return iVar11;
          }
          uVar4 = 0;
          goto switchD_23051c14_caseD_5;
        case 0x1f:
          prec = 8;
          break;
        case 0x20:
switchD_23051d70_caseD_20:
          width = width | 0x20;
          pcStack104 = *(char **)__arg;
          pcStack100 = (char *)0x0;
          __arg = (char **)__arg + 1;
          prec = 0x10;
          flags = &DAT_00000008;
          goto is_integer;
        case 0x23:
          pcStack88 = *(char **)__arg;
          if (pcStack88 == (char *)0x0) {
            pcStack88 = "(null)";
          }
          pcVar1 = (char *)strlen(pcStack88);
is_string:
          __arg = (char **)__arg + 1;
          if ((flags != (char *)0xffffffff) && ((int)flags < (int)pcVar1)) {
            pcVar1 = flags;
          }
          pcVar9 = pcVar5;
          if (((int)pcVar1 < (int)pcVar12) && ((width & 2) == 0)) {
            if ((width & 1) == 0) {
              bVar6 = 0x20;
            }
            else {
              bVar6 = 0x30;
            }
            pcVar9 = pcVar12 + (int)(pcVar5 + -(int)pcVar1);
            do {
              if (pcVar5 < __maxlen) {
                *str = bVar6;
                str = str + 1;
              }
              pcVar5 = pcVar5 + 1;
              pcVar12 = pcVar1;
            } while (pcVar5 != pcVar9);
          }
          pcVar5 = pcVar9;
          if (pcVar1 != (char *)0x0) {
            pcVar10 = pcVar9;
            do {
              if (pcVar10 < __maxlen) {
                *str = pcStack88[(int)(pcVar10 + -(int)pcVar9)];
                str = str + 1;
              }
              pcVar10 = pcVar10 + 1;
              pcVar5 = pcVar1 + (int)pcVar9;
            } while (pcVar10 != pcVar1 + (int)pcVar9);
          }
          if ((int)pcVar1 < (int)pcVar12) {
            if ((width & 2) == 0) {
              uVar4 = 0;
            }
            else {
              pcVar9 = pcVar5 + -(int)pcVar1;
              do {
                if (pcVar5 < __maxlen) {
                  *str = 0x20;
                  str = str + 1;
                }
                pcVar5 = pcVar5 + 1;
              } while (pcVar5 != pcVar12 + (int)pcVar9);
              uVar4 = 0;
              pcVar5 = pcVar12 + (int)pcVar9;
              pcVar12 = pcVar1;
            }
          }
          else {
            uVar4 = 0;
          }
          goto switchD_23051c14_caseD_5;
        case 0x25:
          prec = 10;
          break;
        case 0x28:
          prec = 0x10;
        }
                    // WARNING: Could not find normalized switch variable to match jumptable
        switch(iVar11) {
        case -2:
          pcStack104 = (char *)(uint)*(byte *)__arg;
          pcStack100 = (char *)0x0;
          __arg = (char **)__arg + 1;
          break;
        case 0:
          pcStack104 = *(char **)__arg;
          pcStack100 = (char *)0x0;
          __arg = (char **)__arg + 1;
          break;
        case 2:
          ppcVar8 = (char **)((int)__arg + 7U & 0xfffffff8);
          __arg = ppcVar8 + 2;
          pcStack104 = *ppcVar8;
          pcStack100 = ppcVar8[1];
        }
is_integer:
        if (pcVar5 < __maxlen) {
          n = __maxlen - (int)pcVar5;
        }
        else {
          n = 0;
        }
        n = format_int((char *)str,n,(uint)pcStack104,(int)pcStack100,width,prec);
        str = str + n;
        uVar4 = 0;
        pcVar5 = pcVar5 + n;
        break;
      case 0x1c:
        iVar11 = iVar11 + -1;
        break;
      case 0x1e:
        iVar11 = 2;
        break;
      case 0x20:
        iVar11 = iVar11 + 1;
        break;
      case 0x28:
      case 0x2e:
        iVar11 = 1;
      }
    }
  } while( true );
}



int vsprintf(char *__s,char *__format,__gnuc_va_list __arg)

{
  int iVar1;
  
