pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  iVar1 = vsnprintf(__s,0x1e0,__format,__arg);
  return iVar1;
}



void vprint(char *fmt,va_list argp)

{
  uint8_t *puVar1;
  int iVar2;
  
  if (sys_log_all_enable == false) {
    return;
  }
  iVar2 = vsprintf(string,fmt,argp);
  puVar1 = (uint8_t *)string;
  if (0 < iVar2) {
    while( true ) {
      if (*puVar1 == '\0') break;
      bl_uart_data_send('\0',*puVar1);
      puVar1 = puVar1 + 1;
    }
  }
  return;
}



int bl_putchar(int c)

{
  bl_uart_data_send('\0',(uint8_t)c);
  return 0;
}



int puts(char *__s)

{
  int iVar1;
  
  iVar1 = 0;
  if (sys_log_all_enable != false) {
    iVar1 = 0;
    while (__s[iVar1] != '\0') {
      bl_uart_data_send('\0',__s[iVar1]);
      iVar1 = iVar1 + 1;
    }
  }
  return iVar1;
}



int printf(char *__format,...)

{
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list argp;
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  if (sys_log_all_enable != false) {
    uStack28 = in_a1;
    uStack24 = in_a2;
    uStack20 = in_a3;
    uStack16 = in_a4;
    uStack12 = in_a5;
    uStack8 = in_a6;
    uStack4 = in_a7;
    vprint(__format,&uStack28);
  }
  return 0;
}



int sprintf(char *__s,char *__format,...)

{
  int iVar1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list ap;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack24 = in_a2;
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  iVar1 = vsnprintf(__s,0xffffffff,__format,&uStack24);
  return iVar1;
}



int snprintf(char *__s,size_t __maxlen,char *__format,...)

{
  int iVar1;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list ap;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  iVar1 = vsnprintf(__s,__maxlen,__format,&uStack20);
  return iVar1;
}



int sscanf(char *__s,char *__format,...)

{
  int iVar1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list ap;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  uStack24 = in_a2;
  uStack20 = in_a3;
  uStack16 = in_a4;
  uStack12 = in_a5;
  uStack8 = in_a6;
  uStack4 = in_a7;
  iVar1 = vsscanf(__s,__format,&uStack24);
  return iVar1;
}



void set_bit(ulong *bitmap,uint bit)

{
  bitmap[bit >> 5] = bitmap[bit >> 5] | 1 << (bit & 0x1f);
  return;
}



int vsscanf(char *__s,char *__format,__gnuc_va_list __arg)

{
  byte bVar1;
  bool bVar2;
  bool bVar3;
  size_t sVar4;
  uint uVar5;
  uint bit;
  byte *pbVar6;
  int base;
  uint uVar7;
  byte **endptr;
  byte **ppbVar8;
  uint bit_00;
  int iVar9;
  byte *nptr;
  byte *pbVar10;
  size_t n;
  byte *pbVar11;
  int iVar12;
  uint uVar13;
  uint uStack132;
  uint uStack128;
  byte *pbStack100;
  char *qq;
  ulong matchmap [8];
  
  uStack128 = 0;
  uStack132 = 0;
  iVar12 = 0;
  pbVar11 = (byte *)0x0;
  bVar2 = false;
  bVar3 = false;
  iVar9 = 0;
  uVar5 = 0;
  pbVar10 = (byte *)__s;
  n = 0xffffffff;
  uVar13 = 0;
switchD_23052248_caseD_7:
  nptr = pbVar10;
  pbVar6 = (byte *)__format;
  uVar7 = uVar5;
  bVar1 = *pbVar6;
  bit = (uint)bVar1;
  __format = (char *)(pbVar6 + 1);
  if ((bVar1 == 0) || (uVar13 != 0)) {
    if ((uVar13 == 1) && (iVar12 == 0)) {
      iVar12 = -1;
    }
    return iVar12;
  }
  uVar5 = uVar7;
  pbVar10 = nptr;
  switch(uVar7) {
  case 0:
    if (bVar1 == 0x25) {
      bVar2 = false;
      bVar3 = false;
      iVar9 = 0;
      uVar5 = 1;
      n = 0xffffffff;
      uVar13 = uVar7;
      goto switchD_23052248_caseD_7;
    }
    uVar5 = (uint)(byte)_ctype_[bit + 1] & 8;
    if ((_ctype_[bit + 1] & 8) == 0) {
      uVar13 = 2;
      if ((uint)*nptr != bit) goto switchD_23052248_caseD_7;
      nptr = nptr + 1;
    }
    else {
      while (uVar5 = (uint)(byte)_ctype_[(uint)*nptr + 1] & 8, (_ctype_[(uint)*nptr + 1] & 8) != 0)
      {
        nptr = nptr + 1;
      }
    }
    pbVar10 = nptr;
    uVar13 = 0;
    goto switchD_23052248_caseD_7;
  case 1:
    if (bVar1 == 0x2a) {
      bVar3 = true;
      goto switchD_23052248_caseD_7;
    }
    if ((0x29 < bVar1) && ((bit - 0x30 & 0xff) < 10)) {
      bVar2 = true;
      uVar5 = 2;
      n = bit - 0x30;
      goto switchD_23052248_caseD_7;
    }
    break;
  case 2:
    if ((bit - 0x30 & 0xff) < 10) {
      n = n * 10 + -0x30 + bit;
      goto switchD_23052248_caseD_7;
    }
    break;
  case 3:
    if (bVar1 == 0x6c) {
      iVar9 = iVar9 + 1;
    }
    else {
      if (0x6c < bVar1) {
        if ((bVar1 == 0x74) || (bVar1 == 0x7a)) {
          iVar9 = 1;
          goto switchD_23052248_caseD_7;
        }
        uVar7 = 0x71;
LAB_230522f0:
        if (bit == uVar7) goto LAB_230522f4;
        if (2 < iVar9) {
          iVar9 = 2;
        }
        if (iVar9 < -2) {
          iVar9 = -2;
        }
        if (bVar1 == 0x69) {
          base = 0;
LAB_230523aa:
          while( true ) {
            uVar7 = (uint)*nptr;
            if ((_ctype_[uVar7 + 1] & 8) == 0) break;
            nptr = nptr + 1;
          }
          pbVar10 = nptr;
          if (*nptr == 0) goto LAB_230525ca;
          endptr = &pbStack100;
          pbVar6 = nptr;
          strntoumax((char *)nptr,(char **)endptr,base,n);
          if (pbStack100 == nptr) goto LAB_2305234e;
          nptr = pbStack100;
          if (!bVar3) {
            iVar12 = iVar12 + 1;
          }
set_integer:
          uVar5 = 0;
          pbVar10 = nptr;
          if (!bVar3) {
            if (iVar9 == 0) {
              endptr = *(byte ***)__arg;
              __arg = (byte **)__arg + 1;
              *endptr = pbVar6;
LAB_230524ba:
              uVar5 = 0;
              pbVar10 = nptr;
              goto switchD_23052248_caseD_7;
            }
            if (iVar9 < 1) {
              if (iVar9 == -2) {
                **(byte **)__arg = (byte)pbVar6;
              }
              else {
                if (iVar9 != -1) goto switchD_23052248_caseD_7;
                **(undefined2 **)__arg = (short)pbVar6;
              }
            }
            else {
              if (iVar9 == 2) {
                ppbVar8 = *(byte ***)__arg;
                *ppbVar8 = pbVar6;
                *(byte ***)(ppbVar8 + 1) = endptr;
              }
              else {
                if ((1 < iVar9) && (iVar9 != 0x7fffffff)) goto switchD_23052248_caseD_7;
                **(byte ***)__arg = pbVar6;
              }
            }
            __arg = (byte **)__arg + 1;
          }
          goto switchD_23052248_caseD_7;
        }
        if (bVar1 < 0x6a) {
          if (bVar1 == 0x58) {
scan_int:
            base = 0x10;
            goto LAB_230523aa;
          }
          if (0x58 < bVar1) {
            if (bVar1 == 99) {
              if (!bVar2) {
                n = 1;
              }
              sVar4 = n - 1;
              if (!bVar3) {
                pbVar11 = *(byte **)__arg;
                __arg = (byte **)__arg + 1;
                n = n - 1;
                while (n != 0xffffffff) {
                  bVar1 = *nptr;
                  uVar7 = (uint)bVar1;
                  pbVar10 = nptr;
                  if (bVar1 == 0) goto LAB_230525ca;
                  nptr = nptr + 1;
                  *pbVar11 = bVar1;
                  n = n - 1;
                  pbVar11 = pbVar11 + 1;
                }
                iVar12 = iVar12 + 1;
                goto LAB_230524ba;
              }
              do {
                n = sVar4;
                if (n == 0xffffffff) goto LAB_230524ba;
                uVar7 = (uint)*nptr;
                sVar4 = n - 1;
              } while (*nptr != 0);
              goto LAB_230525ca;
            }
            if (bVar1 == 100) goto LAB_2305247c;
            if (bVar1 != 0x5b) goto LAB_2305234e;
            pbVar11 = (byte *)0x0;
            if (!bVar3) {
              pbVar11 = *(byte **)__arg;
              __arg = (byte **)__arg + 1;
            }
            memset(&qq,0,0x20);
            uStack132 = 0;
            uVar5 = 4;
            goto switchD_23052248_caseD_7;
          }
          if (bVar1 == 0x25) {
            if ((uint)*nptr == bit) {
              nptr = nptr + 1;
              goto LAB_230524ba;
            }
          }
          else {
            if (bVar1 == 0x50) goto LAB_23052470;
          }
        }
        else {
          if (bVar1 == 0x70) {
LAB_23052470:
            base = 0;
            iVar9 = 0x7fffffff;
            goto LAB_230523aa;
          }
          if (bVar1 < 0x71) {
            if (bVar1 == 0x6e) {
              pbVar6 = nptr + -(int)__s;
              endptr = (byte **)((int)pbVar6 >> 0x1f);
              goto set_integer;
            }
            base = 8;
            if (bVar1 == 0x6f) goto LAB_230523aa;
          }
          else {
            if (bVar1 == 0x75) {
LAB_2305247c:
              base = 10;
              goto LAB_230523aa;
            }
            if (bVar1 == 0x78) goto scan_int;
            if (bVar1 == 0x73) {
              n = n - 1;
              if (bVar3) {
                while (n != 0xffffffff) {
                  uVar7 = (uint)*nptr;
                  pbVar10 = nptr;
                  if (*nptr == 0) goto LAB_230525ca;
                  if ((_ctype_[uVar7 + 1] & 8) != 0) break;
                  nptr = nptr + 1;
                  n = n - 1;
                }
                goto LAB_230524ba;
              }
              pbVar11 = *(byte **)__arg;
              __arg = (byte **)__arg + 1;
              uVar13 = 1;
              pbVar10 = pbVar11;
              while (n != 0xffffffff) {
                bVar1 = *nptr;
                uVar13 = (uint)bVar1;
                if ((bVar1 == 0) || ((_ctype_[uVar13 + 1] & 8) != 0)) break;
                *pbVar10 = bVar1;
                nptr = nptr + 1;
                pbVar10 = pbVar10 + 1;
                n = n - 1;
              }
              if (pbVar10 != pbVar11) {
                *pbVar10 = 0;
                iVar12 = iVar12 + 1;
              }
              uVar13 = (uint)(uVar13 == 0);
              uVar5 = 0;
              pbVar10 = nptr;
              goto switchD_23052248_caseD_7;
            }
          }
        }
LAB_2305234e:
        uVar13 = 2;
        uVar5 = 0;
        pbVar10 = nptr;
        goto switchD_23052248_caseD_7;
      }
      if (bVar1 == 0x68) {
        iVar9 = iVar9 + -1;
      }
      else {
        if (bVar1 != 0x6a) {
          uVar7 = 0x4c;
          goto LAB_230522f0;
        }
LAB_230522f4:
        iVar9 = 2;
      }
    }
    goto switchD_23052248_caseD_7;
  case 4:
    if (bVar1 != 0x5e) {
      set_bit((ulong *)&qq,bit);
      goto LAB_2305255e;
    }
    uStack132 = 1;
    goto switchD_23052248_caseD_7;
  case 5:
    if (bVar1 == 0x5d) {
match_run:
      bit = 1;
      while (n != 0) {
        bVar1 = *pbVar10;
        bit = (uint)bVar1;
        if ((bVar1 == 0) || (uStack132 == ((uint)(&qq)[bVar1 >> 5] >> (bit & 0x1f) & 1))) break;
        if (pbVar11 != (byte *)0x0) {
          *pbVar11 = bVar1;
          pbVar11 = pbVar11 + 1;
        }
        pbVar10 = pbVar10 + 1;
      }
      if ((nptr == pbVar10) || (pbVar11 == (byte *)0x0)) {
        uVar13 = 2;
      }
      else {
        *pbVar11 = 0;
        iVar12 = iVar12 + 1;
      }
      pbStack100 = nptr;
      if (bit == 0) {
LAB_230525ca:
        uVar13 = 1;
        uVar5 = uVar7;
      }
    }
    else {
      if (bVar1 == 0x2d) {
        uStack128 = 0x2d;
        uVar5 = 6;
      }
      else {
        set_bit((ulong *)&qq,bit);
      }
    }
    goto switchD_23052248_caseD_7;
  case 6:
    bit_00 = uStack128;
    if (bVar1 == 0x5d) goto match_run;
    while ((int)bit_00 < (int)bit) {
      set_bit((ulong *)&qq,bit_00);
      bit_00 = bit_00 + 1;
    }
LAB_2305255e:
    uVar5 = 5;
  default:
    goto switchD_23052248_caseD_7;
  }
  uVar5 = 3;
  __format = (char *)pbVar6;
  goto switchD_23052248_caseD_7;
}



uintmax_t strntoumax(char *nptr,char **endptr,int base,size_t n)

{
  byte *pbVar1;
  uint uVar2;
  uint uVar3;
  uintmax_t in_fa0;
  
  while (n != 0) {
    if ((_ctype_[(uint)(byte)*nptr + 1] & 8) == 0) {
      if (((uint)(byte)*nptr - 0x2b & 0xfd) == 0) {
        nptr = (char *)((byte *)nptr + 1);
        n = n - 1;
      }
      if (base != 0) {
        if ((((base == 0x10) && (1 < n)) && (*nptr == 0x30)) && ((((byte *)nptr)[1] & 0xdf) == 0x58)
           ) {
          n = n - 2;
          nptr = (char *)((byte *)nptr + 2);
        }
        goto LAB_2305267a;
      }
      if (n < 2) {
        if (n == 0) goto joined_r0x23052722;
        if (*nptr != 0x30) {
          n = 1;
          base = 10;
          goto LAB_2305267a;
        }
      }
      else {
        base = 10;
        if (*nptr != 0x30) goto LAB_2305267a;
        if ((((byte *)nptr)[1] & 0xdf) == 0x58) {
          n = n - 2;
          nptr = (char *)((byte *)nptr + 2);
          base = 0x10;
          goto LAB_2305267a;
        }
      }
      n = n - 1;
      nptr = (char *)((byte *)nptr + 1);
      base = 8;
      goto LAB_2305267a;
    }
    nptr = (char *)((byte *)nptr + 1);
    n = n - 1;
  }
  if (base != 0) {
LAB_2305267a:
    pbVar1 = (byte *)nptr + n;
    while ((byte *)nptr != pbVar1) {
      uVar3 = (uint)(byte)*nptr;
      uVar2 = uVar3 - 0x30;
      if (9 < uVar2) {
        if (uVar3 - 0x41 < 0x1a) {
          uVar2 = uVar3 - 0x37;
        }
        else {
          if (0x19 < uVar3 - 0x61) break;
          uVar2 = uVar3 - 0x57;
        }
      }
      if (((int)uVar2 < 0) || (base <= (int)uVar2)) break;
      nptr = (char *)((byte *)nptr + 1);
    }
  }
joined_r0x23052722:
  if (endptr != (char **)0x0) {
    *endptr = nptr;
  }
  return in_fa0;
}



BL_Err_Type UART_Init(UART_ID_Type uartId,UART_CFG_Type *uartCfg)

{
  UART_Parity_Type UVar1;
  undefined3 in_register_00002029;
  uint *puVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  
  puVar2 = (uint *)uartAddr[CONCAT31(in_register_00002029,uartId)];
  uVar5 = uartCfg->uartClk / uartCfg->baudRate;
  if (4 < ((uartCfg->uartClk * 10) / uartCfg->baudRate) % 10) {
    uVar5 = uVar5 + 1;
  }
  puVar2[2] = uVar5 - 1 & 0xffff | (uVar5 - 1) * 0x10000;
  UVar1 = uartCfg->parity;
  uVar5 = *puVar2;
  uVar6 = puVar2[1];
  if (UVar1 == UART_PARITY_ODD) {
    uVar5 = uVar5 | 0x30;
    uVar6 = uVar6 | 0x30;
  }
  else {
    if (UVar1 == UART_PARITY_NONE) {
      uVar5 = uVar5 & 0xffffffef;
      uVar6 = uVar6 & 0xffffffef;
    }
    else {
      if (UVar1 == UART_PARITY_EVEN) {
        uVar5 = uVar5 & 0xffffffdf | 0x10;
        uVar6 = uVar6 & 0xffffffdf | 0x10;
      }
    }
  }
  uVar3 = ((uint)uartCfg->dataBits + 4) * 0x100;
  uVar4 = uVar5 & 0xfffff8ff | uVar3;
  uVar3 = uVar6 & 0xfffff8ff | uVar3;
  uVar5 = ((uint)uartCfg->stopBits + 1) * 0x1000;
  uVar6 = uVar4 & 0xffffcffd | uVar5;
  if (uartCfg->ctsFlowControl == ENABLE) {
    uVar6 = uVar4 & 0xffffcfff | uVar5 | 2;
  }
  if (uartCfg->rxDeglitch == ENABLE) {
    uVar3 = uVar3 | 0x800;
  }
  else {
    uVar3 = uVar3 & 0xfffff7ff;
  }
  uVar5 = uVar3 & 0xfffffffd;
  if (uartCfg->rtsSoftwareControl == ENABLE) {
    uVar5 = uVar3 | 2;
  }
  *puVar2 = uVar6;
  puVar2[1] = uVar5;
  uVar5 = puVar2[3] & 0xfffffffe;
  if (uartCfg->byteBitInverse == UART_MSB_FIRST) {
    uVar5 = puVar2[3] | 1;
  }
  puVar2[3] = uVar5;
  return SUCCESS;
}



