pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
BL_Err_Type UART_FifoConfig(UART_ID_Type uartId,UART_FifoCfg_Type *fifoCfg)

{
  undefined3 in_register_00002029;
  uint32_t uVar1;
  uint uVar2;
  uint uVar3;
  
  uVar1 = uartAddr[CONCAT31(in_register_00002029,uartId)];
  *(uint *)(uVar1 + 0x84) =
       (((uint)fifoCfg->txFifoDmaThreshold - 1) * 0x10000 | *(uint *)(uVar1 + 0x84) & 0xffe0ffff) &
       0xe0ffffff | ((uint)fifoCfg->rxFifoDmaThreshold - 1) * 0x1000000;
  uVar3 = *(uint *)(uVar1 + 0x80) & 0xfffffffe;
  if (fifoCfg->txFifoDmaEnable == ENABLE) {
    uVar3 = *(uint *)(uVar1 + 0x80) | 1;
  }
  uVar2 = uVar3 & 0xfffffffd;
  if (fifoCfg->rxFifoDmaEnable == ENABLE) {
    uVar2 = uVar3 | 2;
  }
  *(uint *)(uVar1 + 0x80) = uVar2;
  return SUCCESS;
}



BL_Err_Type UART_Enable(UART_ID_Type uartId,UART_Direction_Type direct)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  
  puVar1 = (uint *)uartAddr[CONCAT31(in_register_00002029,uartId)];
  if ((direct & ~UART_TXRX) == UART_TX) {
    *puVar1 = *puVar1 | 1;
  }
  if ((byte)(direct + ~UART_TX) < 2) {
    puVar1[1] = puVar1[1] | 1;
  }
  return SUCCESS;
}



BL_Err_Type UART_Disable(UART_ID_Type uartId,UART_Direction_Type direct)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  
  puVar1 = (uint *)uartAddr[CONCAT31(in_register_00002029,uartId)];
  if ((direct & ~UART_TXRX) == UART_TX) {
    *puVar1 = *puVar1 & 0xfffffffe;
  }
  if ((byte)(direct + ~UART_TX) < 2) {
    puVar1[1] = puVar1[1] & 0xfffffffe;
  }
  return SUCCESS;
}



BL_Err_Type UART_SetRxTimeoutValue(UART_ID_Type uartId,uint8_t time)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  
  *(uint *)(uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x18) =
       CONCAT31(in_register_0000202d,time) - 1U |
       *(uint *)(uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x18) & 0xffffff00;
  return SUCCESS;
}



BL_Err_Type UART_TxFreeRun(UART_ID_Type uartId,BL_Fun_Type txFreeRun)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  uint uVar1;
  
  uVar1 = *(uint *)uartAddr[CONCAT31(in_register_00002029,uartId)];
  if (CONCAT31(in_register_0000202d,txFreeRun) == 1) {
    uVar1 = uVar1 | 4;
  }
  else {
    uVar1 = uVar1 & 0xfffffffb;
  }
  *(uint *)uartAddr[CONCAT31(in_register_00002029,uartId)] = uVar1;
  return SUCCESS;
}



BL_Err_Type UART_IntMask(UART_ID_Type uartId,UART_INT_Type intType,BL_Mask_Type intMask)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  uint uVar1;
  undefined3 in_register_00002031;
  uint uVar2;
  
  uVar2 = *(uint *)(uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x24);
  if (CONCAT31(in_register_0000202d,intType) == 8) {
    uVar1 = 0;
    if (CONCAT31(in_register_00002031,intMask) == 1) {
      uVar1 = uVar2 | 0xff;
    }
  }
  else {
    uVar1 = 1 << ((uint)intType & 0x1f);
    if (CONCAT31(in_register_00002031,intMask) == 1) {
      uVar1 = uVar1 | uVar2;
    }
    else {
      uVar1 = ~uVar1 & uVar2;
    }
  }
  *(uint *)(uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x24) = uVar1;
  return SUCCESS;
}



uint8_t UART_GetTxFifoCount(UART_ID_Type uartId)

{
  undefined3 in_register_00002029;
  
  return (uint8_t)((byte)*(undefined4 *)(uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x84) &
                  0x3f);
}



BL_Err_Type UART_SendData(UART_ID_Type uartId,uint8_t *data,uint32_t len)

{
  int iVar1;
  uint uVar2;
  uint8_t uVar3;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  uint8_t *puVar4;
  uint32_t uVar5;
  
  uVar5 = uartAddr[CONCAT31(in_register_00002029,uartId)];
  iVar1 = 160000;
  uVar2 = 0;
  do {
    while( true ) {
      if (len <= uVar2) {
        return SUCCESS;
      }
      uVar3 = UART_GetTxFifoCount(uartId);
      if (CONCAT31(extraout_var,uVar3) == 0) break;
      puVar4 = data + uVar2;
      uVar2 = uVar2 + 1;
      iVar1 = 160000;
      *(uint8_t *)(uVar5 + 0x88) = *puVar4;
    }
    iVar1 = iVar1 + -1;
  } while (iVar1 != 0);
  return TIMEOUT;
}



uint8_t UART_GetRxFifoCount(UART_ID_Type uartId)

{
  undefined3 in_register_00002029;
  
  return (uint8_t)((byte)((uint)*(undefined4 *)
                                 (uartAddr[CONCAT31(in_register_00002029,uartId)] + 0x84) >> 8) &
                  0x3f);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Reset(void)

{
  _DAT_4000f90c = _DAT_4000f90c & 0xfffffffb;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Enable(void)

{
  _DAT_4000f90c = _DAT_4000f90c | 1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Disable(void)

{
  _DAT_4000f90c = _DAT_4000f90c & 0xfffffffe;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Channel_Config(ADC_Chan_Type posCh,ADC_Chan_Type negCh,BL_Fun_Type contEn)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  
  _DAT_4000f90c =
       CONCAT31(in_register_00002029,posCh) << 8 | _DAT_4000f90c & 0xffffe007 |
       CONCAT31(in_register_0000202d,negCh) << 3;
  _DAT_4000f910 =
       (CONCAT31(in_register_00002031,contEn) << 1 | _DAT_4000f910 & 0xfffffffd) & 0xfdffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Start(void)

{
  _DAT_4000f90c = _DAT_4000f90c & 0xfffffffd;
  BL602_Delay_US(100);
  _DAT_4000f90c = _DAT_4000f90c | 2;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_FIFO_Cfg(ADC_FIFO_Cfg_Type *fifoCfg)

{
  _DAT_40002000 =
       (uint)fifoCfg->fifoThreshold << 0x16 | _DAT_40002000 & 0xff3ffffe | (uint)fifoCfg->dmaEn | 2;
  return;
}



