pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t ADC_Get_FIFO_Count(void)

{
  return (uint8_t)((byte)((uint)_DAT_40002000 >> 0x10) & 0x3f);
}



// WARNING: Control flow encountered bad instruction data

void ADC_Parse_Result(uint32_t *orgVal,uint32_t len,ADC_Result_Type *result)

{
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Tsen_Init(ADC_TSEN_MOD_Type tsenMod)

{
  undefined3 in_register_00002029;
  
  _DAT_4000f90c = _DAT_4000f90c & 0x87ffffff | 0xc0000;
  _DAT_4000f910 = _DAT_4000f910 | 0x4000000;
  _DAT_4000f914 =
       (_DAT_4000f914 & 0xfc3ffdf | CONCAT31(in_register_00002029,tsenMod) << 5) & 0xffffa07f |
       0x20000140;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_SET_TSVBE_LOW(void)

{
  _DAT_4000f914 = _DAT_4000f914 & 0x7fffffff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_SET_TSVBE_HIGH(void)

{
  _DAT_4000f914 = _DAT_4000f914 | 0x80000000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t TSEN_Get_V_Error(void)

{
  BL_Fun_Type BVar1;
  uint8_t uVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint uVar3;
  uint32_t uStack44;
  uint32_t regVal;
  ADC_Result_Type result;
  
  uStack44 = 0;
  _DAT_40002000 = _DAT_40002000 | 2;
  ADC_SET_TSVBE_LOW();
  ADC_Start();
  do {
    uVar2 = ADC_Get_FIFO_Count();
    BVar1 = adcGainCoeffCal.adcGainCoeffEnable;
  } while (CONCAT31(extraout_var,uVar2) == 0);
  uStack44 = _DAT_40002004;
  adcGainCoeffCal.adcGainCoeffEnable = DISABLE;
  ADC_Parse_Result(&uStack44,1,(ADC_Result_Type *)&regVal);
  uVar3 = (uint)regVal._2_2_;
  _DAT_40002000 = _DAT_40002000 | 2;
  adcGainCoeffCal.adcGainCoeffEnable = BVar1;
  ADC_SET_TSVBE_HIGH();
  ADC_Start();
  do {
    uVar2 = ADC_Get_FIFO_Count();
    BVar1 = adcGainCoeffCal.adcGainCoeffEnable;
  } while (CONCAT31(extraout_var_00,uVar2) == 0);
  uStack44 = _DAT_40002004;
  adcGainCoeffCal.adcGainCoeffEnable = DISABLE;
  ADC_Parse_Result(&uStack44,1,(ADC_Result_Type *)&regVal);
  adcGainCoeffCal.adcGainCoeffEnable = BVar1;
  return uVar3 - regVal._2_2_;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

float TSEN_Get_Temp(uint32_t tsen_offset)

{
  BL_Fun_Type BVar1;
  uint8_t uVar2;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  uint32_t *orgVal;
  SFtype SVar3;
  undefined4 uVar4;
  uint32_t uStack44;
  uint32_t regVal;
  ADC_Result_Type result;
  
  uStack44 = 0;
  _DAT_40002000 = _DAT_40002000 | 2;
  uVar4 = ADC_SET_TSVBE_LOW();
  ADC_Start(uVar4);
  do {
    uVar2 = ADC_Get_FIFO_Count();
    BVar1 = adcGainCoeffCal.adcGainCoeffEnable;
  } while (CONCAT31(extraout_var,uVar2) == 0);
  uStack44 = _DAT_40002004;
  adcGainCoeffCal.adcGainCoeffEnable = DISABLE;
  ADC_Parse_Result(&uStack44,1,(ADC_Result_Type *)&regVal);
  _DAT_40002000 = _DAT_40002000 | 2;
  adcGainCoeffCal.adcGainCoeffEnable = BVar1;
  uVar4 = ADC_SET_TSVBE_HIGH();
  ADC_Start(uVar4);
  do {
    uVar2 = ADC_Get_FIFO_Count();
    BVar1 = adcGainCoeffCal.adcGainCoeffEnable;
  } while (CONCAT31(extraout_var_00,uVar2) == 0);
  orgVal = &uStack44;
  uStack44 = _DAT_40002004;
  adcGainCoeffCal.adcGainCoeffEnable = DISABLE;
  ADC_Parse_Result(orgVal,1,(ADC_Result_Type *)&regVal);
  adcGainCoeffCal.adcGainCoeffEnable = BVar1;
  __extendsfdf2((SFtype)orgVal);
  __divdf3();
  SVar3 = __truncdfsf2();
  return (float)SVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void ADC_Init(ADC_CFG_Type *cfg)

{
  uint uVar1;
  uint uVar2;
  
  _DAT_4000f910 =
       (uint)cfg->resWidth << 2 |
       ((uint)cfg->clkDiv << 0x12 |
        (uint)cfg->v11Sel << 0x1b | (uint)cfg->v18Sel << 0x1d | _DAT_4000f910 & 0x8001fffe |
       (uint)cfg->offsetCalibEn) & 0xffffffe3;
  if ((cfg->gain1 | cfg->gain2) == 0) {
    uVar1 = 0xfffe1fff;
    uVar2 = 0x8000;
  }
  else {
    uVar1 = 0xfffe3fff;
    uVar2 = 0x12000;
  }
  _DAT_4000f914 =
       ((uint)cfg->biasSel << 0x11 |
       (uint)cfg->gain2 << 0x16 | (uint)cfg->gain1 << 0x19 | _DAT_4000f914 & 0x803dffff) & uVar1 &
       0xffffe073 | uVar2 | (uint)cfg->vcm << 7 | (uint)cfg->vref << 3 | 0x1000 |
       (uint)cfg->inputMode << 2;
  _DAT_4000f938 = (int)cfg->offsetCalibVal | _DAT_4000f938 & 0xffff0000;
                    // WARNING: Treating indirect jump as call
  ADC_Gain_Trim();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Write_Common_OP_First_Cfg
               (uint8_t s0RegIndex,uint8_t s0RegType,uint8_t dRegIndex,uint8_t dRegType,uint8_t op,
               uint8_t lastOp)

{
  undefined3 in_register_00002029;
  uint uVar1;
  undefined3 in_register_00002031;
  undefined3 in_register_00002039;
  
  uVar1 = CONCAT31(in_register_00002029,s0RegIndex) | ((uint)s0RegType & 0xf) << 8;
  if (CONCAT31(in_register_00002039,op) != 0x19) {
    uVar1 = uVar1 | CONCAT31(in_register_00002031,dRegIndex) << 0xc | ((uint)dRegType & 0xf) << 0x14
    ;
  }
  _DAT_40004340 = uVar1 & 0xffffff | ((uint)op & 0x7f) << 0x18 | (uint)lastOp << 0x1f;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type Sec_Eng_PKA_Wait_ISR(void)

{
  int iVar1;
  
  iVar1 = 16000000;
  do {
    iVar1 = iVar1 + -1;
    if (iVar1 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004300 & 0x100) == 0);
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type Sec_Eng_SHA256_Update(SEC_Eng_SHA256_Ctx *shaCtx,uint8_t *input,uint32_t len)

{
  byte bVar1;
  uint uVar2;
  int iVar3;
  uint n;
  uint32_t *psrc;
  uint uVar4;
  
  uVar2 = _DAT_40004000;
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  bVar1 = shaCtx->shaFeed;
  uVar4 = shaCtx->total[0] & 0x3f;
  n = shaCtx->total[0] + len;
  shaCtx->total[0] = n;
  if (n < len) {
    shaCtx->total[1] = shaCtx->total[1] + 1;
  }
  if ((uVar4 != 0) && (n = 0x40 - uVar4, n <= len)) {
    BL602_MemCpy_Fast((void *)((int)shaCtx->shaBuf + uVar4),input,n);
    _DAT_40004004 = shaCtx->shaBuf;
    _DAT_40004000 = (uint)bVar1 << 6 | uVar2 & 0xffbf | 0x10002;
    len = (len - 0x40) + uVar4;
    shaCtx->shaFeed = '\x01';
    input = input + n;
    uVar4 = 0;
  }
  psrc = (uint32_t *)input;
  if (0x3f < len) {
    iVar3 = 16000000;
    do {
      iVar3 = iVar3 + -1;
      if (iVar3 == 0) {
        return TIMEOUT;
      }
    } while ((_DAT_40004000 & 1) != 0);
    _DAT_40004000 = (len >> 6) << 0x10 | (uint)shaCtx->shaFeed << 6 | _DAT_40004000 & 0xffbf | 2;
    psrc = (uint32_t *)((int)input + (len & 0xffffffc0));
    _DAT_40004004 = (uint32_t *)input;
    shaCtx->shaFeed = '\x01';
  }
  if ((len & 0x3f) != 0) {
    iVar3 = 16000000;
    do {
      iVar3 = iVar3 + -1;
      if (iVar3 == 0) {
        return TIMEOUT;
      }
    } while ((_DAT_40004000 & 1) != 0);
    BL602_MemCpy_Fast((void *)((int)shaCtx->shaBuf + uVar4),psrc,len & 0x3f);
  }
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  return SUCCESS;
}



