pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_SHA256_Init(SEC_Eng_SHA256_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,
                        SEC_ENG_SHA_Type shaType,uint32_t *shaTmpBuf,uint32_t *padding)

{
  undefined3 in_register_00002031;
  
  _DAT_40004000 = CONCAT31(in_register_00002031,shaType) << 2 | _DAT_40004000 & 0xffffffe3;
  memset(shaCtx,0,0x14);
  shaCtx->shaPadding = padding;
  shaCtx->shaBuf = shaTmpBuf;
  BL602_MemSet(padding,'\0',0x40);
                    // WARNING: Treating indirect jump as call
  BL602_MemSet(shaCtx->shaPadding,-0x80,1);
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_SHA_Start(SEC_ENG_SHA_ID_Type shaNo)

{
  _DAT_40004000 = _DAT_40004000 & 0xffffffbf | 0x20;
  return;
}



BL_Err_Type
Sec_Eng_SHA256_Update
          (SEC_Eng_SHA256_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,uint8_t *input,uint32_t len)

{
  BL_Err_Type BVar1;
  
  if (len != 0) {
    BVar1 = Sec_Eng_SHA256_Update(shaCtx,input,len);
    return BVar1;
  }
  return SUCCESS;
}



// WARNING: Could not reconcile some variable overlaps
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type
Sec_Eng_SHA256_Finish(SEC_Eng_SHA256_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,uint8_t *hash)

{
  undefined4 uVar1;
  uint uVar2;
  int iVar3;
  uint uVar4;
  undefined uStack24;
  undefined uStack23;
  ushort uStack22;
  uint8_t msgLen [8];
  
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  uVar2 = shaCtx->total[0];
  uVar4 = shaCtx->total[1] << 3;
  uStack24 = (undefined)(uVar4 >> 0x18);
  uStack23 = (undefined)(uVar4 >> 0x10);
  uStack22 = (ushort)((uVar4 | uVar2 >> 0x1d) << 8) | (ushort)(uVar4 >> 8) & 0xff;
  msgLen[0] = (uint8_t)((uVar2 << 3) >> 0x18);
  msgLen[1] = (uint8_t)((uVar2 << 3) >> 0x10);
  msgLen._2_2_ = (ushort)((uVar2 << 0x13) >> 0x18) | (ushort)(uVar2 << 0xb);
  if ((uVar2 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  Sec_Eng_SHA256_Update(shaCtx,shaNo,(uint8_t *)shaCtx->shaPadding,iVar3 - (uVar2 & 0x3f));
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  BL602_MemCpy_Fast(shaCtx->shaPadding,&uStack24,8);
  Sec_Eng_SHA256_Update(shaCtx,(uint8_t *)shaCtx->shaPadding,8);
  uVar1 = _DAT_40004010;
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  uVar2 = _DAT_40004000 >> 2;
  *hash = (uint8_t)_DAT_40004010;
  hash[1] = (uint8_t)((uint)uVar1 >> 8);
  hash[2] = (uint8_t)((uint)uVar1 >> 0x10);
  hash[3] = (uint8_t)((uint)uVar1 >> 0x18);
  uVar1 = _DAT_40004014;
  hash[4] = (uint8_t)_DAT_40004014;
  hash[5] = (uint8_t)((uint)uVar1 >> 8);
  hash[6] = (uint8_t)((uint)uVar1 >> 0x10);
  hash[7] = (uint8_t)((uint)uVar1 >> 0x18);
  uVar1 = _DAT_40004018;
  hash[8] = (uint8_t)_DAT_40004018;
  hash[9] = (uint8_t)((uint)uVar1 >> 8);
  hash[10] = (uint8_t)((uint)uVar1 >> 0x10);
  hash[0xb] = (uint8_t)((uint)uVar1 >> 0x18);
  uVar1 = _DAT_4000401c;
  hash[0xc] = (uint8_t)_DAT_4000401c;
  hash[0xd] = (uint8_t)((uint)uVar1 >> 8);
  hash[0xe] = (uint8_t)((uint)uVar1 >> 0x10);
  hash[0xf] = (uint8_t)((uint)uVar1 >> 0x18);
  uVar1 = _DAT_40004020;
  hash[0x10] = (uint8_t)_DAT_40004020;
  hash[0x11] = (uint8_t)((uint)uVar1 >> 8);
  hash[0x13] = (uint8_t)((uint)uVar1 >> 0x18);
  hash[0x12] = (uint8_t)((uint)uVar1 >> 0x10);
  uVar1 = _DAT_40004024;
  if ((uVar2 & 6) == 0) {
    hash[0x14] = (uint8_t)_DAT_40004024;
    hash[0x15] = (uint8_t)((uint)uVar1 >> 8);
    hash[0x16] = (uint8_t)((uint)uVar1 >> 0x10);
    hash[0x17] = (uint8_t)((uint)uVar1 >> 0x18);
    uVar1 = _DAT_40004028;
    hash[0x18] = (uint8_t)_DAT_40004028;
    hash[0x19] = (uint8_t)((uint)uVar1 >> 8);
    hash[0x1a] = (uint8_t)((uint)uVar1 >> 0x10);
    hash[0x1b] = (uint8_t)((uint)uVar1 >> 0x18);
    uVar1 = _DAT_4000402c;
    if ((uVar2 & 7) == 0) {
      hash[0x1c] = (uint8_t)_DAT_4000402c;
      hash[0x1d] = (uint8_t)((uint)uVar1 >> 8);
      hash[0x1e] = (uint8_t)((uint)uVar1 >> 0x10);
      hash[0x1f] = (uint8_t)((uint)uVar1 >> 0x18);
    }
  }
  _DAT_40004000 = _DAT_40004000 & 0xffffff9f;
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_SHA_Enable_Link(SEC_ENG_SHA_ID_Type shaNo)

{
  _DAT_40004000 = _DAT_40004000 | 0x8020;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_SHA_Disable_Link(SEC_ENG_SHA_ID_Type shaNo)

{
  _DAT_40004000 = _DAT_40004000 & 0xffff7fdf;
  return;
}



void Sec_Eng_SHA256_Link_Init
               (SEC_Eng_SHA256_Link_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,uint32_t linkAddr,
               uint32_t *shaTmpBuf,uint32_t *padding)

{
  memset(shaCtx,0,0x14);
  shaCtx->shaPadding = padding;
  shaCtx->shaBuf = shaTmpBuf;
  BL602_MemSet(padding,'\0',0x40);
  BL602_MemSet(shaCtx->shaPadding,-0x80,1);
  shaCtx->linkAddr = linkAddr;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type
Sec_Eng_SHA256_Link_Update
          (SEC_Eng_SHA256_Link_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,uint8_t *input,uint32_t len)

{
  int iVar1;
  uint n;
  uint uVar2;
  
  if (len == 0) {
    return SUCCESS;
  }
  iVar1 = 16000000;
  do {
    iVar1 = iVar1 + -1;
    if (iVar1 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  _DAT_40004050 = shaCtx->linkAddr;
  uVar2 = shaCtx->total[0] & 0x3f;
  n = shaCtx->total[0] + len;
  shaCtx->total[0] = n;
  if (n < len) {
    shaCtx->total[1] = shaCtx->total[1] + 1;
  }
  if ((uVar2 != 0) && (n = 0x40 - uVar2, n <= len)) {
    BL602_MemCpy_Fast((void *)((int)shaCtx->shaBuf + uVar2),input,n);
    input = input + n;
    *(uint32_t **)(shaCtx->linkAddr + 4) = shaCtx->shaBuf;
    *(undefined2 *)(shaCtx->linkAddr + 2) = 1;
    _DAT_40004000 = _DAT_40004000 | 2;
    len = (len + uVar2) - 0x40;
    *(uint *)shaCtx->linkAddr = *(uint *)shaCtx->linkAddr | 0x40;
    uVar2 = 0;
  }
  if (0x3f < len) {
    iVar1 = 16000000;
    do {
      iVar1 = iVar1 + -1;
      if (iVar1 == 0) {
        return TIMEOUT;
      }
    } while ((_DAT_40004000 & 1) != 0);
    *(uint8_t **)(shaCtx->linkAddr + 4) = input;
    input = input + (len & 0xffffffc0);
    *(undefined2 *)(shaCtx->linkAddr + 2) = (short)(len >> 6);
    _DAT_40004000 = _DAT_40004000 | 2;
    *(uint *)shaCtx->linkAddr = *(uint *)shaCtx->linkAddr | 0x40;
  }
  if ((len & 0x3f) != 0) {
    iVar1 = 16000000;
    do {
      iVar1 = iVar1 + -1;
      if (iVar1 == 0) {
        return TIMEOUT;
      }
    } while ((_DAT_40004000 & 1) != 0);
    BL602_MemCpy_Fast((void *)((int)shaCtx->shaBuf + uVar2),input,len & 0x3f);
  }
  iVar1 = 16000000;
  do {
    iVar1 = iVar1 + -1;
    if (iVar1 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  return SUCCESS;
}



