pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type
Sec_Eng_SHA256_Link_Finish(SEC_Eng_SHA256_Link_Ctx *shaCtx,SEC_ENG_SHA_ID_Type shaNo,uint8_t *hash)

{
  uint uVar1;
  uint32_t n;
  uint uVar2;
  int iVar3;
  uint uVar4;
  uint8_t uStack40;
  undefined uStack39;
  ushort uStack38;
  uint8_t msgLen [8];
  
  iVar3 = 16000000;
  uVar1 = *(uint *)shaCtx->linkAddr;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  uVar2 = shaCtx->total[0];
  uVar4 = shaCtx->total[1] << 3;
  uStack40 = (uint8_t)(uVar4 >> 0x18);
  uStack39 = (undefined)(uVar4 >> 0x10);
  uStack38 = (ushort)((uVar4 | uVar2 >> 0x1d) << 8) | (ushort)(uVar4 >> 8) & 0xff;
  msgLen[0] = (uint8_t)((uVar2 << 3) >> 0x18);
  msgLen[1] = (uint8_t)((uVar2 << 3) >> 0x10);
  msgLen._2_2_ = (ushort)((uVar2 << 0x13) >> 0x18) | (ushort)(uVar2 << 0xb);
  if ((uVar2 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  _DAT_40004050 = (uint *)shaCtx->linkAddr;
  Sec_Eng_SHA256_Link_Update(shaCtx,shaNo,(uint8_t *)shaCtx->shaPadding,iVar3 - (uVar2 & 0x3f));
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  Sec_Eng_SHA256_Link_Update(shaCtx,shaNo,&uStack40,8);
  iVar3 = 16000000;
  do {
    iVar3 = iVar3 + -1;
    if (iVar3 == 0) {
      return TIMEOUT;
    }
  } while ((_DAT_40004000 & 1) != 0);
  uVar1 = uVar1 >> 2 & 7;
  if (uVar1 == 1) {
    n = 0x1c;
  }
  else {
    if (uVar1 == 0) {
      n = 0x20;
    }
    else {
      n = 0x14;
      if (3 < uVar1) goto LAB_230537a0;
    }
  }
  BL602_MemCpy_Fast(hash,(void *)(shaCtx->linkAddr + 8),n);
LAB_230537a0:
  *(uint *)shaCtx->linkAddr = *(uint *)shaCtx->linkAddr & 0xffffffbf;
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_AES_Enable_Link(SEC_ENG_AES_ID_Type aesNo)

{
  _DAT_40004100 = _DAT_40004100 | 0x8000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_AES_Disable_Link(SEC_ENG_AES_ID_Type aesNo)

{
  _DAT_40004100 = _DAT_40004100 & 0xffff7fff;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type
Sec_Eng_AES_Link_Work
          (SEC_ENG_AES_ID_Type aesNo,uint32_t linkAddr,uint8_t *in,uint32_t len,uint8_t *out)

{
  BL_Err_Type BVar1;
  int iVar2;
  
  BVar1 = ERROR;
  if ((linkAddr & 3 | len & 0xf) == 0) {
    iVar2 = 16000000;
    do {
      iVar2 = iVar2 + -1;
      if (iVar2 == 0) {
        return TIMEOUT;
      }
    } while ((_DAT_40004100 & 1) != 0);
    _DAT_40004150 = linkAddr;
    *(uint8_t **)(linkAddr + 4) = in;
    *(uint8_t **)(linkAddr + 8) = out;
    *(undefined2 *)(linkAddr + 2) = (short)(len >> 4);
    iVar2 = 16000000;
    do {
      iVar2 = iVar2 + -1;
      if (iVar2 == 0) {
        _DAT_40004100 = _DAT_40004100 | 6;
        return TIMEOUT;
      }
    } while ((_DAT_40004100 & 1) != 0);
    _DAT_40004100 = (_DAT_40004100 | 6) & 0xfffffffb;
    BVar1 = SUCCESS;
  }
  return BVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Reset(void)

{
  _DAT_40004300 = 8;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_BigEndian_Enable(void)

{
  _DAT_40004300 = _DAT_40004300 | 0x1000;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Clear_Int(void)

{
  _DAT_40004300 = _DAT_40004300 & 0xfffffdff;
  return;
}



void Sec_Eng_PKA_Read_Block(uint32_t *dest,uint32_t *src,uint32_t len)

{
  uint uVar1;
  
  uVar1 = 0;
  while (uVar1 != (len & 0xfffffffc)) {
    dest[uVar1] = *src;
    uVar1 = uVar1 + 1;
  }
  return;
}



void Sec_Eng_PKA_Write_Block(uint32_t *dest,uint32_t *src,uint32_t len)

{
  uint32_t *puVar1;
  uint uVar2;
  
  uVar2 = 0;
  while (uVar2 != (len & 0xfffffffc)) {
    puVar1 = src + uVar2;
    uVar2 = uVar2 + 1;
    *dest = *puVar1;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Write_Data
               (SEC_ENG_PKA_REG_SIZE_Type regType,uint8_t regIndex,uint32_t *data,uint16_t size,
               uint8_t lastOp)

{
  undefined3 in_register_0000202d;
  uint uVar1;
  undefined2 in_register_00002036;
  uint uVar2;
  
  uVar1 = (uint)regType - 1 & 0xff;
  uVar2 = 0;
  if (uVar1 < 10) {
    uVar2 = (uint)*(ushort *)(CSWTCH_116 + uVar1 * 2);
  }
  _DAT_40004340 =
       (uint)size & 0xfff | CONCAT31(in_register_0000202d,regIndex) << 0xc |
       ((uint)regType & 0xf) << 0x14 | 0x39000000 | (uint)lastOp << 0x1f;
  uVar1 = uVar2 >> 2;
  if (CONCAT22(in_register_00002036,size) < uVar2 >> 2) {
    uVar1 = CONCAT22(in_register_00002036,size);
  }
  Sec_Eng_PKA_Write_Block((uint32_t *)&DAT_40004340,data,uVar1 & 0xffff);
  uVar2 = uVar1 & 0xfffc;
  while ((int)uVar2 < (int)(uVar1 & 0xffff)) {
    _DAT_40004340 = data[uVar2];
    uVar2 = uVar2 + 1;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Read_Data
               (SEC_ENG_PKA_REG_SIZE_Type regType,uint8_t regIdx,uint32_t *result,uint8_t retSize)

{
  undefined3 in_register_00002035;
  uint len;
  uint uVar1;
  uint uVar2;
  
  len = CONCAT31(in_register_00002035,retSize);
  uVar2 = (uint)regType - 1 & 0xff;
  uVar1 = 0;
  if (uVar2 < 10) {
    uVar1 = (uint)*(ushort *)(CSWTCH_116 + uVar2 * 2);
  }
  if (len <= uVar1 >> 2) {
    _DAT_40004340 = 0;
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    Sec_Eng_PKA_Read_Block(result,(uint32_t *)&DAT_40004340,len);
    uVar1 = len & 0xfffffffc;
    while ((int)uVar1 < (int)len) {
      result[uVar1] = _DAT_40004340;
      uVar1 = uVar1 + 1;
    }
    return;
  }
  return;
}



