pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_Type dRegType,uint8_t dRegIdx,uint8_t size,uint8_t lastOp
                     )

{
  undefined3 in_register_00002035;
  
  _DAT_40004340 = 0;
  if (CONCAT31(in_register_00002035,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  _DAT_40004340 = 0;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_Move_Data
               (uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,uint8_t lastOp)

{
  undefined3 in_register_00002039;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'2',lastOp);
  _DAT_40004340 = 0;
  if (CONCAT31(in_register_00002039,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  _DAT_40004340 = 0;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_MREM(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                     uint8_t s2RegType,uint8_t s2RegIdx,uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  undefined3 in_register_00002041;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'&',lastOp);
  _DAT_40004340 = ((uint)s2RegType & 0xf) << 8 | CONCAT31(in_register_0000203d,s2RegIdx);
  if (CONCAT31(in_register_00002041,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_MEXP(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                     uint8_t s1RegType,uint8_t s1RegIdx,uint8_t s2RegType,uint8_t s2RegIdx,
                     uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  undefined3 in_register_00002045;
  uint8_t in_stack_00000000;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'#',in_stack_00000000);
  _DAT_40004340 =
       CONCAT31(in_register_0000203d,s1RegIdx) << 0xc | ((uint)s1RegType & 0xf) << 0x14 |
       CONCAT31(in_register_00002045,s2RegIdx) | ((uint)s2RegType & 0xf) << 8;
  if (in_stack_00000000 != '\0') {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_LCMP(uint8_t *cout,uint8_t s0RegType,uint8_t s0RegIdx,uint8_t s1RegType,
                     uint8_t s1RegIdx)

{
  undefined3 in_register_00002039;
  
  _DAT_40004340 = CONCAT31(in_register_00002039,s1RegIdx) << 0xc | ((uint)s1RegType & 0xf) << 0x14;
  Sec_Eng_PKA_Wait_ISR();
  Sec_Eng_PKA_Clear_Int();
  *cout = (byte)((uint)_DAT_40004300 >> 0x18) & 1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_LSUB(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                     uint8_t s1RegType,uint8_t s1RegIdx,uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  undefined3 in_register_00002041;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'\x17',lastOp);
  _DAT_40004340 = CONCAT31(in_register_0000203d,s1RegIdx) << 0xc | ((uint)s1RegType & 0xf) << 0x14;
  if (CONCAT31(in_register_00002041,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_LMUL(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                     uint8_t s1RegType,uint8_t s1RegIdx,uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  undefined3 in_register_00002041;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'\x16',lastOp);
  _DAT_40004340 = CONCAT31(in_register_0000203d,s1RegIdx) << 0xc | ((uint)s1RegType & 0xf) << 0x14;
  if (CONCAT31(in_register_00002041,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_LDIV(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                     uint8_t s2RegType,uint8_t s2RegIdx,uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  undefined3 in_register_00002041;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'\x14',lastOp);
  _DAT_40004340 = ((uint)s2RegType & 0xf) << 8 | CONCAT31(in_register_0000203d,s2RegIdx);
  if (CONCAT31(in_register_00002041,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void Sec_Eng_PKA_LMUL2N(uint8_t dRegType,uint8_t dRegIdx,uint8_t s0RegType,uint8_t s0RegIdx,
                       uint16_t bit_shift,uint8_t lastOp)

{
  undefined3 in_register_0000203d;
  
  Sec_Eng_PKA_Write_Common_OP_First_Cfg(s0RegIdx,s0RegType,dRegIdx,dRegType,'\x13','\0');
  _DAT_40004340 = (uint)bit_shift & 0x7fff;
  if (CONCAT31(in_register_0000203d,lastOp) != 0) {
    Sec_Eng_PKA_Wait_ISR();
    Sec_Eng_PKA_Clear_Int();
    return;
  }
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void SEC_Eng_IntMask(SEC_ENG_INT_Type intType,BL_Mask_Type intMask)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  int iVar1;
  
  iVar1 = CONCAT31(in_register_0000202d,intMask);
  switch(CONCAT31(in_register_00002029,intType)) {
  case 0:
    if (iVar1 == 0) {
      _DAT_40004200 = _DAT_40004200 & 0xfffff7ff;
    }
    else {
      _DAT_40004200 = _DAT_40004200 | 0x800;
    }
    return;
  case 1:
    if (iVar1 == 0) {
      _DAT_40004100 = _DAT_40004100 & 0xfffff7ff;
    }
    else {
      _DAT_40004100 = _DAT_40004100 | 0x800;
    }
    return;
  case 2:
    if (iVar1 == 0) {
      _DAT_40004000 = _DAT_40004000 & 0xfffff7ff;
    }
    else {
      _DAT_40004000 = _DAT_40004000 | 0x800;
    }
    return;
  case 3:
    if (iVar1 == 0) {
      _DAT_40004300 = _DAT_40004300 & 0xfffff7ff;
    }
    else {
      _DAT_40004300 = _DAT_40004300 | 0x800;
    }
    return;
  case 5:
    if (iVar1 == 0) {
      _DAT_40004500 = _DAT_40004500 & 0xfffff7ff;
    }
    else {
      _DAT_40004500 = _DAT_40004500 | 0x800;
    }
    return;
  case 6:
    if (iVar1 == 0) {
      _DAT_40004200 = _DAT_40004200 & 0xfffff7ff;
      _DAT_40004100 = _DAT_40004100 & 0xfffff7ff;
      _DAT_40004000 = _DAT_40004000 & 0xfffff7ff;
      _DAT_40004300 = _DAT_40004300 & 0xfffff7ff;
      _DAT_40004500 = _DAT_40004500 & 0xfffff7ff;
    }
    else {
      _DAT_40004200 = _DAT_40004200 | 0x800;
      _DAT_40004100 = _DAT_40004100 | 0x800;
      _DAT_40004000 = _DAT_40004000 | 0x800;
      _DAT_40004300 = _DAT_40004300 | 0x800;
      _DAT_40004500 = _DAT_40004500 | 0x800;
    }
  }
  return;
}



