pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void DMA_Enable(void)

{
  _DAT_4000c030 = _DAT_4000c030 | 1;
  return;
}



void DMA_Channel_Enable(uint8_t ch)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  
  puVar1 = (uint *)(CONCAT31(in_register_00002029,ch) * 0x100 + 0x4000c110);
  *puVar1 = *puVar1 | 1;
  return;
}



void DMA_LLI_Init(uint8_t ch,DMA_LLI_Cfg_Type *lliCfg)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  
  puVar1 = (uint *)(CONCAT31(in_register_00002029,ch) * 0x100 + 0x4000c110);
  *puVar1 = (uint)lliCfg->dir << 0xb | *puVar1 & 0xffffc001 | (uint)lliCfg->dstPeriph << 6 |
            (uint)lliCfg->srcPeriph << 1;
  return;
}



void DMA_LLI_Update(uint8_t ch,uint32_t LLI)

{
  undefined3 in_register_00002029;
  
                    // WARNING: Treating indirect jump as call
  BL602_MemCpy4((uint32_t *)(CONCAT31(in_register_00002029,ch) * 0x100 + 0x4000c100),(uint32_t *)LLI
                ,4);
  return;
}



void DMA_IntMask(uint8_t ch,DMA_INT_Type intType,BL_Mask_Type intMask)

{
  undefined3 in_register_00002029;
  int iVar1;
  uint *puVar2;
  undefined3 in_register_0000202d;
  int iVar3;
  undefined3 in_register_00002031;
  int iVar4;
  uint uVar5;
  uint uVar6;
  
  iVar4 = CONCAT31(in_register_00002031,intMask);
  iVar3 = CONCAT31(in_register_0000202d,intType);
  iVar1 = CONCAT31(in_register_00002029,ch) * 0x100;
  if (iVar3 == 1) {
    puVar2 = (uint *)(iVar1 + 0x4000c110);
    uVar6 = *puVar2;
    if (iVar4 == 0) {
      uVar6 = uVar6 & 0xffffbfff;
      goto LAB_23053e98;
    }
    uVar5 = 0x4000;
  }
  else {
    if (iVar3 == 0) {
      uVar6 = *(uint *)(iVar1 + 0x4000c110);
      iVar3 = -0x8000;
      if (iVar4 != 0) {
        uVar5 = 0x8000;
        goto LAB_23053e78;
      }
    }
    else {
      if (iVar3 != 2) {
        return;
      }
      uVar6 = *(uint *)(iVar1 + 0x4000c110);
      if (iVar4 != 0) {
        uVar5 = 0xc000;
LAB_23053e78:
        puVar2 = (uint *)(iVar1 + 0x4000c10c);
        *(uint *)(iVar1 + 0x4000c110) = uVar6 | uVar5;
        uVar6 = *puVar2 & 0x7fffffff;
        goto LAB_23053e98;
      }
      iVar3 = -0xc000;
    }
    puVar2 = (uint *)(iVar1 + 0x4000c10c);
    *(uint *)(iVar1 + 0x4000c110) = uVar6 & iVar3 - 1U;
    uVar6 = *puVar2;
    uVar5 = 0x80000000;
  }
  uVar6 = uVar6 | uVar5;
LAB_23053e98:
  *puVar2 = uVar6;
  return;
}



void Default_Handler(void)

{
  bflb_platform_printf("Default_Handler\r\n");
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type GLB_Set_UART_CLK(uint8_t enable,HBN_UART_CLK_Type clkSel,uint8_t div)

{
  undefined3 in_register_00002029;
  undefined3 in_register_00002031;
  uint uVar1;
  
  _DAT_40000008 = CONCAT31(in_register_00002031,div) | _DAT_40000008 & 0xffffffe8;
  HBN_Set_UART_CLK_Sel(clkSel);
  uVar1 = _DAT_40000008 | 0x10;
  if (CONCAT31(in_register_00002029,enable) == 0) {
    uVar1 = _DAT_40000008 & 0xffffffef;
  }
  _DAT_40000008 = uVar1;
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type GLB_Set_ADC_CLK(uint8_t enable,GLB_ADC_CLK_Type clkSel,uint8_t div)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  undefined3 in_register_00002031;
  uint uVar1;
  
  uVar1 = (CONCAT31(in_register_00002031,div) | _DAT_400000a4 & 0xfffffec0) & 0xffffff7f |
          CONCAT31(in_register_0000202d,clkSel) << 7;
  _DAT_400000a4 = uVar1 & 0xfffffeff;
  if (CONCAT31(in_register_00002029,enable) != 0) {
    _DAT_400000a4 = uVar1 | 0x100;
  }
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type GLB_UART_Fun_Sel(GLB_UART_SIG_Type sig,GLB_UART_SIG_FUN_Type fun)

{
  undefined3 in_register_0000202d;
  
  _DAT_400000c0 =
       ~(0xf << (((uint)sig & 7) << 2)) & _DAT_400000c0 |
       CONCAT31(in_register_0000202d,fun) << (((uint)sig & 7) << 2);
  return SUCCESS;
}



BL_Err_Type GLB_GPIO_Write(GLB_GPIO_Type gpioPin,uint32_t val)

{
  undefined3 in_register_00002029;
  uint uVar1;
  uint uVar2;
  uint *puVar3;
  
  puVar3 = (uint *)((CONCAT31(in_register_00002029,gpioPin) >> 5) * 4 + 0x40000188);
  uVar2 = *puVar3;
  uVar1 = 1 << ((uint)gpioPin & 0x1f);
  if (val == 0) {
    uVar1 = ~uVar1 & uVar2;
  }
  else {
    uVar1 = uVar1 | uVar2;
  }
  *puVar3 = uVar1;
  return SUCCESS;
}



uint32_t GLB_GPIO_Read(GLB_GPIO_Type gpioPin)

{
  undefined3 in_register_00002029;
  
  return (uint)((1 << ((uint)gpioPin & 0x1f) &
                *(uint *)((CONCAT31(in_register_00002029,gpioPin) >> 5) * 4 + 0x40000180)) != 0);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type HBN_Set_UART_CLK_Sel(HBN_UART_CLK_Type clkSel)

{
  undefined3 in_register_00002029;
  
  _DAT_4000f030 = CONCAT31(in_register_00002029,clkSel) << 2 | _DAT_4000f030 & 0xfffffffb;
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type HBN_Get_RTC_Timer_Val(uint32_t *valLow,uint32_t *valHigh)

{
  _DAT_4000f010 = _DAT_4000f010 & 0x7fffffff;
  *valLow = _DAT_4000f00c;
  *valHigh = _DAT_4000f010 & 0xff;
  return SUCCESS;
}



void TIMER_SetCompValue(TIMER_Chan_Type timerCh,TIMER_Comp_ID_Type cmpNo,uint32_t val)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  
  *(uint32_t *)
   ((CONCAT31(in_register_00002029,timerCh) * 3 + CONCAT31(in_register_0000202d,cmpNo)) * 4 +
   0x4000a510) = val;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void TIMER_SetCountMode(TIMER_Chan_Type timerCh,TIMER_CountMode_Type countMode)

{
  undefined3 in_register_0000202d;
  
  _DAT_4000a588 =
       ~(1 << ((uint)timerCh + 1 & 0x1f)) & _DAT_4000a588 |
       CONCAT31(in_register_0000202d,countMode) << ((uint)timerCh + 1 & 0x1f);
  return;
}



