pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void TIMER_ClearIntStatus(TIMER_Chan_Type timerCh,TIMER_Comp_ID_Type cmpNo)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  
  puVar1 = (uint *)(CONCAT31(in_register_00002029,timerCh) * 4 + 0x4000a578);
  *puVar1 = 1 << ((uint)cmpNo & 0x1f) | *puVar1;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type TIMER_Init(TIMER_CFG_Type *timerCfg)

{
  TIMER_Chan_Type timerCh;
  uint uVar1;
  uint uVar2;
  
  timerCh = timerCfg->timerCh;
  if (timerCh == TIMER_CH0) {
    _DAT_4000a500 = _DAT_4000a500 & 0xfffffff3;
    uVar1 = (uint)timerCfg->clkSrc << 2;
  }
  else {
    _DAT_4000a500 = _DAT_4000a500 & 0xffffff9f;
    uVar1 = (uint)timerCfg->clkSrc << 5;
  }
  _DAT_4000a500 = uVar1 | _DAT_4000a500;
  if (timerCh == TIMER_CH0) {
    uVar1 = 0xffff00ff;
    uVar2 = (uint)timerCfg->clockDivision << 8;
  }
  else {
    uVar1 = 0xff00ffff;
    uVar2 = (uint)timerCfg->clockDivision << 0x10;
  }
  _DAT_4000a5bc = uVar2 | uVar1 & _DAT_4000a5bc;
  TIMER_SetCountMode(timerCh,timerCfg->countMode);
  *(uint *)((uint)timerCh * 4 + 0x4000a55c) = (uint)timerCfg->plTrigSrc;
  if (timerCfg->countMode == TIMER_COUNT_PRELOAD) {
    *(uint32_t *)((uint)timerCh * 4 + 0x4000a550) = timerCfg->preLoadVal;
  }
  TIMER_SetCompValue(timerCh,TIMER_COMP_ID_0,timerCfg->matchVal0);
  TIMER_SetCompValue(timerCh,TIMER_COMP_ID_1,timerCfg->matchVal1);
  TIMER_SetCompValue(timerCh,TIMER_COMP_ID_2,timerCfg->matchVal2);
  return SUCCESS;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void TIMER_Enable(TIMER_Chan_Type timerCh)

{
  _DAT_4000a584 = 1 << ((uint)timerCh + 1 & 0x1f) | _DAT_4000a584;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void TIMER_Disable(TIMER_Chan_Type timerCh)

{
  _DAT_4000a584 = ~(1 << ((uint)timerCh + 1 & 0x1f)) & _DAT_4000a584;
  return;
}



void TIMER_IntMask(TIMER_Chan_Type timerCh,TIMER_INT_Type intType,BL_Mask_Type intMask)

{
  undefined3 in_register_00002029;
  uint *puVar1;
  undefined3 in_register_0000202d;
  int iVar2;
  undefined3 in_register_00002031;
  int iVar3;
  uint uVar4;
  
  iVar3 = CONCAT31(in_register_00002031,intMask);
  iVar2 = CONCAT31(in_register_0000202d,intType);
  puVar1 = (uint *)(CONCAT31(in_register_00002029,timerCh) * 4 + 0x4000a544);
  uVar4 = *puVar1;
  if (iVar2 == 1) {
    if (iVar3 == 0) {
      uVar4 = uVar4 | 2;
    }
    else {
      uVar4 = uVar4 & 0xfffffffd;
    }
    goto LAB_2305416e;
  }
  if (iVar2 == 0) {
    if (iVar3 == 0) {
      uVar4 = uVar4 | 1;
    }
    else {
      uVar4 = uVar4 & 0xfffffffe;
    }
    goto LAB_2305416e;
  }
  if (iVar2 == 2) {
    if (iVar3 != 0) goto LAB_230541a6;
  }
  else {
    if (iVar2 != 3) {
      return;
    }
    if (iVar3 != 0) {
      *puVar1 = uVar4 & 0xfffffffe;
      *puVar1 = uVar4 & 0xfffffffd;
LAB_230541a6:
      uVar4 = uVar4 & 0xfffffffb;
      goto LAB_2305416e;
    }
    *puVar1 = uVar4 | 1;
    *puVar1 = uVar4 | 2;
  }
  uVar4 = uVar4 | 4;
LAB_2305416e:
  *puVar1 = uVar4;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_Set_Clock(TIMER_ClkSrc_Type clkSrc,uint8_t div)

{
  undefined3 in_register_00002029;
  
  _DAT_4000a500 = CONCAT31(in_register_00002029,clkSrc) << 8 | _DAT_4000a500 & 0xfffffcff;
  _DAT_4000a5bc = _DAT_4000a5bc & 0xffffff | (uint)div << 0x18;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_SetCompValue(uint16_t val)

{
  undefined2 in_register_0000202a;
  
  _DAT_4000a568 = CONCAT22(in_register_0000202a,val);
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_ResetCounterValue(void)

{
  _DAT_4000a598 = _DAT_4000a598 | 1;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_Enable(void)

{
  _DAT_4000a564 = _DAT_4000a564 | 1;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_Disable(void)

{
  _DAT_4000a564 = _DAT_4000a564 & 0xfffffffe;
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void WDT_IntMask(WDT_INT_Type intType,BL_Mask_Type intMask)

{
  undefined3 in_register_00002029;
  undefined3 in_register_0000202d;
  
  if (CONCAT31(in_register_00002029,intType) == 0) {
    if (CONCAT31(in_register_0000202d,intMask) == 0) {
      _DAT_4000a564 = _DAT_4000a564 & 0xfffffffd;
    }
    else {
      _DAT_4000a564 = _DAT_4000a564 | 2;
    }
  }
  _DAT_4000a59c = _DAT_4000a59c & 0xffff0000 | 0xbaba;
  _DAT_4000a5a0 = _DAT_4000a5a0 & 0xffff0000 | 0xeb10;
  return;
}



uint32_t EF_Ctrl_Get_Byte_Zero_Cnt(uint8_t val)

{
  undefined3 in_register_00002029;
  uint32_t uVar1;
  uint uVar2;
  
  uVar2 = 0;
  uVar1 = 0;
  do {
    if ((CONCAT31(in_register_00002029,val) >> (uVar2 & 0x1f) & 1U) == 0) {
      uVar1 = uVar1 + 1;
    }
    uVar2 = uVar2 + 1;
  } while (uVar2 != 8);
  return uVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type EF_Ctrl_Read_MAC_Address(uint8_t *mac)

{
  uint8_t uVar1;
  undefined4 uVar2;
  uint uVar3;
  BL_Err_Type BVar4;
  uint32_t uVar5;
  uint8_t *puVar6;
  uint8_t *puVar7;
  uint8_t *puVar8;
  int iVar9;
  uint uVar10;
  
  EF_Ctrl_Load_Efuse_R0();
  uVar2 = _DAT_40007014;
  uVar10 = 0;
  iVar9 = 0;
  *mac = (uint8_t)_DAT_40007014;
  mac[1] = (uint8_t)((uint)uVar2 >> 8);
  mac[3] = (uint8_t)((uint)uVar2 >> 0x18);
  mac[2] = (uint8_t)((uint)uVar2 >> 0x10);
  uVar3 = _DAT_40007018;
  mac[4] = (uint8_t)_DAT_40007018;
  mac[5] = (uint8_t)(uVar3 >> 8);
  do {
    puVar7 = mac + iVar9;
    iVar9 = iVar9 + 1;
    uVar5 = EF_Ctrl_Get_Byte_Zero_Cnt(*puVar7);
    uVar10 = uVar10 + uVar5;
  } while (iVar9 != 6);
  BVar4 = ERROR;
  if (((uVar3 >> 0x10 ^ uVar10) & 0x3f) == 0) {
    puVar6 = mac + 2;
    puVar7 = mac + 5;
    do {
      uVar1 = *mac;
      puVar8 = puVar7 + -1;
      *mac = *puVar7;
      *puVar7 = uVar1;
      mac = mac + 1;
      puVar7 = puVar8;
    } while (puVar8 != puVar6);
    BVar4 = SUCCESS;
  }
  return BVar4;
}



