pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t EF_Ctrl_Is_MAC_Address_Slot_Empty(uint8_t slot,uint8_t reload)

{
  undefined3 in_register_00002029;
  int iVar1;
  undefined3 in_register_0000202d;
  int iVar2;
  uint uVar3;
  uint uVar4;
  
  iVar2 = CONCAT31(in_register_0000202d,reload);
  iVar1 = CONCAT31(in_register_00002029,slot);
  if (iVar1 == 0) {
    EF_Ctrl_Sw_AHB_Clk_0();
    uVar3 = _DAT_40007014;
    uVar4 = _DAT_40007018;
    if (iVar2 != 0) {
      EF_Ctrl_Load_Efuse_R0();
      uVar3 = _DAT_40007014;
      uVar4 = _DAT_40007018;
    }
  }
  else {
    if (iVar1 == 1) {
      EF_Ctrl_Sw_AHB_Clk_0();
      uVar3 = _DAT_4000706c;
      uVar4 = _DAT_40007070;
      if (iVar2 != 0) {
        EF_Ctrl_Load_Efuse_R0();
        uVar3 = _DAT_4000706c;
        uVar4 = _DAT_40007070;
      }
    }
    else {
      if (iVar1 != 2) {
        return '\0';
      }
      EF_Ctrl_Sw_AHB_Clk_0();
      uVar3 = _DAT_40007004;
      uVar4 = _DAT_40007008;
      if (iVar2 != 0) {
        EF_Ctrl_Load_Efuse_R0();
        uVar3 = _DAT_40007004;
        uVar4 = _DAT_40007008;
      }
    }
  }
  if ((uVar4 & 0x3fffff | uVar3) != 0) {
    return '\0';
  }
  return '\x01';
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type EF_Ctrl_Read_MAC_Address_Opt(uint8_t slot,uint8_t *mac,uint8_t reload)

{
  uint8_t uVar1;
  uint uVar2;
  BL_Err_Type BVar3;
  undefined3 in_register_00002029;
  uint32_t uVar4;
  undefined3 in_register_00002031;
  uint8_t *puVar5;
  undefined4 uVar6;
  uint8_t *puVar7;
  uint8_t *puVar8;
  int iVar9;
  uint uVar10;
  
  uVar10 = CONCAT31(in_register_00002029,slot);
  if (2 < uVar10) {
    return ERROR;
  }
  if (CONCAT31(in_register_00002031,reload) == 0) {
LAB_23054456:
    uVar6 = _DAT_40007014;
    if ((uVar10 == 0) || (uVar6 = _DAT_4000706c, uVar10 == 1)) goto LAB_2305445e;
  }
  else {
    if (uVar10 != 2) {
      EF_Ctrl_Load_Efuse_R0();
      goto LAB_23054456;
    }
    EF_Ctrl_Load_Efuse_R0();
  }
  uVar6 = _DAT_40007004;
LAB_2305445e:
  *mac = (uint8_t)uVar6;
  mac[1] = (uint8_t)((uint)uVar6 >> 8);
  mac[2] = (uint8_t)((uint)uVar6 >> 0x10);
  mac[3] = (uint8_t)((uint)uVar6 >> 0x18);
  uVar2 = _DAT_40007018;
  if ((uVar10 != 0) && (uVar2 = _DAT_40007008, uVar10 == 1)) {
    uVar2 = _DAT_40007070;
  }
  mac[4] = (uint8_t)uVar2;
  mac[5] = (uint8_t)(uVar2 >> 8);
  uVar10 = 0;
  iVar9 = 0;
  do {
    puVar7 = mac + iVar9;
    iVar9 = iVar9 + 1;
    uVar4 = EF_Ctrl_Get_Byte_Zero_Cnt(*puVar7);
    uVar10 = uVar10 + uVar4;
  } while (iVar9 != 6);
  BVar3 = ERROR;
  if (((uVar2 >> 0x10 ^ uVar10) & 0x3f) == 0) {
    puVar5 = mac + 2;
    puVar7 = mac + 5;
    do {
      uVar1 = *mac;
      puVar8 = puVar7 + -1;
      *mac = *puVar7;
      *puVar7 = uVar1;
      mac = mac + 1;
      puVar7 = puVar8;
    } while (puVar5 != puVar8);
    BVar3 = SUCCESS;
  }
  return BVar3;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint EF_Ctrl_Is_CapCode_Slot_Empty(int param_1,int param_2)

{
  uint uVar1;
  
  EF_Ctrl_Sw_AHB_Clk_0();
  if (param_2 != 0) {
    EF_Ctrl_Load_Efuse_R0();
  }
  if (param_1 == 0) {
    uVar1 = _DAT_4000700c >> 2;
  }
  else {
    uVar1 = _DAT_40007070;
    if ((param_1 != 1) && (uVar1 = _DAT_40007008, param_1 != 2)) {
      return 0;
    }
    uVar1 = uVar1 >> 0x16;
  }
  return (uint)((uVar1 & 0xff) == 0);
}



// WARNING: Variable defined which should be unmapped: tmp
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type EF_Ctrl_Read_CapCode_Opt(uint8_t slot,uint8_t *code,uint8_t reload)

{
  uint8_t uVar1;
  undefined3 in_register_00002029;
  uint uVar2;
  undefined3 extraout_var;
  undefined3 in_register_00002031;
  uint uVar3;
  uint32_t tmp;
  
  uVar2 = CONCAT31(in_register_00002029,slot);
  if (2 < uVar2) {
    return ERROR;
  }
  EF_Ctrl_Sw_AHB_Clk_0();
  if (CONCAT31(in_register_00002031,reload) != 0) {
    EF_Ctrl_Load_Efuse_R0();
  }
  if (uVar2 == 0) {
    uVar3 = _DAT_4000700c >> 2;
  }
  else {
    uVar3 = _DAT_40007008;
    if (uVar2 == 1) {
      uVar3 = _DAT_40007070;
    }
    uVar3 = uVar3 >> 0x16;
  }
  if ((uVar3 & 0x80) != 0) {
    uVar1 = EF_Ctrl_Get_Trim_Parity(uVar3 & 0x3f,'\x06');
    if ((uVar3 >> 6 & 1) == CONCAT31(extraout_var,uVar1)) {
      *code = (uint8_t)(uVar3 & 0x3f);
      return SUCCESS;
    }
  }
  return ERROR;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint8_t EF_Ctrl_Is_PowerOffset_Slot_Empty(uint8_t slot,uint8_t reload)

{
  byte bVar1;
  undefined3 in_register_00002029;
  int iVar2;
  undefined3 in_register_0000202d;
  byte bVar3;
  uint uVar4;
  
  iVar2 = CONCAT31(in_register_00002029,slot);
  EF_Ctrl_Sw_AHB_Clk_0();
  if (CONCAT31(in_register_0000202d,reload) != 0) {
    EF_Ctrl_Load_Efuse_R0();
  }
  if (iVar2 == 0) {
    bVar3 = 1;
    uVar4 = _DAT_40007078 >> 0xf;
  }
  else {
    if (iVar2 == 1) {
      bVar3 = (byte)_DAT_4000700c;
      uVar4 = _DAT_40007074 & 0xffff;
    }
    else {
      if (iVar2 != 2) {
        return '\0';
      }
      uVar4 = _DAT_40007074 >> 0x10;
      bVar3 = (byte)(_DAT_4000700c >> 1);
    }
    bVar3 = ~bVar3 & 1;
  }
  bVar1 = 0;
  if (uVar4 == 0) {
    bVar1 = bVar3;
  }
  return (uint8_t)bVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type EF_Ctrl_Read_PowerOffset_Opt(uint8_t slot,int8_t *pwrOffset,uint8_t reload)

{
  uint uVar1;
  int iVar2;
  uint32_t val;
  uint8_t uVar3;
  undefined3 in_register_00002029;
  undefined3 extraout_var;
  uint32_t uVar4;
  undefined3 in_register_00002031;
  byte bVar5;
  uint uVar6;
  undefined4 uVar7;
  
  iVar2 = CONCAT31(in_register_00002029,slot);
  uVar7 = EF_Ctrl_Sw_AHB_Clk_0();
  if (CONCAT31(in_register_00002031,reload) != 0) {
    EF_Ctrl_Load_Efuse_R0(uVar7);
  }
  if (iVar2 == 0) {
    val = (_DAT_40007078 << 1) >> 0x11;
    uVar1 = _DAT_40007078 >> 0x1f;
    uVar6 = _DAT_40007078 >> 0xf;
  }
  else {
    if (iVar2 == 1) {
      val = _DAT_40007074 & 0x7fff;
      uVar1 = _DAT_40007074 >> 0xf & 1;
      uVar6 = _DAT_4000700c;
    }
    else {
      if (iVar2 != 2) {
        return ERROR;
      }
      val = (_DAT_40007074 << 1) >> 0x11;
      uVar1 = _DAT_40007074 >> 0x1f;
      uVar6 = _DAT_4000700c >> 1;
    }
  }
  if (((uVar6 & 1) != 0) &&
     (uVar3 = EF_Ctrl_Get_Trim_Parity(val,'\x0f'), CONCAT31(extraout_var,uVar3) == uVar1)) {
    iVar2 = 0;
    do {
      uVar4 = val;
      __lshrdi3(val);
      bVar5 = (byte)uVar4 & 0x1f;
      if ((uVar4 & 0x10) != 0) {
        bVar5 = bVar5 - 0x20;
      }
      pwrOffset[iVar2] = bVar5;
      iVar2 = iVar2 + 1;
    } while (iVar2 != 3);
    return SUCCESS;
  }
  return ERROR;
}



int8_t mfg_media_read_xtal_capcode(uint8_t *capcode,uint8_t reload)

{
  int8_t iVar1;
  
  if (rf_para_on_flash != '\0') {
    iVar1 = mfg_flash_read_xtal_capcode(capcode,reload);
    return iVar1;
  }
  iVar1 = mfg_efuse_read_xtal_capcode(capcode,reload);
  return iVar1;
}



int8_t mfg_media_read_poweroffset(int8_t *pwrOffset,uint8_t reload)

{
  int8_t iVar1;
  
  if (rf_para_on_flash != '\0') {
    iVar1 = mfg_flash_read_poweroffset(pwrOffset,reload);
    return iVar1;
  }
  iVar1 = mfg_efuse_read_poweroffset(pwrOffset,reload);
  return iVar1;
}



int8_t mfg_media_read_macaddr(uint8_t *mac,uint8_t reload)

{
  int8_t iVar1;
  
  if (rf_para_on_flash != '\0') {
    iVar1 = mfg_flash_read_macaddr(mac,reload);
    return iVar1;
  }
  iVar1 = mfg_efuse_read_macaddr(mac,reload);
  return iVar1;
}



