pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void bflb_platform_usart_dbg_send(uint8_t *data,uint32_t len)

{
  UART_SendData(UART0_ID,data,len);
  return;
}



void bflb_platform_printf(char *fmt,...)

{
  char print_buf [128];
  size_t len;
  undefined4 in_a1;
  undefined4 in_a2;
  undefined4 in_a3;
  undefined4 in_a4;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list ap;
  undefined4 uStack28;
  undefined4 uStack24;
  undefined4 uStack20;
  undefined4 uStack16;
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  if (uart_dbg_disable == '\0') {
    uStack28 = in_a1;
    uStack24 = in_a2;
    uStack20 = in_a3;
    uStack16 = in_a4;
    uStack12 = in_a5;
    uStack8 = in_a6;
    uStack4 = in_a7;
    vsnprintf((char *)&ram0x42016b80,0x7f,fmt,&uStack28);
    len = strlen((char *)0x42016b80);
    bflb_platform_usart_dbg_send((uint8_t *)0x42016b80,len);
  }
  return;
}



// WARNING: Control flow encountered bad instruction data

void Default_Handler_Stub(void)

{
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



int8_t mfg_efuse_read_xtal_capcode(uint8_t *capcode,uint8_t reload)

{
  uint8_t bclkDiv;
  uint8_t hclkDiv;
  BL_Err_Type BVar1;
  int iVar2;
  undefined3 extraout_var;
  undefined3 in_register_0000202d;
  undefined4 uVar3;
  
  uVar3 = CONCAT31(in_register_0000202d,reload);
  bclkDiv = GLB_Get_BCLK_Div();
  hclkDiv = GLB_Get_HCLK_Div();
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_XTAL);
  if ((rf_cal_slots < 3) || (iVar2 = EF_Ctrl_Is_CapCode_Slot_Empty(2,uVar3), iVar2 != 0)) {
    if ((rf_cal_slots < 2) || (iVar2 = EF_Ctrl_Is_CapCode_Slot_Empty(1,uVar3), iVar2 != 0)) {
      if ((rf_cal_slots == '\0') || (iVar2 = EF_Ctrl_Is_CapCode_Slot_Empty(0,uVar3), iVar2 != 0)) {
        printf("No written slot found\r\n");
        iVar2 = 1;
        goto LAB_230548ee;
      }
    }
    else {
      iVar2 = 1;
    }
  }
  else {
    iVar2 = 2;
  }
  printf("Read slot:%d\r\n",iVar2);
  BVar1 = EF_Ctrl_Read_CapCode_Opt((uint8_t)iVar2,capcode,reload);
  iVar2 = CONCAT31(extraout_var,BVar1);
LAB_230548ee:
  GLB_Set_System_CLK_Div(hclkDiv,bclkDiv);
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
  return (int8_t)-(iVar2 != 0);
}



int8_t mfg_efuse_read_poweroffset(int8_t *pwrOffset,uint8_t reload)

{
  int iVar1;
  uint8_t bclkDiv;
  uint8_t hclkDiv;
  uint8_t uVar2;
  BL_Err_Type BVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  int iVar4;
  int iVar5;
  int8_t iStack36;
  char cStack35;
  char cStack34;
  int8_t pwrOffsetTmp [3];
  
  bclkDiv = GLB_Get_BCLK_Div();
  hclkDiv = GLB_Get_HCLK_Div();
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_XTAL);
  if ((rf_cal_slots < 3) ||
     (uVar2 = EF_Ctrl_Is_PowerOffset_Slot_Empty('\x02',reload), CONCAT31(extraout_var_00,uVar2) != 0
     )) {
    if ((rf_cal_slots < 2) ||
       (uVar2 = EF_Ctrl_Is_PowerOffset_Slot_Empty('\x01',reload), CONCAT31(extraout_var,uVar2) != 0)
       ) {
      if (rf_cal_slots != '\0') {
        uVar2 = EF_Ctrl_Is_PowerOffset_Slot_Empty('\0',reload);
        iVar1 = CONCAT31(extraout_var_01,uVar2);
        if (iVar1 == 0) goto LAB_230549a8;
      }
      printf("No written slot found\r\n");
      iVar1 = 1;
      goto LAB_23054aca;
    }
    iVar1 = 1;
  }
  else {
    iVar1 = 2;
  }
LAB_230549a8:
  printf("Read slot:%d\r\n",iVar1);
  BVar3 = EF_Ctrl_Read_PowerOffset_Opt((uint8_t)iVar1,&iStack36,reload);
  iVar1 = CONCAT31(extraout_var_02,BVar3);
  memset(pwrOffset,0,0xe);
  *pwrOffset = iStack36;
  pwrOffset[6] = cStack35;
  pwrOffset[0xc] = cStack34;
  iVar4 = (((int)cStack35 - (int)iStack36) * 100) / 6;
  pwrOffset[2] = (char)((iVar4 + 0x19) / 0x32) + iStack36;
  pwrOffset[3] = (char)((iVar4 * 3 + 0x32) / 100) + iStack36;
  pwrOffset[4] = (char)((iVar4 * 4 + 0x32) / 100) + iStack36;
  pwrOffset[1] = (char)((iVar4 + 0x32) / 100) + iStack36;
  iVar5 = (((int)cStack34 - (int)cStack35) * 100) / 6;
  pwrOffset[5] = (char)((iVar4 * 5 + 0x32) / 100) + iStack36;
  pwrOffset[8] = (char)((iVar5 + 0x19) / 0x32) + cStack35;
  pwrOffset[0xb] = (char)((iVar5 * 5 + 0x32) / 100) + cStack35;
  pwrOffset[9] = (char)((iVar5 * 3 + 0x32) / 100) + cStack35;
  pwrOffset[7] = (char)((iVar5 + 0x32) / 100) + cStack35;
  pwrOffset[10] = (char)((iVar5 * 4 + 0x32) / 100) + cStack35;
  pwrOffset[0xd] = (char)((iVar5 * 7 + 0x32) / 100) + cStack35;
LAB_23054aca:
  GLB_Set_System_CLK_Div(hclkDiv,bclkDiv);
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
  return (int8_t)-(iVar1 != 0);
}



int8_t mfg_efuse_read_macaddr(uint8_t *mac,uint8_t reload)

{
  int iVar1;
  uint8_t bclkDiv;
  uint8_t hclkDiv;
  uint8_t uVar2;
  BL_Err_Type BVar3;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  undefined3 extraout_var_01;
  undefined3 extraout_var_02;
  
  bclkDiv = GLB_Get_BCLK_Div();
  hclkDiv = GLB_Get_HCLK_Div();
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_XTAL);
  if ((rf_cal_slots < 3) ||
     (uVar2 = EF_Ctrl_Is_MAC_Address_Slot_Empty('\x02',reload), CONCAT31(extraout_var_00,uVar2) != 0
     )) {
    if ((rf_cal_slots < 2) ||
       (uVar2 = EF_Ctrl_Is_MAC_Address_Slot_Empty('\x01',reload), CONCAT31(extraout_var,uVar2) != 0)
       ) {
      if (rf_cal_slots != '\0') {
        uVar2 = EF_Ctrl_Is_MAC_Address_Slot_Empty('\0',reload);
        iVar1 = CONCAT31(extraout_var_01,uVar2);
        if (iVar1 == 0) goto LAB_23054b82;
      }
      printf("No written slot found\r\n");
      iVar1 = 1;
      goto LAB_23054b9c;
    }
    iVar1 = 1;
  }
  else {
    iVar1 = 2;
  }
LAB_23054b82:
  printf("Read slot:%d\r\n",iVar1);
  BVar3 = EF_Ctrl_Read_MAC_Address_Opt((uint8_t)iVar1,mac,reload);
  iVar1 = CONCAT31(extraout_var_02,BVar3);
LAB_23054b9c:
  GLB_Set_System_CLK_Div(hclkDiv,bclkDiv);
  HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_PLL);
  return (int8_t)-(iVar1 != 0);
}


