pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile 'mfg_flash_read'
Cause: Exception while decompiling 23054bce: Decompiler process died

*/


int8_t mfg_flash_read_xtal_capcode(uint8_t *capcode,uint8_t reload)

{
  uint32_t uVar1;
  int8_t iVar2;
  undefined3 extraout_var;
  uint32_t uVar3;
  undefined3 in_register_0000202d;
  
  if ((((CONCAT31(in_register_0000202d,reload) == 0) ||
       (iVar2 = mfg_flash_read(), CONCAT31(extraout_var,iVar2) == 0)) &&
      (uVar1 = rf_para.crc32, rf_para.magic == 0x41)) &&
     ((uVar3 = BFLB_Soft_CRC32(&rf_para.capcode_valid,0x10), uVar1 == uVar3 &&
      (rf_para.capcode_valid == 'Z')))) {
    iVar2 = '\0';
    *capcode = rf_para.capcode;
  }
  else {
    iVar2 = -1;
  }
  return iVar2;
}



int8_t mfg_flash_read_poweroffset(int8_t *pwrOffset,uint8_t reload)

{
  int8_t iVar1;
  int8_t iVar2;
  uint32_t uVar3;
  int8_t iVar4;
  undefined3 extraout_var;
  uint32_t uVar5;
  undefined3 in_register_0000202d;
  int iVar6;
  int iVar7;
  int iVar8;
  
  if ((((CONCAT31(in_register_0000202d,reload) == 0) ||
       (iVar4 = mfg_flash_read(), CONCAT31(extraout_var,iVar4) == 0)) &&
      (uVar3 = rf_para.crc32, rf_para.magic == 0x41)) &&
     ((uVar5 = BFLB_Soft_CRC32(&rf_para.capcode_valid,0x10), uVar3 == uVar5 &&
      (rf_para.poweroffset_valid == 'Z')))) {
    memset(pwrOffset,0,0xe);
    iVar2 = rf_para.poweroffset[2];
    iVar1 = rf_para.poweroffset[1];
    iVar4 = rf_para.poweroffset[0];
    iVar8 = (int)rf_para.poweroffset[1];
    iVar6 = (int)rf_para.poweroffset[0];
    iVar7 = (int)rf_para.poweroffset[2];
    *pwrOffset = rf_para.poweroffset[0];
    pwrOffset[6] = iVar1;
    pwrOffset[0xc] = iVar2;
    iVar6 = ((iVar8 - iVar6) * 100) / 6;
    pwrOffset[2] = (char)((iVar6 + 0x19) / 0x32) + iVar4;
    pwrOffset[3] = (char)((iVar6 * 3 + 0x32) / 100) + iVar4;
    pwrOffset[4] = (char)((iVar6 * 4 + 0x32) / 100) + iVar4;
    pwrOffset[1] = (char)((iVar6 + 0x32) / 100) + iVar4;
    iVar7 = ((iVar7 - iVar8) * 100) / 6;
    pwrOffset[5] = iVar4 + (char)((iVar6 * 5 + 0x32) / 100);
    pwrOffset[8] = (char)((iVar7 + 0x19) / 0x32) + iVar1;
    pwrOffset[10] = (char)((iVar7 * 4 + 0x32) / 100) + iVar1;
    pwrOffset[7] = (char)((iVar7 + 0x32) / 100) + iVar1;
    pwrOffset[9] = (char)((iVar7 * 3 + 0x32) / 100) + iVar1;
    pwrOffset[0xb] = (char)((iVar7 * 5 + 0x32) / 100) + iVar1;
    iVar4 = '\0';
    pwrOffset[0xd] = (char)((iVar7 * 7 + 0x32) / 100) + iVar1;
  }
  else {
    iVar4 = -1;
  }
  return iVar4;
}



int8_t mfg_flash_read_macaddr(uint8_t *mac,uint8_t reload)

{
  uint32_t uVar1;
  int8_t iVar2;
  undefined3 extraout_var;
  uint32_t uVar3;
  undefined3 in_register_0000202d;
  
  if ((CONCAT31(in_register_0000202d,reload) == 0) ||
     (iVar2 = mfg_flash_read(), CONCAT31(extraout_var,iVar2) == 0)) {
    uVar1 = rf_para.crc32;
    if ((rf_para.magic == 0x41) &&
       ((uVar3 = BFLB_Soft_CRC32(&rf_para.capcode_valid,0x10), uVar1 == uVar3 &&
        (rf_para.mac_valid == 'Z')))) {
      memcpy(mac,rf_para.mac,6);
      return '\0';
    }
  }
  else {
    printf("mfg_flash_read fail\r\n");
  }
  return -1;
}



void Bl_F(uchar *digest,uchar *digest1,char *password,uchar *ssid,int ssidlength,int iterations,
         int count,uchar *output)

{
  int iVar1;
  size_t key_len;
  byte *pbVar2;
  uchar *puVar3;
  byte *pbVar4;
  int iVar5;
  int iStack56;
  int tmpLen;
  uchar *pTemp;
  
  key_len = strlen(password);
  iStack56 = ssidlength + 4;
  tmpLen = (int)digest;
  memcpy(digest,ssid,ssidlength);
  puVar3 = digest + ssidlength;
  *puVar3 = (uchar)((uint)count >> 0x18);
  puVar3[1] = (uchar)((uint)count >> 0x10);
  puVar3[2] = (uchar)((uint)count >> 8);
  puVar3[3] = (uchar)count;
  Bl_hmac_sha1((uchar **)&tmpLen,&iStack56,1,(uchar *)password,key_len,digest1,0x14);
  memcpy(output,digest1,0x14);
  iVar1 = 1;
  tmpLen = (int)digest1;
  while (iVar1 < iterations) {
    iStack56 = 0x14;
    Bl_hmac_sha1((uchar **)&tmpLen,&iStack56,1,(uchar *)password,key_len,digest,0x14);
    memcpy(digest1,digest,0x14);
    iVar5 = 0;
    do {
      pbVar2 = output + iVar5;
      pbVar4 = digest + iVar5;
      iVar5 = iVar5 + 1;
      *pbVar2 = *pbVar4 ^ *pbVar2;
    } while (iVar5 != 0x14);
    iVar1 = iVar1 + 1;
  }
  return;
}



int Bl_PasswordHash(char *password,uchar *ssid,int ssidlength,uchar *output)

{
  size_t sVar1;
  int iVar2;
  uchar auStack88 [4];
  uchar digest1 [20];
  uchar digest [36];
  
  sVar1 = strlen(password);
  if (sVar1 < 0x40) {
    iVar2 = -1;
    if (ssidlength < 0x21) {
      Bl_F(digest1 + 0x10,auStack88,password,ssid,ssidlength,0x1000,2,output);
      memcpy(output + 0x14,output,0xc);
      Bl_F(digest1 + 0x10,auStack88,password,ssid,ssidlength,0x1000,1,output);
      iVar2 = 0;
    }
  }
  else {
    iVar2 = -1;
  }
  return iVar2;
}



int bl60x_fw_password_hash(char *password,uchar *ssid,int ssidlength,uchar *output)

{
  size_t sVar1;
  int iVar2;
  uchar auStack88 [20];
  uchar auStack68 [48];
  
  sVar1 = strlen(password);
  if (sVar1 < 0x40) {
    iVar2 = -1;
    if (ssidlength < 0x21) {
      Bl_F(auStack68,auStack88,password,ssid,ssidlength,0x1000,2,output);
      memcpy(output + 0x14,output,0xc);
      Bl_F(auStack68,auStack88,password,ssid,ssidlength,0x1000,1,output);
      iVar2 = 0;
    }
  }
  else {
    iVar2 = -1;
  }
  return iVar2;
}



int bl_mtd_open(char *name,bl_mtd_handle_t *handle,uint flags)

{
  char *__dest;
  int iVar1;
  uint32_t uStack40;
  uint32_t addr;
  uint32_t size;
  
  uStack40 = 0;
  addr = 0;
  __dest = (char *)pvPortMalloc(0x20);
  if (__dest == (char *)0x0) {
    iVar1 = -1;
  }
  else {
    memset(__dest,0,0x20);
    strncpy(__dest,name,0x10);
    if ((flags & 1) == 0) {
      if ((flags & 2) == 0) {
        *(undefined4 *)(__dest + 0x1c) = 0;
      }
      else {
        iVar1 = hal_boot2_partition_bus_addr_active(name,&uStack40,&addr);
        if ((iVar1 != 0) || (uStack40 == 0)) {
          printf("[MTD] [PART] [XIP] error when get %s partition %d\r\n",name,iVar1);
          printf("[MTD] [PART] [XIP] Dead Loop. Reason: no Valid %s partition found\r\n",name);
          do {
                    // WARNING: Do nothing block with infinite loop
          } while( true );
        }
        *(uint32_t *)(__dest + 0x1c) = uStack40;
      }
      iVar1 = hal_boot2_partition_addr_active(name,&uStack40,&addr);
      if ((iVar1 != 0) || (uStack40 == 0)) {
        printf("[MTD] [PART] [XIP] error when get %s partition %d\r\n",name,iVar1);
        printf("[MTD] [PART] [XIP] Dead Loop. Reason: no Valid %s partition found\r\n",name);
        do {
                    // WARNING: Do nothing block with infinite loop
        } while( true );
      }
    }
    else {
      if ((flags & 2) == 0) {
        *(undefined4 *)(__dest + 0x1c) = 0;
      }
      else {
        iVar1 = hal_boot2_partition_bus_addr_inactive(name,&uStack40,&addr);
        if ((iVar1 != 0) || (uStack40 == 0)) {
          printf("[MTD] [PART] [XIP] error when get %s partition %d\r\n",name,iVar1);
          printf("[MTD] [PART] [XIP] Dead Loop. Reason: no Valid %s partition found\r\n",name);
          do {
                    // WARNING: Do nothing block with infinite loop
          } while( true );
        }
        *(uint32_t *)(__dest + 0x1c) = uStack40;
      }
      iVar1 = hal_boot2_partition_addr_inactive(name,&uStack40,&addr);
      if ((iVar1 != 0) || (uStack40 == 0)) {
        printf("[MTD] [PART] [XIP] error when get %s partition %d\r\n",name,iVar1);
        printf("[MTD] [PART] [XIP] Dead Loop. Reason: no Valid %s partition found\r\n",name);
        do {
                    // WARNING: Do nothing block with infinite loop
        } while( true );
      }
    }
    *(uint32_t *)(__dest + 0x14) = uStack40;
    *(uint32_t *)(__dest + 0x18) = addr;
    puts("[MTD] >>>>>> Hanlde info Dump >>>>>>\r\n");
    printf("      name %s\r\n",__dest);
    printf("      id %d\r\n",*(undefined4 *)(__dest + 0x10));
    printf("      offset %p(%u)\r\n",*(undefined4 *)(__dest + 0x14));
    printf("      size %p(%uKbytes)\r\n",*(uint *)(__dest + 0x18),*(uint *)(__dest + 0x18) >> 10);
    printf("      xip_addr %p\r\n",*(undefined4 *)(__dest + 0x1c));
    puts("[MTD] <<<<<< Hanlde info End <<<<<<\r\n");
    iVar1 = 0;
    *(char **)handle = __dest;
  }
  return iVar1;
}



int bl_mtd_close(bl_mtd_handle_t handle)

{
  vPortFree(handle);
  return 0;
}



