pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bl_mtd_info(bl_mtd_handle_t handle,bl_mtd_info_t *info)

{
  strcpy((char *)info,(char *)handle);
  info->offset = *(uint *)((int)handle + 0x14);
  info->size = *(uint *)((int)handle + 0x18);
  info->xip_addr = *(void **)((int)handle + 0x1c);
  return 0;
}



int bl_mtd_erase(bl_mtd_handle_t handle,uint addr,uint size)

{
  bl_flash_erase(*(int *)((int)handle + 0x14) + addr,size);
  return 0;
}



int bl_mtd_erase_all(bl_mtd_handle_t handle)

{
  bl_flash_erase(*(uint32_t *)((int)handle + 0x14),*(int *)((int)handle + 0x18));
  return 0;
}



int bl_mtd_write(bl_mtd_handle_t handle,uint addr,uint size,uint8_t *data)

{
  uint32_t addr_00;
  int iVar1;
  TickType_t TVar2;
  uint __n;
  uint8_t auStack96 [4];
  uint8_t buf_tmp [64];
  
  addr_00 = *(int *)((int)handle + 0x14) + addr;
  iVar1 = bl_sys_isxipaddr((uint32_t)data);
  if (iVar1 == 0) {
    bl_flash_write(addr_00,data,size);
  }
  else {
    if (TrapNetCounter == 0) {
      TVar2 = xTaskGetTickCount();
    }
    else {
      TVar2 = xTaskGetTickCountFromISR();
    }
    bl_printk("[%10u][%s: %s:%4d] addr@%p is xip flash, size %d\r\n",TVar2,&DAT_23081ce8,"bl_mtd.c",
              0xc9,data,size);
    while (size != 0) {
      __n = size;
      if (0x40 < size) {
        __n = 0x40;
      }
      memcpy(auStack96,data,__n);
      bl_flash_write(addr_00,auStack96,__n);
      addr_00 = addr_00 + __n;
      data = data + __n;
      size = size - __n;
    }
  }
  return 0;
}



int bl_mtd_read(bl_mtd_handle_t handle,uint addr,uint size,uint8_t *data)

{
  bl_flash_read(*(int *)((int)handle + 0x14) + addr,data,size);
  return 0;
}



int bloop_init(loop_ctx *loop)

{
  loop_evt_handler_statistic *list;
  loop_evt_handler_statistic *plVar1;
  
  memset(loop,0,0x4a0);
  list = (loop_evt_handler_statistic *)loop->list;
  do {
    plVar1 = (loop_evt_handler_statistic *)&list->time_accumulated;
    utils_list_init((utils_list *)list);
    list = plVar1;
  } while (plVar1 != loop->statistic);
  *(utils_dlist_t **)&(loop->timer_dlist).next = &loop->timer_dlist;
  *(utils_dlist_t **)&(loop->timer_dlist).prev = &loop->timer_dlist;
  *(utils_dlist_t **)&(loop->timer_dued).next = &loop->timer_dued;
  *(utils_dlist_t **)&(loop->timer_dued).prev = &loop->timer_dued;
  printf("=== %d task inited\r\n",0x20);
  return 0;
}



int bloop_handler_register(loop_ctx *loop,loop_evt_handler *handler,int priority)

{
  if (((uint)priority < 0x20) && ((&loop->looper + priority)[0x104] == (TaskHandle_t)0x0)) {
    *(loop_evt_handler **)(&loop->looper + priority + 0x104) = handler;
    return 0;
  }
  return -1;
}



void bloop_timer_init(loop_timer *timer,int use_auto_free)

{
  memset(timer,0,0x24);
  *(loop_timer **)&(timer->dlist_item).prev = timer;
  *(loop_timer **)&(timer->dlist_item).next = timer;
  timer->flags = (use_auto_free != 0) << 1;
  return;
}



void bloop_timer_configure
               (loop_timer *timer,uint delay_ms,
               anon_subr_void_loop_ctx_ptr_loop_timer_ptr_void_ptr *cb,void *arg,int idx_task,
               uint32_t evt_type_map)

{
  TickType_t TVar1;
  
  TVar1 = xTaskGetTickCount();
  timer->time_added = TVar1;
  timer->time_target = TVar1 + delay_ms;
  *(anon_subr_void_loop_ctx_ptr_loop_timer_ptr_void_ptr **)&timer->cb = cb;
  timer->arg = arg;
  timer->idx_task = idx_task;
  timer->evt_type_map = evt_type_map;
  return;
}



void bloop_timer_repeat_enable(loop_timer *timer)

{
  timer->flags = timer->flags | 1;
  return;
}



void bloop_timer_repeat_reconfigure(loop_timer *timer)

{
  uint uVar1;
  uint uVar2;
  TickType_t TVar3;
  
  uVar1 = timer->time_target;
  uVar2 = timer->time_added;
  TVar3 = xTaskGetTickCount();
  timer->time_target = (uVar1 - uVar2) + TVar3;
  timer->time_added = TVar3;
  return;
}



void bloop_timer_register(loop_ctx *loop,loop_timer *timer)

{
  utils_dlist_s *puVar1;
  utils_dlist_s *puVar2;
  utils_dlist_s *puVar3;
  utils_dlist_s *puVar4;
  utils_dlist_s *puVar5;
  
  puVar2 = (loop->timer_dlist).next;
  puVar3 = (utils_dlist_s *)&loop->timer_dlist;
  if (puVar3 == puVar2) {
    (timer->dlist_item).next = puVar3;
    (timer->dlist_item).prev = puVar3;
    *(loop_timer **)&(loop->timer_dlist).next = timer;
    *(loop_timer **)&(loop->timer_dlist).prev = timer;
    return;
  }
  puVar1 = puVar2;
  puVar5 = (utils_dlist_s *)0x0;
  do {
    puVar4 = puVar1;
    if (puVar3 == puVar4) {
LAB_230553be:
      puVar2 = puVar5->next;
      (timer->dlist_item).prev = puVar5;
      (timer->dlist_item).next = puVar2;
      *(loop_timer **)&puVar5->next = timer;
      *(loop_timer **)&puVar2->prev = timer;
      return;
    }
    if ((int)(timer->time_target - (int)puVar4[2].prev) < 1) {
      if (puVar5 == (utils_dlist_s *)0x0) {
        (timer->dlist_item).next = puVar2;
        (timer->dlist_item).prev = puVar3;
        *(loop_timer **)&(loop->timer_dlist).next = timer;
        *(loop_timer **)&puVar2->prev = timer;
        return;
      }
      goto LAB_230553be;
    }
    puVar1 = puVar4->next;
    puVar5 = puVar4;
  } while( true );
}



void bloop_wait_startup(loop_ctx *loop)

{
  while (loop->looper == (TaskHandle_t)0x0) {
    vTaskDelay(1);
  }
  return;
}



void bloop_evt_set_async(loop_ctx *loop,uint evt,uint32_t evt_map)

{
  if (0x1f < evt) {
    printf("[ASSERT] [ERR] %s:%d\r\n","bloop_base.c",0x15a);
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  vTaskEnterCritical();
  loop->bitmap_evt_async = loop->bitmap_evt_async | 1 << (evt & 0x1f);
  (&loop->looper + evt)[4] = (TaskHandle_t)((uint)(&loop->looper + evt)[4] | evt_map);
  vTaskExitCritical();
  xTaskGenericNotify(loop->looper,0,eIncrement,(uint32_t *)0x0);
  return;
}



void bloop_evt_set_sync(loop_ctx *loop,uint evt,uint32_t evt_map)

{
  if (0x1f < evt) {
    printf("[ASSERT] [ERR] %s:%d\r\n","bloop_base.c",0x177);
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  loop->bitmap_evt_sync = loop->bitmap_evt_sync | 1 << (evt & 0x1f);
  (&loop->looper + evt)[4] = (TaskHandle_t)((uint)(&loop->looper + evt)[4] | evt_map);
  return;
}



void bloop_evt_unset_sync(loop_ctx *loop,uint evt)

{
  if (0x1f < evt) {
    printf("[ASSERT] [ERR] %s:%d\r\n","bloop_base.c",0x17f);
    do {
                    // WARNING: Do nothing block with infinite loop
    } while( true );
  }
  loop->bitmap_evt_sync = ~(1 << (evt & 0x1f)) & loop->bitmap_evt_sync;
  return;
}



void bloop_run(loop_ctx *param_1)

{
  loop_timer *plVar1;
  utils_dlist_t *puVar2;
  loop_timer *timer;
  TaskHandle_t ptVar3;
  TickType_t TVar4;
  uint32_t uVar5;
  uint32_t uVar6;
  int iVar7;
  int iVar8;
  utils_list_hdr *puVar9;
  utils_dlist_s *xTicksToWait;
  uint evt;
  TaskHandle_t ptVar10;
  utils_dlist_s *puVar11;
  utils_dlist_s *puVar12;
  TaskHandle_t *pptVar13;
  loop_timer *plVar14;
  utils_dlist_t *puVar15;
  
  ptVar3 = xTaskGetCurrentTaskHandle();
  param_1->looper = ptVar3;
LAB_230554f2:
  do {
    puVar15 = &param_1->timer_dlist;
    while( true ) {
      vTaskEnterCritical();
      evt = param_1->bitmap_evt_async;
      param_1->bitmap_evt_async = 0;
      param_1->bitmap_evt_sync = param_1->bitmap_evt_sync | evt;
      vTaskExitCritical();
      if (param_1->bitmap_evt_sync != 0) break;
      puVar2 = (utils_dlist_t *)(param_1->timer_dlist).next;
      xTicksToWait = (utils_dlist_s *)0xffffffff;
      if (puVar2 != puVar15) {
        xTicksToWait = puVar2[2].prev;
        TVar4 = xTaskGetTickCount();
        xTicksToWait = (utils_dlist_s *)((int)xTicksToWait - TVar4);
        if ((int)xTicksToWait < 1) break;
      }
      ulTaskNotifyTake(1,(TickType_t)xTicksToWait);
    }
    if ((utils_dlist_t *)(param_1->timer_dlist).next != puVar15) {
      TVar4 = xTaskGetTickCount();
      puVar2 = (utils_dlist_t *)(param_1->timer_dlist).next;
      xTicksToWait = (utils_dlist_s *)0x0;
      if (puVar2 != (utils_dlist_t *)0x0) {
        xTicksToWait = (&puVar2->prev)[1];
      }
      while ((puVar11 = xTicksToWait, puVar2 != puVar15 && (-1 < (int)(TVar4 - (int)puVar2[2].prev))
             )) {
        bloop_evt_set_sync(param_1,(uint)puVar2[2].next,(uint32_t)puVar2[3].prev);
        if (puVar2[3].next != (utils_dlist_s *)0x0) {
          (*(code *)puVar2[3].next)(param_1,puVar2,puVar2[4].prev);
        }
        puVar12 = (&puVar2->prev)[1];
        xTicksToWait = puVar2->prev;
        xTicksToWait->next = puVar12;
        puVar12->prev = xTicksToWait;
        xTicksToWait = (param_1->timer_dued).next;
        *(loop_timer **)&puVar2->prev = (loop_timer *)&param_1->timer_dued;
        (&puVar2->prev)[1] = xTicksToWait;
        *(utils_dlist_t **)&(param_1->timer_dued).next = puVar2;
        *(utils_dlist_t **)&xTicksToWait->prev = puVar2;
        puVar2 = (utils_dlist_t *)puVar11;
        xTicksToWait = (utils_dlist_s *)0x0;
        if (puVar11 != (utils_dlist_s *)0x0) {
          xTicksToWait = (&puVar11->prev)[1];
        }
      }
      timer = (loop_timer *)(param_1->timer_dued).next;
      plVar1 = (loop_timer *)0x0;
      if (timer != (loop_timer *)0x0) {
        plVar1 = (loop_timer *)(timer->dlist_item).next;
      }
      while (plVar14 = plVar1, timer != (loop_timer *)&param_1->timer_dued) {
        xTicksToWait = (timer->dlist_item).prev;
        puVar11 = (timer->dlist_item).next;
        xTicksToWait->next = puVar11;
        puVar11->prev = xTicksToWait;
        if ((timer->flags & 2) == 0) {
          if ((timer->flags & 1) != 0) {
            if ((_fsymc_level_bloop < BLOG_LEVEL_INFO) &&
               (_fsymf_level_bloopbloop_base < BLOG_LEVEL_INFO)) {
              if (TrapNetCounter == 0) {
                TVar4 = xTaskGetTickCount();
              }
              else {
                TVar4 = xTaskGetTickCountFromISR();
              }
              bl_printk("[%10u][%s: %s:%4d] Repeat timer\r\n",TVar4,"DEBUG ","bloop_base.c",0xbb);
            }
            bloop_timer_repeat_reconfigure(timer);
            bloop_timer_register(param_1,timer);
          }
        }
        else {
          if ((_fsymc_level_bloop < BLOG_LEVEL_INFO) &&
             (_fsymf_level_bloopbloop_base < BLOG_LEVEL_INFO)) {
            if (TrapNetCounter == 0) {
              TVar4 = xTaskGetTickCount();
            }
            else {
              TVar4 = xTaskGetTickCountFromISR();
            }
            bl_printk("[%10u][%s: %s:%4d] Free now\r\n",TVar4,"DEBUG ","bloop_base.c",0xb8);
          }
          vPortFree(timer);
        }
        timer = plVar14;
        plVar1 = (loop_timer *)0x0;
        if (plVar14 != (loop_timer *)0x0) {
          plVar1 = (loop_timer *)(plVar14->dlist_item).next;
        }
      }
    }
    iVar7 = __clzsi2(param_1->bitmap_evt_sync);
    iVar8 = __clzsi2(param_1->bitmap_msg);
    if (iVar7 <= iVar8) {
      evt = -iVar7 + 0x1f;
      if (evt != 0xffffffff) {
        pptVar13 = &param_1->looper + evt;
        ptVar3 = pptVar13[0x104];
        if (ptVar3 == (TaskHandle_t)0x0) {
          printf("[ASSERT] [ERR] %s:%d\r\n","bloop_base.c",0x105);
          do {
                    // WARNING: Do nothing block with infinite loop
          } while( true );
        }
        vTaskEnterCritical();
        ptVar10 = pptVar13[4];
        pptVar13[4] = (TaskHandle_t)0x0;
        pptVar13[0x24] = (TaskHandle_t)((uint)pptVar13[0x24] | (uint)ptVar10);
        vTaskExitCritical();
        uVar5 = bl_timer_now_us();
        (*(code *)(ptVar3->xStateListItem).xItemValue)
                  (param_1,(loop_evt_handler *)ptVar3,&param_1->bitmap_evt_sync,
                   (uint32_t *)(&param_1->looper + -iVar7 + 0x43));
        uVar6 = bl_timer_now_us();
        pptVar13 = &param_1->looper + evt * 4;
        ptVar3 = (TaskHandle_t)(uVar6 - uVar5);
        pptVar13[0x85] = ptVar3;
        pptVar13[0x86] = (TaskHandle_t)((int)pptVar13[0x86] + (int)ptVar3);
        if (pptVar13[0x84] < ptVar3) {
          pptVar13[0x84] = ptVar3;
        }
        pptVar13[0x87] = (TaskHandle_t)((int)&pptVar13[0x87]->pxTopOfStack + 1);
        bloop_evt_unset_sync(param_1,evt);
        goto LAB_230554f2;
      }
    }
    if ((-iVar8 != -0x20) &&
       (puVar9 = utils_list_pop_front((utils_list *)(&param_1->looper + (-iVar8 + 0x41) * 2)),
       puVar9 == (utils_list_hdr *)0x0)) {
      printf("[ASSERT] [ERR] %s:%d\r\n","bloop_base.c",0x124);
      do {
                    // WARNING: Do nothing block with infinite loop
      } while( true );
    }
  } while( true );
}



