pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int bloop_status_dump(loop_ctx *loop)

{
  loop_evt_handler_statistic *plVar1;
  utils_dlist_s *puVar2;
  uint32_t *puVar3;
  TickType_t TVar4;
  char *pcVar5;
  uint32_t uVar6;
  int iVar7;
  uint32_t uVar8;
  uint32_t uVar9;
  
  puts("====== bloop dump ======\r\n");
  printf("  bitmap_evt %lx\r\n",loop->bitmap_evt_sync);
  printf("  bitmap_msg %lx\r\n",loop->bitmap_msg);
  TVar4 = xTaskGetTickCount();
  puts("--->>> timer list:\r\n");
  puVar2 = (loop->timer_dlist).next;
  iVar7 = 0;
  while ((utils_dlist_s *)&loop->timer_dlist != puVar2) {
    printf("    timer[%02d]: %u(diff %d)ms, \t\t task idx %02d, evt map %08lx, ptr %p\r\n",iVar7,
           puVar2[2].prev,TVar4 - (int)puVar2[2].prev,puVar2[2].next,puVar2[3].prev,puVar2[3].next);
    iVar7 = iVar7 + 1;
    puVar2 = puVar2->next;
  }
  puVar3 = loop->evt_type_map_async + 0x1f;
  printf("  %d task:\r\n",0x20);
  plVar1 = loop->statistic + 0x1f;
  iVar7 = 0x1f;
  do {
    pcVar5 = "empty";
    if ((char **)puVar3[0x100] != (char **)0x0) {
      pcVar5 = *(char **)puVar3[0x100];
    }
    printf("    task[%02d] : %s\r\n",iVar7,pcVar5);
    uVar8 = puVar3[0x100];
    if (uVar8 != 0) {
      uVar6 = puVar3[0x20];
      uVar9 = *puVar3;
      printf("      evt handler %p,",*(undefined4 *)(uVar8 + 4));
      printf(" msg handler %p,",*(undefined4 *)(uVar8 + 8));
      printf(" trigged cnt %u,",plVar1->count_triggered);
      printf(" bitmap async %lx sync %lx,",uVar9,uVar6);
      printf(" time consumed %dus acc %dms, max %uus\r\n",plVar1->time_consumed,
             plVar1->time_accumulated / 1000,plVar1->time_max);
    }
    iVar7 = iVar7 + -1;
    puVar3 = puVar3 + -1;
    plVar1 = plVar1 + -1;
  } while (iVar7 != -1);
  return 0;
}



int loop_evt_entity_sys_handler(loop_ctx *loop,loop_evt_handler *handler,loop_msg *msg)

{
  printf(
         "[SYS] [MSG] called with msg info\r\n    priority %u\r\n    dst %u\r\n    msgid %u\r\n    src %u\r\n    arg1 %p\r\n    arg2 %p\r\n"
         ,(uint)*(byte *)&msg->u,(uint)*(byte *)((int)&msg->u + 1),(uint)*(byte *)((int)&msg->u + 2)
         ,(uint)*(byte *)((int)&msg->u + 3),msg->arg1,msg->arg2);
  return 0;
}



int loop_evt_entity_sys_evt
              (loop_ctx *loop,loop_evt_handler *handler,uint32_t *bitmap_evt,uint32_t *evt_type_map)

{
  uint uVar1;
  
  uVar1 = *evt_type_map;
  printf("[SYS] [EVT] called with bitmap_evt %08lx, bitmap_task %08lx\r\n",*bitmap_evt,uVar1);
  do {
    if ((uVar1 & 1) == 0) {
      if (uVar1 != 0) {
        printf("[ASSERT] [ERR] %s:%d\r\n","bloop_handler_sys.c",0x2e);
        do {
                    // WARNING: Do nothing block with infinite loop
        } while( true );
      }
      break;
    }
    uVar1 = uVar1 & 0xfffffffe;
    bloop_status_dump(loop);
  } while (uVar1 != 0);
  *evt_type_map = 0;
  return 0;
}


/*
Unable to decompile 'misaligned_load_trap'
Cause: Exception while decompiling 23055930: Decompiler process died

*/

/*
Unable to decompile 'misaligned_store_trap'
Cause: Exception while decompiling 23055a82: Decompiler process died

*/


void get_f32_reg(void)

{
  uint in_t0;
  
                    // WARNING: Could not recover jumptable at 0x23055bd2. Too many branches
                    // WARNING: Treating indirect jump as call
  (*(code *)(in_t0 & 0xfffffffe))();
  return;
}



void put_f32_reg(void)

{
  uint in_t0;
  
                    // WARNING: Could not recover jumptable at 0x23055cd2. Too many branches
                    // WARNING: Treating indirect jump as call
  (*(code *)(in_t0 & 0xfffffffe))();
  return;
}



int backtrace_riscv(anon_subr_int_char_ptr *print_func,uintptr_t *regs)

{
  return -1;
}



// WARNING: Variable defined which should be unmapped: addr

void set_if(netif *netif,char *ip_addr,char *gw_addr,char *nm_addr)

{
  int iVar1;
  ip4_addr_t iStack20;
  ip4_addr_t addr;
  
  if ((ip_addr != (char *)0x0) && (iVar1 = ip4addr_aton(ip_addr,&iStack20), iVar1 != 0)) {
    netif_set_ipaddr(netif,&iStack20);
  }
  if ((gw_addr != (char *)0x0) && (iVar1 = ip4addr_aton(gw_addr,&iStack20), iVar1 != 0)) {
    netif_set_gw(netif,&iStack20);
  }
  if ((nm_addr != (char *)0x0) && (iVar1 = ip4addr_aton(nm_addr,&iStack20), iVar1 != 0)) {
    netif_set_netmask(netif,&iStack20);
  }
  return;
}



// WARNING: Variable defined which should be unmapped: buf
// WARNING: Could not reconcile some variable overlaps

int block_cipher_df(uchar *output,uchar *data,size_t data_len)

{
  uchar *__dest;
  uchar *puVar1;
  byte *pbVar2;
  byte *pbVar3;
  int iVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  uint32_t *puVar8;
  byte local_338 [4];
  uchar chain [16];
  uchar key [32];
  uchar tmp [48];
  mbedtls_aes_context aes_ctx;
  uchar buf [416];
  
  if (data_len < 0x181) {
    memset(aes_ctx.buf + 0x43,0,0x1a0);
    mbedtls_aes_init((mbedtls_aes_context *)(tmp + 0x2c));
    buf._14_2_ = (ushort)(data_len << 8) | (ushort)(data_len >> 8) & 0xff;
    buf[19] = '0';
    buf._12_2_ = 0;
    memcpy(buf + 0x14,data,data_len);
    buf[data_len + 0x14] = -0x80;
    iVar4 = 0;
    do {
      chain[iVar4 + 0xc] = (uchar)iVar4;
      iVar4 = iVar4 + 1;
    } while (iVar4 != 0x20);
    mbedtls_aes_setkey_enc((mbedtls_aes_context *)(tmp + 0x2c),chain + 0xc,0x100);
    iVar4 = 0;
    do {
      memset(local_338,0,0x10);
      puVar8 = aes_ctx.buf + 0x43;
      uVar7 = data_len + 0x19;
      do {
        iVar5 = 0;
        pbVar3 = local_338;
        do {
          pbVar2 = (byte *)((int)puVar8 + iVar5);
          iVar5 = iVar5 + 1;
          *pbVar3 = *pbVar2 ^ *pbVar3;
          pbVar3 = pbVar3 + 1;
        } while (iVar5 != 0x10);
        puVar8 = puVar8 + 4;
        uVar6 = uVar7;
        if (0x10 < uVar7) {
          uVar6 = 0x10;
        }
        uVar7 = uVar7 - uVar6;
        mbedtls_aes_crypt_ecb((mbedtls_aes_context *)(tmp + 0x2c),1,local_338,local_338);
      } while (uVar7 != 0);
      memcpy(key + iVar4 + 0x1c,local_338,0x10);
      iVar4 = iVar4 + 0x10;
      aes_ctx.buf[67]._3_1_ = aes_ctx.buf[67]._3_1_ + '\x01';
    } while (iVar4 != 0x30);
    mbedtls_aes_setkey_enc((mbedtls_aes_context *)(tmp + 0x2c),key + 0x1c,0x100);
    __dest = output;
    do {
      mbedtls_aes_crypt_ecb((mbedtls_aes_context *)(tmp + 0x2c),1,tmp + 0x1c,tmp + 0x1c);
      puVar1 = __dest + 0x10;
      memcpy(__dest,tmp + 0x1c,0x10);
      __dest = puVar1;
    } while (output + 0x30 != puVar1);
    mbedtls_aes_free((mbedtls_aes_context *)(tmp + 0x2c));
    return 0;
  }
  return -0x38;
}



// WARNING: Variable defined which should be unmapped: tmp

