pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int ctr_drbg_update_internal(mbedtls_ctr_drbg_context_conflict *ctx,uchar *data)

{
  bool bVar1;
  byte *output;
  mbedtls_ctr_drbg_context_conflict *pmVar2;
  byte *pbVar3;
  uchar uVar4;
  int iVar5;
  byte local_50 [4];
  uchar tmp [48];
  
  iVar5 = 0;
  memset(local_50,0,0x30);
  do {
    output = local_50 + iVar5;
    pmVar2 = (mbedtls_ctr_drbg_context_conflict *)(ctx->counter + 0xf);
    do {
      uVar4 = pmVar2->counter[0] + '\x01';
      pmVar2->counter[0] = uVar4;
      if (uVar4 != '\0') break;
      bVar1 = ctx != pmVar2;
      pmVar2 = (mbedtls_ctr_drbg_context_conflict *)((int)&pmVar2[-1].p_entropy + 3);
    } while (bVar1);
    iVar5 = iVar5 + 0x10;
    mbedtls_aes_crypt_ecb(&ctx->aes_ctx,1,(uchar *)ctx,output);
    if (iVar5 == 0x30) {
      iVar5 = 0;
      output = local_50;
      do {
        pbVar3 = data + iVar5;
        iVar5 = iVar5 + 1;
        *output = *pbVar3 ^ *output;
        output = output + 1;
      } while (iVar5 != 0x30);
      mbedtls_aes_setkey_enc(&ctx->aes_ctx,local_50,0x100);
      memcpy(ctx,tmp + 0x1c,0x10);
      return 0;
    }
  } while( true );
}



void mbedtls_ctr_drbg_init(mbedtls_ctr_drbg_context_conflict *ctx)

{
  memset(ctx,0,0x140);
  return;
}



void mbedtls_ctr_drbg_free(mbedtls_ctr_drbg_context_conflict *ctx)

{
  mbedtls_ctr_drbg_context_conflict *pmVar1;
  
  if (ctx != (mbedtls_ctr_drbg_context_conflict *)0x0) {
    mbedtls_aes_free(&ctx->aes_ctx);
    pmVar1 = ctx + 1;
    while (ctx != pmVar1) {
      ctx->counter[0] = '\0';
      ctx = (mbedtls_ctr_drbg_context_conflict *)(ctx->counter + 1);
    }
    return;
  }
  return;
}



int mbedtls_ctr_drbg_reseed(mbedtls_ctr_drbg_context_conflict *ctx,uchar *additional,size_t len)

{
  int iVar1;
  size_t data_len;
  uchar auStack416 [4];
  uchar seed [384];
  
  iVar1 = -0x38;
  if ((ctx->entropy_len < 0x181) && (iVar1 = -0x38, len <= 0x180 - ctx->entropy_len)) {
    memset(auStack416,0,0x180);
    iVar1 = (*ctx->f_entropy)(ctx->p_entropy,auStack416,ctx->entropy_len);
    if (iVar1 == 0) {
      data_len = ctx->entropy_len;
      if ((additional != (uchar *)0x0) && (len != 0)) {
        memcpy(auStack416 + data_len,additional,len);
        data_len = data_len + len;
      }
      block_cipher_df(auStack416,auStack416,data_len);
      ctr_drbg_update_internal(ctx,auStack416);
      ctx->reseed_counter = 1;
    }
    else {
      iVar1 = -0x34;
    }
  }
  return iVar1;
}



int mbedtls_ctr_drbg_seed_entropy_len
              (mbedtls_ctr_drbg_context_conflict *ctx,
              anon_subr_int_void_ptr_uchar_ptr_size_t *f_entropy,void *p_entropy,uchar *custom,
              size_t len,size_t entropy_len)

{
  int iVar1;
  uchar auStack64 [4];
  uchar key [32];
  
  memset(auStack64,0,0x20);
  mbedtls_aes_init(&ctx->aes_ctx);
  *(anon_subr_int_void_ptr_uchar_ptr_size_t **)&ctx->f_entropy = f_entropy;
  ctx->p_entropy = p_entropy;
  ctx->entropy_len = entropy_len;
  ctx->reseed_interval = 10000;
  mbedtls_aes_setkey_enc(&ctx->aes_ctx,auStack64,0x100);
  iVar1 = mbedtls_ctr_drbg_reseed(ctx,custom,len);
  return iVar1;
}



int mbedtls_ctr_drbg_seed
              (mbedtls_ctr_drbg_context_conflict *ctx,
              anon_subr_int_void_ptr_uchar_ptr_size_t *f_entropy,void *p_entropy,uchar *custom,
              size_t len)

{
  int iVar1;
  
  iVar1 = mbedtls_ctr_drbg_seed_entropy_len(ctx,f_entropy,p_entropy,custom,len,0x20);
  return iVar1;
}



// WARNING: Variable defined which should be unmapped: add_input

int mbedtls_ctr_drbg_random_with_add
              (void *p_rng,uchar *output,size_t output_len,uchar *additional,size_t add_len)

{
  bool bVar1;
  char cVar2;
  int iVar3;
  char *pcVar4;
  uint __n;
  uchar auStack96 [4];
  uchar tmp [16];
  uchar add_input [48];
  
  if (output_len < 0x401) {
    iVar3 = -0x38;
    if (add_len < 0x101) {
      memset(tmp + 0xc,0,0x30);
      if ((*(int *)((int)p_rng + 0x1c) < *(int *)((int)p_rng + 0x10)) ||
         (*(int *)((int)p_rng + 0x14) != 0)) {
        iVar3 = mbedtls_ctr_drbg_reseed
                          ((mbedtls_ctr_drbg_context_conflict *)p_rng,additional,add_len);
        if (iVar3 != 0) {
          return iVar3;
        }
      }
      else {
        if (add_len != 0) {
          block_cipher_df(tmp + 0xc,additional,add_len);
          ctr_drbg_update_internal((mbedtls_ctr_drbg_context_conflict *)p_rng,tmp + 0xc);
        }
      }
      while (pcVar4 = (char *)((int)p_rng + 0xf), output_len != 0) {
        do {
          cVar2 = *pcVar4;
          *pcVar4 = cVar2 + '\x01';
          if ((char)(cVar2 + '\x01') != '\0') break;
          bVar1 = (char *)p_rng != pcVar4;
          pcVar4 = pcVar4 + -1;
        } while (bVar1);
        mbedtls_aes_crypt_ecb((mbedtls_aes_context *)((int)p_rng + 0x20),1,(uchar *)p_rng,auStack96)
        ;
        __n = output_len;
        if (0x10 < output_len) {
          __n = 0x10;
        }
        memcpy(output,auStack96,__n);
        output = output + __n;
        output_len = output_len - __n;
      }
      ctr_drbg_update_internal((mbedtls_ctr_drbg_context_conflict *)p_rng,tmp + 0xc);
      iVar3 = 0;
      *(int *)((int)p_rng + 0x10) = *(int *)((int)p_rng + 0x10) + 1;
    }
  }
  else {
    iVar3 = -0x36;
  }
  return iVar3;
}



int mbedtls_ctr_drbg_random(void *p_rng,uchar *output,size_t output_len)

{
  int iVar1;
  
  iVar1 = mbedtls_ctr_drbg_random_with_add(p_rng,output,output_len,(uchar *)0x0,0);
  return iVar1;
}



int entropy_update(mbedtls_entropy_context *ctx,uchar source_id,uchar *data,size_t len)

{
  uchar uStack68;
  undefined uStack67;
  uchar header [2];
  uchar tmp [32];
  
  if (0x20 < len) {
    mbedtls_sha256(data,len,header,0);
    data = header;
    len = 0x20;
  }
  uStack67 = (undefined)len;
  uStack68 = source_id;
  mbedtls_sha256_update((mbedtls_sha256_context *)ctx,&uStack68,2);
  mbedtls_sha256_update((mbedtls_sha256_context *)ctx,data,len);
  return 0;
}



int entropy_gather_internal(mbedtls_entropy_context *ctx)

{
  bool bVar1;
  mbedtls_entropy_source_state *pmVar2;
  int iVar3;
  int iVar4;
  size_t local_a4;
  size_t olen;
  uchar buf [128];
  
  pmVar2 = ctx->source;
  bVar1 = false;
  iVar3 = 0;
  while( true ) {
    if (ctx->source_count <= iVar3) {
      iVar3 = 0;
      if (!bVar1) {
        iVar3 = -0x3d;
      }
      return iVar3;
    }
    if (pmVar2->strong == 1) {
      bVar1 = true;
    }
    local_a4 = 0;
    iVar4 = (*pmVar2->f_source)(pmVar2->p_source,(uchar *)&olen,0x80,&local_a4);
    if (iVar4 != 0) break;
    if (local_a4 != 0) {
      entropy_update(ctx,(uchar)iVar3,(uchar *)&olen,local_a4);
      pmVar2->size = pmVar2->size + local_a4;
    }
    iVar3 = iVar3 + 1;
    pmVar2 = pmVar2 + 1;
  }
  return iVar4;
}



void mbedtls_entropy_init(mbedtls_entropy_context *ctx)

{
  int iVar1;
  uint32_t *puVar2;
  
  memset(ctx,0,0x208);
  mbedtls_sha256_starts((mbedtls_sha256_context *)ctx,0);
  iVar1 = ctx->source_count;
  if (iVar1 < 0x14) {
    puVar2 = (ctx->accumulator).total + iVar1 * 5;
    puVar2[0x1e] = 0x23056490;
    puVar2[0x21] = 0x20;
    puVar2[0x1f] = 0;
    puVar2[0x22] = 1;
    ctx->source_count = iVar1 + 1;
  }
  return;
}



void mbedtls_entropy_free(mbedtls_entropy_context *ctx)

{
  mbedtls_entropy_context *pmVar1;
  
  pmVar1 = ctx + 1;
  while (ctx != pmVar1) {
    *(undefined *)(ctx->accumulator).total = 0;
    ctx = (mbedtls_entropy_context *)((int)(ctx->accumulator).total + 1);
  }
  return;
}



int mbedtls_entropy_func(void *data,uchar *output,size_t len)

{
  bool bVar1;
  int iVar2;
  int iVar3;
  uint *puVar4;
  uint *puVar5;
  int iVar6;
  uchar auStack64 [4];
  uchar buf [32];
  
  if (len < 0x21) {
    iVar6 = 0x102;
    do {
      iVar6 = iVar6 + -1;
      if (iVar6 == 0) goto LAB_230563d2;
      if (*(int *)((int)data + 0x74) == 0) {
        return -0x40;
      }
      iVar2 = entropy_gather_internal((mbedtls_entropy_context *)data);
      if (iVar2 != 0) {
        return iVar2;
      }
      puVar5 = (uint *)((int)data + 0x80);
      iVar3 = 0;
      bVar1 = true;
      puVar4 = puVar5;
      while (iVar3 < *(int *)((int)data + 0x74)) {
        if (*puVar4 < puVar4[1]) {
          bVar1 = false;
        }
        iVar3 = iVar3 + 1;
        puVar4 = puVar4 + 5;
      }
    } while (!bVar1);
    memset(auStack64,0,0x20);
    mbedtls_sha256_finish((mbedtls_sha256_context *)data,auStack64);
    memset(data,0,0x74);
    mbedtls_sha256_starts((mbedtls_sha256_context *)data,0);
    mbedtls_sha256_update((mbedtls_sha256_context *)data,auStack64,0x20);
    mbedtls_sha256(auStack64,0x20,auStack64,0);
    iVar6 = *(int *)((int)data + 0x74);
    iVar3 = 0;
    while (iVar3 < iVar6) {
      *puVar5 = 0;
      iVar3 = iVar3 + 1;
      puVar5 = puVar5 + 5;
    }
    memcpy(output,auStack64,len);
  }
  else {
LAB_230563d2:
    iVar2 = -0x3c;
  }
  return iVar2;
}



int mbedtls_platform_entropy_poll(void *data,uchar *output,size_t len,size_t *olen)

{
  uint uVar1;
  uint uVar2;
  
  *olen = 0;
  uVar2 = 0;
  uVar1 = 0;
  while (uVar1 != len) {
    if ((uVar1 & 3) == 0) {
      uVar2 = bl_rand();
    }
    output[uVar1] = (uchar)uVar2;
    uVar1 = uVar1 + 1;
    uVar2 = uVar2 >> 8;
  }
  *olen = uVar1;
  return 0;
}



void mbedtls_pk_init(mbedtls_pk_context *ctx)

{
  if (ctx != (mbedtls_pk_context *)0x0) {
    ctx->pk_info = (mbedtls_pk_info_t *)0x0;
    ctx->pk_ctx = (void *)0x0;
  }
  return;
}



