pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mbedtls_pk_free(mbedtls_pk_context *ctx)

{
  mbedtls_pk_context *pmVar1;
  
  if (ctx != (mbedtls_pk_context *)0x0) {
    if (ctx->pk_info != (mbedtls_pk_info_t *)0x0) {
      (*ctx->pk_info->ctx_free_func)(ctx->pk_ctx);
      pmVar1 = ctx + 1;
      while (ctx != pmVar1) {
        *(undefined *)&ctx->pk_info = 0;
        ctx = (mbedtls_pk_context *)((int)&ctx->pk_info + 1);
      }
    }
    return;
  }
  return;
}



mbedtls_pk_info_t * mbedtls_pk_info_from_type(mbedtls_pk_type_t pk_type)

{
  uint uVar1;
  
  uVar1 = (uint)pk_type - 1 & 0xff;
  if (uVar1 < 3) {
    return *(mbedtls_pk_info_t **)(&CSWTCH_5 + uVar1 * 4);
  }
  return (mbedtls_pk_info_t *)0x0;
}



int mbedtls_pk_setup(mbedtls_pk_context *ctx,mbedtls_pk_info_t *info)

{
  void *pvVar1;
  int iVar2;
  
  if (((ctx != (mbedtls_pk_context *)0x0) && (info != (mbedtls_pk_info_t *)0x0)) &&
     (ctx->pk_info == (mbedtls_pk_info_t *)0x0)) {
    pvVar1 = (*info->ctx_alloc_func)(info->ctx_alloc_func);
    ctx->pk_ctx = pvVar1;
    if (pvVar1 == (void *)0x0) {
      iVar2 = -0x3f80;
    }
    else {
      ctx->pk_info = info;
      iVar2 = 0;
    }
    return iVar2;
  }
  return -16000;
}



int mbedtls_pk_can_do(mbedtls_pk_context *ctx,mbedtls_pk_type_t type)

{
  int iVar1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x23056572. Too many branches
                    // WARNING: Treating indirect jump as call
    iVar1 = (*ctx->pk_info->can_do)(type);
    return iVar1;
  }
  return 0;
}



int mbedtls_pk_verify(mbedtls_pk_context *ctx,mbedtls_md_type_t md_alg,uchar *hash,size_t hash_len,
                     uchar *sig,size_t sig_len)

{
  anon_subr_int_void_ptr_mbedtls_md_type_t_uchar_ptr_size_t_uchar_ptr_size_t_for_verify_func
  *UNRECOVERED_JUMPTABLE;
  uchar uVar1;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  int iVar2;
  
  if (ctx == (mbedtls_pk_context *)0x0) {
    return -16000;
  }
  if (ctx->pk_info == (mbedtls_pk_info_t *)0x0) {
LAB_23056582:
    iVar2 = -16000;
  }
  else {
    if (hash_len == 0) {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) goto LAB_23056582;
      uVar1 = mbedtls_md_get_size(md_info);
      hash_len = CONCAT31(extraout_var,uVar1);
    }
    UNRECOVERED_JUMPTABLE = ctx->pk_info->verify_func;
    if (UNRECOVERED_JUMPTABLE !=
        (anon_subr_int_void_ptr_mbedtls_md_type_t_uchar_ptr_size_t_uchar_ptr_size_t_for_verify_func
         *)0x0) {
                    // WARNING: Could not recover jumptable at 0x230565ce. Too many branches
                    // WARNING: Treating indirect jump as call
      iVar2 = (*UNRECOVERED_JUMPTABLE)(ctx->pk_ctx,md_alg,hash,hash_len,sig,sig_len);
      return iVar2;
    }
    iVar2 = -0x3f00;
  }
  return iVar2;
}



int mbedtls_pk_sign(mbedtls_pk_context *ctx,mbedtls_md_type_t md_alg,uchar *hash,size_t hash_len,
                   uchar *sig,size_t *sig_len,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,
                   void *p_rng)

{
    
  anon_subr_int_void_ptr_mbedtls_md_type_t_uchar_ptr_size_t_uchar_ptr_size_t_ptr_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_sign_func
  *UNRECOVERED_JUMPTABLE;
  uchar uVar1;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  int iVar2;
  
  if (ctx == (mbedtls_pk_context *)0x0) {
    return -16000;
  }
  if (ctx->pk_info == (mbedtls_pk_info_t *)0x0) {
LAB_230565e2:
    iVar2 = -16000;
  }
  else {
    if (hash_len == 0) {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) goto LAB_230565e2;
      uVar1 = mbedtls_md_get_size(md_info);
      hash_len = CONCAT31(extraout_var,uVar1);
    }
    UNRECOVERED_JUMPTABLE = ctx->pk_info->sign_func;
    if (UNRECOVERED_JUMPTABLE !=
        (
         anon_subr_int_void_ptr_mbedtls_md_type_t_uchar_ptr_size_t_uchar_ptr_size_t_ptr_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_sign_func
         *)0x0) {
                    // WARNING: Could not recover jumptable at 0x23056636. Too many branches
                    // WARNING: Treating indirect jump as call
      iVar2 = (*UNRECOVERED_JUMPTABLE)(ctx->pk_ctx,md_alg,hash,hash_len,sig,sig_len,f_rng,p_rng);
      return iVar2;
    }
    iVar2 = -0x3f00;
  }
  return iVar2;
}



// WARNING: Exceeded maximum restarts with more pending

int mbedtls_pk_decrypt(mbedtls_pk_context *ctx,uchar *input,size_t ilen,uchar *output,size_t *olen,
                      size_t osize,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
    
  anon_subr_int_void_ptr_uchar_ptr_size_t_uchar_ptr_size_t_ptr_size_t_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_decrypt_func
  *UNRECOVERED_JUMPTABLE;
  int iVar1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    UNRECOVERED_JUMPTABLE = ctx->pk_info->decrypt_func;
    if (UNRECOVERED_JUMPTABLE !=
        (
         anon_subr_int_void_ptr_uchar_ptr_size_t_uchar_ptr_size_t_ptr_size_t_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_decrypt_func
         *)0x0) {
                    // WARNING: Could not recover jumptable at 0x23056654. Too many branches
                    // WARNING: Treating indirect jump as call
      iVar1 = (*UNRECOVERED_JUMPTABLE)(ctx->pk_ctx);
      return iVar1;
    }
    return -0x3f00;
  }
  return -16000;
}



// WARNING: Exceeded maximum restarts with more pending

int mbedtls_pk_encrypt(mbedtls_pk_context *ctx,uchar *input,size_t ilen,uchar *output,size_t *olen,
                      size_t osize,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
    
  anon_subr_int_void_ptr_uchar_ptr_size_t_uchar_ptr_size_t_ptr_size_t_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_encrypt_func
  *UNRECOVERED_JUMPTABLE;
  int iVar1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    UNRECOVERED_JUMPTABLE = ctx->pk_info->encrypt_func;
    if (UNRECOVERED_JUMPTABLE !=
        (
         anon_subr_int_void_ptr_uchar_ptr_size_t_uchar_ptr_size_t_ptr_size_t_anon_subr_int_void_ptr_uchar_ptr_size_t_ptr_void_ptr_for_encrypt_func
         *)0x0) {
                    // WARNING: Could not recover jumptable at 0x2305667a. Too many branches
                    // WARNING: Treating indirect jump as call
      iVar1 = (*UNRECOVERED_JUMPTABLE)(ctx->pk_ctx);
      return iVar1;
    }
    return -0x3f00;
  }
  return -16000;
}



