pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
size_t mbedtls_pk_get_bitlen(mbedtls_pk_context *ctx)

{
  size_t sVar1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
                    // WARNING: Could not recover jumptable at 0x23056698. Too many branches
                    // WARNING: Treating indirect jump as call
    sVar1 = (*ctx->pk_info->get_bitlen)(ctx->pk_ctx);
    return sVar1;
  }
  return 0;
}



int mbedtls_pk_verify_ext
              (mbedtls_pk_type_t type,void *options,mbedtls_pk_context *ctx,mbedtls_md_type_t md_alg
              ,uchar *hash,size_t hash_len,uchar *sig,size_t sig_len)

{
  undefined3 in_register_00002029;
  int iVar1;
  size_t sVar2;
  int in_fa0;
  uchar *in_fa1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    iVar1 = mbedtls_pk_can_do(ctx,type);
    if (iVar1 == 0) {
      return -0x3f00;
    }
    if (CONCAT31(in_register_00002029,type) == 6) {
      if (options != (void *)0x0) {
        sVar2 = mbedtls_pk_get_bitlen(ctx);
        if (sig_len < sVar2 + 7 >> 3) {
          return -0x4380;
        }
        iVar1 = mbedtls_rsa_rsassa_pss_verify_ext
                          ((mbedtls_rsa_context *)ctx->pk_ctx,
                           (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0,(void *)0x0,0,md_alg,
                           hash_len,hash,*(mbedtls_md_type_t *)options,in_fa0,in_fa1);
        if (iVar1 != 0) {
          return iVar1;
        }
        sVar2 = mbedtls_pk_get_bitlen(ctx);
        if (sig_len <= sVar2 + 7 >> 3) {
          return 0;
        }
        return -0x3900;
      }
    }
    else {
      if (options == (void *)0x0) {
        iVar1 = mbedtls_pk_verify(ctx,md_alg,hash,hash_len,sig,sig_len);
        return iVar1;
      }
    }
  }
  return -16000;
}



int mbedtls_pk_debug(mbedtls_pk_context *ctx,mbedtls_pk_debug_item *items)

{
  anon_subr_void_void_ptr_mbedtls_pk_debug_item_ptr_for_debug_func *paVar1;
  
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    paVar1 = ctx->pk_info->debug_func;
    if (paVar1 != (anon_subr_void_void_ptr_mbedtls_pk_debug_item_ptr_for_debug_func *)0x0) {
      (*paVar1)(ctx->pk_ctx,items);
      return 0;
    }
    return -0x3f00;
  }
  return -16000;
}



char * mbedtls_pk_get_name(mbedtls_pk_context *ctx)

{
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    return ctx->pk_info->name;
  }
  return "invalid PK";
}



mbedtls_pk_type_t mbedtls_pk_get_type(mbedtls_pk_context *ctx)

{
  if ((ctx != (mbedtls_pk_context *)0x0) && (ctx->pk_info != (mbedtls_pk_info_t *)0x0)) {
    return ctx->pk_info->type;
  }
  return MBEDTLS_PK_NONE;
}



int pk_use_ecparams(mbedtls_asn1_buf *params,mbedtls_ecp_group *grp)

{
  int iVar1;
  mbedtls_ecp_group_id local_11 [4];
  mbedtls_ecp_group_id grp_id;
  
  if (params->tag != 6) {
    return -0x3d00;
  }
  iVar1 = mbedtls_oid_get_ec_grp(params,local_11);
  if (iVar1 == 0) {
    if ((grp->id == MBEDTLS_ECP_DP_NONE) || (grp->id == local_11[0])) {
      iVar1 = mbedtls_ecp_group_load(grp,local_11[0]);
    }
    else {
      iVar1 = -0x3d00;
    }
  }
  else {
    iVar1 = -0x3a00;
  }
  return iVar1;
}



int pk_parse_key_pkcs1_der(mbedtls_rsa_context *rsa,uchar *key,size_t keylen)

{
  int iVar1;
  int iVar2;
  size_t sVar3;
  uchar *end;
  size_t sStack40;
  size_t len;
  uchar *p;
  
  len = (size_t)key;
  iVar2 = mbedtls_asn1_get_tag((uchar **)&len,key + keylen,&sStack40,0x30);
  if (iVar2 == 0) {
    end = (uchar *)(len + sStack40);
    iVar2 = mbedtls_asn1_get_int((uchar **)&len,end,(int *)rsa);
    if (iVar2 == 0) {
      if (rsa->ver != 0) {
        return -0x3d80;
      }
      iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->N);
      if (((((iVar1 == 0) && (iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->E), iVar1 == 0))
           && (iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->D), iVar1 == 0)) &&
          ((iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->P), iVar1 == 0 &&
           (iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->Q), iVar1 == 0)))) &&
         ((iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->DP), iVar1 == 0 &&
          ((iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->DQ), iVar1 == 0 &&
           (iVar1 = mbedtls_asn1_get_mpi((uchar **)&len,end,&rsa->QP), iVar1 == 0)))))) {
        sVar3 = mbedtls_mpi_size(&rsa->N);
        rsa->len = sVar3;
        if ((uchar *)len != end) {
          mbedtls_rsa_free(rsa);
          return -0x3d66;
        }
        iVar2 = mbedtls_rsa_check_privkey(rsa);
        if (iVar2 == 0) {
          return 0;
        }
        mbedtls_rsa_free(rsa);
        return iVar2;
      }
      mbedtls_rsa_free(rsa);
      iVar2 = -0x3d00;
      goto LAB_2305683a;
    }
  }
  iVar1 = -0x3d00;
LAB_2305683a:
  return iVar1 + iVar2;
}



int pk_parse_key_sec1_der(mbedtls_ecp_keypair *eck,uchar *key,size_t keylen)

{
  int iVar1;
  uchar *end;
  int iVar2;
  uchar *end_00;
  mbedtls_mpi *X;
  int iStack56;
  int version;
  size_t len;
  uchar *p;
  mbedtls_asn1_buf params;
  
  len = (size_t)key;
  iVar2 = mbedtls_asn1_get_tag((uchar **)&len,key + keylen,(size_t *)&version,0x30);
  if (iVar2 == 0) {
    end_00 = (uchar *)(len + version);
    iVar2 = mbedtls_asn1_get_int((uchar **)&len,end_00,&iStack56);
    if (iVar2 == 0) {
      if (iStack56 != 1) {
        return -0x3d80;
      }
      iVar2 = mbedtls_asn1_get_tag((uchar **)&len,end_00,(size_t *)&version,4);
      if (iVar2 == 0) {
        X = &eck->d;
        iVar1 = mbedtls_mpi_read_binary(X,(uchar *)len,version);
        if (iVar1 == 0) {
          len = len + version;
          if ((uchar *)len == end_00) {
LAB_23056a92:
            iVar1 = mbedtls_ecp_mul((mbedtls_ecp_group *)eck,&eck->Q,X,&(eck->grp).G,
                                    (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0,(void *)0x0);
            if (iVar1 != 0) goto LAB_2305698a;
          }
          else {
            iVar1 = mbedtls_asn1_get_tag((uchar **)&len,end_00,(size_t *)&version,0xa0);
            if (iVar1 == 0) {
              end = (uchar *)(version + len);
              p = (uchar *)(uint)*(byte *)len;
              if (*(byte *)len != 6) {
                iVar2 = -0x3d62;
                goto LAB_230569fc;
              }
              iVar2 = mbedtls_asn1_get_tag((uchar **)&len,end,(size_t *)&params,6);
              if (iVar2 == 0) {
                params.len = len;
                len = len + params.tag;
                if (end != (uchar *)len) {
                  iVar2 = -0x3d66;
                  goto LAB_230569fc;
                }
              }
              else {
                iVar2 = iVar2 + -0x3d00;
                if (iVar2 != 0) goto LAB_230569fc;
              }
              iVar2 = pk_use_ecparams((mbedtls_asn1_buf *)&p,(mbedtls_ecp_group *)eck);
              if (iVar2 != 0) goto LAB_230569fc;
            }
            else {
              if (iVar1 != -0x62) goto LAB_2305698a;
            }
            iVar1 = mbedtls_asn1_get_tag((uchar **)&len,end_00,(size_t *)&version,0xa1);
            if (iVar1 != 0) {
              if (iVar1 != -0x62) goto LAB_2305698a;
              goto LAB_23056a92;
            }
            end_00 = (uchar *)(len + version);
            iVar2 = mbedtls_asn1_get_bitstring_null((uchar **)&len,end_00,(size_t *)&version);
            if (iVar2 != 0) goto LAB_23056948;
            if (end_00 != (uchar *)(version + len)) {
              return -0x3d66;
            }
            iVar2 = mbedtls_ecp_point_read_binary
                              ((mbedtls_ecp_group *)eck,&eck->Q,(uchar *)len,(size_t)(end_00 + -len)
                              );
            if (iVar2 == 0) {
              iVar2 = mbedtls_ecp_check_pubkey((mbedtls_ecp_group *)eck,&eck->Q);
            }
            len = (size_t)end_00;
            if (iVar2 != 0) {
              if (iVar2 != -0x4e80) {
                return -0x3d00;
              }
              goto LAB_23056a92;
            }
          }
          iVar2 = mbedtls_ecp_check_privkey((mbedtls_ecp_group *)eck,X);
          if (iVar2 == 0) {
            return 0;
          }
LAB_230569fc:
          mbedtls_ecp_keypair_free(eck);
          return iVar2;
        }
LAB_2305698a:
        mbedtls_ecp_keypair_free(eck);
        iVar2 = -0x3d00;
        goto LAB_23056996;
      }
    }
  }
LAB_23056948:
  iVar1 = -0x3d00;
LAB_23056996:
  return iVar1 + iVar2;
}



