pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int pk_get_pk_alg(uchar **p,uchar *end,mbedtls_pk_type_t *pk_alg,mbedtls_asn1_buf *params)

{
  int iVar1;
  undefined auStack44 [4];
  mbedtls_asn1_buf alg_oid;
  
  memset(params,0,0xc);
  iVar1 = mbedtls_asn1_get_alg(p,end,(mbedtls_asn1_buf *)auStack44,params);
  if (iVar1 == 0) {
    iVar1 = mbedtls_oid_get_pk_alg((mbedtls_asn1_buf *)auStack44,pk_alg);
    if (iVar1 == 0) {
      if ((*pk_alg == MBEDTLS_PK_RSA) &&
         (((params->tag != 5 && (params->tag != 0)) || (params->len != 0)))) {
        iVar1 = -0x3a80;
      }
    }
    else {
      iVar1 = -0x3c80;
    }
  }
  else {
    iVar1 = iVar1 + -0x3a80;
  }
  return iVar1;
}



// WARNING: Could not reconcile some variable overlaps

int pk_parse_key_pkcs8_unencrypted_der(mbedtls_pk_context *pk,uchar *key,size_t keylen)

{
  uchar *end;
  int iVar1;
  mbedtls_pk_info_t *info;
  mbedtls_pk_type_t mStack41;
  mbedtls_pk_type_t pk_alg;
  int iStack40;
  int version;
  size_t len;
  uchar *p;
  mbedtls_asn1_buf params;
  
  mStack41 = MBEDTLS_PK_NONE;
  len = (size_t)key;
  iVar1 = mbedtls_asn1_get_tag((uchar **)&len,key + keylen,(size_t *)&version,0x30);
  if (iVar1 != 0) {
LAB_23056b60:
    return iVar1 + -0x3d00;
  }
  end = (uchar *)(len + version);
  iVar1 = mbedtls_asn1_get_int((uchar **)&len,end,(int *)&stack0xffffffd8);
  if (iVar1 != 0) goto LAB_23056b60;
  if (iStack40 != 0) {
    return -0x3d80;
  }
  iVar1 = pk_get_pk_alg((uchar **)&len,end,&mStack41,(mbedtls_asn1_buf *)&p);
  if ((iVar1 != 0) ||
     (iVar1 = mbedtls_asn1_get_tag((uchar **)&len,end,(size_t *)&version,4), iVar1 != 0))
  goto LAB_23056b60;
  if (version == 0) {
    return -0x3d60;
  }
  info = mbedtls_pk_info_from_type(mStack41);
  if (info == (mbedtls_pk_info_t *)0x0) {
    return -0x3c80;
  }
  iVar1 = mbedtls_pk_setup(pk,info);
  if (iVar1 != 0) {
    return iVar1;
  }
  if (mStack41 == MBEDTLS_PK_RSA) {
    iVar1 = pk_parse_key_pkcs1_der((mbedtls_rsa_context *)pk->pk_ctx,(uchar *)len,version);
  }
  else {
    if (1 < (byte)(mStack41 + ~MBEDTLS_PK_RSA)) {
      return -0x3c80;
    }
    iVar1 = pk_use_ecparams((mbedtls_asn1_buf *)&p,(mbedtls_ecp_group *)pk->pk_ctx);
    if (iVar1 != 0) goto LAB_23056be2;
    iVar1 = pk_parse_key_sec1_der((mbedtls_ecp_keypair *)pk->pk_ctx,(uchar *)len,version);
  }
  if (iVar1 == 0) {
    return 0;
  }
LAB_23056be2:
  mbedtls_pk_free(pk);
  return iVar1;
}



int mbedtls_pk_load_file(char *path,uchar **buf,size_t *n)

{
  char "mbedtls_pk_load_file" [21];
  int fd;
  size_t sVar1;
  uchar *buf_00;
  char *pcVar2;
  undefined4 uVar3;
  
  printf("Open path %s\r\n",path);
  fd = aos_open(path,0);
  uVar3 = 0x7f;
  if (-1 < fd) {
    sVar1 = aos_lseek(fd,0,2);
    if (sVar1 != 0xffffffff) {
      aos_lseek(fd,0,0);
      *n = sVar1;
      printf("Cert size is %d\r\n",sVar1);
      if (*n != 0xffffffff) {
        buf_00 = (uchar *)mycalloc(1,*n + 1);
        *buf = buf_00;
        if (buf_00 != (uchar *)0x0) {
          sVar1 = aos_read(fd,buf_00,*n);
          if (sVar1 == *n) {
            aos_close(fd);
            (*buf)[*n] = '\0';
            pcVar2 = strstr((char *)*buf,"-----BEGIN ");
            if (pcVar2 == (char *)0x0) {
              return 0;
            }
            *n = *n + 1;
            return 0;
          }
          aos_close(fd);
          vPortFree(*buf);
          uVar3 = 0x96;
          goto LAB_23056c6a;
        }
      }
      aos_close(fd);
      printf("%s:%d\r\n",0x23088b4c,0x90);
      return -0x3f80;
    }
    aos_close(fd);
    uVar3 = 0x86;
  }
LAB_23056c6a:
  printf("%s:%d\r\n","mbedtls_pk_load_file",uVar3);
  return -0x3e00;
}



// WARNING: Variable defined which should be unmapped: alg_params
// WARNING: Could not reconcile some variable overlaps

int mbedtls_pk_parse_subpubkey(uchar **p,uchar *end,mbedtls_pk_context *pk)

{
  mbedtls_rsa_context *ctx;
  int iVar1;
  mbedtls_pk_info_t *info;
  size_t sVar2;
  int iVar3;
  uchar *end_00;
  mbedtls_ecp_group *grp;
  mbedtls_ecp_point *pt;
  mbedtls_pk_type_t mStack53;
  mbedtls_pk_type_t pk_alg;
  size_t sStack52;
  size_t len;
  size_t len_1;
  mbedtls_asn1_buf alg_params;
  
  mStack53 = MBEDTLS_PK_NONE;
  iVar1 = mbedtls_asn1_get_tag(p,end,(size_t *)&stack0xffffffcc,0x30);
  if (iVar1 != 0) {
    iVar3 = -0x3d00;
LAB_23056d6c:
    return iVar1 + iVar3;
  }
  end_00 = *p + sStack52;
  iVar1 = pk_get_pk_alg(p,end_00,&mStack53,(mbedtls_asn1_buf *)&len_1);
  if (iVar1 != 0) {
    return iVar1;
  }
  iVar1 = mbedtls_asn1_get_bitstring_null(p,end_00,(size_t *)&stack0xffffffcc);
  if (iVar1 != 0) {
    iVar3 = -0x3b00;
    goto LAB_23056d6c;
  }
  if (end_00 != *p + sStack52) {
    return -0x3b66;
  }
  info = mbedtls_pk_info_from_type(mStack53);
  if (info == (mbedtls_pk_info_t *)0x0) {
    return -0x3c80;
  }
  iVar1 = mbedtls_pk_setup(pk,info);
  if (iVar1 != 0) {
    return iVar1;
  }
  if (mStack53 != MBEDTLS_PK_RSA) {
    if ((byte)(mStack53 + ~MBEDTLS_PK_RSA) < 2) {
      iVar1 = pk_use_ecparams((mbedtls_asn1_buf *)&len_1,(mbedtls_ecp_group *)pk->pk_ctx);
      if (iVar1 == 0) {
        grp = (mbedtls_ecp_group *)pk->pk_ctx;
        pt = (mbedtls_ecp_point *)&grp[1].P.p;
        iVar1 = mbedtls_ecp_point_read_binary(grp,pt,*p,(size_t)(end_00 + -(int)*p));
        if (iVar1 == 0) {
          iVar1 = mbedtls_ecp_check_pubkey(grp,pt);
        }
        *p = end_00;
        if (iVar1 == 0) {
          return 0;
        }
      }
    }
    else {
      iVar1 = -0x3c80;
    }
    goto LAB_23056e00;
  }
  ctx = (mbedtls_rsa_context *)pk->pk_ctx;
  iVar1 = mbedtls_asn1_get_tag(p,end_00,&len,0x30);
  if (iVar1 == 0) {
    if (end_00 == *p + len) {
      iVar1 = mbedtls_asn1_get_mpi(p,end_00,&ctx->N);
      if ((iVar1 != 0) || (iVar1 = mbedtls_asn1_get_mpi(p,end_00,&ctx->E), iVar1 != 0))
      goto LAB_23056df6;
      if (end_00 != *p) goto LAB_23056e16;
      iVar1 = mbedtls_rsa_check_pubkey(ctx);
      if (iVar1 != 0) {
        iVar1 = -0x3b00;
        goto LAB_23056e00;
      }
      sVar2 = mbedtls_mpi_size(&ctx->N);
      ctx->len = sVar2;
      goto LAB_23056e52;
    }
  }
  else {
LAB_23056df6:
    iVar1 = iVar1 + -0x3b00;
    if (iVar1 != 0) goto LAB_23056e00;
LAB_23056e52:
    if (*p == end_00) {
      return 0;
    }
  }
LAB_23056e16:
  iVar1 = -0x3b66;
LAB_23056e00:
  mbedtls_pk_free(pk);
  return iVar1;
}



int mbedtls_pk_parse_key(mbedtls_pk_context *pk,uchar *key,size_t keylen,uchar *pwd,size_t pwdlen)

{
  int iVar1;
  mbedtls_pk_info_t *info;
  uchar *puVar2;
  size_t sStack64;
  size_t len;
  mbedtls_pem_context pem;
  
