pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mbedtls_pem_init((mbedtls_pem_context *)&len);
  if ((keylen == 0) || (puVar2 = key + (keylen - 1), *puVar2 != '\0')) {
LAB_23056eee:
    iVar1 = pk_parse_key_pkcs8_unencrypted_der(pk,key,keylen);
    if (iVar1 != 0) {
      mbedtls_pk_free(pk);
      info = mbedtls_pk_info_from_type(MBEDTLS_PK_RSA);
      if (info == (mbedtls_pk_info_t *)0x0) goto LAB_23056f92;
      iVar1 = mbedtls_pk_setup(pk,info);
      if ((iVar1 == 0) &&
         (iVar1 = pk_parse_key_pkcs1_der((mbedtls_rsa_context *)pk->pk_ctx,key,keylen), iVar1 != 0))
      {
        mbedtls_pk_free(pk);
        info = mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY);
        if (info == (mbedtls_pk_info_t *)0x0) goto LAB_23056f92;
        iVar1 = mbedtls_pk_setup(pk,info);
        if ((iVar1 == 0) &&
           (iVar1 = pk_parse_key_sec1_der((mbedtls_ecp_keypair *)pk->pk_ctx,key,keylen), iVar1 != 0)
           ) {
          mbedtls_pk_free(pk);
          return -0x3d00;
        }
      }
    }
    iVar1 = 0;
  }
  else {
    iVar1 = mbedtls_pem_read_buffer
                      ((mbedtls_pem_context *)&len,"-----BEGIN RSA PRIVATE KEY-----",
                       "-----END RSA PRIVATE KEY-----",key,pwd,pwdlen,&sStack64);
    if (iVar1 != 0) {
      if (iVar1 == -0x1380) {
        return -0x3b80;
      }
      if (iVar1 == -0x1300) {
        return -0x3c00;
      }
      if (iVar1 != -0x1080) {
        return iVar1;
      }
      if (*puVar2 == '\0') {
        iVar1 = mbedtls_pem_read_buffer
                          ((mbedtls_pem_context *)&len,"-----BEGIN EC PRIVATE KEY-----",
                           "-----END EC PRIVATE KEY-----",key,pwd,pwdlen,&sStack64);
        if (iVar1 == 0) {
          info = mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY);
          if (info == (mbedtls_pk_info_t *)0x0) goto LAB_23056f92;
          iVar1 = mbedtls_pk_setup(pk,info);
          if (iVar1 != 0) goto LAB_23056fca;
          iVar1 = pk_parse_key_sec1_der
                            ((mbedtls_ecp_keypair *)pk->pk_ctx,(uchar *)len,(size_t)pem.buf);
LAB_23056fc6:
          if (iVar1 == 0) goto LAB_23056fd0;
          goto LAB_23056fca;
        }
        if (iVar1 == -0x1380) {
          return -0x3b80;
        }
        if (iVar1 == -0x1300) {
          return -0x3c00;
        }
        if (iVar1 != -0x1080) {
          return iVar1;
        }
        if (*puVar2 == '\0') {
          iVar1 = mbedtls_pem_read_buffer
                            ((mbedtls_pem_context *)&len,"-----BEGIN PRIVATE KEY-----",
                             "-----END PRIVATE KEY-----",key,(uchar *)0x0,0,&sStack64);
          if (iVar1 == 0) {
            iVar1 = pk_parse_key_pkcs8_unencrypted_der(pk,(uchar *)len,(size_t)pem.buf);
            goto LAB_23056fc6;
          }
          if (iVar1 != -0x1080) {
            return iVar1;
          }
        }
      }
      goto LAB_23056eee;
    }
    info = mbedtls_pk_info_from_type(MBEDTLS_PK_RSA);
    if (info != (mbedtls_pk_info_t *)0x0) {
      iVar1 = mbedtls_pk_setup(pk,info);
      if (iVar1 == 0) {
        iVar1 = pk_parse_key_pkcs1_der
                          ((mbedtls_rsa_context *)pk->pk_ctx,(uchar *)len,(size_t)pem.buf);
        goto LAB_23056fc6;
      }
LAB_23056fca:
      mbedtls_pk_free(pk);
LAB_23056fd0:
      mbedtls_pem_free((mbedtls_pem_context *)&len);
      return iVar1;
    }
LAB_23056f92:
    iVar1 = -0x3c80;
  }
  return iVar1;
}



// WARNING: Variable defined which should be unmapped: buf

int mbedtls_pk_parse_keyfile(mbedtls_pk_context *ctx,char *path,char *pwd)

{
  size_t keylen;
  size_t key;
  int iVar1;
  size_t pwdlen;
  uchar *puVar2;
  size_t local_18;
  size_t n;
  uchar *buf;
  
  iVar1 = mbedtls_pk_load_file(path,(uchar **)&n,&local_18);
  key = n;
  keylen = local_18;
  if (iVar1 == 0) {
    if (pwd == (char *)0x0) {
      pwdlen = 0;
      pwd = (char *)0x0;
    }
    else {
      pwdlen = strlen(pwd);
    }
    iVar1 = mbedtls_pk_parse_key(ctx,(uchar *)key,keylen,(uchar *)pwd,pwdlen);
    puVar2 = (uchar *)n;
    while (puVar2 != (uchar *)(local_18 + n)) {
      *puVar2 = '\0';
      puVar2 = puVar2 + 1;
    }
    vPortFree((void *)n);
  }
  return iVar1;
}



int rsa_can_do(mbedtls_pk_type_t type)

{
  undefined3 in_register_00002029;
  
  if (CONCAT31(in_register_00002029,type) != 1) {
    return (uint)(CONCAT31(in_register_00002029,type) == 6);
  }
  return 1;
}



size_t rsa_get_bitlen(void *ctx)

{
  return *(int *)((int)ctx + 4) << 3;
}



void rsa_debug(void *ctx,mbedtls_pk_debug_item *items)

{
  items->name = "rsa.N";
  items->value = (void *)((int)ctx + 8);
  items->type = MBEDTLS_PK_DEBUG_MPI;
  items[1].type = MBEDTLS_PK_DEBUG_MPI;
  items[1].name = "rsa.E";
  items[1].value = (void *)((int)ctx + 0x14);
  return;
}



int eckey_can_do(mbedtls_pk_type_t type)

{
  undefined3 in_register_00002029;
  
  return (uint)(CONCAT31(in_register_00002029,type) - 2U < 3);
}



size_t eckey_get_bitlen(void *ctx)

{
  return *(size_t *)((int)ctx + 0x58);
}



void eckey_debug(void *ctx,mbedtls_pk_debug_item *items)

{
  items->type = MBEDTLS_PK_DEBUG_ECP;
  items->name = "eckey.Q";
  items->value = (void *)((int)ctx + 0x88);
  return;
}



int eckeydh_can_do(mbedtls_pk_type_t type)

{
  undefined3 in_register_00002029;
  
  return (uint)(CONCAT31(in_register_00002029,type) - 2U < 2);
}



void rsa_free_wrap(void *ctx)

{
  mbedtls_rsa_free((mbedtls_rsa_context *)ctx);
  vPortFree(ctx);
  return;
}



void * rsa_alloc_wrap(void)

{
  mbedtls_rsa_context *ctx;
  
  ctx = (mbedtls_rsa_context *)mycalloc(1,0xac);
  if (ctx != (mbedtls_rsa_context *)0x0) {
    mbedtls_rsa_init(ctx,0,0);
  }
  return ctx;
}



int rsa_check_pair_wrap(mbedtls_rsa_context *pub,mbedtls_rsa_context *prv)

{
  int iVar1;
  
  iVar1 = mbedtls_rsa_check_pubkey(pub);
  if ((((iVar1 != 0) || (iVar1 = mbedtls_rsa_check_privkey(prv), iVar1 != 0)) ||
      (iVar1 = mbedtls_mpi_cmp_mpi(&pub->N,&prv->N), iVar1 != 0)) ||
     (iVar1 = mbedtls_mpi_cmp_mpi(&pub->E,&prv->E), iVar1 != 0)) {
    iVar1 = -0x4200;
  }
  return iVar1;
}



int rsa_encrypt_wrap(void *ctx,uchar *input,size_t ilen,uchar *output,size_t *olen,size_t osize,
                    anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
  int iVar1;
  uint uVar2;
  
