pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar2 = *(uint *)((int)ctx + 4);
  *olen = uVar2;
  if (uVar2 <= osize) {
    iVar1 = mbedtls_rsa_pkcs1_encrypt((mbedtls_rsa_context *)ctx,f_rng,p_rng,0,ilen,input,output);
    return iVar1;
  }
  return -0x4400;
}



int rsa_decrypt_wrap(void *ctx,uchar *input,size_t ilen,uchar *output,size_t *olen,size_t osize,
                    anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
  int iVar1;
  
  if (*(size_t *)((int)ctx + 4) == ilen) {
    iVar1 = mbedtls_rsa_pkcs1_decrypt
                      ((mbedtls_rsa_context *)ctx,f_rng,p_rng,1,olen,input,output,osize);
    return iVar1;
  }
  return -0x4080;
}



int rsa_sign_wrap(void *ctx,mbedtls_md_type_t md_alg,uchar *hash,size_t hash_len,uchar *sig,
                 size_t *sig_len,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
  int iVar1;
  
  *sig_len = *(size_t *)((int)ctx + 4);
  iVar1 = mbedtls_rsa_pkcs1_sign((mbedtls_rsa_context *)ctx,f_rng,p_rng,1,md_alg,hash_len,hash,sig);
  return iVar1;
}



int rsa_verify_wrap(void *ctx,mbedtls_md_type_t md_alg,uchar *hash,size_t hash_len,uchar *sig,
                   size_t sig_len)

{
  int iVar1;
  
  if (*(uint *)((int)ctx + 4) <= sig_len) {
    iVar1 = mbedtls_rsa_pkcs1_verify
                      ((mbedtls_rsa_context *)ctx,(anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0,
                       (void *)0x0,0,md_alg,hash_len,hash,sig);
    if ((iVar1 == 0) && (*(uint *)((int)ctx + 4) < sig_len)) {
      iVar1 = -0x3900;
    }
    return iVar1;
  }
  return -0x4380;
}



void eckey_free_wrap(void *ctx)

{
  mbedtls_ecp_keypair_free((mbedtls_ecp_keypair *)ctx);
  vPortFree(ctx);
  return;
}



void * eckey_alloc_wrap(void)

{
  mbedtls_ecp_keypair *key;
  
  key = (mbedtls_ecp_keypair *)mycalloc(1,0xac);
  if (key != (mbedtls_ecp_keypair *)0x0) {
    mbedtls_ecp_keypair_init(key);
  }
  return key;
}



int eckey_check_pair(mbedtls_ecp_keypair *pub,mbedtls_ecp_keypair *prv)

{
  mbedtls_ecp_group_id mVar1;
  int iVar2;
  mbedtls_mpi *Y;
  mbedtls_mpi *Y_00;
  mbedtls_ecp_point mStack192;
  mbedtls_ecp_group mStack156;
  
  mVar1 = (pub->grp).id;
  if ((mVar1 != MBEDTLS_ECP_DP_NONE) && ((prv->grp).id == mVar1)) {
    iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&pub->Q,(mbedtls_mpi *)&prv->Q);
    if (iVar2 == 0) {
      Y_00 = &(prv->Q).Y;
      iVar2 = mbedtls_mpi_cmp_mpi(&(pub->Q).Y,Y_00);
      if (iVar2 == 0) {
        Y = &(prv->Q).Z;
        iVar2 = mbedtls_mpi_cmp_mpi(&(pub->Q).Z,Y);
        if (iVar2 == 0) {
          mbedtls_ecp_point_init(&mStack192);
          memset(&mStack156,0,0x7c);
          mbedtls_ecp_group_copy(&mStack156,(mbedtls_ecp_group *)prv);
          iVar2 = mbedtls_ecp_mul(&mStack156,&mStack192,&prv->d,&(prv->grp).G,
                                  (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0,(void *)0x0);
          if ((iVar2 == 0) &&
             (((iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&mStack192,(mbedtls_mpi *)&prv->Q),
               iVar2 != 0 || (iVar2 = mbedtls_mpi_cmp_mpi(&mStack192.Y,Y_00), iVar2 != 0)) ||
              (iVar2 = mbedtls_mpi_cmp_mpi(&mStack192.Z,Y), iVar2 != 0)))) {
            iVar2 = -0x4f80;
          }
          mbedtls_ecp_point_free(&mStack192);
          mbedtls_ecp_group_free(&mStack156);
          return iVar2;
        }
      }
    }
  }
  return -0x4f80;
}



// WARNING: Variable defined which should be unmapped: mask

void mgf_mask(uchar *dst,size_t dlen,uchar *src,size_t slen,mbedtls_md_context_t *md_ctx)

{
  uchar uVar1;
  undefined3 extraout_var;
  byte *pbVar2;
  byte *pbVar3;
  uint uVar4;
  uint uVar5;
  uchar auStack68 [3];
  char cStack65;
  uchar counter [4];
  uchar mask [32];
  
  memset(counter,0,0x20);
  memset(auStack68,0,4);
  uVar1 = mbedtls_md_get_size(md_ctx->md_info);
  while (dlen != 0) {
    uVar5 = dlen;
    if (CONCAT31(extraout_var,uVar1) < dlen) {
      uVar5 = CONCAT31(extraout_var,uVar1);
    }
    mbedtls_md_starts(md_ctx);
    mbedtls_md_update(md_ctx,src,slen);
    mbedtls_md_update(md_ctx,auStack68,4);
    mbedtls_md_finish(md_ctx,counter);
    uVar4 = 0;
    while (pbVar3 = dst + uVar4, uVar4 != uVar5) {
      pbVar2 = counter + uVar4;
      uVar4 = uVar4 + 1;
      *pbVar3 = *pbVar2 ^ *pbVar3;
    }
    dlen = dlen - uVar4;
    cStack65 = cStack65 + '\x01';
    dst = pbVar3;
  }
  return;
}



void mbedtls_rsa_init(mbedtls_rsa_context *ctx,int padding,int hash_id)

{
  memset(ctx,0,0xac);
  ctx->padding = padding;
  ctx->hash_id = hash_id;
  return;
}



int mbedtls_rsa_check_pubkey(mbedtls_rsa_context *ctx)

{
  mbedtls_mpi *X;
  size_t sVar1;
  int iVar2;
  mbedtls_mpi_uint *pmVar3;
  mbedtls_mpi_uint *pmVar4;
  
  pmVar4 = (ctx->N).p;
  if ((((pmVar4 != (mbedtls_mpi_uint *)0x0) &&
       (pmVar3 = (ctx->E).p, pmVar3 != (mbedtls_mpi_uint *)0x0)) && ((*pmVar4 & 1) != 0)) &&
     ((*pmVar3 & 1) != 0)) {
    X = &ctx->N;
    sVar1 = mbedtls_mpi_bitlen(X);
    if ((0x7f < sVar1) && (sVar1 = mbedtls_mpi_bitlen(X), sVar1 < 0x2001)) {
      sVar1 = mbedtls_mpi_bitlen(&ctx->E);
      if ((1 < sVar1) && (iVar2 = mbedtls_mpi_cmp_mpi(&ctx->E,X), iVar2 < 0)) {
        return 0;
      }
    }
    return -0x4200;
  }
  return -0x4200;
}



int mbedtls_rsa_check_privkey(mbedtls_rsa_context *ctx)

{
  int iVar1;
  mbedtls_mpi *B;
  mbedtls_mpi *A;
  mbedtls_mpi *A_00;
  undefined auStack188 [4];
  mbedtls_mpi PQ;
  mbedtls_mpi DE;
  mbedtls_mpi P1;
  mbedtls_mpi Q1;
  mbedtls_mpi H;
  mbedtls_mpi I;
  mbedtls_mpi G;
  mbedtls_mpi G2;
  mbedtls_mpi L1;
  mbedtls_mpi L2;
  mbedtls_mpi DP;
  mbedtls_mpi DQ;
  mbedtls_mpi QP;
  
  iVar1 = mbedtls_rsa_check_pubkey(ctx);
  if (iVar1 == 0) {
    iVar1 = -0x4200;
    if ((((ctx->P).p != (mbedtls_mpi_uint *)0x0) && ((ctx->Q).p != (mbedtls_mpi_uint *)0x0)) &&
       (iVar1 = -0x4200, (ctx->D).p != (mbedtls_mpi_uint *)0x0)) {
      mbedtls_mpi_init((mbedtls_mpi *)auStack188);
      mbedtls_mpi_init((mbedtls_mpi *)&PQ.p);
      mbedtls_mpi_init((mbedtls_mpi *)&DE.p);
      mbedtls_mpi_init((mbedtls_mpi *)&P1.p);
      mbedtls_mpi_init((mbedtls_mpi *)&Q1.p);
      mbedtls_mpi_init((mbedtls_mpi *)&H.p);
      mbedtls_mpi_init((mbedtls_mpi *)&I.p);
      mbedtls_mpi_init((mbedtls_mpi *)&G.p);
      mbedtls_mpi_init((mbedtls_mpi *)&G2.p);
      mbedtls_mpi_init((mbedtls_mpi *)&L1.p);
      mbedtls_mpi_init((mbedtls_mpi *)&L2.p);
      mbedtls_mpi_init((mbedtls_mpi *)&DP.p);
      mbedtls_mpi_init((mbedtls_mpi *)&DQ.p);
      A = &ctx->P;
      B = &ctx->Q;
      iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)auStack188,A,B);
      if (iVar1 == 0) {
        A_00 = &ctx->D;
        iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&PQ.p,A_00,&ctx->E);
        if (((((iVar1 == 0) && (iVar1 = mbedtls_mpi_sub_int((mbedtls_mpi *)&DE.p,A,1), iVar1 == 0))
             && ((iVar1 = mbedtls_mpi_sub_int((mbedtls_mpi *)&P1.p,B,1), iVar1 == 0 &&
                 ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&Q1.p,(mbedtls_mpi *)&DE.p,
                                               (mbedtls_mpi *)&P1.p), iVar1 == 0 &&
                  (iVar1 = mbedtls_mpi_gcd((mbedtls_mpi *)&I.p,&ctx->E,(mbedtls_mpi *)&Q1.p),
                  iVar1 == 0)))))) &&
            ((iVar1 = mbedtls_mpi_gcd((mbedtls_mpi *)&G.p,(mbedtls_mpi *)&DE.p,(mbedtls_mpi *)&P1.p)
             , iVar1 == 0 &&
             ((((iVar1 = mbedtls_mpi_div_mpi((mbedtls_mpi *)&G2.p,(mbedtls_mpi *)&L1.p,
                                             (mbedtls_mpi *)&Q1.p,(mbedtls_mpi *)&G.p), iVar1 == 0
                && (iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&H.p,(mbedtls_mpi *)&PQ.p,
                                                (mbedtls_mpi *)&G2.p), iVar1 == 0)) &&
               (iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&L2.p,A_00,(mbedtls_mpi *)&DE.p),
               iVar1 == 0)) &&
              ((iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&DP.p,A_00,(mbedtls_mpi *)&P1.p),
               iVar1 == 0 && (iVar1 = mbedtls_mpi_inv_mod((mbedtls_mpi *)&DQ.p,B,A), iVar1 == 0)))))
             ))) && ((((iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack188,&ctx->N), iVar1 != 0
                       || ((iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&L2.p,&ctx->DP), iVar1 != 0
                           || (iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&DP.p,&ctx->DQ),
                              iVar1 != 0)))) ||
                      (iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&DQ.p,&ctx->QP), iVar1 != 0)) ||
                     (((iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&L1.p,0), iVar1 != 0 ||
                       (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&H.p,1), iVar1 != 0)) ||
                      (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&I.p,1), iVar1 != 0)))))) {
          iVar1 = -0x4200;
        }
      }
      mbedtls_mpi_free((mbedtls_mpi *)auStack188);
      mbedtls_mpi_free((mbedtls_mpi *)&PQ.p);
      mbedtls_mpi_free((mbedtls_mpi *)&DE.p);
      mbedtls_mpi_free((mbedtls_mpi *)&P1.p);
      mbedtls_mpi_free((mbedtls_mpi *)&Q1.p);
      mbedtls_mpi_free((mbedtls_mpi *)&H.p);
      mbedtls_mpi_free((mbedtls_mpi *)&I.p);
      mbedtls_mpi_free((mbedtls_mpi *)&G.p);
      mbedtls_mpi_free((mbedtls_mpi *)&G2.p);
      mbedtls_mpi_free((mbedtls_mpi *)&L1.p);
      mbedtls_mpi_free((mbedtls_mpi *)&L2.p);
      mbedtls_mpi_free((mbedtls_mpi *)&DP.p);
      mbedtls_mpi_free((mbedtls_mpi *)&DQ.p);
      if ((iVar1 != -0x4200) && (iVar1 != 0)) {
        iVar1 = iVar1 + -0x4200;
      }
    }
  }
  return iVar1;
}



