pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_rsa_check_pub_priv(mbedtls_rsa_context *pub,mbedtls_rsa_context *prv)

{
  int iVar1;
  
  iVar1 = mbedtls_rsa_check_pubkey(pub);
  if ((((iVar1 != 0) || (iVar1 = mbedtls_rsa_check_privkey(prv), iVar1 != 0)) ||
      (iVar1 = mbedtls_mpi_cmp_mpi(&pub->N,&prv->N), iVar1 != 0)) ||
     (iVar1 = mbedtls_mpi_cmp_mpi(&pub->E,&prv->E), iVar1 != 0)) {
    iVar1 = -0x4200;
  }
  return iVar1;
}



int mbedtls_rsa_public(mbedtls_rsa_context *ctx,uchar *input,uchar *output)

{
  int iVar1;
  int iVar2;
  size_t buflen;
  undefined auStack44 [4];
  mbedtls_mpi T;
  
  mbedtls_mpi_init((mbedtls_mpi *)auStack44);
  iVar1 = mbedtls_mpi_read_binary((mbedtls_mpi *)auStack44,input,ctx->len);
  if (iVar1 == 0) {
    iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack44,&ctx->N);
    iVar1 = -4;
    if (iVar2 < 0) {
      buflen = ctx->len;
      iVar1 = mbedtls_mpi_exp_mod((mbedtls_mpi *)auStack44,(mbedtls_mpi *)auStack44,&ctx->E,&ctx->N,
                                  &ctx->RN);
      if (iVar1 == 0) {
        iVar1 = mbedtls_mpi_write_binary((mbedtls_mpi *)auStack44,output,buflen);
      }
    }
  }
  mbedtls_mpi_free((mbedtls_mpi *)auStack44);
  if (iVar1 != 0) {
    iVar1 = iVar1 + -0x4280;
  }
  return iVar1;
}



int mbedtls_rsa_private(mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,
                       void *p_rng,uchar *input,uchar *output)

{
  int iVar1;
  int iVar2;
  mbedtls_mpi *Y;
  mbedtls_mpi *G;
  mbedtls_mpi *X;
  undefined auStack84 [4];
  mbedtls_mpi T;
  mbedtls_mpi T1;
  mbedtls_mpi T2;
  
  if ((((ctx->P).p == (mbedtls_mpi_uint *)0x0) || ((ctx->Q).p == (mbedtls_mpi_uint *)0x0)) ||
     ((ctx->D).p == (mbedtls_mpi_uint *)0x0)) {
    return -0x4080;
  }
  mbedtls_mpi_init((mbedtls_mpi *)auStack84);
  mbedtls_mpi_init((mbedtls_mpi *)&T.p);
  mbedtls_mpi_init((mbedtls_mpi *)&T1.p);
  iVar1 = mbedtls_mpi_read_binary((mbedtls_mpi *)auStack84,input,ctx->len);
  if (iVar1 == 0) {
    Y = &ctx->N;
    iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack84,Y);
    iVar1 = -4;
    if (iVar2 < 0) {
      if (f_rng != (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0) {
        if ((ctx->Vf).p == (mbedtls_mpi_uint *)0x0) {
          iVar2 = 0xc;
          X = &ctx->Vf;
          G = &ctx->Vi;
          do {
            iVar2 = iVar2 + -1;
            if (iVar2 == 0) {
              iVar1 = -0x4480;
              goto cleanup;
            }
            iVar1 = mbedtls_mpi_fill_random(X,ctx->len - 1,f_rng,p_rng);
            if ((iVar1 != 0) || (iVar1 = mbedtls_mpi_gcd(G,X,Y), iVar1 != 0)) goto cleanup;
            iVar1 = mbedtls_mpi_cmp_int(G,1);
          } while (iVar1 != 0);
          iVar1 = mbedtls_mpi_inv_mod(G,X,Y);
          if (iVar1 != 0) goto cleanup;
          iVar1 = mbedtls_mpi_exp_mod(G,G,&ctx->E,Y,&ctx->RN);
        }
        else {
          G = &ctx->Vi;
          iVar1 = mbedtls_mpi_mul_mpi(G,G,G);
          if ((iVar1 != 0) || (iVar1 = mbedtls_mpi_mod_mpi(G,G,Y), iVar1 != 0)) goto cleanup;
          G = &ctx->Vf;
          iVar1 = mbedtls_mpi_mul_mpi(G,G,G);
          if (iVar1 != 0) goto cleanup;
          iVar1 = mbedtls_mpi_mod_mpi(G,G,Y);
        }
        if (((iVar1 != 0) ||
            (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)auStack84,&ctx->Vi)
            , iVar1 != 0)) ||
           (iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)auStack84,Y),
           iVar1 != 0)) goto cleanup;
      }
      iVar1 = mbedtls_mpi_exp_mod((mbedtls_mpi *)&T.p,(mbedtls_mpi *)auStack84,&ctx->DP,&ctx->P,
                                  &ctx->RP);
      if (iVar1 == 0) {
        iVar1 = mbedtls_mpi_exp_mod((mbedtls_mpi *)&T1.p,(mbedtls_mpi *)auStack84,&ctx->DQ,&ctx->Q,
                                    &ctx->RQ);
        if (((((iVar1 == 0) &&
              (iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)&T.p,
                                           (mbedtls_mpi *)&T1.p), iVar1 == 0)) &&
             ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T.p,(mbedtls_mpi *)auStack84,&ctx->QP),
              iVar1 == 0 &&
              ((iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)&T.p,&ctx->P),
               iVar1 == 0 &&
               (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T.p,(mbedtls_mpi *)auStack84,&ctx->Q),
               iVar1 == 0)))))) &&
            (iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)&T1.p,
                                         (mbedtls_mpi *)&T.p), iVar1 == 0)) &&
           ((f_rng == (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0 ||
            ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)auStack84,&ctx->Vf
                                         ), iVar1 == 0 &&
             (iVar1 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)auStack84,Y),
             iVar1 == 0)))))) {
          iVar1 = mbedtls_mpi_write_binary((mbedtls_mpi *)auStack84,output,ctx->len);
        }
      }
    }
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)auStack84);
  mbedtls_mpi_free((mbedtls_mpi *)&T.p);
  mbedtls_mpi_free((mbedtls_mpi *)&T1.p);
  if (iVar1 != 0) {
    iVar1 = iVar1 + -0x4300;
  }
  return iVar1;
}



int mbedtls_rsa_rsaes_oaep_encrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,uchar *label,size_t label_len,size_t ilen,uchar *input,uchar *output)

{
  uint __n;
  size_t dlen;
  uchar slen;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  int iVar1;
  uint uVar2;
  uchar *output_00;
  uchar *src;
  uchar *in_stack_00000000;
  undefined auStack76 [4];
  mbedtls_md_context_t md_ctx;
  
  if ((((mode != 1) || (ctx->padding == 1)) &&
      (f_rng != (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0)) &&
     (md_info = mbedtls_md_info_from_type(*(mbedtls_md_type_t *)&ctx->hash_id),
     md_info != (mbedtls_md_info_t *)0x0)) {
    __n = ctx->len;
    slen = mbedtls_md_get_size(md_info);
    _slen = CONCAT31(extraout_var,slen);
    uVar2 = ilen + 2 + _slen * 2;
    if ((ilen <= uVar2) && (uVar2 <= __n)) {
      memset(in_stack_00000000,0,__n);
      src = in_stack_00000000 + 1;
      *in_stack_00000000 = '\0';
      iVar1 = (*f_rng)(p_rng,src,_slen);
      if (iVar1 != 0) {
        return iVar1 + -0x4480;
      }
      output_00 = src + _slen;
      mbedtls_md(md_info,label,label_len,output_00);
      output_00[((__n - ilen) + -2) - _slen] = '\x01';
      memcpy(output_00 + (((__n - ilen) + -2) - _slen) + 1,input,ilen);
      mbedtls_md_init((mbedtls_md_context_t *)auStack76);
      iVar1 = mbedtls_md_setup((mbedtls_md_context_t *)auStack76,md_info,0);
      if (iVar1 != 0) {
        mbedtls_md_free((mbedtls_md_context_t *)auStack76);
        return iVar1;
      }
      dlen = (__n - 1) - _slen;
      mgf_mask(in_stack_00000000 + _slen + 1,dlen,src,_slen,(mbedtls_md_context_t *)auStack76);
      mgf_mask(src,_slen,in_stack_00000000 + _slen + 1,dlen,(mbedtls_md_context_t *)auStack76);
      mbedtls_md_free((mbedtls_md_context_t *)auStack76);
      if (mode == 0) {
        iVar1 = mbedtls_rsa_public(ctx,in_stack_00000000,in_stack_00000000);
        return iVar1;
      }
      iVar1 = mbedtls_rsa_private(ctx,f_rng,p_rng,in_stack_00000000,in_stack_00000000);
      return iVar1;
    }
  }
  return -0x4080;
}



int mbedtls_rsa_rsaes_pkcs1_v15_encrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,size_t ilen,uchar *input,uchar *output)

{
  int iVar1;
  int iVar2;
  uchar *puVar3;
  uchar *puVar4;
  
  if ((((mode == 1) && (ctx->padding != 0)) ||
      (f_rng == (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0)) ||
     ((input == (uchar *)0x0 || (output == (uchar *)0x0)))) {
    return -0x4080;
  }
  if ((0xfffffff4 < ilen) || (ctx->len < ilen + 0xb)) {
    return -0x4080;
  }
  iVar1 = ctx->len - ilen;
  *output = '\0';
  iVar2 = iVar1 + -3;
  puVar4 = output + 2;
  if (mode == 0) {
    output[1] = '\x02';
    puVar3 = output + iVar1 + -1;
    while (puVar4 != puVar3) {
      iVar1 = 100;
      while (iVar2 = (*f_rng)(p_rng,puVar4,1), *puVar4 == '\0') {
        iVar1 = iVar1 + -1;
        if ((iVar1 == 0) || (iVar2 != 0)) goto LAB_23057aec;
      }
      if (iVar2 != 0) {
LAB_23057aec:
        return iVar2 + -0x4480;
      }
      puVar4 = puVar4 + 1;
    }
  }
  else {
    output[1] = '\x01';
    puVar3 = output;
    while (output + iVar2 != puVar3) {
      puVar3[2] = -1;
      puVar3 = puVar3 + 1;
    }
    puVar3 = puVar4 + iVar2;
  }
  *puVar3 = '\0';
  memcpy(puVar3 + 1,input,ilen);
  if (mode != 0) {
    iVar1 = mbedtls_rsa_private(ctx,f_rng,p_rng,output,output);
    return iVar1;
  }
  iVar1 = mbedtls_rsa_public(ctx,output,output);
  return iVar1;
}



int mbedtls_rsa_pkcs1_encrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,size_t ilen,uchar *input,uchar *output)

{
  int iVar1;
  uchar *in_fa0;
  
  if (ctx->padding == 0) {
    iVar1 = mbedtls_rsa_rsaes_pkcs1_v15_encrypt(ctx,f_rng,p_rng,mode,ilen,input,output);
    return iVar1;
  }
  if (ctx->padding != 1) {
    return -0x4100;
  }
  iVar1 = mbedtls_rsa_rsaes_oaep_encrypt(ctx,f_rng,p_rng,mode,(uchar *)0x0,0,ilen,input,in_fa0);
  return iVar1;
}



