pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_rsa_rsaes_oaep_decrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,uchar *label,size_t label_len,size_t *olen,uchar *input,uchar *output,
              size_t output_max_len)

{
  uint __n;
  uchar dlen;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  int iVar1;
  uchar *puVar2;
  uint uVar3;
  int iVar4;
  byte *pbVar5;
  byte *pbVar6;
  uchar *output_00;
  int iVar7;
  size_t slen;
  void *in_stack_00000000;
  uint in_stack_00000004;
  undefined auStack1132 [4];
  mbedtls_md_context_t md_ctx;
  uchar lhash [32];
  uchar buf [1024];
  
  if ((((mode != 1) || (ctx->padding == 1)) && (__n = ctx->len, __n - 0x10 < 0x3f1)) &&
     (md_info = mbedtls_md_info_from_type(*(mbedtls_md_type_t *)&ctx->hash_id),
     md_info != (mbedtls_md_info_t *)0x0)) {
    dlen = mbedtls_md_get_size(md_info);
    _dlen = CONCAT31(extraout_var,dlen);
    iVar7 = _dlen + 1;
    if ((uint)(iVar7 * 2) <= __n) {
      output_00 = lhash + 0x1c;
      if (mode == 0) {
        iVar1 = mbedtls_rsa_public(ctx,input,output_00);
      }
      else {
        iVar1 = mbedtls_rsa_private(ctx,f_rng,p_rng,input,output_00);
      }
      if (iVar1 != 0) {
        return iVar1;
      }
      mbedtls_md_init((mbedtls_md_context_t *)auStack1132);
      iVar1 = mbedtls_md_setup((mbedtls_md_context_t *)auStack1132,md_info,0);
      if (iVar1 != 0) {
        mbedtls_md_free((mbedtls_md_context_t *)auStack1132);
        return iVar1;
      }
      mbedtls_md(md_info,label,label_len,(uchar *)&md_ctx.hmac_ctx);
      slen = (__n - 1) - _dlen;
      mgf_mask(lhash + 0x1d,_dlen,output_00 + iVar7,slen,(mbedtls_md_context_t *)auStack1132);
      mgf_mask(output_00 + iVar7,slen,lhash + 0x1d,_dlen,(mbedtls_md_context_t *)auStack1132);
      mbedtls_md_free((mbedtls_md_context_t *)auStack1132);
      uVar3 = 0;
      while (uVar3 < _dlen) {
        pbVar5 = (byte *)((int)&md_ctx.hmac_ctx + uVar3);
        pbVar6 = lhash + _dlen + 0x1d + uVar3;
        uVar3 = uVar3 + 1;
        lhash[28] = *pbVar5 ^ *pbVar6 | lhash[28];
      }
      puVar2 = lhash + _dlen + 0x1d + _dlen;
      uVar3 = 0;
      iVar4 = 0;
      iVar1 = 0;
      while (__n + iVar7 * -2 != iVar1) {
        pbVar6 = puVar2 + iVar1;
        iVar1 = iVar1 + 1;
        uVar3 = uVar3 | *pbVar6;
        iVar4 = iVar4 + ((-uVar3 & 0xff | uVar3) >> 7 ^ 1);
      }
      if ((byte)(puVar2[iVar4] ^ 1 | lhash[28]) == 0) {
        __n = __n - (int)(puVar2 + iVar4 + 1 + -(int)output_00);
        if (__n <= in_stack_00000004) {
          *olen = __n;
          memcpy(in_stack_00000000,puVar2 + iVar4 + 1,__n);
          return 0;
        }
        return -0x4400;
      }
      return -0x4100;
    }
  }
  return -0x4080;
}



// WARNING: Variable defined which should be unmapped: buf

int mbedtls_rsa_rsaes_pkcs1_v15_decrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,size_t *olen,uchar *input,uchar *output,size_t output_max_len)

{
  char *pcVar1;
  int iVar2;
  uint __n;
  byte *pbVar3;
  uint uVar4;
  uint uVar5;
  byte *pbVar6;
  size_t sVar7;
  byte local_420;
  byte bStack1055;
  byte abStack1054 [2];
  uchar buf [1024];
  
  pbVar6 = &local_420;
  pbVar3 = &local_420;
  if (((mode == 1) && (ctx->padding != 0)) || (sVar7 = ctx->len, 0x3f0 < sVar7 - 0x10)) {
    iVar2 = -0x4080;
  }
  else {
    if (mode == 0) {
      iVar2 = mbedtls_rsa_public(ctx,input,&local_420);
    }
    else {
      iVar2 = mbedtls_rsa_private(ctx,f_rng,p_rng,input,&local_420);
    }
    if (iVar2 == 0) {
      if (mode == 1) {
        bStack1055 = bStack1055 ^ 2;
        uVar4 = 0;
        __n = 0;
        uVar5 = 0;
        do {
          pbVar3 = pbVar6 + 2;
          __n = __n + 1;
          pbVar6 = pbVar6 + 1;
          uVar4 = uVar4 | ((uint)*pbVar3 | -(uint)*pbVar3 & 0xff) >> 7 ^ 1;
          uVar5 = uVar5 + ((-uVar4 & 0xff) >> 7 ^ 1);
        } while (__n < sVar7 - 3);
      }
      else {
        bStack1055 = bStack1055 ^ 1;
        uVar4 = 0;
        __n = 0;
        uVar5 = 0;
        do {
          pcVar1 = (char *)(pbVar3 + 2);
          __n = __n + 1;
          pbVar3 = pbVar3 + 1;
          uVar4 = *pcVar1 != -1 | uVar4;
          uVar5 = uVar5 + (uVar4 ^ 1);
        } while (__n < sVar7 - 3);
      }
      if ((byte)(uVar5 < 8 | bStack1055 | local_420 | abStack1054[uVar5]) == 0) {
        __n = sVar7 - (int)(abStack1054 + uVar5 + 1 + -(int)&local_420);
        if (output_max_len < __n) {
          iVar2 = -0x4400;
        }
        else {
          *olen = __n;
          memcpy(output,abStack1054 + uVar5 + 1,__n);
        }
      }
      else {
        iVar2 = -0x4100;
      }
    }
  }
  return iVar2;
}



int mbedtls_rsa_pkcs1_decrypt
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,size_t *olen,uchar *input,uchar *output,size_t output_max_len)

{
  int iVar1;
  uchar *in_fa0;
  size_t in_fa1;
  
  if (ctx->padding == 0) {
    iVar1 = mbedtls_rsa_rsaes_pkcs1_v15_decrypt
                      (ctx,f_rng,p_rng,mode,olen,input,output,output_max_len);
    return iVar1;
  }
  if (ctx->padding != 1) {
    return -0x4100;
  }
  iVar1 = mbedtls_rsa_rsaes_oaep_decrypt
                    (ctx,f_rng,p_rng,mode,(uchar *)0x0,0,olen,input,in_fa0,in_fa1);
  return iVar1;
}



int mbedtls_rsa_rsassa_pss_sign
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  uint __n;
  uchar uVar1;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  size_t __n_00;
  int iVar2;
  size_t sVar3;
  uint uVar4;
  undefined3 in_register_00002039;
  uchar *input;
  undefined auStack108 [4];
  mbedtls_md_context_t md_ctx;
  uchar salt [32];
  
  if (((mode != 1) || (ctx->padding == 1)) &&
     (f_rng != (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0)) {
    __n = ctx->len;
    if (CONCAT31(in_register_00002039,md_alg) != 0) {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) {
        return -0x4080;
      }
      uVar1 = mbedtls_md_get_size(md_info);
      hashlen = CONCAT31(extraout_var,uVar1);
    }
    md_info = mbedtls_md_info_from_type(*(mbedtls_md_type_t *)&ctx->hash_id);
    if (md_info != (mbedtls_md_info_t *)0x0) {
      uVar1 = mbedtls_md_get_size(md_info);
      __n_00 = CONCAT31(__n_00._1_3_,uVar1);
      if ((__n_00 + 1) * 2 <= __n) {
        memset(sig,0,__n);
        iVar2 = (*f_rng)(p_rng,(uchar *)&md_ctx.hmac_ctx,__n_00);
        if (iVar2 != 0) {
          return iVar2 + -0x4480;
        }
        sVar3 = mbedtls_mpi_bitlen(&ctx->N);
        input = sig + __n + (__n_00 + 1) * -2;
        *input = '\x01';
        memcpy(input + 1,&md_ctx.hmac_ctx,__n_00);
        mbedtls_md_init((mbedtls_md_context_t *)auStack108);
        iVar2 = mbedtls_md_setup((mbedtls_md_context_t *)auStack108,md_info,0);
        if (iVar2 == 0) {
          input = input + 1 + __n_00;
          mbedtls_md_starts((mbedtls_md_context_t *)auStack108);
          mbedtls_md_update((mbedtls_md_context_t *)auStack108,input,8);
          mbedtls_md_update((mbedtls_md_context_t *)auStack108,hash,hashlen);
          mbedtls_md_update((mbedtls_md_context_t *)auStack108,(uchar *)&md_ctx.hmac_ctx,__n_00);
          mbedtls_md_finish((mbedtls_md_context_t *)auStack108,input);
          uVar4 = (uint)((sVar3 - 1 & 7) == 0);
          mgf_mask(sig + uVar4,((__n - 1) - __n_00) - uVar4,input,__n_00,
                   (mbedtls_md_context_t *)auStack108);
          mbedtls_md_free((mbedtls_md_context_t *)auStack108);
          sVar3 = mbedtls_mpi_bitlen(&ctx->N);
          *sig = (byte)(0xff >> ((__n * 8 + 1) - sVar3 & 0x1f)) & *sig;
          input[__n_00] = -0x44;
          if (mode != 0) {
            iVar2 = mbedtls_rsa_private(ctx,f_rng,p_rng,sig,sig);
            return iVar2;
          }
          iVar2 = mbedtls_rsa_public(ctx,sig,sig);
          return iVar2;
        }
        mbedtls_md_free((mbedtls_md_context_t *)auStack108);
        return iVar2;
      }
    }
  }
  return -0x4080;
}



