pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

int mbedtls_rsa_rsassa_pkcs1_v15_sign
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  uint uVar1;
  int iVar2;
  uint __n;
  uchar uVar3;
  mbedtls_md_info_t *md_info;
  int iVar4;
  undefined3 extraout_var;
  uchar *output;
  uchar *output_00;
  byte *pbVar5;
  byte *pbVar6;
  byte bVar7;
  undefined3 in_register_00002039;
  size_t sVar8;
  uchar diff_no_optimize;
  size_t __n_00;
  size_t oid_size;
  char *oid;
  
  __n_00 = 0;
  oid_size = 0;
  if ((mode != 1) || (ctx->padding == 0)) {
    uVar1 = ctx->len;
    iVar2 = uVar1 - 3;
    if (CONCAT31(in_register_00002039,md_alg) != 0) {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) {
        return -0x4080;
      }
      iVar4 = mbedtls_oid_get_oid_by_md(md_alg,(char **)&oid_size,(size_t *)&stack0xffffffc8);
      if (iVar4 != 0) {
        return -0x4080;
      }
      iVar2 = iVar2 - __n_00;
      uVar3 = mbedtls_md_get_size(md_info);
      hashlen = CONCAT31(extraout_var,uVar3);
      iVar2 = iVar2 + -10;
    }
    __n = iVar2 - hashlen;
    if ((7 < __n) && (__n <= uVar1)) {
      *sig = '\0';
      sig[1] = '\x01';
      memset(sig + 2,0xff,__n);
      output = sig + 2 + __n;
      *output = '\0';
      if (CONCAT31(in_register_00002039,md_alg) == 0) {
        output = output + 1;
      }
      else {
        uVar3 = (uchar)__n_00;
        output[2] = uVar3 + '\b' + (uchar)hashlen;
        output[4] = uVar3 + '\x04';
        output[6] = uVar3;
        output[1] = '0';
        output[3] = '0';
        output[5] = '\x06';
        memcpy(output + 7,(void *)oid_size,__n_00);
        output = output + 7 + __n_00;
        *output = '\x05';
        output[1] = '\0';
        output[2] = '\x04';
        output[3] = (uchar)hashlen;
        output = output + 4;
      }
      memcpy(output,hash,hashlen);
      if (mode != 0) {
        iVar2 = -0x10;
        output = (uchar *)mycalloc(1,ctx->len);
        if (output != (uchar *)0x0) {
          output_00 = (uchar *)mycalloc(1,ctx->len);
          if (output_00 != (uchar *)0x0) {
            iVar2 = mbedtls_rsa_private(ctx,f_rng,p_rng,sig,output);
            if ((iVar2 == 0) && (iVar2 = mbedtls_rsa_public(ctx,output,output_00), iVar2 == 0)) {
              bVar7 = 0;
              sVar8 = 0;
              while (ctx->len != sVar8) {
                pbVar6 = output_00 + sVar8;
                pbVar5 = sig + sVar8;
                sVar8 = sVar8 + 1;
                bVar7 = bVar7 | *pbVar6 ^ *pbVar5;
              }
              if (bVar7 == 0) {
                memcpy(sig,output,ctx->len);
              }
              else {
                iVar2 = -0x4300;
              }
            }
            vPortFree(output);
            output = output_00;
          }
          vPortFree(output);
          return iVar2;
        }
        return -0x10;
      }
      iVar2 = mbedtls_rsa_public(ctx,sig,sig);
      return iVar2;
    }
  }
  return -0x4080;
}



int mbedtls_rsa_pkcs1_sign
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  int iVar1;
  
  if (ctx->padding == 0) {
    iVar1 = mbedtls_rsa_rsassa_pkcs1_v15_sign(ctx,f_rng,p_rng,mode,md_alg,hashlen,hash,sig);
    return iVar1;
  }
  if (ctx->padding != 1) {
    return -0x4100;
  }
  iVar1 = mbedtls_rsa_rsassa_pss_sign(ctx,f_rng,p_rng,mode,md_alg,hashlen,hash,sig);
  return iVar1;
}



// WARNING: Type propagation algorithm not settling

int mbedtls_rsa_rsassa_pss_verify_ext
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,
              mbedtls_md_type_t mgf1_hash_id,int expected_salt_len,uchar *sig)

{
  uchar *dst;
  uchar *puVar1;
  uchar uVar2;
  int iVar3;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  uint slen;
  size_t sVar4;
  undefined3 in_register_00002039;
  size_t ilen;
  size_t sVar5;
  uchar *output;
  size_t in_stack_00000000;
  uchar *in_stack_00000004;
  uchar auStack1124 [4];
  uchar zeros [8];
  mbedtls_md_context_t md_ctx;
  uchar result [32];
  uchar buf [1024];
  
  if (((mode != 1) || (ctx->padding == 1)) && (ilen = ctx->len, ilen - 0x10 < 0x3f1)) {
    output = result + 0x1c;
    if (mode == 0) {
      iVar3 = mbedtls_rsa_public(ctx,in_stack_00000004,output);
    }
    else {
      iVar3 = mbedtls_rsa_private(ctx,f_rng,p_rng,in_stack_00000004,output);
    }
    if (iVar3 != 0) {
      return iVar3;
    }
    if (result[ilen + 0x1b] != -0x44) {
      return -0x4100;
    }
    if (CONCAT31(in_register_00002039,md_alg) != 0) {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) {
        return -0x4080;
      }
      uVar2 = mbedtls_md_get_size(md_info);
      hashlen = CONCAT31(extraout_var,uVar2);
    }
    md_info = mbedtls_md_info_from_type(mgf1_hash_id);
    if (md_info != (mbedtls_md_info_t *)0x0) {
      uVar2 = mbedtls_md_get_size(md_info);
      slen = CONCAT31(slen._1_3_,uVar2);
      memset(auStack1124,0,8);
      sVar4 = mbedtls_mpi_bitlen(&ctx->N);
      dst = output;
      sVar5 = ilen;
      if ((sVar4 - 1 & 7) == 0) {
        dst = result + 0x1d;
        sVar5 = ilen - 1;
      }
      if ((int)(uint)result[28] >> (sVar5 * -8 + sVar4 + 7 & 0x1f) == 0) {
        mbedtls_md_init((mbedtls_md_context_t *)(zeros + 4));
        iVar3 = mbedtls_md_setup((mbedtls_md_context_t *)(zeros + 4),md_info,0);
        if (iVar3 != 0) {
          mbedtls_md_free((mbedtls_md_context_t *)(zeros + 4));
          return iVar3;
        }
        mgf_mask(dst,~slen + sVar5,dst + ~slen + sVar5,slen,(mbedtls_md_context_t *)(zeros + 4));
        result[28] = (byte)(0xff >> (sVar5 * 8 - (sVar4 - 1) & 0x1f)) & result[28];
        do {
          puVar1 = dst;
          if (output + sVar5 <= puVar1) {
            if (output + sVar5 == puVar1) goto LAB_230584a6;
            break;
          }
          dst = puVar1 + 1;
        } while (*puVar1 == '\0');
        dst = puVar1 + 1;
        if ((*puVar1 == '\x01') &&
           ((ilen = ((ilen - 1) - slen) - (int)(dst + -(int)output), in_stack_00000000 == 0xffffffff
            || (in_stack_00000000 == ilen)))) {
          mbedtls_md_starts((mbedtls_md_context_t *)(zeros + 4));
          mbedtls_md_update((mbedtls_md_context_t *)(zeros + 4),auStack1124,8);
          mbedtls_md_update((mbedtls_md_context_t *)(zeros + 4),hash,hashlen);
          mbedtls_md_update((mbedtls_md_context_t *)(zeros + 4),dst,ilen);
          mbedtls_md_finish((mbedtls_md_context_t *)(zeros + 4),(uchar *)&md_ctx.hmac_ctx);
          mbedtls_md_free((mbedtls_md_context_t *)(zeros + 4));
          iVar3 = memcmp(dst + ilen,&md_ctx.hmac_ctx,slen);
          if (iVar3 == 0) {
            return 0;
          }
          return -0x4380;
        }
LAB_230584a6:
        mbedtls_md_free((mbedtls_md_context_t *)(zeros + 4));
        return -0x4100;
      }
    }
  }
  return -0x4080;
}



int mbedtls_rsa_rsassa_pss_verify
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  int iVar1;
  mbedtls_md_type_t mgf1_hash_id;
  int in_fa0;
  uchar *in_fa1;
  
  mgf1_hash_id = (mbedtls_md_type_t)ctx->hash_id;
  if (ctx->hash_id == 0) {
    mgf1_hash_id = md_alg;
  }
  iVar1 = mbedtls_rsa_rsassa_pss_verify_ext
                    (ctx,f_rng,p_rng,mode,md_alg,hashlen,hash,mgf1_hash_id,in_fa0,in_fa1);
  return iVar1;
}



// WARNING: Type propagation algorithm not settling
// WARNING: Could not reconcile some variable overlaps

int mbedtls_rsa_rsassa_pkcs1_v15_verify
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  uchar **output;
  uint uVar1;
  uchar *end;
  uchar __n;
  int iVar2;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  undefined3 in_register_00002039;
  size_t sVar3;
  mbedtls_md_type_t mStack1077;
  mbedtls_md_type_t msg_md_alg;
  size_t sStack1076;
  size_t asn1_len;
  uchar *p;
  mbedtls_asn1_buf oid;
  uchar buf [1024];
  
