pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if ((mode == 1) && (ctx->padding != 0)) {
    return -0x4080;
  }
  sVar3 = ctx->len;
  if (sVar3 - 0x10 < 0x3f1) {
    output = &oid.p;
    if (mode == 0) {
      iVar2 = mbedtls_rsa_public(ctx,sig,(uchar *)output);
    }
    else {
      iVar2 = mbedtls_rsa_private(ctx,f_rng,p_rng,sig,(uchar *)output);
    }
    if (iVar2 != 0) {
      return iVar2;
    }
    if (((char)oid.p != '\0') || (asn1_len = (int)&oid.p + 2, oid.p._1_1_ != '\x01')) {
      return -0x4100;
    }
    while (*(uchar *)asn1_len != '\0') {
      if ((uchar *)((int)output + (sVar3 - 1)) <= asn1_len) {
        return -0x4100;
      }
      if (*(uchar *)asn1_len != -1) {
        return -0x4100;
      }
      asn1_len = asn1_len + 1;
    }
    asn1_len = asn1_len + 1;
    uVar1 = sVar3 - (int)((uchar *)asn1_len + -(int)output);
    if ((uVar1 == hashlen) && (CONCAT31(in_register_00002039,md_alg) == 0)) {
      iVar2 = memcmp((void *)asn1_len,hash,hashlen);
      if (iVar2 == 0) {
        return 0;
      }
    }
    else {
      md_info = mbedtls_md_info_from_type(md_alg);
      if (md_info == (mbedtls_md_info_t *)0x0) goto LAB_230584ee;
      __n = mbedtls_md_get_size(md_info);
      ___n = CONCAT31(extraout_var,__n);
      end = (uchar *)(asn1_len + uVar1);
      iVar2 = mbedtls_asn1_get_tag((uchar **)&asn1_len,end,(size_t *)&stack0xfffffbcc,0x30);
      if ((((iVar2 == 0) && (sStack1076 + 2 == uVar1)) &&
          (iVar2 = mbedtls_asn1_get_tag((uchar **)&asn1_len,end,(size_t *)&stack0xfffffbcc,0x30),
          iVar2 == 0)) &&
         ((sStack1076 + 6 + ___n == uVar1 &&
          (iVar2 = mbedtls_asn1_get_tag((uchar **)&asn1_len,end,(size_t *)&oid,6), iVar2 == 0)))) {
        oid.len = asn1_len;
        asn1_len = asn1_len + oid.tag;
        iVar2 = mbedtls_oid_get_md_alg((mbedtls_asn1_buf *)&p,&mStack1077);
        if (((iVar2 == 0) &&
            (((uint)mStack1077 == CONCAT31(in_register_00002039,md_alg) &&
             (iVar2 = mbedtls_asn1_get_tag((uchar **)&asn1_len,end,(size_t *)&stack0xfffffbcc,5),
             iVar2 == 0)))) &&
           ((iVar2 = mbedtls_asn1_get_tag((uchar **)&asn1_len,end,(size_t *)&stack0xfffffbcc,4),
            iVar2 == 0 &&
            (((sStack1076 == ___n && (iVar2 = memcmp((void *)asn1_len,hash,___n), iVar2 == 0)) &&
             (end == (uchar *)(___n + asn1_len))))))) {
          return 0;
        }
      }
    }
    iVar2 = -0x4380;
  }
  else {
LAB_230584ee:
    iVar2 = -0x4080;
  }
  return iVar2;
}



int mbedtls_rsa_pkcs1_verify
              (mbedtls_rsa_context *ctx,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng,
              int mode,mbedtls_md_type_t md_alg,uint hashlen,uchar *hash,uchar *sig)

{
  int iVar1;
  
  if (ctx->padding == 0) {
    iVar1 = mbedtls_rsa_rsassa_pkcs1_v15_verify(ctx,f_rng,p_rng,mode,md_alg,hashlen,hash,sig);
    return iVar1;
  }
  if (ctx->padding != 1) {
    return -0x4100;
  }
  iVar1 = mbedtls_rsa_rsassa_pss_verify(ctx,f_rng,p_rng,mode,md_alg,hashlen,hash,sig);
  return iVar1;
}



void mbedtls_rsa_free(mbedtls_rsa_context *ctx)

{
  mbedtls_mpi_free(&ctx->Vi);
  mbedtls_mpi_free(&ctx->Vf);
  mbedtls_mpi_free(&ctx->RQ);
  mbedtls_mpi_free(&ctx->RP);
  mbedtls_mpi_free(&ctx->RN);
  mbedtls_mpi_free(&ctx->QP);
  mbedtls_mpi_free(&ctx->DQ);
  mbedtls_mpi_free(&ctx->DP);
  mbedtls_mpi_free(&ctx->Q);
  mbedtls_mpi_free(&ctx->P);
  mbedtls_mpi_free(&ctx->D);
  mbedtls_mpi_free(&ctx->E);
  mbedtls_mpi_free(&ctx->N);
  return;
}



void mbedtls_sha256_init(mbedtls_sha256_context *ctx)

{
  memset(ctx,0,0x74);
  return;
}



void mbedtls_sha256_free(mbedtls_sha256_context *ctx)

{
  mbedtls_sha256_context *pmVar1;
  
  pmVar1 = ctx + 1;
  if (ctx != (mbedtls_sha256_context *)0x0) {
    while (ctx != pmVar1) {
      *(undefined *)ctx->total = 0;
      ctx = (mbedtls_sha256_context *)((int)ctx->total + 1);
    }
  }
  return;
}



void mbedtls_sha256_clone(mbedtls_sha256_context *dst,mbedtls_sha256_context *src)

{
  memcpy(dst,src,0x74);
  return;
}



void mbedtls_sha256_starts(mbedtls_sha256_context *ctx,int is224)

{
  uint32_t uVar1;
  
  ctx->total[0] = 0;
  ctx->total[1] = 0;
  if (is224 == 0) {
    ctx->state[0] = 0x6a09e667;
    ctx->state[1] = 0xbb67ae85;
    ctx->state[2] = 0x3c6ef372;
    ctx->state[3] = 0xa54ff53a;
    ctx->state[4] = 0x510e527f;
    ctx->state[5] = 0x9b05688c;
    ctx->state[6] = 0x1f83d9ab;
    uVar1 = 0x5be0cd19;
  }
  else {
    ctx->state[0] = 0xc1059ed8;
    ctx->state[1] = 0x367cd507;
    ctx->state[2] = 0x3070dd17;
    ctx->state[3] = 0xf70e5939;
    ctx->state[4] = 0xffc00b31;
    ctx->state[5] = 0x68581511;
    ctx->state[6] = 0x64f98fa7;
    uVar1 = 0xbefa4fa4;
  }
  ctx->state[7] = uVar1;
  ctx->is224 = is224;
  return;
}



void mbedtls_sha256_process(mbedtls_sha256_context *ctx,uchar *data)

{
  uint uVar1;
  uint32_t *puVar2;
  byte *pbVar3;
  byte *pbVar4;
  uint uVar5;
  uint uVar6;
  uint32_t uVar7;
  uint uVar8;
  uint32_t *puVar9;
  uint uVar10;
  uint32_t *puVar11;
  uint uVar12;
  int iVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  uint uVar17;
  uint32_t *puVar18;
  uint uVar19;
  uint uVar20;
  uint uVar21;
  uint32_t *puVar22;
  uint uVar23;
  uint32_t uVar24;
  uint uVar25;
  uint32_t *puVar26;
  uint32_t uVar27;
  uint32_t local_150;
  uint32_t A [8];
  uint32_t W [64];
  
  puVar18 = &local_150;
  puVar9 = &local_150;
  puVar11 = ctx->state;
  do {
    uVar7 = *puVar11;
    puVar11 = puVar11 + 1;
    *puVar9 = uVar7;
    puVar9 = puVar9 + 1;
  } while ((uint32_t *)ctx->buffer != puVar11);
  puVar11 = A + 7;
  pbVar3 = data;
  puVar9 = puVar11;
  do {
    pbVar4 = pbVar3 + 4;
    *puVar9 = (uint)*pbVar3 << 0x18 | (uint)pbVar3[1] << 0x10 | (uint)pbVar3[3] |
              (uint)pbVar3[2] << 8;
    pbVar3 = pbVar4;
    puVar9 = puVar9 + 1;
  } while (data + 0x40 != pbVar4);
  puVar2 = K;
  puVar9 = K;
  puVar26 = puVar11;
  do {
    puVar22 = puVar9 + 8;
    iVar13 = A[6] + ((A[3] >> 6 | A[3] << 0x1a) ^ (A[3] >> 0xb | A[3] << 0x15) ^
                    (A[3] << 7 | A[3] >> 0x19)) + *puVar9 + *puVar26 + ((A[5] ^ A[4]) & A[3] ^ A[5])
    ;
    uVar12 = A[2] + iVar13;
    uVar14 = iVar13 + ((local_150 >> 2 | local_150 << 0x1e) ^ (local_150 >> 0xd | local_150 << 0x13)
                      ^ (local_150 << 10 | local_150 >> 0x16)) +
                      ((local_150 | A[0]) & A[1] | local_150 & A[0]);
    iVar13 = ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19)) +
             A[5] + puVar9[1] + puVar26[1] + ((A[3] ^ A[4]) & uVar12 ^ A[4]);
    uVar1 = ((uVar14 >> 2 | uVar14 * 0x40000000) ^ (uVar14 >> 0xd | uVar14 * 0x80000) ^
            (uVar14 * 0x400 | uVar14 >> 0x16)) + ((uVar14 | local_150) & A[0] | uVar14 & local_150)
            + iVar13;
    uVar10 = A[1] + iVar13;
    iVar13 = ((uVar10 >> 6 | uVar10 * 0x4000000) ^ (uVar10 >> 0xb | uVar10 * 0x200000) ^
             (uVar10 * 0x80 | uVar10 >> 0x19)) +
             A[4] + puVar9[2] + puVar26[2] + ((uVar12 ^ A[3]) & uVar10 ^ A[3]);
    uVar5 = ((uVar1 >> 2 | uVar1 * 0x40000000) ^ (uVar1 >> 0xd | uVar1 * 0x80000) ^
            (uVar1 * 0x400 | uVar1 >> 0x16)) + ((uVar14 | uVar1) & local_150 | uVar14 & uVar1) +
            iVar13;
    uVar8 = A[0] + iVar13;
    iVar13 = ((uVar8 >> 6 | uVar8 * 0x4000000) ^ (uVar8 >> 0xb | uVar8 * 0x200000) ^
             (uVar8 * 0x80 | uVar8 >> 0x19)) +
             A[3] + puVar9[3] + puVar26[3] + ((uVar12 ^ uVar10) & uVar8 ^ uVar12);
    uVar16 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
             (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar1 | uVar5) & uVar14 | uVar1 & uVar5) + iVar13;
    uVar6 = local_150 + iVar13;
    iVar13 = ((uVar6 >> 6 | uVar6 * 0x4000000) ^ (uVar6 >> 0xb | uVar6 * 0x200000) ^
             (uVar6 * 0x80 | uVar6 >> 0x19)) +
             uVar12 + puVar9[4] + puVar26[4] + ((uVar10 ^ uVar8) & uVar6 ^ uVar10);
    A[2] = ((uVar16 >> 2 | uVar16 * 0x40000000) ^ (uVar16 >> 0xd | uVar16 * 0x80000) ^
           (uVar16 * 0x400 | uVar16 >> 0x16)) + ((uVar5 | uVar16) & uVar1 | uVar5 & uVar16) + iVar13
    ;
    A[6] = uVar14 + iVar13;
    iVar13 = ((A[6] >> 6 | A[6] * 0x4000000) ^ (A[6] >> 0xb | A[6] * 0x200000) ^
             (A[6] * 0x80 | A[6] >> 0x19)) +
             uVar10 + puVar9[5] + puVar26[5] + ((uVar8 ^ uVar6) & A[6] ^ uVar8);
    A[1] = ((A[2] >> 2 | A[2] * 0x40000000) ^ (A[2] >> 0xd | A[2] * 0x80000) ^
           (A[2] * 0x400 | A[2] >> 0x16)) + ((uVar16 | A[2]) & uVar5 | uVar16 & A[2]) + iVar13;
    A[5] = uVar1 + iVar13;
    iVar13 = ((A[5] >> 6 | A[5] * 0x4000000) ^ (A[5] >> 0xb | A[5] * 0x200000) ^
             (A[5] * 0x80 | A[5] >> 0x19)) +
             uVar8 + puVar9[6] + puVar26[6] + ((uVar6 ^ A[6]) & A[5] ^ uVar6);
    A[0] = ((A[1] >> 2 | A[1] * 0x40000000) ^ (A[1] >> 0xd | A[1] * 0x80000) ^
           (A[1] * 0x400 | A[1] >> 0x16)) + ((A[2] | A[1]) & uVar16 | A[2] & A[1]) + iVar13;
    A[4] = uVar5 + iVar13;
    iVar13 = ((A[4] >> 6 | A[4] * 0x4000000) ^ (A[4] >> 0xb | A[4] * 0x200000) ^
             (A[4] * 0x80 | A[4] >> 0x19)) +
             uVar6 + puVar9[7] + puVar26[7] + ((A[6] ^ A[5]) & A[4] ^ A[6]);
    A[3] = uVar16 + iVar13;
    local_150 = ((A[0] >> 2 | A[0] * 0x40000000) ^ (A[0] >> 0xd | A[0] * 0x80000) ^
                (A[0] * 0x400 | A[0] >> 0x16)) + ((A[1] | A[0]) & A[2] | A[1] & A[0]) + iVar13;
    puVar9 = puVar22;
    puVar26 = puVar26 + 8;
  } while (puVar22 != K + 0x10);
  do {
    uVar19 = puVar11[0xe];
    uVar1 = puVar11[1];
    uVar20 = puVar11[0xf];
    uVar23 = ((uVar19 << 0xf | uVar19 >> 0x11) ^ (uVar19 << 0xd | uVar19 >> 0x13) ^ uVar19 >> 10) +
             puVar11[9] + *puVar11 +
             ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    uVar10 = puVar11[3];
    iVar13 = A[6] + ((A[3] >> 6 | A[3] << 0x1a) ^ (A[3] >> 0xb | A[3] << 0x15) ^
                    (A[3] << 7 | A[3] >> 0x19)) + ((A[5] ^ A[4]) & A[3] ^ A[5]) + puVar2[0x10] +
                    uVar23;
    uVar16 = A[2] + iVar13;
    uVar15 = iVar13 + ((local_150 >> 2 | local_150 << 0x1e) ^ (local_150 >> 0xd | local_150 << 0x13)
                      ^ (local_150 << 10 | local_150 >> 0x16)) +
                      ((local_150 | A[0]) & A[1] | local_150 & A[0]);
    uVar6 = puVar11[2];
    uVar1 = ((uVar20 << 0xf | uVar20 >> 0x11) ^ (uVar20 << 0xd | uVar20 >> 0x13) ^ uVar20 >> 10) +
            uVar1 + puVar11[10] +
            ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((A[3] ^ A[4]) & uVar16 ^ A[4]) + A[5] + puVar2[0x11] + uVar1 +
             ((uVar16 >> 6 | uVar16 * 0x4000000) ^ (uVar16 >> 0xb | uVar16 * 0x200000) ^
             (uVar16 * 0x80 | uVar16 >> 0x19));
    uVar5 = ((uVar15 >> 2 | uVar15 * 0x40000000) ^ (uVar15 >> 0xd | uVar15 * 0x80000) ^
            (uVar15 * 0x400 | uVar15 >> 0x16)) + ((local_150 | uVar15) & A[0] | local_150 & uVar15)
            + iVar13;
    uVar14 = A[1] + iVar13;
    uVar6 = ((uVar23 * 0x8000 | uVar23 >> 0x11) ^ (uVar23 * 0x2000 | uVar23 >> 0x13) ^ uVar23 >> 10)
            + uVar6 + puVar11[0xb] +
            ((uVar10 >> 7 | uVar10 << 0x19) ^ (uVar10 << 0xe | uVar10 >> 0x12) ^ uVar10 >> 3);
    iVar13 = ((A[3] ^ uVar16) & uVar14 ^ A[3]) + A[4] + puVar2[0x12] + uVar6 +
             ((uVar14 >> 6 | uVar14 * 0x4000000) ^ (uVar14 >> 0xb | uVar14 * 0x200000) ^
             (uVar14 * 0x80 | uVar14 >> 0x19));
    puVar11[0x11] = uVar1;
    uVar8 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
            (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar15 | uVar5) & local_150 | uVar15 & uVar5) +
            iVar13;
    uVar12 = A[0] + iVar13;
    uVar25 = puVar11[4];
    uVar1 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
            uVar10 + puVar11[0xc] +
            ((uVar25 >> 7 | uVar25 << 0x19) ^ (uVar25 << 0xe | uVar25 >> 0x12) ^ uVar25 >> 3);
    iVar13 = ((uVar16 ^ uVar14) & uVar12 ^ uVar16) + A[3] + puVar2[0x13] + uVar1 +
             ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19));
    uVar17 = ((uVar8 >> 2 | uVar8 * 0x40000000) ^ (uVar8 >> 0xd | uVar8 * 0x80000) ^
             (uVar8 * 0x400 | uVar8 >> 0x16)) + ((uVar5 | uVar8) & uVar15 | uVar5 & uVar8) + iVar13;
    uVar10 = local_150 + iVar13;
    puVar11[0x12] = uVar6;
    uVar21 = puVar11[5];
    uVar25 = ((uVar6 * 0x8000 | uVar6 >> 0x11) ^ (uVar6 * 0x2000 | uVar6 >> 0x13) ^ uVar6 >> 10) +
             uVar25 + puVar11[0xd] +
             ((uVar21 >> 7 | uVar21 << 0x19) ^ (uVar21 << 0xe | uVar21 >> 0x12) ^ uVar21 >> 3);
    iVar13 = ((uVar10 >> 6 | uVar10 * 0x4000000) ^ (uVar10 >> 0xb | uVar10 * 0x200000) ^
             (uVar10 * 0x80 | uVar10 >> 0x19)) +
             ((uVar14 ^ uVar12) & uVar10 ^ uVar14) + uVar16 + puVar2[0x14] + uVar25;
    A[2] = ((uVar17 >> 2 | uVar17 * 0x40000000) ^ (uVar17 >> 0xd | uVar17 * 0x80000) ^
           (uVar17 * 0x400 | uVar17 >> 0x16)) + ((uVar8 | uVar17) & uVar5 | uVar8 & uVar17) + iVar13
    ;
    A[6] = uVar15 + iVar13;
    uVar6 = puVar11[6];
    puVar11[0x13] = uVar1;
    uVar16 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
             uVar19 + uVar21 +
             ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((A[6] >> 6 | A[6] * 0x4000000) ^ (A[6] >> 0xb | A[6] * 0x200000) ^
             (A[6] * 0x80 | A[6] >> 0x19)) +
             ((uVar12 ^ uVar10) & A[6] ^ uVar12) + uVar14 + puVar2[0x15] + uVar16;
    A[1] = ((A[2] >> 2 | A[2] * 0x40000000) ^ (A[2] >> 0xd | A[2] * 0x80000) ^
           (A[2] * 0x400 | A[2] >> 0x16)) + ((uVar17 | A[2]) & uVar8 | uVar17 & A[2]) + iVar13;
    A[5] = uVar5 + iVar13;
    uVar1 = puVar11[7];
    puVar11[0x14] = uVar25;
    uVar7 = uVar20 + uVar6 +
            ((uVar25 * 0x8000 | uVar25 >> 0x11) ^ (uVar25 * 0x2000 | uVar25 >> 0x13) ^ uVar25 >> 10)
            + ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    iVar13 = ((A[5] >> 6 | A[5] * 0x4000000) ^ (A[5] >> 0xb | A[5] * 0x200000) ^
             (A[5] * 0x80 | A[5] >> 0x19)) +
             ((uVar10 ^ A[6]) & A[5] ^ uVar10) + uVar12 + puVar2[0x16] + uVar7;
    A[0] = ((A[1] >> 2 | A[1] * 0x40000000) ^ (A[1] >> 0xd | A[1] * 0x80000) ^
           (A[1] * 0x400 | A[1] >> 0x16)) + ((A[2] | A[1]) & uVar17 | A[2] & A[1]) + iVar13;
    A[4] = uVar8 + iVar13;
    uVar5 = puVar11[8];
    puVar11[0x15] = uVar16;
    puVar11[0x10] = uVar23;
    uVar27 = puVar2[0x17];
    uVar24 = uVar23 + uVar1 +
             ((uVar16 * 0x8000 | uVar16 >> 0x11) ^ (uVar16 * 0x2000 | uVar16 >> 0x13) ^ uVar16 >> 10
             ) + ((uVar5 >> 7 | uVar5 << 0x19) ^ (uVar5 << 0xe | uVar5 >> 0x12) ^ uVar5 >> 3);
    puVar11[0x17] = uVar24;
    iVar13 = ((A[4] >> 6 | A[4] * 0x4000000) ^ (A[4] >> 0xb | A[4] * 0x200000) ^
             (A[4] * 0x80 | A[4] >> 0x19)) +
             uVar10 + uVar27 + uVar24 + ((A[6] ^ A[5]) & A[4] ^ A[6]);
    puVar11[0x16] = uVar7;
    puVar11 = puVar11 + 8;
    A[3] = uVar17 + iVar13;
    local_150 = ((A[0] >> 2 | A[0] * 0x40000000) ^ (A[0] >> 0xd | A[0] * 0x80000) ^
                (A[0] * 0x400 | A[0] >> 0x16)) + ((A[1] | A[0]) & A[2] | A[1] & A[0]) + iVar13;
    puVar2 = puVar2 + 8;
  } while (W + 0x2f != puVar11);
  puVar9 = ctx->state;
  do {
    iVar13 = *puVar18;
    puVar11 = puVar9 + 1;
    puVar18 = (uint32_t *)((int *)puVar18 + 1);
    *puVar9 = *puVar9 + iVar13;
    puVar9 = puVar11;
  } while ((uint32_t *)ctx->buffer != puVar11);
  return;
}



void mbedtls_sha256_update(mbedtls_sha256_context *ctx,uchar *input,size_t ilen)

{
  size_t __n;
  uint uVar1;
  uint uVar2;
  uint __n_00;
  
