pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar2 = ctx->total[0] & 0x3f;
  uVar1 = ctx->total[0] + ilen;
  ctx->total[0] = uVar1;
  if (uVar1 < ilen) {
    ctx->total[1] = ctx->total[1] + 1;
  }
  uVar1 = ilen;
  if ((uVar2 != 0) && (__n_00 = 0x40 - uVar2, __n_00 <= ilen)) {
    memcpy(ctx->buffer + uVar2,input,__n_00);
    ilen = (ilen - 0x40) + uVar2;
    mbedtls_sha256_process(ctx,ctx->buffer);
    input = input + __n_00;
    uVar2 = 0;
    uVar1 = ilen;
  }
  while (0x3f < ilen) {
    mbedtls_sha256_process(ctx,input + (uVar1 - ilen));
    ilen = ilen - 0x40;
  }
  __n = (uVar1 >> 6) * -0x40 + uVar1;
  if (__n == 0) {
    return;
  }
  memcpy(ctx->buffer + uVar2,input + (uVar1 & 0xffffffc0),__n);
  return;
}



void mbedtls_sha256_update(mbedtls_sha256_context *ctx,uchar *input,size_t ilen)

{
  if (ilen != 0) {
    mbedtls_sha256_update(ctx,input,ilen);
    return;
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void mbedtls_sha256_finish(mbedtls_sha256_context *ctx,uchar *output)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uchar uStack24;
  undefined uStack23;
  ushort uStack22;
  uchar msglen [8];
  
  uVar1 = ctx->total[0];
  uVar2 = ctx->total[1] << 3;
  uStack24 = (uchar)(uVar2 >> 0x18);
  uStack23 = (undefined)(uVar2 >> 0x10);
  uStack22 = (ushort)(uVar2 >> 8) & 0xff | (ushort)((uVar2 | uVar1 >> 0x1d) << 8);
  msglen[0] = (uchar)((uVar1 << 3) >> 0x18);
  msglen[1] = (uchar)((uVar1 << 3) >> 0x10);
  msglen._2_2_ = (ushort)((uVar1 << 0x13) >> 0x18) | (ushort)(uVar1 << 0xb);
  if ((uVar1 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  mbedtls_sha256_update(ctx,sha256_padding,iVar3 - (uVar1 & 0x3f));
  mbedtls_sha256_update(ctx,&uStack24,8);
  *output = *(uchar *)((int)ctx->state + 3);
  output[1] = (uchar)*(undefined2 *)((int)ctx->state + 2);
  output[2] = (uchar)(ctx->state[0] >> 8);
  output[3] = (uchar)ctx->state[0];
  output[4] = *(uchar *)((int)ctx->state + 7);
  output[5] = (uchar)*(undefined2 *)((int)ctx->state + 6);
  output[6] = (uchar)(ctx->state[1] >> 8);
  output[7] = (uchar)ctx->state[1];
  output[8] = *(uchar *)((int)ctx->state + 0xb);
  output[9] = (uchar)*(undefined2 *)((int)ctx->state + 10);
  output[10] = (uchar)(ctx->state[2] >> 8);
  output[0xb] = (uchar)ctx->state[2];
  output[0xc] = *(uchar *)((int)ctx->state + 0xf);
  output[0xd] = (uchar)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xe] = (uchar)(ctx->state[3] >> 8);
  output[0xf] = (uchar)ctx->state[3];
  output[0x10] = *(uchar *)((int)ctx->state + 0x13);
  output[0x11] = (uchar)*(undefined2 *)((int)ctx->state + 0x12);
  output[0x12] = (uchar)(ctx->state[4] >> 8);
  output[0x13] = (uchar)ctx->state[4];
  output[0x14] = *(uchar *)((int)ctx->state + 0x17);
  output[0x15] = (uchar)*(undefined2 *)((int)ctx->state + 0x16);
  output[0x16] = (uchar)(ctx->state[5] >> 8);
  output[0x17] = (uchar)ctx->state[5];
  output[0x18] = *(uchar *)((int)ctx->state + 0x1b);
  output[0x19] = (uchar)*(undefined2 *)((int)ctx->state + 0x1a);
  output[0x1a] = (uchar)(ctx->state[6] >> 8);
  output[0x1b] = (uchar)ctx->state[6];
  if (ctx->is224 == 0) {
    output[0x1c] = *(uchar *)((int)ctx->state + 0x1f);
    output[0x1d] = (uchar)*(undefined2 *)((int)ctx->state + 0x1e);
    output[0x1e] = (uchar)(ctx->state[7] >> 8);
    output[0x1f] = (uchar)ctx->state[7];
  }
  return;
}



// WARNING: Variable defined which should be unmapped: ctx

void mbedtls_sha256(uchar *input,size_t ilen,uchar *output,int is224)

{
  undefined auStack132 [4];
  mbedtls_sha256_context ctx;
  
  mbedtls_sha256_init((mbedtls_sha256_context *)auStack132);
  mbedtls_sha256_starts((mbedtls_sha256_context *)auStack132,is224);
  mbedtls_sha256_update((mbedtls_sha256_context *)auStack132,input,ilen);
  mbedtls_sha256_finish((mbedtls_sha256_context *)auStack132,output);
  mbedtls_sha256_free((mbedtls_sha256_context *)auStack132);
  return;
}



mbedtls_x509_crt * mbedtls_ssl_own_cert(mbedtls_ssl_context *ssl)

{
  mbedtls_x509_crt *pmVar1;
  
  if (((ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) &&
      (pmVar1 = (mbedtls_x509_crt *)ssl->handshake->key_cert, pmVar1 != (mbedtls_x509_crt *)0x0)) ||
     (pmVar1 = (mbedtls_x509_crt *)ssl->conf->key_cert, pmVar1 != (mbedtls_x509_crt *)0x0)) {
    pmVar1 = (mbedtls_x509_crt *)(pmVar1->raw).tag;
  }
  return pmVar1;
}



void mbedtls_zeroize(void *v,size_t n)

{
  undefined *puVar1;
  
  puVar1 = (undefined *)(n + (int)v);
  while ((undefined *)v != puVar1) {
    *(undefined *)v = 0;
    v = (undefined *)v + 1;
  }
  return;
}



void ssl_swap_epochs(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_transform *pmVar1;
  uchar *puVar2;
  undefined auStack24 [4];
  uchar tmp_out_ctr [8];
  
  if (ssl->transform_out == ssl->handshake->alt_transform_out) {
    mbedtls_debug_print_msg(ssl,3,"file1",0xa0a,"skip swap epochs");
  }
  else {
    mbedtls_debug_print_msg(ssl,3,"file1",0xa0e,"swap epochs");
    pmVar1 = ssl->transform_out;
    ssl->transform_out = ssl->handshake->alt_transform_out;
    ssl->handshake->alt_transform_out = pmVar1;
    memcpy(auStack24,ssl->out_ctr,8);
    memcpy(ssl->out_ctr,ssl->handshake->alt_out_ctr,8);
    memcpy(ssl->handshake->alt_out_ctr,auStack24,8);
    pmVar1 = ssl->transform_out;
    puVar2 = ssl->out_iv;
    if ((pmVar1 != (mbedtls_ssl_transform *)0x0) && (1 < ssl->minor_ver)) {
      puVar2 = puVar2 + (pmVar1->ivlen - pmVar1->fixed_ivlen);
    }
    ssl->out_msg = puVar2;
  }
  return;
}



void ssl_calc_finished_tls_sha256(mbedtls_ssl_context *ssl,uchar *buf,int from)

{
  mbedtls_ssl_session *pmVar1;
  char *pcVar2;
  uchar auStack180 [4];
  uchar padbuf [32];
  mbedtls_sha256_context sha256;
  
  pmVar1 = ssl->session_negotiate;
  if (pmVar1 == (mbedtls_ssl_session *)0x0) {
    pmVar1 = ssl->session;
  }
  mbedtls_sha256_init((mbedtls_sha256_context *)(padbuf + 0x1c));
  mbedtls_debug_print_msg(ssl,2,"file1",0x1356,"=> calc  finished tls sha256");
  mbedtls_sha256_clone((mbedtls_sha256_context *)(padbuf + 0x1c),&ssl->handshake->fin_sha256);
  mbedtls_debug_print_buf
            (ssl,4,"file1",0x1362,"finished sha2 state",(uchar *)(sha256.total + 1),0x20);
  if (from == 0) {
    pcVar2 = "client finished";
  }
  else {
    pcVar2 = "server finished";
  }
  mbedtls_sha256_finish((mbedtls_sha256_context *)(padbuf + 0x1c),auStack180);
  (*ssl->handshake->tls_prf)(pmVar1->master,0x30,pcVar2,auStack180,0x20,buf,0xc);
  mbedtls_debug_print_buf(ssl,3,"file1",0x136e,"calc finished result",buf,0xc);
  mbedtls_sha256_free((mbedtls_sha256_context *)(padbuf + 0x1c));
  mbedtls_zeroize(auStack180,0x20);
  mbedtls_debug_print_msg(ssl,2,"file1",0x1374,"<= calc  finished");
  return;
}



// WARNING: Variable defined which should be unmapped: sha256

void ssl_calc_verify_tls_sha256(mbedtls_ssl_context *ssl,uchar *hash)

{
  undefined auStack132 [4];
  mbedtls_sha256_context sha256;
  
