pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mbedtls_sha256_init((mbedtls_sha256_context *)auStack132);
  mbedtls_debug_print_msg(ssl,2,"file1",0x42d,"=> calc verify sha256");
  mbedtls_sha256_clone((mbedtls_sha256_context *)auStack132,&ssl->handshake->fin_sha256);
  mbedtls_sha256_finish((mbedtls_sha256_context *)auStack132,hash);
  mbedtls_debug_print_buf(ssl,3,"file1",0x432,"calculated verify result",hash,0x20);
  mbedtls_debug_print_msg(ssl,2,"file1",0x433,"<= calc verify");
  mbedtls_sha256_free((mbedtls_sha256_context *)auStack132);
  return;
}



void ssl_flight_free(mbedtls_ssl_flight_item *flight)

{
  mbedtls_ssl_flight_item *pmVar1;
  
  while (flight != (mbedtls_ssl_flight_item *)0x0) {
    pmVar1 = flight->next;
    vPortFree(flight->p);
    vPortFree(flight);
    flight = pmVar1;
  }
  return;
}



int ssl_append_key_cert(mbedtls_ssl_key_cert **head,mbedtls_x509_crt *cert,mbedtls_pk_context *key)

{
  mbedtls_ssl_key_cert *pmVar1;
  int iVar2;
  mbedtls_ssl_key_cert *pmVar3;
  mbedtls_ssl_key_cert *pmVar4;
  
  pmVar1 = (mbedtls_ssl_key_cert *)mycalloc(1,0xc);
  if (pmVar1 == (mbedtls_ssl_key_cert *)0x0) {
    iVar2 = -0x7f00;
  }
  else {
    pmVar1->cert = cert;
    pmVar1->next = (mbedtls_ssl_key_cert *)0x0;
    pmVar1->key = key;
    pmVar3 = *head;
    if (*head == (mbedtls_ssl_key_cert *)0x0) {
      *head = pmVar1;
    }
    else {
      do {
        pmVar4 = pmVar3;
        pmVar3 = pmVar4->next;
      } while (pmVar3 != (mbedtls_ssl_key_cert *)0x0);
      pmVar4->next = pmVar1;
    }
    iVar2 = 0;
  }
  return iVar2;
}



void ssl_update_checksum_start(mbedtls_ssl_context *ssl,uchar *buf,size_t len)

{
  mbedtls_sha256_update(&ssl->handshake->fin_sha256,buf,len);
  return;
}



void ssl_update_checksum_sha256(mbedtls_ssl_context *ssl,uchar *buf,size_t len)

{
  mbedtls_sha256_update(&ssl->handshake->fin_sha256,buf,len);
  return;
}



size_t mbedtls_ssl_hdr_len(void)

{
  int in_a0;
  
  if ((*(ushort *)(in_a0 + 0x74) & 2) != 0) {
    return 0xd;
  }
  return 5;
}



void ssl_set_timer(mbedtls_ssl_context *ssl,uint32_t millisecs)

{
  if (ssl->f_set_timer != (mbedtls_ssl_set_timer_t_conflict1 *)0x0) {
    mbedtls_debug_print_msg(ssl,3,"file1",0x52,"set_timer to %d ms",millisecs);
                    // WARNING: Could not recover jumptable at 0x230599f4. Too many branches
                    // WARNING: Treating indirect jump as call
    (*ssl->f_set_timer)(ssl->p_timer,millisecs >> 2,millisecs);
    return;
  }
  return;
}



int ssl_check_timer(mbedtls_ssl_context *ssl)

{
  int iVar1;
  
  if (ssl->f_get_timer == (mbedtls_ssl_get_timer_t *)0x0) {
    return 0;
  }
  iVar1 = (*ssl->f_get_timer)(ssl->p_timer);
  if (iVar1 == 2) {
    mbedtls_debug_print_msg(ssl,3,"file1",0x60,"timer expired");
    iVar1 = -1;
  }
  else {
    iVar1 = 0;
  }
  return iVar1;
}



// WARNING: Variable defined which should be unmapped: tmp

int tls_prf_sha256(uchar *secret,size_t slen,char *label,uchar *random,size_t rlen,uchar *dstbuf,
                  size_t dlen)

{
  int iVar1;
  uint uVar2;
  uchar ilen;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  size_t __n;
  int iVar3;
  uchar *puVar4;
  size_t sVar5;
  size_t sVar6;
  uint uVar7;
  undefined auStack220 [4];
  mbedtls_md_context_t md_ctx;
  uchar h_i [32];
  uchar tmp [128];
  
  mbedtls_md_init((mbedtls_md_context_t *)auStack220);
  md_info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (md_info == (mbedtls_md_info_t *)0x0) {
    iVar3 = -0x6c00;
  }
  else {
    ilen = mbedtls_md_get_size(md_info);
    _ilen = CONCAT31(extraout_var,ilen);
    __n = strlen(label);
    if (__n + rlen + _ilen < 0x81) {
      __n = strlen(label);
      memcpy(h_i + _ilen + 0x1c,label,__n);
      memcpy(h_i + _ilen + __n + 0x1c,random,rlen);
      iVar3 = mbedtls_md_setup((mbedtls_md_context_t *)auStack220,md_info,1);
      if (iVar3 == 0) {
        mbedtls_md_hmac_starts((mbedtls_md_context_t *)auStack220,secret,slen);
        mbedtls_md_hmac_update((mbedtls_md_context_t *)auStack220,h_i + _ilen + 0x1c,rlen + __n);
        mbedtls_md_hmac_finish((mbedtls_md_context_t *)auStack220,h_i + 0x1c);
        uVar2 = 0;
        while (uVar7 = uVar2, uVar7 < dlen) {
          mbedtls_md_hmac_reset((mbedtls_md_context_t *)auStack220);
          mbedtls_md_hmac_update((mbedtls_md_context_t *)auStack220,h_i + 0x1c,rlen + __n + _ilen);
          mbedtls_md_hmac_finish((mbedtls_md_context_t *)auStack220,(uchar *)&md_ctx.hmac_ctx);
          mbedtls_md_hmac_reset((mbedtls_md_context_t *)auStack220);
          mbedtls_md_hmac_update((mbedtls_md_context_t *)auStack220,h_i + 0x1c,_ilen);
          mbedtls_md_hmac_finish((mbedtls_md_context_t *)auStack220,h_i + 0x1c);
          sVar5 = _ilen;
          if (dlen < _ilen + uVar7) {
            sVar5 = dlen % _ilen;
          }
          sVar6 = 0;
          while (uVar2 = _ilen + uVar7, sVar6 != sVar5) {
            puVar4 = (uchar *)((int)&md_ctx.hmac_ctx + sVar6);
            iVar1 = sVar6 + uVar7;
            sVar6 = sVar6 + 1;
            dstbuf[iVar1] = *puVar4;
          }
        }
        mbedtls_md_free((mbedtls_md_context_t *)auStack220);
        mbedtls_zeroize(h_i + 0x1c,0x80);
        mbedtls_zeroize(&md_ctx.hmac_ctx,0x20);
      }
    }
    else {
      iVar3 = -0x7100;
    }
  }
  return iVar3;
}



int mbedtls_ssl_derive_keys(mbedtls_ssl_context *ssl)

{
  mbedtls_cipher_type_t mVar1;
  size_t __n;
  mbedtls_ssl_transform *pmVar2;
  mbedtls_cipher_context_t *ctx;
  uchar uVar3;
  mbedtls_cipher_info_t *cipher_info;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  size_t sVar4;
  uint uVar5;
  int line;
  int line_00;
  char *text;
  size_t sVar6;
  mbedtls_ssl_handshake_params *pmVar7;
  uchar *buf;
  uchar *buf_00;
  mbedtls_cipher_context_t *ctx_00;
  uchar *buf_01;
  uchar *key;
  mbedtls_ssl_session *pmVar8;
  undefined auStack384 [4];
  uchar tmp [64];
  uchar keyblk [256];
  
  pmVar2 = ssl->transform_negotiate;
  pmVar8 = ssl->session_negotiate;
  pmVar7 = ssl->handshake;
  mbedtls_debug_print_msg(ssl,2,"file1",0x1f5,"=> derive keys");
  cipher_info = mbedtls_cipher_info_from_type(pmVar2->ciphersuite_info->cipher);
  if (cipher_info == (mbedtls_cipher_info_t *)0x0) {
    mVar1 = pmVar2->ciphersuite_info->cipher;
    text = "cipher info for %d not found";
    line = 0x1fb;
LAB_23059c08:
    mbedtls_debug_print_msg(ssl,1,"file1",line,text,(uint)mVar1);
    return -0x7100;
  }
  md_info = mbedtls_md_info_from_type(pmVar2->ciphersuite_info->mac);
  if (md_info == (mbedtls_md_info_t *)0x0) {
    text = "mbedtls_md info for %d not found";
    mVar1 = pmVar2->ciphersuite_info->mac;
    line = 0x203;
    goto LAB_23059c08;
  }
  if (ssl->minor_ver != 3) {
    line = 0x232;
    goto LAB_23059cde;
  }
  pmVar7->tls_prf = tls_prf_sha256;
  pmVar7->calc_verify = ssl_calc_verify_tls_sha256;
  pmVar7->calc_finished = ssl_calc_finished_tls_sha256;
  buf_01 = pmVar7->randbytes;
  buf = pmVar8->master;
  if (pmVar7->resume == 0) {
    buf_00 = pmVar7->premaster;
    mbedtls_debug_print_buf(ssl,3,"file1",0x243,"premaster secret",buf_00,pmVar7->pmslen);
    line = (*pmVar7->tls_prf)(buf_00,pmVar7->pmslen,"master secret",buf_01,0x40,buf,0x30);
    if (line != 0) {
      text = "prf";
      line_00 = 0x275;
      goto LAB_23059d46;
    }
    mbedtls_zeroize(buf_00,0x30);
  }
  else {
    mbedtls_debug_print_msg(ssl,3,"file1",0x27c,"no premaster (session resumed)");
  }
  memcpy(auStack384,buf_01,0x40);
  memcpy(buf_01,tmp + 0x1c,0x20);
  memcpy(pmVar7->randbytes + 0x20,auStack384,0x20);
  mbedtls_zeroize(auStack384,0x40);
  line = (*pmVar7->tls_prf)(buf,0x30,"key expansion",buf_01,0x40,tmp + 0x3c,0x100);
  if (line != 0) {
    text = "prf";
    line_00 = 0x296;
    goto LAB_23059d46;
  }
  text = mbedtls_ssl_get_ciphersuite_name(pmVar8->ciphersuite);
  mbedtls_debug_print_msg(ssl,3,"file1",0x29b,"ciphersuite = %s",text);
  mbedtls_debug_print_buf(ssl,3,"file1",0x29c,"master secret",buf,0x30);
  mbedtls_debug_print_buf(ssl,4,"file1",0x29d,"random bytes",buf_01,0x40);
  mbedtls_debug_print_buf(ssl,4,"file1",0x29e,"key block",tmp + 0x3c,0x100);
  mbedtls_zeroize(buf_01,0x40);
  pmVar2->keylen = cipher_info->key_bitlen >> 3;
  if ((cipher_info->mode + ~MBEDTLS_MODE_CTR & 0xfd) == 0) {
    pmVar2->ivlen = 0xc;
    pmVar2->fixed_ivlen = 4;
    pmVar2->maclen = 0;
    line = 8;
    if ((pmVar2->ciphersuite_info->flags & 2) == 0) {
      line = 0x10;
    }
    sVar6 = line + 8;
LAB_23059e78:
    pmVar2->minlen = sVar6;
  }
  else {
    line = mbedtls_md_setup(&pmVar2->md_ctx_enc,md_info,1);
    if ((line != 0) || (line = mbedtls_md_setup(&pmVar2->md_ctx_dec,md_info,1), line != 0)) {
      text = "mbedtls_md_setup";
      line_00 = 699;
      goto LAB_23059d46;
    }
    uVar3 = mbedtls_md_get_size(md_info);
    uVar5 = CONCAT31(extraout_var,uVar3);
    pmVar2->maclen = uVar5;
    sVar6 = cipher_info->iv_size;
    pmVar2->ivlen = sVar6;
    if (cipher_info->mode != MBEDTLS_MODE_STREAM) {
      sVar4 = (uVar5 + cipher_info->block_size) - uVar5 % cipher_info->block_size;
      pmVar2->minlen = sVar4;
      if (1 < ssl->minor_ver - 2U) {
        line = 0x2f7;
        goto LAB_23059cde;
      }
      sVar6 = sVar6 + sVar4;
      goto LAB_23059e78;
    }
    pmVar2->minlen = uVar5;
  }
  mbedtls_debug_print_msg
            (ssl,3,"file1",0x2ff,"keylen: %d, minlen: %d, ivlen: %d, maclen: %d",pmVar2->keylen,
             pmVar2->minlen,pmVar2->ivlen);
  uVar5 = pmVar2->keylen;
  __n = pmVar2->fixed_ivlen;
  sVar6 = pmVar2->maclen;
  line = sVar6 * 2;
  if ((*(ushort *)&ssl->conf->field_0x74 & 1) == 0) {
    key = tmp + 0x3c;
    buf_00 = key + line;
    buf = key + line + uVar5;
    key = key + sVar6;
    if (__n == 0) {
      __n = pmVar2->ivlen;
    }
    memcpy(pmVar2->iv_enc,buf + uVar5,__n);
    memcpy(pmVar2->iv_dec,buf + pmVar2->keylen + __n,__n);
    buf_01 = tmp + 0x3c;
  }
  else {
    buf_01 = tmp + 0x3c;
    buf_00 = buf_01 + line + uVar5;
    buf = buf_01 + line;
    buf_01 = buf_01 + sVar6;
    if (__n == 0) {
      __n = pmVar2->ivlen;
    }
    memcpy(pmVar2->iv_dec,buf_00 + uVar5,__n);
    memcpy(pmVar2->iv_enc,buf_00 + pmVar2->keylen + __n,__n);
    key = tmp + 0x3c;
  }
  if (0 < ssl->minor_ver) {
    mbedtls_md_hmac_starts(&pmVar2->md_ctx_enc,buf_01,pmVar2->maclen);
    mbedtls_md_hmac_starts(&pmVar2->md_ctx_dec,key,pmVar2->maclen);
    ctx_00 = &pmVar2->cipher_ctx_enc;
    line = mbedtls_cipher_setup(ctx_00,cipher_info);
    if (line == 0) {
      ctx = &pmVar2->cipher_ctx_dec;
      line = mbedtls_cipher_setup(ctx,cipher_info);
      if (line == 0) {
        line = mbedtls_cipher_setkey(ctx_00,buf_00,cipher_info->key_bitlen,MBEDTLS_ENCRYPT);
        if (line == 0) {
          line = mbedtls_cipher_setkey(ctx,buf,cipher_info->key_bitlen,MBEDTLS_DECRYPT);
          if (line == 0) {
            if (cipher_info->mode == MBEDTLS_MODE_CBC) {
              line = mbedtls_cipher_set_padding_mode(ctx_00,MBEDTLS_PADDING_NONE);
              if (line != 0) {
                mbedtls_debug_print_ret(ssl,1,"file1",0x38e,"mbedtls_cipher_set_padding_mode",line);
                return line;
              }
              line = mbedtls_cipher_set_padding_mode(ctx,MBEDTLS_PADDING_NONE);
              if (line != 0) {
                mbedtls_debug_print_ret(ssl,1,"file1",0x395,"mbedtls_cipher_set_padding_mode",line);
                return line;
              }
            }
            mbedtls_zeroize(tmp + 0x3c,0x100);
            mbedtls_debug_print_msg(ssl,2,"file1",0x3bd,"<= derive keys");
            return 0;
          }
          text = "mbedtls_cipher_setkey";
          line_00 = 900;
        }
        else {
          text = "mbedtls_cipher_setkey";
          line_00 = 0x37c;
        }
      }
      else {
        text = "mbedtls_cipher_setup";
        line_00 = 0x374;
      }
    }
    else {
      text = "mbedtls_cipher_setup";
      line_00 = 0x36d;
    }
LAB_23059d46:
    mbedtls_debug_print_ret(ssl,1,"file1",line_00,text,line);
    return line;
  }
  line = 0x349;
LAB_23059cde:
  mbedtls_debug_print_msg(ssl,1,"file1",line,"should never happen");
  return -0x6c00;
}



