pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_ssl_flush_output(mbedtls_ssl_context *ssl)

{
  int ret;
  size_t sVar1;
  uint uVar2;
  uchar uVar3;
  size_t sVar4;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x98a,"=> flush output");
  if (ssl->f_send == (mbedtls_ssl_send_t *)0x0) {
    mbedtls_debug_print_msg
              (ssl,1,"file1",0x98f,"Bad usage of mbedtls_ssl_set_bio() or mbedtls_ssl_set_bio()");
    ret = -0x7100;
  }
  else {
    if (ssl->out_left == 0) {
      ret = 0x996;
    }
    else {
      while (sVar4 = ssl->out_left, sVar4 != 0) {
        sVar1 = mbedtls_ssl_hdr_len();
        mbedtls_debug_print_msg
                  (ssl,2,"file1",0x99d,"message length: %d, out_left: %d",ssl->out_msglen + sVar1,
                   sVar4);
        sVar4 = mbedtls_ssl_hdr_len();
        ret = (*ssl->f_send)(ssl->p_bio,ssl->out_hdr + sVar4 + (ssl->out_msglen - ssl->out_left),
                             ssl->out_left);
        mbedtls_debug_print_ret(ssl,2,"file1",0x9a3,"ssl->f_send",ret);
        if (ret < 1) {
          return ret;
        }
        ssl->out_left = ssl->out_left - ret;
      }
      uVar2 = 8;
      while (((uint)*(ushort *)&ssl->conf->field_0x74 & 2) < uVar2) {
        uVar3 = ssl->out_ctr[uVar2 - 1] + '\x01';
        ssl->out_ctr[uVar2 - 1] = uVar3;
        if (uVar3 != '\0') break;
        uVar2 = uVar2 - 1 & 0xff;
      }
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        sVar4 = 2;
      }
      if (uVar2 == sVar4) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x9b2,"outgoing message counter would wrap");
        return -0x6b80;
      }
      ret = 0x9b6;
    }
    mbedtls_debug_print_msg(ssl,2,"file1",ret,"<= flush output");
    ret = 0;
  }
  return ret;
}



void mbedtls_ssl_recv_flight_completed(mbedtls_ssl_context *ssl)

{
  ssl_flight_free(ssl->handshake->flight);
  ssl->handshake->flight = (mbedtls_ssl_flight_item *)0x0;
  ssl->handshake->cur_msg = (mbedtls_ssl_flight_item *)0x0;
  ssl->handshake->in_flight_start_seq = ssl->handshake->in_msg_seq;
  ssl_set_timer(ssl,0);
  if ((ssl->in_msgtype == 0x16) && (*ssl->in_msg == '\x14')) {
    ssl->handshake->retransmit_state = '\x03';
  }
  else {
    ssl->handshake->retransmit_state = '\0';
  }
  return;
}



void mbedtls_ssl_send_flight_completed(mbedtls_ssl_context *ssl)

{
  uchar uVar1;
  
  ssl->handshake->retransmit_timeout = ssl->conf->hs_timeout_min;
  mbedtls_debug_print_msg
            (ssl,3,"file1",0x87,"update timeout value to %d millisecs",
             ssl->handshake->retransmit_timeout);
  ssl_set_timer(ssl,ssl->handshake->retransmit_timeout);
  if ((ssl->in_msgtype == 0x16) && (*ssl->in_msg == '\x14')) {
    uVar1 = '\x03';
  }
  else {
    uVar1 = '\x02';
  }
  ssl->handshake->retransmit_state = uVar1;
  return;
}



void mbedtls_ssl_update_handshake_status(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_handshake_params *pmVar1;
  
  if ((ssl->state != 0x10) && (ssl->handshake != (mbedtls_ssl_handshake_params *)0x0)) {
    (*ssl->handshake->update_checksum)(ssl,ssl->in_msg,ssl->in_hslen);
  }
  if (((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) &&
     (pmVar1 = ssl->handshake, pmVar1 != (mbedtls_ssl_handshake_params *)0x0)) {
    pmVar1->in_msg_seq = pmVar1->in_msg_seq + 1;
  }
  return;
}



void mbedtls_ssl_optimize_checksum
               (mbedtls_ssl_context *ssl,mbedtls_ssl_ciphersuite_t *ciphersuite_info)

{
  if (ciphersuite_info->mac != MBEDTLS_MD_SHA384) {
    ssl->handshake->update_checksum = ssl_update_checksum_sha256;
    return;
  }
  mbedtls_debug_print_msg(ssl,1,"file1",0x122e,"should never happen");
  return;
}



void mbedtls_ssl_reset_checksum(mbedtls_ssl_context *ssl)

{
  mbedtls_sha256_starts(&ssl->handshake->fin_sha256,0);
  return;
}



void mbedtls_ssl_session_init(mbedtls_ssl_session *session)

{
  memset(session,0,0x74);
  return;
}



void mbedtls_ssl_init(mbedtls_ssl_context *ssl)

{
  memset(ssl,0,0xc0);
  return;
}



void mbedtls_ssl_conf_authmode(mbedtls_ssl_config *conf,int authmode)

{
  *(ushort *)&conf->field_0x74 =
       *(ushort *)&conf->field_0x74 & 0xfff3 | (ushort)((authmode & 3U) << 2);
  return;
}



void mbedtls_ssl_conf_verify
               (mbedtls_ssl_config *conf,
               anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *f_vrfy,void *p_vrfy)

{
  *(anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr **)&conf->f_vrfy = f_vrfy;
  conf->p_vrfy = p_vrfy;
  return;
}



void mbedtls_ssl_conf_rng(mbedtls_ssl_config *conf,mbedtls_ssl_recv_t *f_rng,void *p_rng)

{
  conf->f_rng = f_rng;
  conf->p_rng = p_rng;
  return;
}



void mbedtls_ssl_set_bio(mbedtls_ssl_context *ssl,void *p_bio,mbedtls_ssl_send_t *f_send,
                        mbedtls_ssl_recv_t *f_recv,
                        mbedtls_ssl_recv_timeout_t_conflict1 *f_recv_timeout)

{
  ssl->p_bio = p_bio;
  ssl->f_send = f_send;
  ssl->f_recv = f_recv;
  ssl->f_recv_timeout = f_recv_timeout;
  return;
}



void mbedtls_ssl_conf_read_timeout(mbedtls_ssl_config *conf,uint32_t timeout)

{
  conf->read_timeout = timeout;
  return;
}



int mbedtls_ssl_conf_own_cert
              (mbedtls_ssl_config *conf,mbedtls_x509_crt *own_cert,mbedtls_pk_context *pk_key)

{
  int iVar1;
  
  iVar1 = ssl_append_key_cert(&conf->key_cert,own_cert,pk_key);
  return iVar1;
}



void mbedtls_ssl_conf_ca_chain
               (mbedtls_ssl_config *conf,mbedtls_x509_crt *ca_chain,mbedtls_x509_crl *ca_crl)

{
  conf->ca_chain = ca_chain;
  conf->ca_crl = ca_crl;
  return;
}



int mbedtls_ssl_set_hostname(mbedtls_ssl_context *ssl,char *hostname)

{
  size_t __n;
  char *__dest;
  int iVar1;
  
  if (hostname == (char *)0x0) {
    return -0x7100;
  }
  __n = strlen(hostname);
  if (__n < 0x100) {
    __dest = (char *)mycalloc(1,__n + 1);
    ssl->hostname = __dest;
    if (__dest == (char *)0x0) {
      iVar1 = -0x7f00;
    }
    else {
      memcpy(__dest,hostname,__n);
      iVar1 = 0;
      ssl->hostname[__n] = '\0';
    }
  }
  else {
    iVar1 = -0x7100;
  }
  return iVar1;
}



int mbedtls_ssl_conf_alpn_protocols(mbedtls_ssl_config *conf,char **protos)

{
  char **ppcVar1;
  uint uVar2;
  size_t sVar3;
  
