pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar2 = 0;
  ppcVar1 = protos;
  while( true ) {
    if (*ppcVar1 == (char *)0x0) {
      conf->alpn_list = protos;
      return 0;
    }
    sVar3 = strlen(*ppcVar1);
    uVar2 = uVar2 + sVar3;
    if ((0xfe < sVar3 - 1) || (0xffff < uVar2)) break;
    ppcVar1 = ppcVar1 + 1;
  }
  return -0x7100;
}



uint32_t mbedtls_ssl_get_verify_result(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_session *pmVar1;
  
  pmVar1 = ssl->session;
  if ((pmVar1 == (mbedtls_ssl_session *)0x0) &&
     (pmVar1 = ssl->session_negotiate, pmVar1 == (mbedtls_ssl_session *)0x0)) {
    return 0xffffffff;
  }
  return pmVar1->verify_result;
}



char * mbedtls_ssl_get_ciphersuite(mbedtls_ssl_context *ssl)

{
  char *pcVar1;
  
  if ((ssl != (mbedtls_ssl_context *)0x0) && (ssl->session != (mbedtls_ssl_session *)0x0)) {
    pcVar1 = mbedtls_ssl_get_ciphersuite_name(ssl->session->ciphersuite);
    return pcVar1;
  }
  return (char *)0x0;
}



char * mbedtls_ssl_get_version(mbedtls_ssl_context *ssl)

{
  uint uVar1;
  
  uVar1 = ssl->minor_ver;
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
    if (uVar1 < 4) {
      return *(char **)(CSWTCH_34 + uVar1 * 4);
    }
    return "unknown";
  }
  if (uVar1 != 2) {
    if (uVar1 != 3) {
      return "unknown (DTLS)";
    }
    return "DTLSv1.2";
  }
  return "DTLSv1.0";
}



size_t mbedtls_ssl_get_record_expansion(mbedtls_ssl_context *param_1)

{
  mbedtls_cipher_mode_t mVar1;
  size_t sVar2;
  size_t sVar3;
  int iVar4;
  mbedtls_cipher_info_t *pmVar5;
  mbedtls_ssl_transform *pmVar6;
  
  pmVar6 = param_1->transform_out;
  if (pmVar6 == (mbedtls_ssl_transform *)0x0) {
    sVar2 = mbedtls_ssl_hdr_len();
    return sVar2;
  }
  pmVar5 = (pmVar6->cipher_ctx_enc).cipher_info;
  if (pmVar5 == (mbedtls_cipher_info_t *)0x0) {
LAB_2305a542:
    mbedtls_debug_print_msg(param_1,1,"file1",0x18cf,"should never happen");
    iVar4 = -0x6c00;
  }
  else {
    mVar1 = pmVar5->mode;
    if (mVar1 == MBEDTLS_MODE_CBC) {
      sVar2 = pmVar6->maclen + pmVar5->block_size;
    }
    else {
      if ((mVar1 < MBEDTLS_MODE_CBC) || (2 < (byte)(mVar1 + ~MBEDTLS_MODE_CTR))) goto LAB_2305a542;
      sVar2 = pmVar6->minlen;
    }
    sVar3 = mbedtls_ssl_hdr_len();
    iVar4 = sVar3 + sVar2;
  }
  return iVar4;
}



size_t mbedtls_ssl_get_max_frag_len(mbedtls_ssl_context *ssl)

{
  uint uVar1;
  
  uVar1 = *(uint *)((int)mfl_code_to_length + (*(uint *)&ssl->conf->field_0x74 >> 4 & 0x1c));
  if ((ssl->session_out != (mbedtls_ssl_session *)0x0) &&
     (mfl_code_to_length[ssl->session_out->mfl_code] < uVar1)) {
    uVar1 = mfl_code_to_length[ssl->session_out->mfl_code];
  }
  return uVar1;
}



mbedtls_x509_crt * mbedtls_ssl_get_peer_cert(mbedtls_ssl_context *ssl)

{
  if ((ssl != (mbedtls_ssl_context *)0x0) &&
     (ssl = (mbedtls_ssl_context *)ssl->session, (mbedtls_x509_crt *)ssl != (mbedtls_x509_crt *)0x0)
     ) {
    ssl = (mbedtls_ssl_context *)(((mbedtls_x509_crt *)ssl)->issuer).val.len;
  }
  return (mbedtls_x509_crt *)ssl;
}



int mbedtls_ssl_handshake_step(mbedtls_ssl_context *ssl)

{
  int iVar1;
  
  if (ssl == (mbedtls_ssl_context *)0x0) {
    return -0x7100;
  }
  if (ssl->conf == (mbedtls_ssl_config *)0x0) {
    iVar1 = -0x7100;
  }
  else {
    if (((*(ushort *)&ssl->conf->field_0x74 & 1) != 0) ||
       (iVar1 = mbedtls_ssl_handshake_client_step(ssl), (*(ushort *)&ssl->conf->field_0x74 & 1) != 0
       )) {
      iVar1 = mbedtls_ssl_handshake_server_step(ssl);
      return iVar1;
    }
  }
  return iVar1;
}



int mbedtls_ssl_handshake(mbedtls_ssl_context *ssl)

{
  int iVar1;
  
  if ((ssl == (mbedtls_ssl_context *)0x0) || (ssl->conf == (mbedtls_ssl_config *)0x0)) {
    iVar1 = -0x7100;
  }
  else {
    mbedtls_debug_print_msg(ssl,2,"file1",0x1926,"=> handshake");
    do {
      if (ssl->state == 0x10) {
        iVar1 = 0;
        break;
      }
      iVar1 = mbedtls_ssl_handshake_step(ssl);
    } while (iVar1 == 0);
    mbedtls_debug_print_msg(ssl,2,"file1",0x1930,"<= handshake");
  }
  return iVar1;
}



void mbedtls_ssl_transform_free(mbedtls_ssl_transform *transform)

{
  if (transform != (mbedtls_ssl_transform *)0x0) {
    mbedtls_cipher_free(&transform->cipher_ctx_enc);
    mbedtls_cipher_free(&transform->cipher_ctx_dec);
    mbedtls_md_free(&transform->md_ctx_enc);
    mbedtls_md_free(&transform->md_ctx_dec);
    mbedtls_zeroize(transform,0xd0);
    return;
  }
  return;
}



void mbedtls_ssl_handshake_free(mbedtls_ssl_handshake_params *handshake)

{
  mbedtls_ssl_key_cert *pmVar1;
  mbedtls_ssl_key_cert *pv;
  
  if (handshake != (mbedtls_ssl_handshake_params *)0x0) {
    mbedtls_sha256_free(&handshake->fin_sha256);
    pv = handshake->sni_key_cert;
    while (pv != (mbedtls_ssl_key_cert *)0x0) {
      pmVar1 = pv->next;
      vPortFree(pv);
      pv = pmVar1;
    }
    vPortFree(handshake->verify_cookie);
    vPortFree(handshake->hs_msg);
    ssl_flight_free(handshake->flight);
    mbedtls_zeroize(handshake,0x15c);
    return;
  }
  return;
}



void ssl_handshake_wrapup_free_hs_transform(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_transform *pmVar1;
  
  mbedtls_debug_print_msg(ssl,3,"file1",0x13af,"=> handshake wrapup: final free");
  mbedtls_ssl_handshake_free(ssl->handshake);
  vPortFree(ssl->handshake);
  ssl->handshake = (mbedtls_ssl_handshake_params *)0x0;
  if (ssl->transform != (mbedtls_ssl_transform *)0x0) {
    mbedtls_ssl_transform_free(ssl->transform);
    vPortFree(ssl->transform);
  }
  pmVar1 = ssl->transform_negotiate;
  ssl->transform_negotiate = (mbedtls_ssl_transform *)0x0;
  ssl->transform = pmVar1;
  mbedtls_debug_print_msg(ssl,3,"file1",0x13c3,"<= handshake wrapup: final free");
  return;
}



void mbedtls_ssl_session_free(mbedtls_ssl_session *session)

{
  if (session != (mbedtls_ssl_session *)0x0) {
    if (session->peer_cert != (mbedtls_x509_crt *)0x0) {
      mbedtls_x509_crt_free(session->peer_cert);
      vPortFree(session->peer_cert);
    }
    vPortFree(session->ticket);
    mbedtls_zeroize(session,0x74);
    return;
  }
  return;
}



void mbedtls_ssl_handshake_wrapup(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_session *pmVar1;
  anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_for_f_set_cache *paVar2;
  int iVar3;
  
  iVar3 = ssl->handshake->resume;
  mbedtls_debug_print_msg(ssl,3,"file1",0x13ca,"=> handshake wrapup");
  if (ssl->session != (mbedtls_ssl_session *)0x0) {
    mbedtls_ssl_session_free(ssl->session);
    vPortFree(ssl->session);
  }
  pmVar1 = ssl->session_negotiate;
  ssl->session_negotiate = (mbedtls_ssl_session *)0x0;
  ssl->session = pmVar1;
  paVar2 = ssl->conf->f_set_cache;
  if ((((paVar2 != (anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_for_f_set_cache *)0x0) &&
       (pmVar1->id_len != 0)) && (iVar3 == 0)) &&
     (iVar3 = (*paVar2)(ssl->conf->p_cache,pmVar1), iVar3 != 0)) {
    mbedtls_debug_print_msg(ssl,1,"file1",0x13ed,"cache did not store session");
  }
  if (((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) ||
     (ssl->handshake->flight == (mbedtls_ssl_flight_item *)0x0)) {
    ssl_handshake_wrapup_free_hs_transform(ssl);
  }
  else {
    ssl_set_timer(ssl,0);
    mbedtls_debug_print_msg(ssl,3,"file1",0x13f9,"skip freeing handshake and transform");
  }
  ssl->state = ssl->state + 1;
  mbedtls_debug_print_msg(ssl,3,"file1",0x1401,"<= handshake wrapup");
  return;
}



