pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int ssl_handshake_init(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_transform *__s;
  mbedtls_ssl_handshake_params *__s_00;
  mbedtls_ssl_session *pmVar1;
  
  if (ssl->transform_negotiate != (mbedtls_ssl_transform *)0x0) {
    mbedtls_ssl_transform_free(ssl->transform_negotiate);
  }
  if (ssl->session_negotiate != (mbedtls_ssl_session *)0x0) {
    mbedtls_ssl_session_free(ssl->session_negotiate);
  }
  if (ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) {
    mbedtls_ssl_handshake_free(ssl->handshake);
  }
  if (ssl->transform_negotiate == (mbedtls_ssl_transform *)0x0) {
    __s = (mbedtls_ssl_transform *)mycalloc(1,0xd0);
    ssl->transform_negotiate = __s;
  }
  if (ssl->session_negotiate == (mbedtls_ssl_session *)0x0) {
    pmVar1 = (mbedtls_ssl_session *)mycalloc(1,0x74);
    ssl->session_negotiate = pmVar1;
  }
  if (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0) {
    __s_00 = (mbedtls_ssl_handshake_params *)mycalloc(1,0x15c);
    ssl->handshake = __s_00;
    if (__s_00 == (mbedtls_ssl_handshake_params *)0x0) goto LAB_2305a8a6;
  }
  if ((ssl->transform_negotiate != (mbedtls_ssl_transform *)0x0) &&
     (ssl->session_negotiate != (mbedtls_ssl_session *)0x0)) {
    mbedtls_ssl_session_init(ssl->session_negotiate);
    __s = ssl->transform_negotiate;
    memset(__s,0,0xd0);
    mbedtls_cipher_init(&__s->cipher_ctx_enc);
    mbedtls_cipher_init(&__s->cipher_ctx_dec);
    mbedtls_md_init(&__s->md_ctx_enc);
    mbedtls_md_init(&__s->md_ctx_dec);
    __s_00 = ssl->handshake;
    memset(__s_00,0,0x15c);
    mbedtls_sha256_init(&__s_00->fin_sha256);
    mbedtls_sha256_starts(&__s_00->fin_sha256,0);
    __s_00->update_checksum = ssl_update_checksum_start;
    __s_00->sig_alg = 2;
    __s_00->sni_authmode = 3;
    if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
      return 0;
    }
    ssl->handshake->alt_transform_out = ssl->transform_out;
    if ((*(ushort *)&ssl->conf->field_0x74 & 1) == 0) {
      ssl->handshake->retransmit_state = '\0';
    }
    else {
      ssl->handshake->retransmit_state = '\x02';
    }
    ssl_set_timer(ssl,0);
    return 0;
  }
LAB_2305a8a6:
  mbedtls_debug_print_msg(ssl,1,"file1",0x152c,"alloc() of ssl sub-contexts failed");
  vPortFree(ssl->handshake);
  vPortFree(ssl->transform_negotiate);
  vPortFree(ssl->session_negotiate);
  ssl->handshake = (mbedtls_ssl_handshake_params *)0x0;
  ssl->transform_negotiate = (mbedtls_ssl_transform *)0x0;
  ssl->session_negotiate = (mbedtls_ssl_session *)0x0;
  return -0x7f00;
}



int mbedtls_ssl_setup(mbedtls_ssl_context *ssl,mbedtls_ssl_config *conf)

{
  uchar *puVar1;
  int iVar2;
  uchar *puVar3;
  uchar *puVar4;
  
  ssl->conf = conf;
  puVar1 = (uchar *)mycalloc(1,0x413d);
  ssl->in_buf = puVar1;
  if (puVar1 != (uchar *)0x0) {
    puVar1 = (uchar *)mycalloc(1,0x413d);
    ssl->out_buf = puVar1;
    if (puVar1 != (uchar *)0x0) {
      puVar4 = ssl->in_buf;
      puVar3 = puVar1 + 0xd;
      if ((*(ushort *)&conf->field_0x74 & 2) == 0) {
        ssl->out_ctr = puVar1;
        ssl->in_ctr = puVar4;
        ssl->out_hdr = puVar1 + 8;
        ssl->out_len = puVar1 + 0xb;
        ssl->out_iv = puVar3;
        ssl->out_msg = puVar3;
        ssl->in_hdr = puVar4 + 8;
      }
      else {
        ssl->out_hdr = puVar1;
        ssl->in_hdr = puVar4;
        ssl->out_ctr = puVar1 + 3;
        ssl->out_len = puVar1 + 0xb;
        ssl->out_iv = puVar3;
        ssl->out_msg = puVar3;
        ssl->in_ctr = puVar4 + 3;
      }
      ssl->in_len = puVar4 + 0xb;
      ssl->in_iv = puVar4 + 0xd;
      ssl->in_msg = puVar4 + 0xd;
      iVar2 = ssl_handshake_init(ssl);
      return iVar2;
    }
  }
  mbedtls_debug_print_msg(ssl,1,"file1",0x1585,"alloc(%d bytes) failed",0x413d);
  vPortFree(ssl->in_buf);
  ssl->in_buf = (uchar *)0x0;
  return -0x7f00;
}



void mbedtls_ssl_free(mbedtls_ssl_context *ssl)

{
  size_t n;
  char *__s;
  
  if (ssl != (mbedtls_ssl_context *)0x0) {
    mbedtls_debug_print_msg(ssl,2,"file1",0x1c0a,"=> free");
    if (ssl->out_buf != (uchar *)0x0) {
      mbedtls_zeroize(ssl->out_buf,0x413d);
      vPortFree(ssl->out_buf);
    }
    if (ssl->in_buf != (uchar *)0x0) {
      mbedtls_zeroize(ssl->in_buf,0x413d);
      vPortFree(ssl->in_buf);
    }
    if (ssl->transform != (mbedtls_ssl_transform *)0x0) {
      mbedtls_ssl_transform_free(ssl->transform);
      vPortFree(ssl->transform);
    }
    if (ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) {
      mbedtls_ssl_handshake_free(ssl->handshake);
      mbedtls_ssl_transform_free(ssl->transform_negotiate);
      mbedtls_ssl_session_free(ssl->session_negotiate);
      vPortFree(ssl->handshake);
      vPortFree(ssl->transform_negotiate);
      vPortFree(ssl->session_negotiate);
    }
    if (ssl->session != (mbedtls_ssl_session *)0x0) {
      mbedtls_ssl_session_free(ssl->session);
      vPortFree(ssl->session);
    }
    __s = ssl->hostname;
    if (__s != (char *)0x0) {
      n = strlen(__s);
      mbedtls_zeroize(__s,n);
      vPortFree(ssl->hostname);
    }
    mbedtls_debug_print_msg(ssl,2,"file1",0x1c4b,"<= free");
    mbedtls_zeroize(ssl,0xc0);
    return;
  }
  return;
}



void mbedtls_ssl_config_init(mbedtls_ssl_config *conf)

{
  memset(conf,0,0x78);
  return;
}



int mbedtls_ssl_config_defaults(mbedtls_ssl_config *conf,int endpoint,int transport,int preset)

{
  ushort uVar1;
  ushort uVar2;
  ushort uVar3;
  int *piVar4;
  mbedtls_ecp_group_id *pmVar5;
  
  uVar1 = *(ushort *)&conf->field_0x74;
  uVar3 = (ushort)endpoint & 1;
  uVar2 = (ushort)((transport & 1U) << 1);
  *(ushort *)&conf->field_0x74 = uVar1 & 0xfffc | uVar3 | uVar2;
  if (endpoint == 0) {
    *(ushort *)&conf->field_0x74 = uVar1 & 0xfdf0 | uVar3 | uVar2 | 0x208;
  }
  conf->hs_timeout_min = 1000;
  conf->hs_timeout_max = 60000;
  if (preset == 2) {
    *(undefined4 *)&conf->max_major_ver = 0x3030303;
    conf->ciphersuite_list[3] = (int *)0x4200d4a8;
    conf->ciphersuite_list[2] = (int *)0x4200d4a8;
    conf->ciphersuite_list[1] = (int *)0x4200d4a8;
    conf->ciphersuite_list[0] = (int *)0x4200d4a8;
    conf->cert_profile = &mbedtls_x509_crt_profile_suiteb;
    conf->sig_hashes = ssl_preset_suiteb_hashes;
    conf->curve_list = ssl_preset_suiteb_curves;
    return 0;
  }
  *(undefined4 *)&conf->max_major_ver = 0x3030303;
  if (transport == 1) {
    conf->min_minor_ver = '\x02';
  }
  piVar4 = mbedtls_ssl_list_ciphersuites();
  conf->cert_profile = &mbedtls_x509_crt_profile_default;
  conf->ciphersuite_list[3] = piVar4;
  conf->ciphersuite_list[2] = piVar4;
  conf->ciphersuite_list[1] = piVar4;
  conf->ciphersuite_list[0] = piVar4;
  conf->sig_hashes = ssl_preset_default_hashes;
  pmVar5 = mbedtls_ecp_grp_id_list();
  conf->curve_list = pmVar5;
  return 0;
}



void mbedtls_ssl_config_free(mbedtls_ssl_config *conf)

{
  mbedtls_ssl_key_cert *pmVar1;
  mbedtls_ssl_key_cert *pv;
  
