pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  pv = conf->key_cert;
  while (pv != (mbedtls_ssl_key_cert *)0x0) {
    pmVar1 = pv->next;
    vPortFree(pv);
    pv = pmVar1;
  }
  mbedtls_zeroize(conf,0x78);
  return;
}



uchar mbedtls_ssl_sig_from_pk(mbedtls_pk_context *pk)

{
  int iVar1;
  
  iVar1 = mbedtls_pk_can_do(pk,MBEDTLS_PK_RSA);
  return (uchar)(iVar1 != 0);
}



mbedtls_pk_type_t mbedtls_ssl_pk_alg_from_sig(uchar sig)

{
  undefined3 in_register_00002029;
  
  return (mbedtls_pk_type_t)(CONCAT31(in_register_00002029,sig) == 1);
}



mbedtls_md_type_t mbedtls_ssl_md_alg_from_hash(uchar hash)

{
  uint uVar1;
  
  uVar1 = (uint)hash - 1 & 0xff;
  if (uVar1 < 4) {
    return *(mbedtls_md_type_t *)((int)&CSWTCH_35 + uVar1);
  }
  return MBEDTLS_MD_NONE;
}



uchar mbedtls_ssl_hash_from_md_alg(int md)

{
  if (md - 3U < 4) {
    return *(uchar *)((int)&CSWTCH_35 + md + 1);
  }
  return '\0';
}



int mbedtls_ssl_check_curve(mbedtls_ssl_context *ssl,mbedtls_ecp_group_id grp_id)

{
  undefined3 in_register_0000202d;
  mbedtls_ecp_group_id *pmVar1;
  
  pmVar1 = ssl->conf->curve_list;
  if (pmVar1 != (mbedtls_ecp_group_id *)0x0) {
    while (*pmVar1 != MBEDTLS_ECP_DP_NONE) {
      if ((uint)*pmVar1 == CONCAT31(in_register_0000202d,grp_id)) {
        return 0;
      }
      pmVar1 = pmVar1 + 1;
    }
  }
  return -1;
}



int mbedtls_ssl_check_cert_usage
              (mbedtls_x509_crt *cert,mbedtls_ssl_ciphersuite_t *ciphersuite,int cert_endpoint,
              uint32_t *flags)

{
  int iVar1;
  int iVar2;
  uint usage;
  char *usage_oid;
  uint uVar3;
  
  usage = 0x80;
  if (cert_endpoint == 1) {
    usage = 0;
    if (ciphersuite->key_exchange < MBEDTLS_KEY_EXCHANGE_ECJPAKE) {
      uVar3 = 1 << ((uint)ciphersuite->key_exchange & 0x1f);
      usage = 0x20;
      if (((uVar3 & 0x82) == 0) && (usage = 8, (uVar3 & 0x600) == 0)) {
        usage = (uint)((uVar3 & 0x1c) != 0) << 7;
      }
    }
  }
  iVar1 = mbedtls_x509_crt_check_key_usage(cert,usage);
  if (iVar1 != 0) {
    *flags = *flags | 0x800;
    iVar1 = -1;
  }
  if (cert_endpoint == 1) {
    usage_oid = "+\x06\x01\x05\x05\a\x03\x01";
  }
  else {
    usage_oid = "+\x06\x01\x05\x05\a\x03\x02";
  }
  iVar2 = mbedtls_x509_crt_check_extended_key_usage(cert,usage_oid,8);
  if (iVar2 != 0) {
    iVar1 = -1;
    *flags = *flags | 0x1000;
  }
  return iVar1;
}



void mbedtls_ssl_write_version(int major,int minor,int transport,uchar *ver)

{
  uchar uVar1;
  
  uVar1 = (uchar)minor;
  if (transport == 1) {
    if (minor == 2) {
      uVar1 = '\x01';
    }
    *ver = ~((uchar)major - 2);
    uVar1 = -uVar1;
  }
  else {
    *ver = (uchar)major;
  }
  ver[1] = uVar1;
  return;
}



// WARNING: Variable defined which should be unmapped: add_data

int mbedtls_ssl_write_record(mbedtls_ssl_context *ssl)

{
  uchar uVar1;
  mbedtls_cipher_mode_t mVar2;
  int ret;
  mbedtls_ssl_flight_item *pv;
  size_t __n;
  char *text;
  int line;
  mbedtls_ssl_flight_item *pmVar3;
  mbedtls_ssl_flight_item *pmVar4;
  mbedtls_cipher_info_t *pmVar5;
  mbedtls_ssl_transform *pmVar6;
  uint uVar7;
  byte *pbVar8;
  uchar *input;
  undefined2 ilen;
  uint uVar9;
  size_t ilen_00;
  size_t *in_fa0;
  uchar *in_fa1;
  uchar *extraout_fa1;
  size_t in_fa2;
  size_t sStack52;
  size_t olen;
  uchar add_data [13];
  
  _ilen = ssl->out_msglen;
  ilen = (undefined2)_ilen;
  mbedtls_debug_print_msg(ssl,2,"file1",0xaa7,"=> write record");
  if (((((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) ||
       (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0)) ||
      (ssl->handshake->retransmit_state != '\x01')) && (ssl->out_msgtype == 0x16)) {
    uVar1 = *ssl->out_msg;
    if ((uVar1 != '\0') && (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0)) {
      mbedtls_debug_print_msg(ssl,1,"file1",0xab9,"should never happen");
      return -0x6c00;
    }
    __n = _ilen - 4;
    ssl->out_msg[1] = (uchar)(__n >> 0x10);
    ssl->out_msg[2] = (uchar)(__n >> 8);
    ssl->out_msg[3] = (uchar)__n;
    if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
      _ilen = _ilen + 8;
      memmove(ssl->out_msg + 0xc,ssl->out_msg + 4,__n);
      ssl->out_msglen = ssl->out_msglen + 8;
      if (uVar1 == '\0') {
        ssl->out_msg[4] = '\0';
        ssl->out_msg[5] = '\0';
      }
      else {
        ssl->out_msg[4] = (uchar)(ssl->handshake->out_msg_seq >> 8);
        ssl->out_msg[5] = (uchar)ssl->handshake->out_msg_seq;
        ssl->handshake->out_msg_seq = ssl->handshake->out_msg_seq + 1;
      }
      memset(ssl->out_msg + 6,0,3);
      memcpy(ssl->out_msg + 9,ssl->out_msg + 1,3);
    }
    ilen = (undefined2)_ilen;
    if (uVar1 != '\0') {
      in_fa0 = (size_t *)(*ssl->handshake->update_checksum)(ssl,ssl->out_msg,_ilen);
      in_fa1 = extraout_fa1;
    }
  }
  if ((((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) &&
      (ssl->handshake != (mbedtls_ssl_handshake_params *)0x0)) &&
     ((ssl->handshake->retransmit_state != '\x01' && ((ssl->out_msgtype & 0xfffffffdU) == 0x14)))) {
    pv = (mbedtls_ssl_flight_item *)mycalloc(1,0x10);
    if (pv == (mbedtls_ssl_flight_item *)0x0) {
      mbedtls_debug_print_msg(ssl,1,"file1",0x9ca,"alloc %d bytes failed",0x10);
LAB_2305af0c:
      mbedtls_debug_print_ret(ssl,1,"file1",0xaf1,"ssl_flight_append",-0x7f00);
      return -0x7f00;
    }
    input = (uchar *)mycalloc(1,ssl->out_msglen);
    pv->p = input;
    if (input == (uchar *)0x0) {
      mbedtls_debug_print_msg(ssl,1,"file1",0x9d0,"alloc %d bytes failed");
      vPortFree(pv);
      goto LAB_2305af0c;
    }
    memcpy(input,ssl->out_msg,ssl->out_msglen);
    pv->len = ssl->out_msglen;
    line = ssl->out_msgtype;
    pv->next = (mbedtls_ssl_flight_item *)0x0;
    pv->type = (uchar)line;
    pmVar3 = ssl->handshake->flight;
    if (pmVar3 == (mbedtls_ssl_flight_item *)0x0) {
      ssl->handshake->flight = pv;
    }
    else {
      do {
        pmVar4 = pmVar3;
        pmVar3 = pmVar4->next;
      } while (pmVar3 != (mbedtls_ssl_flight_item *)0x0);
      pmVar4->next = pv;
    }
  }
  *ssl->out_hdr = (uchar)ssl->out_msgtype;
  mbedtls_ssl_write_version
            (ssl->major_ver,ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,ssl->out_hdr + 1
            );
  *ssl->out_len = (uchar)((ushort)ilen >> 8);
  ssl->out_len[1] = (uchar)ilen;
  if (ssl->transform_out == (mbedtls_ssl_transform *)0x0) {
LAB_2305b3e0:
    _ilen = mbedtls_ssl_hdr_len();
    ssl->out_left = _ilen + ssl->out_msglen;
    pbVar8 = ssl->out_hdr;
    mbedtls_debug_print_msg
              (ssl,3,"file1",0xb30,"output record: msgtype = %d, version = [%d:%d], msglen = %d",
               (uint)*pbVar8,(uint)pbVar8[1],(uint)pbVar8[2]);
    _ilen = mbedtls_ssl_hdr_len();
    mbedtls_debug_print_buf
              (ssl,4,"file1",0xb33,"output record sent to network",ssl->out_hdr,
               ssl->out_msglen + _ilen);
    ret = mbedtls_ssl_flush_output(ssl);
    if (ret == 0) {
      mbedtls_debug_print_msg(ssl,2,"file1",0xb3c,"<= write record");
      return 0;
    }
    text = "mbedtls_ssl_flush_output";
    line = 0xb38;
    goto LAB_2305b256;
  }
  mbedtls_debug_print_msg(ssl,2,"file1",0x504,"=> encrypt buf");
  if ((ssl->session_out == (mbedtls_ssl_session *)0x0) ||
     (ssl->transform_out == (mbedtls_ssl_transform *)0x0)) {
    line = 0x508;
LAB_2305b000:
    mbedtls_debug_print_msg(ssl,1,"file1",line,"should never happen");
    ret = -0x6c00;
  }
  else {
    pmVar5 = (ssl->transform_out->cipher_ctx_enc).cipher_info;
    mVar2 = MBEDTLS_MODE_NONE;
    if (pmVar5 != (mbedtls_cipher_info_t *)0x0) {
      mVar2 = pmVar5->mode;
    }
    mbedtls_debug_print_buf
              (ssl,4,"file1",0x50f,"before encrypt: output payload",ssl->out_msg,ssl->out_msglen);
    if ((mVar2 == MBEDTLS_MODE_STREAM) || (line = 0, mVar2 == MBEDTLS_MODE_CBC)) {
      if (ssl->minor_ver < 1) {
        line = 0x536;
        goto LAB_2305b000;
      }
      mbedtls_md_hmac_update(&ssl->transform_out->md_ctx_enc,ssl->out_ctr,8);
      mbedtls_md_hmac_update(&ssl->transform_out->md_ctx_enc,ssl->out_hdr,3);
      mbedtls_md_hmac_update(&ssl->transform_out->md_ctx_enc,ssl->out_len,2);
      line = 1;
      mbedtls_md_hmac_update(&ssl->transform_out->md_ctx_enc,ssl->out_msg,ssl->out_msglen);
      mbedtls_md_hmac_finish(&ssl->transform_out->md_ctx_enc,ssl->out_msg + ssl->out_msglen);
      mbedtls_md_hmac_reset(&ssl->transform_out->md_ctx_enc);
      mbedtls_debug_print_buf
                (ssl,4,"file1",0x53c,"computed mac",ssl->out_msg + ssl->out_msglen,
                 ssl->transform_out->maclen);
      ssl->out_msglen = ssl->out_msglen + ssl->transform_out->maclen;
    }
    if ((mVar2 + ~MBEDTLS_MODE_CTR & 0xfd) != 0) {
      if (mVar2 != MBEDTLS_MODE_CBC) {
        line = 0x627;
        goto LAB_2305b000;
      }
      olen = 0;
      uVar7 = ssl->transform_out->ivlen;
      uVar9 = uVar7 - (ssl->out_msglen + 1) % uVar7;
      if (uVar7 == uVar9) {
        uVar9 = 0;
      }
      uVar7 = 0;
      do {
        ssl->out_msg[ssl->out_msglen + uVar7] = (uchar)uVar9;
        uVar7 = uVar7 + 1;
      } while (uVar7 <= uVar9);
      _ilen = ssl->out_msglen + 1 + uVar9;
      ssl->out_msglen = _ilen;
      if (1 < ssl->minor_ver) {
        ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,ssl->transform_out->iv_enc,
                                  ssl->transform_out->ivlen);
        if (ret == 0) {
          memcpy(ssl->out_iv,ssl->transform_out->iv_enc,ssl->transform_out->ivlen);
          _ilen = ssl->out_msglen;
          input = ssl->out_msg;
          ssl->out_msglen = ssl->transform_out->ivlen + _ilen;
          goto LAB_2305b304;
        }
        goto LAB_2305b246;
      }
      input = ssl->out_msg;
LAB_2305b304:
      mbedtls_debug_print_msg
                (ssl,3,"file1",0x5e3,
                 "before encrypt: msglen = %d, including %d bytes of IV and %d bytes of padding",
                 ssl->out_msglen,ssl->transform_out->ivlen,uVar9 + 1);
      pmVar6 = ssl->transform_out;
      ret = mbedtls_cipher_crypt
                      (&pmVar6->cipher_ctx_enc,pmVar6->iv_enc,pmVar6->ivlen,input,_ilen,input,&olen)
      ;
      if (ret != 0) {
        text = "mbedtls_cipher_crypt";
        line = 0x5eb;
        goto LAB_2305b23a;
      }
      if (_ilen == olen) goto LAB_2305b2a0;
      line = 0x5f1;
      goto LAB_2305b000;
    }
    _ilen = 8;
    if ((ssl->transform_out->ciphersuite_info->flags & 2) == 0) {
      _ilen = 0x10;
    }
    memcpy(&olen,ssl->out_ctr,8);
    add_data[4] = (uchar)ssl->out_msgtype;
    mbedtls_ssl_write_version
              (ssl->major_ver,ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,add_data + 5);
    add_data[7] = (uchar)(ssl->out_msglen >> 8);
    add_data[8] = (uchar)ssl->out_msglen;
    mbedtls_debug_print_buf(ssl,4,"file1",0x575,"additional data used for AEAD",(uchar *)&olen,0xd);
    pmVar6 = ssl->transform_out;
    if (pmVar6->ivlen - 8 != pmVar6->fixed_ivlen) {
      line = 0x57d;
      goto LAB_2305b000;
    }
    memcpy(pmVar6->iv_enc + pmVar6->fixed_ivlen,ssl->out_ctr,8);
    memcpy(ssl->out_iv,ssl->out_ctr,8);
    mbedtls_debug_print_buf
              (ssl,4,"file1",0x586,"IV used",ssl->out_iv,
               ssl->transform_out->ivlen - ssl->transform_out->fixed_ivlen);
    ilen_00 = ssl->out_msglen;
    input = ssl->out_msg;
    ssl->out_msglen = (ssl->transform_out->ivlen + ilen_00) - ssl->transform_out->fixed_ivlen;
    mbedtls_debug_print_msg
              (ssl,3,"file1",0x592,"before encrypt: msglen = %d, including %d bytes of padding",0);
    pmVar6 = ssl->transform_out;
    ret = mbedtls_cipher_auth_encrypt
                    (&pmVar6->cipher_ctx_enc,pmVar6->iv_enc,pmVar6->ivlen,(uchar *)&olen,0xd,input,
                     ilen_00,input,in_fa0,in_fa1,in_fa2);
    if (ret == 0) {
      if (ilen_00 != sStack52) {
        line = 0x5a5;
        goto LAB_2305b000;
      }
      ssl->out_msglen = ssl->out_msglen + _ilen;
      line = line + 1;
      mbedtls_debug_print_buf(ssl,4,"file1",0x5ac,"after encrypt: tag",input + ilen_00,_ilen);
LAB_2305b2a0:
      if (line == 1) {
        mbedtls_debug_print_msg(ssl,2,"file1",0x632,"<= encrypt buf");
        _ilen = ssl->out_msglen;
        *ssl->out_len = (uchar)(_ilen >> 8);
        ssl->out_len[1] = (uchar)_ilen;
        goto LAB_2305b3e0;
      }
      line = 0x62e;
      goto LAB_2305b000;
    }
    text = "mbedtls_cipher_auth_encrypt";
    line = 0x59f;
LAB_2305b23a:
    mbedtls_debug_print_ret(ssl,1,"file1",line,text,ret);
  }
LAB_2305b246:
  text = "ssl_encrypt_buf";
  line = 0xb22;
LAB_2305b256:
  mbedtls_debug_print_ret(ssl,1,"file1",line,text,ret);
  return ret;
}



int mbedtls_ssl_resend(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_flight_item *pmVar1;
  int ret;
  mbedtls_ssl_handshake_params *pmVar2;
  
