pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mbedtls_debug_print_msg(ssl,2,"file1",0xa39,"=> mbedtls_ssl_resend");
  if (ssl->handshake->retransmit_state != '\x01') {
    mbedtls_debug_print_msg(ssl,2,"file1",0xa3d,"initialise resending");
    ssl->handshake->cur_msg = ssl->handshake->flight;
    ssl_swap_epochs(ssl);
    ssl->handshake->retransmit_state = '\x01';
  }
  do {
    pmVar2 = ssl->handshake;
    pmVar1 = pmVar2->cur_msg;
    if (pmVar1 == (mbedtls_ssl_flight_item *)0x0) {
      if (ssl->state == 0x10) {
        pmVar2->retransmit_state = '\x03';
      }
      else {
        pmVar2->retransmit_state = '\x02';
        ssl_set_timer(ssl,ssl->handshake->retransmit_timeout);
      }
      mbedtls_debug_print_msg(ssl,2,"file1",0xa6a,"<= mbedtls_ssl_resend");
      return 0;
    }
    if ((pmVar1->type == '\x16') && (*pmVar1->p == '\x14')) {
      ssl_swap_epochs(ssl);
    }
    memcpy(ssl->out_msg,pmVar1->p,pmVar1->len);
    ssl->out_msglen = pmVar1->len;
    ssl->out_msgtype = (uint)pmVar1->type;
    ssl->handshake->cur_msg = pmVar1->next;
    mbedtls_debug_print_buf(ssl,3,"file1",0xa59,"resent handshake message header",ssl->out_msg,0xc);
    ret = mbedtls_ssl_write_record(ssl);
  } while (ret == 0);
  mbedtls_debug_print_ret(ssl,1,"file1",0xa5d,"mbedtls_ssl_write_record",ret);
  return ret;
}



// WARNING: Exceeded maximum restarts with more pending

int mbedtls_ssl_fetch_input(mbedtls_ssl_context *ssl,size_t nb_want)

{
  void *pvVar1;
  int iVar2;
  int ret;
  uint uVar3;
  char *format;
  size_t ret_00;
  uint uVar4;
  uint uVar5;
  uint32_t uVar6;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x8ba,"=> fetch input");
  if ((ssl->f_recv == (mbedtls_ssl_recv_t *)0x0) &&
     (ssl->f_recv_timeout == (mbedtls_ssl_recv_timeout_t_conflict1 *)0x0)) {
    format = "Bad usage of mbedtls_ssl_set_bio() or mbedtls_ssl_set_bio()";
    ret = 0x8bf;
LAB_2305b62c:
    mbedtls_debug_print_msg(ssl,1,"file1",ret,format);
    return -0x7100;
  }
  if (0x413dU - (int)(ssl->in_hdr + -(int)ssl->in_buf) < nb_want) {
    format = "requesting more data than fits";
    ret = 0x8c5;
    goto LAB_2305b62c;
  }
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
    mbedtls_debug_print_msg(ssl,2,"file1",0x958,"in_left: %d, nb_want: %d",ssl->in_left,nb_want);
    while (uVar5 = ssl->in_left, uVar5 < nb_want) {
      iVar2 = ssl_check_timer(ssl);
      ret = -0x6800;
      if (iVar2 == 0) {
        if (ssl->f_recv_timeout == (mbedtls_ssl_recv_timeout_t_conflict1 *)0x0) {
          ret = (*ssl->f_recv)(ssl->f_recv);
        }
        else {
          ret = (*ssl->f_recv_timeout)
                          (ssl->p_bio,ssl->in_hdr + ssl->in_left,nb_want - uVar5,
                           ssl->conf->read_timeout);
        }
      }
      mbedtls_debug_print_msg(ssl,2,"file1",0x970,"in_left: %d, nb_want: %d",ssl->in_left,nb_want);
      mbedtls_debug_print_ret(ssl,2,"file1",0x971,"ssl->f_recv(_timeout)",ret);
      if (ret == 0) {
        return -0x7280;
      }
      if (ret < 0) {
        return ret;
      }
      ssl->in_left = ret + ssl->in_left;
    }
  }
  else {
    if ((ssl->f_set_timer == (mbedtls_ssl_set_timer_t_conflict1 *)0x0) ||
       (ssl->f_get_timer == (mbedtls_ssl_get_timer_t *)0x0)) {
      format = "You must use mbedtls_ssl_set_timer_cb() for DTLS";
      ret = 0x8d2;
      goto LAB_2305b62c;
    }
    uVar5 = ssl->next_record_offset;
    if (uVar5 != 0) {
      if (ssl->in_left < uVar5) {
        ret = 0x8e4;
        goto LAB_2305b6ba;
      }
      ret_00 = ssl->in_left - uVar5;
      ssl->in_left = ret_00;
      if (ret_00 != 0) {
        mbedtls_debug_print_msg(ssl,2,"file1",0x8ed,"next record in same datagram, offset: %d");
        memmove(ssl->in_hdr,ssl->in_hdr + ssl->next_record_offset,ssl->in_left);
      }
      ssl->next_record_offset = 0;
    }
    mbedtls_debug_print_msg(ssl,2,"file1",0x8f7,"in_left: %d, nb_want: %d",ssl->in_left,nb_want);
    if (nb_want <= ssl->in_left) {
      ret = 0x8fe;
      goto LAB_2305b72e;
    }
    if (ssl->in_left != 0) {
      ret = 0x909;
LAB_2305b6ba:
      mbedtls_debug_print_msg(ssl,1,"file1",ret,"should never happen");
      return -0x6c00;
    }
    ret = ssl_check_timer(ssl);
    if (ret != 0) {
LAB_2305b756:
      mbedtls_debug_print_msg(ssl,2,"file1",0x92d,"timeout");
      ssl_set_timer(ssl,0);
      if (ssl->state != 0x10) {
        uVar3 = ssl->handshake->retransmit_timeout;
        uVar5 = ssl->conf->hs_timeout_max;
        if (uVar3 < uVar5) {
          uVar4 = uVar3 << 1;
          if ((uVar3 <= uVar4) && (uVar4 < uVar5)) {
            uVar5 = uVar4;
          }
          ssl->handshake->retransmit_timeout = uVar5;
          mbedtls_debug_print_msg
                    (ssl,3,"file1",0x7e,"update timeout value to %d millisecs",
                     ssl->handshake->retransmit_timeout);
          ret = mbedtls_ssl_resend(ssl);
          if (ret == 0) {
            return -0x6900;
          }
          mbedtls_debug_print_ret(ssl,1,"file1",0x93a,"mbedtls_ssl_resend",ret);
          return ret;
        }
        mbedtls_debug_print_msg(ssl,1,"file1",0x934,"handshake timeout");
      }
      return -0x6800;
    }
    pvVar1 = (void *)(0x413d - (int)(ssl->in_hdr + -(int)ssl->in_buf));
    if (ssl->state == 0x10) {
      uVar6 = ssl->conf->read_timeout;
    }
    else {
      uVar6 = ssl->handshake->retransmit_timeout;
    }
    mbedtls_debug_print_msg(ssl,3,"file1",0x91d,"f_recv_timeout: %u ms",uVar6);
    if (ssl->f_recv_timeout == (mbedtls_ssl_recv_timeout_t_conflict1 *)0x0) {
      ret_00 = (*ssl->f_recv)(pvVar1,(uchar *)ssl->f_recv);
    }
    else {
      ret_00 = (*ssl->f_recv_timeout)(ssl->p_bio,ssl->in_hdr,(size_t)pvVar1,uVar6);
    }
    mbedtls_debug_print_ret(ssl,2,"file1",0x925,"ssl->f_recv(_timeout)",ret_00);
    if (ret_00 == 0) {
      return -0x7280;
    }
    if (ret_00 == 0xffff9800) goto LAB_2305b756;
    if ((int)ret_00 < 0) {
      return ret_00;
    }
    ssl->in_left = ret_00;
  }
  ret = 0x97d;
LAB_2305b72e:
  mbedtls_debug_print_msg(ssl,2,"file1",ret,"<= fetch input");
  return 0;
}



int mbedtls_ssl_prepare_handshake_record(mbedtls_ssl_context *ssl)

{
  byte bVar1;
  uint uVar2;
  uchar *__s1;
  int line;
  size_t __n;
  uint uVar3;
  mbedtls_ssl_handshake_params *pmVar4;
  uint __n_00;
  int line_00;
  uint uVar5;
  byte *pbVar6;
  char *format;
  uint uVar7;
  size_t size;
  uint uVar8;
  uint uVar9;
  size_t sVar10;
  uchar *puVar11;
  uint uVar12;
  uchar *puVar13;
  
  uVar3 = 0xc;
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
    uVar3 = 4;
  }
  if (ssl->in_msglen < uVar3) {
    mbedtls_debug_print_msg(ssl,1,"file1",0xc20,"handshake message too short: %d");
    return -0x7200;
  }
  pbVar6 = ssl->in_msg;
  ssl->in_hslen = ((uint)pbVar6[1] << 0x10 | (uint)pbVar6[2] << 8 | (uint)pbVar6[3]) + uVar3;
  mbedtls_debug_print_msg
            (ssl,3,"file1",0xc2b,"handshake message: msglen = %d, type = %d, hslen = %d",
             (uint)*pbVar6);
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
    if (ssl->in_hslen <= ssl->in_msglen) {
      return 0;
    }
    mbedtls_debug_print_msg(ssl,1,"file1",0xc69,"TLS handshake fragmentation not supported");
    return -0x7080;
  }
  pmVar4 = ssl->handshake;
  __s1 = ssl->in_msg;
  if (pmVar4 != (mbedtls_ssl_handshake_params *)0x0) {
    uVar3 = (uint)(*(ushort *)(__s1 + 4) >> 8) | ((uint)*(ushort *)(__s1 + 4) & 0xff) << 8;
    if (pmVar4->in_msg_seq != uVar3) {
      __n_00 = pmVar4->in_flight_start_seq - 1;
      if ((__n_00 != uVar3) || (*__s1 == '\x03')) {
        mbedtls_debug_print_msg
                  (ssl,2,"file1",0xc4d,
                   "dropping out-of-sequence message: message_seq = %d, expected = %d",
                   pmVar4->in_msg_seq);
        return -0x6900;
      }
      mbedtls_debug_print_msg
                (ssl,2,"file1",0xc40,
                 "received message from last flight, message_seq = %d, start_of_flight = %d",__n_00)
      ;
      line = mbedtls_ssl_resend(ssl);
      if (line == 0) {
        return -0x6900;
      }
      format = "mbedtls_ssl_resend";
      line_00 = 0xc44;
      goto LAB_2305ba60;
    }
  }
  if (((ssl->in_hslen <= ssl->in_msglen) && (line = memcmp(__s1 + 6,&DAT_23088e44,3), line == 0)) &&
     (line = memcmp(ssl->in_msg + 9,ssl->in_msg + 1,3), line == 0)) {
    if (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0) {
      return 0;
    }
    if (ssl->handshake->hs_msg == (uchar *)0x0) {
      return 0;
    }
  }
  mbedtls_debug_print_msg(ssl,2,"file1",0xc5b,"found fragmented DTLS handshake message");
  sVar10 = ssl->in_hslen;
  uVar3 = sVar10 - 0xc;
  if (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0) {
    format = "not supported outside handshake (for now)";
    line = 0xb8f;
LAB_2305bace:
    mbedtls_debug_print_msg(ssl,1,"file1",line,format);
    line = -0x7080;
  }
  else {
    __s1 = ssl->handshake->hs_msg;
    if (__s1 != (uchar *)0x0) {
      line = memcmp(__s1,ssl->in_msg,4);
      if (line == 0) goto LAB_2305bbca;
      mbedtls_debug_print_msg(ssl,1,"file1",0xbb9,"fragment header mismatch");
      goto LAB_2305bc4c;
    }
    mbedtls_debug_print_msg(ssl,2,"file1",0xb9b,"initialize reassembly, total length = %d",uVar3);
    if (0x4000 < ssl->in_hslen) {
      format = "handshake message too large";
      line = 0xb9f;
      goto LAB_2305bace;
    }
    size = (uint)((uVar3 & 7) != 0) + (uVar3 >> 3) + sVar10;
    pmVar4 = ssl->handshake;
    __s1 = (uchar *)mycalloc(1,size);
    pmVar4->hs_msg = __s1;
    __s1 = ssl->handshake->hs_msg;
    if (__s1 == (uchar *)0x0) {
      mbedtls_debug_print_msg(ssl,1,"file1",0xba9,"alloc failed (%d bytes)",size);
      line = -0x7f00;
      goto LAB_2305bae0;
    }
    memcpy(__s1,ssl->in_msg,6);
    memset(ssl->handshake->hs_msg + 6,0,3);
    __s1 = ssl->handshake->hs_msg;
    memcpy(__s1 + 9,__s1 + 1,3);
LAB_2305bbca:
    puVar13 = ssl->handshake->hs_msg;
    __s1 = ssl->in_msg;
    puVar11 = puVar13 + sVar10;
    bVar1 = __s1[8];
    uVar9 = (uint)__s1[6] << 0x10 | (uint)__s1[7] << 8 | (uint)bVar1;
    __n_00 = (uint)__s1[9] << 0x10 | (uint)__s1[10] << 8 | (uint)__s1[0xb];
    if (uVar3 < uVar9 + __n_00) {
      mbedtls_debug_print_msg
                (ssl,1,"file1",0xbce,"invalid fragment offset/len: %d + %d > %d",uVar9,__n_00,uVar3)
      ;
    }
    else {
      uVar12 = __n_00 + 0xc;
      if (uVar12 <= ssl->in_msglen) {
        mbedtls_debug_print_msg
                  (ssl,2,"file1",0xbda,"adding fragment, offset = %d, length = %d",uVar9,__n_00);
        memcpy(puVar13 + uVar9 + 0xc,ssl->in_msg + 0xc,__n_00);
        uVar5 = (uint)bVar1 & 7;
        uVar8 = 8 - uVar5;
        if (uVar8 == 8) {
LAB_2305bd4a:
          uVar5 = __n_00 & 7;
          if (uVar5 != 0) {
            uVar7 = __n_00 + uVar9;
            uVar8 = (uint)puVar11[uVar7 >> 3];
            __n_00 = __n_00 - uVar5;
            uVar5 = 8 - uVar5;
            do {
              uVar2 = uVar5 & 0x1f;
              uVar5 = uVar5 + 1;
              uVar8 = uVar8 | 1 << uVar2 & 0xffU;
            } while (uVar5 != 8);
            puVar11[uVar7 >> 3] = (byte)uVar8;
          }
          memset(puVar11 + (uVar9 >> 3),0xff,__n_00 >> 3);
        }
        else {
          uVar7 = uVar9 >> 3;
          if (uVar8 < __n_00) {
            __n_00 = (__n_00 - 8) + uVar5;
            uVar5 = (uint)puVar11[uVar7];
            uVar9 = uVar9 + uVar8;
            do {
              uVar8 = uVar8 - 1;
              uVar5 = uVar5 | 1 << (uVar8 & 0x1f) & 0xffU;
            } while (uVar8 != 0);
            puVar11[uVar7] = (byte)uVar5;
            goto LAB_2305bd4a;
          }
          __n_00 = uVar8 - __n_00;
          while (__n_00 != uVar8) {
            uVar9 = __n_00 & 0x1f;
            __n_00 = __n_00 + 1;
            puVar11[uVar7] = (byte)(1 << uVar9) | puVar11[uVar7];
          }
        }
        __n_00 = 0;
        while (__n_00 != uVar3 >> 3) {
          if (puVar11[__n_00] != -1) goto LAB_2305be72;
          __n_00 = __n_00 + 1;
        }
        uVar9 = 0;
        while (uVar9 < (uVar3 & 7)) {
          if (((int)(uint)puVar11[__n_00] >> (7 - uVar9 & 0x1f) & 1U) == 0) goto LAB_2305be72;
          uVar9 = uVar9 + 1;
        }
        mbedtls_debug_print_msg(ssl,2,"file1",0xbe9,"handshake message completed");
        if (ssl->in_msglen <= uVar12) {
          uVar3 = ssl->next_record_offset;
          if (ssl->in_left <= uVar3) {
LAB_2305be0a:
            memcpy(ssl->in_msg,ssl->handshake->hs_msg,ssl->in_hslen);
            vPortFree(ssl->handshake->hs_msg);
            ssl->handshake->hs_msg = (uchar *)0x0;
            mbedtls_debug_print_buf
                      (ssl,3,"file1",0xc15,"reassembled handshake message",ssl->in_msg,ssl->in_hslen
                      );
            return 0;
          }
          puVar13 = ssl->in_hdr;
          __n = ssl->in_left - uVar3;
          __s1 = ssl->in_msg + ssl->in_hslen;
          puVar11 = __s1 + -(int)puVar13;
          *(uchar **)&ssl->next_record_offset = puVar11;
          *(uchar **)&ssl->in_left = puVar11 + __n;
          if (puVar11 + __n <= (uchar *)(0x413d - (int)(puVar13 + -(int)ssl->in_buf))) {
            memmove(__s1,puVar13 + uVar3,__n);
            goto LAB_2305be0a;
          }
          mbedtls_debug_print_msg(ssl,1,"file1",0xc08,"reassembled message too large for buffer");
          line = -0x6a00;
          goto LAB_2305bae0;
        }
        format = "last fragment not alone in its record";
        line = 0xbf2;
        goto LAB_2305bace;
      }
      mbedtls_debug_print_msg(ssl,1,"file1",0xbd5,"invalid fragment length: %d + 12 > %d",__n_00);
    }
LAB_2305bc4c:
    line = -0x7200;
  }
LAB_2305bae0:
  format = "ssl_reassemble_dtls_handshake";
  line_00 = 0xc5f;
LAB_2305ba60:
  mbedtls_debug_print_ret(ssl,1,"file1",line_00,format,line);
  return line;
LAB_2305be72:
  mbedtls_debug_print_msg(ssl,2,"file1",0xbe5,"message is not complete yet");
  line = -0x6900;
  goto LAB_2305bae0;
}



