pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_ssl_handle_message_type(mbedtls_ssl_context *ssl)

{
  int iVar1;
  uchar *puVar2;
  
  if ((ssl->in_msgtype == 0x16) && (iVar1 = mbedtls_ssl_prepare_handshake_record(ssl), iVar1 != 0))
  {
    return iVar1;
  }
  if (ssl->in_msgtype == 0x15) {
    mbedtls_debug_print_msg
              (ssl,2,"file1",0xf93,"got an alert message, type: [%d:%d]",(uint)*ssl->in_msg,
               (uint)ssl->in_msg[1]);
    puVar2 = ssl->in_msg;
    if (*puVar2 == '\x02') {
      mbedtls_debug_print_msg
                (ssl,1,"file1",0xf9b,"is a fatal alert message (msg %d)",(uint)puVar2[1]);
      return -0x7780;
    }
    if (*puVar2 == '\x01') {
      if (puVar2[1] == '\0') {
        mbedtls_debug_print_msg(ssl,2,"file1",0xfa2,"is a close notify message");
        return -0x7880;
      }
      if (puVar2[1] == 'd') {
        mbedtls_debug_print_msg(ssl,2,"file1",0xfaa,"is a SSLv3 no_cert");
        goto LAB_2305beb0;
      }
    }
    iVar1 = -0x6680;
  }
  else {
LAB_2305beb0:
    iVar1 = 0;
  }
  return iVar1;
}



int mbedtls_ssl_send_alert_message(mbedtls_ssl_context *ssl,uchar level,uchar message)

{
  int ret;
  
  if ((ssl == (mbedtls_ssl_context *)0x0) || (ssl->conf == (mbedtls_ssl_config *)0x0)) {
    ret = -0x7100;
  }
  else {
    mbedtls_debug_print_msg(ssl,2,"file1",0xfda,"=> send alert message");
    ssl->out_msgtype = 0x15;
    ssl->out_msglen = 2;
    *ssl->out_msg = level;
    ssl->out_msg[1] = message;
    ret = mbedtls_ssl_write_record(ssl);
    if (ret == 0) {
      mbedtls_debug_print_msg(ssl,2,"file1",0xfe7,"<= send alert message");
    }
    else {
      mbedtls_debug_print_ret(ssl,1,"file1",0xfe3,"mbedtls_ssl_write_record",ret);
    }
  }
  return ret;
}



int mbedtls_ssl_send_fatal_handshake_failure(mbedtls_ssl_context *ssl)

{
  int iVar1;
  
  iVar1 = mbedtls_ssl_send_alert_message(ssl,'\x02','(');
  return iVar1;
}



int mbedtls_ssl_close_notify(mbedtls_ssl_context *ssl)

{
  int ret;
  
  if ((ssl == (mbedtls_ssl_context *)0x0) || (ssl->conf == (mbedtls_ssl_config *)0x0)) {
    ret = -0x7100;
  }
  else {
    mbedtls_debug_print_msg(ssl,2,"file1",0x1b68,"=> write close notify");
    if (ssl->out_left != 0) {
      ret = mbedtls_ssl_flush_output(ssl);
      return ret;
    }
    if ((ssl->state == 0x10) && (ret = mbedtls_ssl_send_alert_message(ssl,'\x01','\0'), ret != 0)) {
      mbedtls_debug_print_ret(ssl,1,"file1",0x1b73,"mbedtls_ssl_send_alert_message",ret);
    }
    else {
      mbedtls_debug_print_msg(ssl,2,"file1",0x1b78,"<= write close notify");
      ret = 0;
    }
  }
  return ret;
}



int mbedtls_ssl_write_certificate(mbedtls_ssl_context *ssl)

{
  int ret;
  mbedtls_x509_crt *crt;
  size_t sVar1;
  uint __n;
  mbedtls_ssl_ciphersuite_t *pmVar2;
  
  pmVar2 = ssl->transform_negotiate->ciphersuite_info;
  mbedtls_debug_print_msg(ssl,2,"file1",0x1025,"=> write certificate");
  __n = (uint)pmVar2->key_exchange - 5;
  if (((__n & 0xff) < 7) && ((0x4bU >> (__n & 0x1f) & 1) != 0)) {
    mbedtls_debug_print_msg(ssl,2,"file1",0x102c,"<= skip write certificate");
    ret = 0;
    ssl->state = ssl->state + 1;
  }
  else {
    if ((*(ushort *)&ssl->conf->field_0x74 & 1) == 0) {
      if (ssl->client_auth == 0) {
        mbedtls_debug_print_msg(ssl,2,"file1",0x1036,"<= skip write certificate");
        ssl->state = ssl->state + 1;
        return 0;
      }
    }
    else {
      crt = mbedtls_ssl_own_cert(ssl);
      if (crt == (mbedtls_x509_crt *)0x0) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x1053,"got no certificate to send");
        return -0x7580;
      }
    }
    crt = mbedtls_ssl_own_cert(ssl);
    mbedtls_debug_print_crt(ssl,3,"file1",0x1059,"own certificate",crt);
    crt = mbedtls_ssl_own_cert(ssl);
    sVar1 = 7;
    while (crt != (mbedtls_x509_crt *)0x0) {
      __n = (crt->raw).len;
      if (0x3ffd - sVar1 < __n) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x106d,"certificate too large, %d > %d",0x4000);
        return -0x7500;
      }
      ssl->out_msg[sVar1] = (uchar)(__n >> 0x10);
      ssl->out_msg[sVar1 + 1] = (uchar)(__n >> 8);
      ssl->out_msg[sVar1 + 2] = (uchar)__n;
      memcpy(ssl->out_msg + sVar1 + 3,(crt->raw).p,__n);
      crt = crt->next;
      sVar1 = sVar1 + 3 + __n;
    }
    ret = sVar1 - 7;
    ssl->out_msg[4] = (uchar)((uint)ret >> 0x10);
    ssl->out_msg[5] = (uchar)((uint)ret >> 8);
    ssl->out_msg[6] = (uchar)ret;
    ssl->out_msgtype = 0x16;
    ssl->out_msglen = sVar1;
    *ssl->out_msg = '\v';
    ssl->state = ssl->state + 1;
    ret = mbedtls_ssl_write_record(ssl);
    if (ret == 0) {
      mbedtls_debug_print_msg(ssl,2,"file1",0x108d,"<= write certificate");
    }
    else {
      mbedtls_debug_print_ret(ssl,1,"file1",0x1089,"mbedtls_ssl_write_record",ret);
    }
  }
  return ret;
}



int mbedtls_ssl_write_change_cipher_spec(mbedtls_ssl_context *ssl)

{
  int ret;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x11b4,"=> write change cipher spec");
  ssl->out_msgtype = 0x14;
  ssl->out_msglen = 1;
  *ssl->out_msg = '\x01';
  ssl->state = ssl->state + 1;
  ret = mbedtls_ssl_write_record(ssl);
  if (ret == 0) {
    mbedtls_debug_print_msg(ssl,2,"file1",0x11c2,"<= write change cipher spec");
  }
  else {
    mbedtls_debug_print_ret(ssl,1,"file1",0x11be,"mbedtls_ssl_write_record",ret);
  }
  return ret;
}



int mbedtls_ssl_write_finished(mbedtls_ssl_context *ssl)

{
  uchar *puVar1;
  uchar uVar2;
  int ret;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x1408,"=> write finished");
  puVar1 = ssl->out_iv;
  if (1 < ssl->minor_ver) {
    puVar1 = puVar1 + (ssl->transform_negotiate->ivlen - ssl->transform_negotiate->fixed_ivlen);
  }
  ssl->out_msg = puVar1;
  (*ssl->handshake->calc_finished)(ssl,puVar1 + 4,*(uint *)&ssl->conf->field_0x74 & 1);
  ret = 0x24;
  if (ssl->minor_ver != 0) {
    ret = 0xc;
  }
  ssl->out_msglen = ret + 4;
  ssl->out_msgtype = 0x16;
  *ssl->out_msg = '\x14';
  if (ssl->handshake->resume == 0) {
    ret = ssl->state + 1;
  }
  else {
    if (((*(ushort *)&ssl->conf->field_0x74 & 1) == 0) &&
       (ssl->state = 0xf, (*(ushort *)&ssl->conf->field_0x74 & 1) == 0)) goto LAB_2305c40a;
    ret = 10;
  }
  ssl->state = ret;
LAB_2305c40a:
  mbedtls_debug_print_msg(ssl,3,"file1",0x143e,"switching to new transform spec for outbound data");
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
    memset(ssl->out_ctr,0,8);
  }
  else {
    ssl->handshake->alt_transform_out = ssl->transform_out;
    memcpy(ssl->handshake->alt_out_ctr,ssl->out_ctr,8);
    memset(ssl->out_ctr + 2,0,6);
    uVar2 = ssl->out_ctr[1] + '\x01';
    ssl->out_ctr[1] = uVar2;
    if ((uVar2 == '\0') && (uVar2 = *ssl->out_ctr + '\x01', *ssl->out_ctr = uVar2, uVar2 == '\0')) {
      mbedtls_debug_print_msg(ssl,1,"file1",0x1454,"DTLS epoch would wrap");
      return -0x6b80;
    }
  }
  ssl->transform_out = ssl->transform_negotiate;
  ssl->session_out = ssl->session_negotiate;
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
    mbedtls_ssl_send_flight_completed(ssl);
  }
  ret = mbedtls_ssl_write_record(ssl);
  if (ret == 0) {
    mbedtls_debug_print_msg(ssl,2,"file1",0x1475,"<= write finished");
  }
  else {
    mbedtls_debug_print_ret(ssl,1,"file1",0x1471,"mbedtls_ssl_write_record",ret);
  }
  return ret;
}



int mbedtls_ssl_write(mbedtls_ssl_context *ssl,uchar *buf,size_t len)

{
  size_t sVar1;
  int line;
  size_t sVar2;
  uint uVar3;
  char *text;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x1b3d,"=> write");
  if ((ssl == (mbedtls_ssl_context *)0x0) || (ssl->conf == (mbedtls_ssl_config *)0x0)) {
    return -0x7100;
  }
  if ((ssl->state != 0x10) && (line = mbedtls_ssl_handshake(ssl), line != 0)) {
    mbedtls_debug_print_ret(ssl,1,"file1",0x1b4e,"mbedtls_ssl_handshake",line);
    return line;
  }
  sVar2 = mbedtls_ssl_get_max_frag_len(ssl);
  sVar1 = len;
  if ((sVar2 < len) && (sVar1 = sVar2, (*(ushort *)&ssl->conf->field_0x74 & 2) != 0)) {
    text = "fragment larger than the (negotiated) maximum fragment length: %d > %d";
    line = 0x1ae7;
LAB_2305c5bc:
    mbedtls_debug_print_msg(ssl,1,"file1",line,text,len,sVar2);
    len = 0xffff8f00;
  }
  else {
    len = sVar1;
    if (ssl->out_left == 0) {
      sVar2 = 0x4130;
      if (0x4130 < len) {
        text = "input larger than the out msg maximum length: 0x%x > 0x%x";
        line = 0x1afe;
        goto LAB_2305c5bc;
      }
      ssl->out_msgtype = 0x17;
      ssl->out_msglen = len;
      memcpy(ssl->out_msg,buf,len);
      uVar3 = mbedtls_ssl_write_record(ssl);
      if (uVar3 == 0) goto LAB_2305c5ce;
      text = "mbedtls_ssl_write_record";
      line = 0x1b08;
      len = uVar3;
    }
    else {
      uVar3 = mbedtls_ssl_flush_output(ssl);
      if (uVar3 == 0) goto LAB_2305c5ce;
      text = "mbedtls_ssl_flush_output";
      line = 0x1af4;
      len = uVar3;
    }
    mbedtls_debug_print_ret(ssl,1,"file1",line,text,len);
  }
LAB_2305c5ce:
  mbedtls_debug_print_msg(ssl,2,"file1",0x1b59,"<= write");
  return len;
}



void mbedtls_ssl_read_version(int *major,int *minor,int transport,uchar *ver)

{
  uint uVar1;
  
