pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (transport == 1) {
    *major = 0x101 - (uint)*ver;
    uVar1 = 0x100 - (uint)ver[1];
    if (uVar1 == 1) {
      uVar1 = 2;
    }
  }
  else {
    *major = (uint)*ver;
    uVar1 = (uint)ver[1];
  }
  *minor = uVar1;
  return;
}



int mbedtls_ssl_read_record_layer(mbedtls_ssl_context *ssl)

{
  bool bVar1;
  size_t nb_want;
  size_t len;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  size_t __n;
  uint uVar5;
  int line;
  mbedtls_cipher_info_t *pmVar6;
  mbedtls_cipher_mode_t mVar7;
  byte bVar8;
  char *format;
  uchar uVar9;
  mbedtls_ssl_transform *pmVar10;
  byte *pbVar11;
  uint uVar12;
  uint uVar13;
  int line_00;
  uint ret;
  uchar *input;
  uint uVar14;
  size_t *in_fa0;
  uchar *in_fa1;
  size_t in_fa2;
  size_t sStack116;
  int major_ver;
  int minor_ver;
  uchar auStack103 [2];
  undefined uStack101;
  undefined uStack100;
  
  uVar4 = ssl->in_hslen;
  if ((uVar4 == 0) || (ssl->in_msglen <= uVar4)) {
    ssl->in_hslen = 0;
    while( true ) {
      nb_want = mbedtls_ssl_hdr_len();
      line_00 = mbedtls_ssl_fetch_input(ssl,nb_want);
      if (line_00 != 0) break;
      nb_want = mbedtls_ssl_hdr_len();
      mbedtls_debug_print_buf(ssl,4,"file1",0xdb1,"input record header",ssl->in_hdr,nb_want);
      ssl->in_msgtype = (uint)*ssl->in_hdr;
      ssl->in_msglen =
           (uint)(*(ushort *)ssl->in_len >> 8) | ((uint)*(ushort *)ssl->in_len & 0xff) << 8;
      mbedtls_ssl_read_version
                ((int *)&sStack116,&major_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,
                 ssl->in_hdr + 1);
      mbedtls_debug_print_msg
                (ssl,3,"file1",0xdba,"input record: msgtype = %d, version = [%d:%d], msglen = %d",
                 ssl->in_msgtype,sStack116,major_ver);
      line_00 = ssl->in_msgtype;
      if (line_00 - 0x14U < 4) {
        if (ssl->major_ver != sStack116) {
          format = "major version mismatch";
          line_00 = 0xdd1;
LAB_2305c86e:
          mbedtls_debug_print_msg(ssl,1,"file1",line_00,format);
          goto LAB_2305c81a;
        }
        if ((int)(uint)ssl->conf->max_minor_ver < major_ver) {
          format = "minor version mismatch";
          line_00 = 0xdd7;
          goto LAB_2305c86e;
        }
        uVar4 = ssl->in_msglen;
        if (0x413dU - (int)(ssl->in_msg + -(int)ssl->in_buf) < uVar4) {
          format = "bad message length";
          line_00 = 0xddf;
          goto LAB_2305c86e;
        }
        if (ssl->transform_in != (mbedtls_ssl_transform *)0x0) {
          ret = ssl->transform_in->minlen;
          if (uVar4 < ret) {
            format = "bad message length";
            line_00 = 0xdf1;
          }
          else {
            if ((ssl->minor_ver < 1) || (uVar4 <= ret + 0x4100)) goto LAB_2305c902;
            format = "bad message length";
            line_00 = 0xe06;
          }
          goto LAB_2305c86e;
        }
        if (0x3fff < uVar4 - 1) {
          format = "bad message length";
          line_00 = 0xde9;
          goto LAB_2305c86e;
        }
LAB_2305c902:
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
          if (line_00 == 0x14) {
            if ((ssl->state - 10U & 0xfffffffd) != 0) {
              format = "dropping unexpected ChangeCipherSpec";
              line_00 = 0xe1c;
              goto LAB_2305c948;
            }
LAB_2305c978:
            if ((((uint)*(ushort *)ssl->in_ctr & 0xff) << 8 | (uint)(*(ushort *)ssl->in_ctr >> 8))
                == (uint)ssl->in_epoch) goto LAB_2305c99c;
            mbedtls_debug_print_msg
                      (ssl,1,"file1",0xe33,"record from another epoch: expected %d, received %d");
          }
          else {
            if ((line_00 != 0x17) || (ssl->state == 0x10)) goto LAB_2305c978;
            format = "dropping unexpected ApplicationData";
            line_00 = 0xe2a;
LAB_2305c948:
            mbedtls_debug_print_msg(ssl,1,"file1",line_00,format);
          }
          line_00 = -0x6700;
          goto LAB_2305c820;
        }
LAB_2305c99c:
        nb_want = mbedtls_ssl_hdr_len();
        line_00 = mbedtls_ssl_fetch_input(ssl,nb_want + uVar4);
        if (line_00 != 0) {
          format = "mbedtls_ssl_fetch_input";
          line = 0xf11;
          goto LAB_2305c75a;
        }
        nb_want = ssl->in_msglen;
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
          ssl->in_left = 0;
        }
        else {
          len = mbedtls_ssl_hdr_len();
          ssl->next_record_offset = len + nb_want;
        }
        len = mbedtls_ssl_hdr_len();
        mbedtls_debug_print_buf
                  (ssl,4,"file1",0xe63,"input record from network",ssl->in_hdr,len + nb_want);
        if (ssl->transform_in == (mbedtls_ssl_transform *)0x0) {
LAB_2305d038:
          if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
            return 0;
          }
          if (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0) {
            return 0;
          }
          if (ssl->state != 0x10) {
            return 0;
          }
          if ((ssl->in_msgtype != 0x16) || (*ssl->in_msg != '\x14')) {
            ssl_handshake_wrapup_free_hs_transform(ssl);
            return 0;
          }
          mbedtls_debug_print_msg(ssl,2,"file1",0xf6d,"received retransmit of last flight");
          line_00 = mbedtls_ssl_resend(ssl);
          if (line_00 == 0) {
            return -0x6900;
          }
          format = "mbedtls_ssl_resend";
          line = 0xf71;
          goto LAB_2305c75a;
        }
        mbedtls_debug_print_msg(ssl,2,"file1",0x642,"=> decrypt buf");
        if ((ssl->session_in == (mbedtls_ssl_session *)0x0) ||
           (pmVar10 = ssl->transform_in, pmVar10 == (mbedtls_ssl_transform *)0x0)) {
          line_00 = 0x646;
LAB_2305ca46:
          mbedtls_debug_print_msg(ssl,1,"file1",line_00,"should never happen");
          ret = 0xffff9400;
LAB_2305ce16:
          mbedtls_debug_print_ret(ssl,1,"file1",0xe79,"ssl_decrypt_buf",ret);
        }
        else {
          pmVar6 = (pmVar10->cipher_ctx_dec).cipher_info;
          mVar7 = MBEDTLS_MODE_NONE;
          if (pmVar6 != (mbedtls_cipher_info_t *)0x0) {
            mVar7 = pmVar6->mode;
          }
          nb_want = ssl->in_msglen;
          if (nb_want < pmVar10->minlen) {
            format = "in_msglen (%d) < minlen (%d)";
            line_00 = 0x64f;
LAB_2305ca86:
            mbedtls_debug_print_msg(ssl,1,"file1",line_00,format,nb_want);
LAB_2305cbe4:
            ret = 0xffff8e80;
            goto LAB_2305ce16;
          }
          if ((mVar7 + ~MBEDTLS_MODE_CTR & 0xfd) != 0) {
            if (mVar7 == MBEDTLS_MODE_CBC) {
              major_ver = 0;
              ret = pmVar10->ivlen;
              uVar4 = ret;
              if (ssl->minor_ver < 2) {
                uVar4 = 0;
              }
              if ((nb_want < uVar4 + ret) || (nb_want < pmVar10->maclen + 1 + uVar4)) {
                format = "msglen (%d) < max( ivlen(%d), maclen (%d) + 1 ) ( + expl IV )";
                line_00 = 0x6d2;
                goto LAB_2305cacc;
              }
              uVar4 = nb_want % ret;
              if (uVar4 != 0) {
                format = "msglen (%d) %% ivlen (%d) != 0";
                line_00 = 0x70b;
                goto LAB_2305ca86;
              }
              input = ssl->in_msg;
              if (1 < ssl->minor_ver) {
                nb_want = nb_want - ret;
                ssl->in_msglen = nb_want;
                ret = 0;
                while (ret < ssl->transform_in->ivlen) {
                  ssl->transform_in->iv_dec[ret] = ssl->in_iv[ret];
                  ret = ret + 1;
                }
              }
              pmVar10 = ssl->transform_in;
              ret = mbedtls_cipher_crypt
                              (&pmVar10->cipher_ctx_dec,pmVar10->iv_dec,pmVar10->ivlen,input,nb_want
                               ,input,(size_t *)&major_ver);
              if (ret != 0) {
                mbedtls_debug_print_ret(ssl,1,"file1",0x723,"mbedtls_cipher_crypt",ret);
                goto LAB_2305ce16;
              }
              if (nb_want == major_ver) {
                uVar5 = ssl->in_msglen;
                nb_want = ssl->transform_in->maclen;
                uVar13 = (uint)ssl->in_msg[uVar5 - 1] + 1;
                bVar1 = uVar13 + nb_want <= uVar5;
                if (!bVar1) {
                  uVar13 = 0;
                }
                if (0 < ssl->minor_ver) {
                  uVar2 = (uVar5 - 1) - uVar13;
                  uVar12 = ((uint)(uVar5 < uVar13 + 1) ^ 1) & (uint)(uVar2 < nb_want + 0x4000) &
                           (uint)bVar1;
                  uVar14 = 1;
                  uVar3 = 1;
                  do {
                    uVar14 = uVar14 & ((uint)(uVar13 < uVar3) ^ 1);
                    line_00 = uVar2 * uVar12 + uVar3;
                    uVar3 = uVar3 + 1;
                    uVar4 = uVar4 + ((uint)ssl->in_msg[line_00] == uVar13 - 1) * uVar14;
                  } while (uVar3 != 0x101);
                  uVar12 = uVar13 == uVar4 & uVar12;
                  uVar13 = uVar12 * 0x1ff & uVar13;
                  ssl->in_msglen = uVar5 - uVar13;
                  goto LAB_2305cc06;
                }
                line_00 = 0x783;
              }
              else {
                line_00 = 0x729;
              }
            }
            else {
              line_00 = 0x78d;
            }
            goto LAB_2305ca46;
          }
          len = 8;
          if ((pmVar10->ciphersuite_info->flags & 2) == 0) {
            len = 0x10;
          }
          if (nb_want < (pmVar10->ivlen - pmVar10->fixed_ivlen) + len) {
            format = "msglen (%d) < explicit_iv_len (%d) + taglen (%d)";
            line_00 = 0x67f;
LAB_2305cacc:
            mbedtls_debug_print_msg(ssl,1,"file1",line_00,format,nb_want);
            goto LAB_2305cbe4;
          }
          nb_want = ((nb_want + pmVar10->fixed_ivlen) - pmVar10->ivlen) - len;
          ssl->in_msglen = nb_want;
          input = ssl->in_msg;
          memcpy(&major_ver,ssl->in_ctr,8);
          mbedtls_ssl_write_version
                    (ssl->major_ver,ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,
                     auStack103);
          uStack101 = (undefined)(ssl->in_msglen >> 8);
          uStack100 = (undefined)ssl->in_msglen;
          mbedtls_debug_print_buf
                    (ssl,4,"file1",0x690,"additional data used for AEAD",(uchar *)&major_ver,0xd);
          pmVar10 = ssl->transform_in;
          memcpy(pmVar10->iv_dec + pmVar10->fixed_ivlen,ssl->in_iv,
                 pmVar10->ivlen - pmVar10->fixed_ivlen);
          mbedtls_debug_print_buf
                    (ssl,4,"file1",0x697,"IV used",ssl->transform_in->iv_dec,
                     ssl->transform_in->ivlen);
          mbedtls_debug_print_buf(ssl,4,"file1",0x698,"TAG used",input + nb_want,len);
          pmVar10 = ssl->transform_in;
          ret = mbedtls_cipher_auth_decrypt
                          (&pmVar10->cipher_ctx_dec,pmVar10->iv_dec,pmVar10->ivlen,
                           (uchar *)&major_ver,0xd,input,nb_want,input,in_fa0,in_fa1,in_fa2);
          if (ret != 0) {
            mbedtls_debug_print_ret(ssl,1,"file1",0x6a5,"mbedtls_cipher_auth_decrypt",ret);
            if (ret == 0xffff9d00) goto LAB_2305cbe4;
            goto LAB_2305ce16;
          }
          if (nb_want != sStack116) {
            line_00 = 0x6b0;
            goto LAB_2305ca46;
          }
          uVar12 = 1;
          uVar13 = 0;
          ret = 1;
LAB_2305cc06:
          mbedtls_debug_print_buf
                    (ssl,4,"file1",0x792,"raw buffer after decryption",ssl->in_msg,ssl->in_msglen);
          if (ret == 0) {
            nb_want = ssl->in_msglen - ssl->transform_in->maclen;
            ssl->in_msglen = nb_want;
            *ssl->in_len = (uchar)(nb_want >> 8);
            ssl->in_len[1] = (uchar)ssl->in_msglen;
            memcpy(&major_ver,ssl->in_msg + ssl->in_msglen,ssl->transform_in->maclen);
            if (ssl->minor_ver < 1) {
              line_00 = 0x7d6;
              goto LAB_2305ca46;
            }
            uVar4 = ssl->in_msglen + 0x15;
            mbedtls_md_hmac_update(&ssl->transform_in->md_ctx_dec,ssl->in_ctr,8);
            mbedtls_md_hmac_update(&ssl->transform_in->md_ctx_dec,ssl->in_hdr,3);
            mbedtls_md_hmac_update(&ssl->transform_in->md_ctx_dec,ssl->in_len,2);
            mbedtls_md_hmac_update(&ssl->transform_in->md_ctx_dec,ssl->in_msg,ssl->in_msglen);
            mbedtls_md_hmac_finish(&ssl->transform_in->md_ctx_dec,ssl->in_msg + ssl->in_msglen);
            ret = 0;
            do {
              mbedtls_md_process(&ssl->transform_in->md_ctx_dec,ssl->in_msg);
              ret = ret + 1;
            } while (ret < (uVar12 * 0xff & (uVar13 + uVar4 >> 6) - (uVar4 >> 6)) + 1);
            mbedtls_md_hmac_reset(&ssl->transform_in->md_ctx_dec);
            mbedtls_debug_print_buf
                      (ssl,4,"file1",0x7da,"message  mac",(uchar *)&major_ver,
                       ssl->transform_in->maclen);
            mbedtls_debug_print_buf
                      (ssl,4,"file1",0x7dc,"computed mac",ssl->in_msg + ssl->in_msglen,
                       ssl->transform_in->maclen);
            bVar8 = 0;
            nb_want = 0;
            while (ssl->transform_in->maclen != nb_want) {
              line_00 = ssl->in_msglen + nb_want;
              pbVar11 = (byte *)((int)&major_ver + nb_want);
              nb_want = nb_want + 1;
              bVar8 = bVar8 | ssl->in_msg[line_00] ^ *pbVar11;
            }
            if ((bVar8 != 0) || (uVar12 == 0)) goto LAB_2305cbe4;
          }
          if (ssl->in_msglen == 0) {
            line_00 = ssl->nb_zero + 1;
            ssl->nb_zero = line_00;
            if (3 < line_00) {
              mbedtls_debug_print_msg
                        (ssl,1,"file1",0x802,
                         "received four consecutive empty messages, possible DoS attack");
              goto LAB_2305cbe4;
            }
          }
          else {
            ssl->nb_zero = 0;
          }
          uVar4 = 8;
          if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
            do {
              ret = uVar4;
              if (ret <= ((uint)*(ushort *)&ssl->conf->field_0x74 & 2)) break;
              uVar9 = ssl->in_ctr[ret - 1] + '\x01';
              ssl->in_ctr[ret - 1] = uVar9;
              uVar4 = ret - 1;
            } while (uVar9 == '\0');
            if (ret == ((uint)*(ushort *)&ssl->conf->field_0x74 & 2)) {
              mbedtls_debug_print_msg(ssl,1,"file1",0x818,"incoming message counter would wrap");
              ret = 0xffff9480;
              goto LAB_2305ce16;
            }
          }
          mbedtls_debug_print_msg(ssl,2,"file1",0x81d,"<= decrypt buf");
          mbedtls_debug_print_buf
                    (ssl,4,"file1",0xe7e,"input payload after decrypt",ssl->in_msg,ssl->in_msglen);
          if (ssl->in_msglen < 0x4001) goto LAB_2305d038;
          mbedtls_debug_print_msg(ssl,1,"file1",0xe82,"bad message length");
          ret = 0xffff8e00;
        }
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
          return ret;
        }
        if ((ret & 0xffffff7f) != 0xffff8e00) {
          return ret;
        }
        if ((ssl->state - 0xbU & 0xfffffffd) == 0) {
          return ret;
        }
        format = "discarding invalid record (mac)";
        line_00 = 0xf40;
      }
      else {
        mbedtls_debug_print_msg(ssl,1,"file1",0xdc2,"unknown record type");
        line_00 = mbedtls_ssl_send_alert_message(ssl,'\x02','\n');
        if (line_00 == 0) {
LAB_2305c81a:
          line_00 = -0x7200;
        }
LAB_2305c820:
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
          return line_00;
        }
        if (line_00 == -0x6780) {
          return -0x6780;
        }
        if (line_00 == -0x6700) {
          nb_want = mbedtls_ssl_hdr_len();
          format = "discarding unexpected record (header)";
          ssl->next_record_offset = nb_want + ssl->in_msglen;
          line_00 = 0xef8;
        }
        else {
          ssl->next_record_offset = 0;
          ssl->in_left = 0;
          format = "discarding invalid record (header)";
          line_00 = 0xf01;
        }
      }
      mbedtls_debug_print_msg(ssl,1,"file1",line_00,format);
    }
    format = "mbedtls_ssl_fetch_input";
    line = 0xee7;
LAB_2305c75a:
    mbedtls_debug_print_ret(ssl,1,"file1",line,format,line_00);
  }
  else {
    __n = ssl->in_msglen - uVar4;
    ssl->in_msglen = __n;
    line_00 = 0;
    memmove(ssl->in_msg,ssl->in_msg + uVar4,__n);
    mbedtls_debug_print_buf
              (ssl,4,"file1",0xed7,"remaining content in record",ssl->in_msg,ssl->in_msglen);
  }
  return line_00;
}



int mbedtls_ssl_read_record(mbedtls_ssl_context *ssl)

{
  int ret;
  int line;
  char *text;
  
