pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  mbedtls_debug_print_msg(ssl,2,"file1",0xeaa,"=> read record");
  do {
    ret = mbedtls_ssl_read_record_layer(ssl);
    if (ret != 0) {
      text = "mbedtls_ssl_read_record_layer";
      line = 0xeb0;
      goto LAB_2305d0fa;
    }
    ret = mbedtls_ssl_handle_message_type(ssl);
  } while (ret == -0x6680);
  if (ret == 0) {
    if (ssl->in_msgtype == 0x16) {
      mbedtls_ssl_update_handshake_status(ssl);
    }
    mbedtls_debug_print_msg(ssl,2,"file1",0xec3,"<= read record");
  }
  else {
    text = "mbedtls_ssl_handle_message_type";
    line = 0xeba;
LAB_2305d0fa:
    mbedtls_debug_print_ret(ssl,1,"file1",line,text,ret);
  }
  return ret;
}



int mbedtls_ssl_parse_certificate(mbedtls_ssl_context *ssl)

{
  mbedtls_key_exchange_type_t mVar1;
  ushort uVar2;
  uint uVar3;
  mbedtls_ssl_session *pmVar4;
  mbedtls_x509_crt *crt;
  mbedtls_x509_crl *ca_crl;
  int ret;
  int line;
  mbedtls_ssl_config *pmVar5;
  char *text;
  uchar *puVar6;
  uint uVar7;
  mbedtls_ssl_ciphersuite_t *ciphersuite;
  
  ciphersuite = ssl->transform_negotiate->ciphersuite_info;
  uVar3 = *(uint *)&ssl->conf->field_0x74;
  mbedtls_debug_print_msg(ssl,2,"file1",0x1099,"=> parse certificate");
  mVar1 = ciphersuite->key_exchange;
  uVar7 = (uint)mVar1 - 5;
  if (((uVar7 & 0xff) < 7) && ((0x4bU >> (uVar7 & 0x1f) & 1) != 0)) {
    ret = 0x10a0;
LAB_2305d1d0:
    mbedtls_debug_print_msg(ssl,2,"file1",ret,"<= skip parse certificate");
    ssl->state = ssl->state + 1;
    return 0;
  }
  uVar2 = *(ushort *)&ssl->conf->field_0x74;
  if (((uVar2 & 1) != 0) && (mVar1 == MBEDTLS_KEY_EXCHANGE_RSA_PSK)) {
    ret = 0x10a9;
    goto LAB_2305d1d0;
  }
  uVar7 = ssl->handshake->sni_authmode;
  if (uVar7 == 3) {
    uVar7 = uVar3 >> 2 & 3;
  }
  if (((uVar2 & 1) != 0) && (uVar7 == 0)) {
    ssl->session_negotiate->verify_result = 0x80;
    ret = 0x10b7;
    goto LAB_2305d1d0;
  }
  ret = mbedtls_ssl_read_record(ssl);
  if (ret != 0) {
    text = "mbedtls_ssl_read_record";
    line = 0x10bf;
    goto LAB_2305d262;
  }
  ssl->state = ssl->state + 1;
  uVar2 = *(ushort *)&ssl->conf->field_0x74;
  if (((uVar2 & 1) == 0) || (ssl->minor_ver == 0)) {
LAB_2305d314:
    if (ssl->in_msgtype != 0x16) {
LAB_2305d2a2:
      mbedtls_debug_print_msg(ssl,1,"file1",0x10f6,"bad certificate message");
      return -0x7700;
    }
  }
  else {
    ret = 4;
    if ((uVar2 & 2) != 0) {
      ret = 0xc;
    }
    if (ssl->in_hslen != ret + 3U) goto LAB_2305d314;
    if (ssl->in_msgtype != 0x16) goto LAB_2305d2a2;
    if (*ssl->in_msg == '\v') {
      ret = memcmp(ssl->in_msg + ret,&DAT_23088e44,3);
      if (ret == 0) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x10e7,"TLSv1 client has no certificate");
        ssl->session_negotiate->verify_result = 0x40;
        if (uVar7 == 1) {
          return 0;
        }
        return -0x7480;
      }
      goto LAB_2305d314;
    }
  }
  if (*ssl->in_msg == '\v') {
    ret = 4;
    if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
      ret = 0xc;
    }
    if (ret + 6U <= ssl->in_hslen) {
      puVar6 = ssl->in_msg + ret;
      if ((*puVar6 == '\0') &&
         (uVar3 = ret + 3, ssl->in_hslen == CONCAT11(puVar6[1],puVar6[2]) + uVar3)) {
        crt = ssl->session_negotiate->peer_cert;
        if (crt != (mbedtls_x509_crt *)0x0) {
          mbedtls_x509_crt_free(crt);
          vPortFree(ssl->session_negotiate->peer_cert);
        }
        pmVar4 = ssl->session_negotiate;
        crt = (mbedtls_x509_crt *)mycalloc(1,0x134);
        pmVar4->peer_cert = crt;
        if (crt == (mbedtls_x509_crt *)0x0) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x111a,"alloc(%d bytes) failed",0x134);
          return -0x7f00;
        }
        ret = 0;
        mbedtls_x509_crt_init(ssl->session_negotiate->peer_cert);
        do {
          if (ssl->in_hslen <= uVar3) {
            mbedtls_debug_print_crt
                      (ssl,3,"file1",0x113f,"peer certificate",ssl->session_negotiate->peer_cert);
            if (uVar7 != 0) {
              pmVar5 = ssl->conf;
              crt = ssl->handshake->sni_ca_chain;
              if (crt == (mbedtls_x509_crt *)0x0) {
                crt = pmVar5->ca_chain;
                ca_crl = pmVar5->ca_crl;
                if (crt == (mbedtls_x509_crt *)0x0) {
                  mbedtls_debug_print_msg(ssl,1,"file1",0x116f,"got no CA chain");
                  return -0x7680;
                }
              }
              else {
                ca_crl = ssl->handshake->sni_ca_crl;
              }
              ret = mbedtls_x509_crt_verify_with_profile
                              (ssl->session_negotiate->peer_cert,crt,ca_crl,pmVar5->cert_profile,
                               ssl->hostname,&ssl->session_negotiate->verify_result,
                               (anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *)
                               pmVar5->f_vrfy,pmVar5->p_vrfy);
              if (ret != 0) {
                mbedtls_debug_print_ret(ssl,1,"file1",0x1180,"x509_verify_cert",ret);
              }
              crt = ssl->session_negotiate->peer_cert;
              line = mbedtls_pk_can_do(&crt->pk,MBEDTLS_PK_ECKEY);
              if (((line != 0) &&
                  (line = mbedtls_ssl_check_curve(ssl,*(mbedtls_ecp_group_id *)(crt->pk).pk_ctx),
                  line != 0)) &&
                 (mbedtls_debug_print_msg(ssl,1,"file1",0x118f,"bad certificate (EC key curve)"),
                 ret == 0)) {
                ret = -0x7a00;
              }
              line = mbedtls_ssl_check_cert_usage
                               (ssl->session_negotiate->peer_cert,ciphersuite,
                                ~(uint)*(ushort *)&ssl->conf->field_0x74 & 1,
                                &ssl->session_negotiate->verify_result);
              if ((line != 0) &&
                 (mbedtls_debug_print_msg(ssl,1,"file1",0x119b,"bad certificate (usage extensions)")
                 , ret == 0)) {
                ret = -0x7a00;
              }
              if (uVar7 == 1) {
                ret = 0;
              }
            }
            mbedtls_debug_print_msg(ssl,2,"file1",0x11a4,"<= parse certificate");
            return ret;
          }
          puVar6 = ssl->in_msg + uVar3;
          if (*puVar6 != '\0') {
            ret = 0x1126;
            goto LAB_2305d350;
          }
          uVar2 = CONCAT11(puVar6[1],puVar6[2]);
          ret = uVar3 + 3;
          if ((uVar2 < 0x80) || (uVar3 = (uint)uVar2 + ret, ssl->in_hslen < uVar3)) {
            ret = 0x1130;
            goto LAB_2305d350;
          }
          ret = mbedtls_x509_crt_parse_der
                          (ssl->session_negotiate->peer_cert,ssl->in_msg + ret,(uint)uVar2);
        } while ((ret == 0) || (ret == -0x262e));
        text = " mbedtls_x509_crt_parse_der";
        line = 0x1138;
LAB_2305d262:
        mbedtls_debug_print_ret(ssl,1,"file1",line,text,ret);
        return ret;
      }
      ret = 0x110b;
      goto LAB_2305d350;
    }
  }
  ret = 0x10fd;
LAB_2305d350:
  mbedtls_debug_print_msg(ssl,1,"file1",ret,"bad certificate message");
  return -0x7a00;
}



int mbedtls_ssl_parse_change_cipher_spec(mbedtls_ssl_context *ssl)

{
  int ret;
  uint uVar1;
  uchar *puVar2;
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x11cb,"=> parse change cipher spec");
  ret = mbedtls_ssl_read_record(ssl);
  if (ret == 0) {
    if (ssl->in_msgtype == 0x14) {
      if ((ssl->in_msglen == 1) && (*ssl->in_msg == '\x01')) {
        mbedtls_debug_print_msg
                  (ssl,3,"file1",0x11e3,"switching to new transform spec for inbound data");
        ssl->transform_in = ssl->transform_negotiate;
        ssl->session_in = ssl->session_negotiate;
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
          memset(ssl->in_ctr,0,8);
        }
        else {
          uVar1 = (uint)ssl->in_epoch + 1;
          ssl->in_epoch = (uint16_t)(uVar1 * 0x10000 >> 0x10);
          if ((uVar1 & 0xffff) == 0) {
            mbedtls_debug_print_msg(ssl,1,"file1",0x11f1,"DTLS epoch would wrap");
            return -0x6b80;
          }
        }
        puVar2 = ssl->in_iv;
        if (1 < ssl->minor_ver) {
          puVar2 = puVar2 + (ssl->transform_negotiate->ivlen - ssl->transform_negotiate->fixed_ivlen
                            );
        }
        ssl->in_msg = puVar2;
        ssl->state = ssl->state + 1;
        mbedtls_debug_print_msg(ssl,2,"file1",0x1211,"<= parse change cipher spec");
      }
      else {
        mbedtls_debug_print_msg(ssl,1,"file1",0x11db,"bad change cipher spec message");
        ret = -0x7e00;
      }
    }
    else {
      mbedtls_debug_print_msg(ssl,1,"file1",0x11d5,"bad change cipher spec message");
      ret = -0x7700;
    }
  }
  else {
    mbedtls_debug_print_ret(ssl,1,"file1",0x11cf,"mbedtls_ssl_read_record",ret);
  }
  return ret;
}



