pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_ssl_parse_finished(mbedtls_ssl_context *ssl)

{
  byte *pbVar1;
  int line;
  int iVar2;
  byte bVar3;
  mbedtls_ssl_config *pmVar4;
  int iVar5;
  byte local_2c [4];
  uchar buf [12];
  
  mbedtls_debug_print_msg(ssl,2,"file1",0x1486,"=> parse finished");
  (*ssl->handshake->calc_finished)(ssl,local_2c,*(uint *)&ssl->conf->field_0x74 & 1 ^ 1);
  line = mbedtls_ssl_read_record(ssl);
  if (line != 0) {
    mbedtls_debug_print_ret(ssl,1,"file1",0x148c,"mbedtls_ssl_read_record",line);
    return line;
  }
  if (ssl->in_msgtype != 0x16) {
    mbedtls_debug_print_msg(ssl,1,"file1",0x1492,"bad finished message");
    return -0x7700;
  }
  if (*ssl->in_msg == '\x14') {
    pmVar4 = ssl->conf;
    line = 4;
    if ((*(ushort *)&pmVar4->field_0x74 & 2) != 0) {
      line = 0xc;
    }
    bVar3 = 0;
    iVar5 = 0;
    if (ssl->in_hslen == line + 0xcU) {
      do {
        iVar2 = line + iVar5;
        pbVar1 = local_2c + iVar5;
        iVar5 = iVar5 + 1;
        bVar3 = bVar3 | ssl->in_msg[iVar2] ^ *pbVar1;
      } while (iVar5 != 0xc);
      if (bVar3 == 0) {
        if (ssl->handshake->resume == 0) {
          line = ssl->state + 1;
        }
        else {
          if (((*(ushort *)&pmVar4->field_0x74 & 1) == 0) &&
             (ssl->state = 10, (*(ushort *)&pmVar4->field_0x74 & 1) == 0)) goto LAB_2305d838;
          line = 0xf;
        }
        ssl->state = line;
LAB_2305d838:
        if ((*(ushort *)&pmVar4->field_0x74 & 2) != 0) {
          mbedtls_ssl_recv_flight_completed(ssl);
        }
        mbedtls_debug_print_msg(ssl,2,"file1",0x14c4,"<= parse finished");
        return 0;
      }
      line = 0x14a8;
      goto LAB_2305d7d4;
    }
  }
  line = 0x14a1;
LAB_2305d7d4:
  mbedtls_debug_print_msg(ssl,1,"file1",line,"bad finished message");
  return -0x7e80;
}



int mbedtls_ssl_read(mbedtls_ssl_context *ssl,uchar *buf,size_t len)

{
  bool bVar1;
  uint __n;
  int ret;
  int line;
  char *text;
  size_t sVar2;
  uchar *puVar3;
  
  if ((ssl == (mbedtls_ssl_context *)0x0) || (ssl->conf == (mbedtls_ssl_config *)0x0)) {
    return -0x7100;
  }
  mbedtls_debug_print_msg(ssl,2,"file1",0x19e0,"=> read");
  if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
    ret = mbedtls_ssl_flush_output(ssl);
    if (ret != 0) {
      return ret;
    }
    if (((ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) &&
        (ssl->handshake->retransmit_state == '\x01')) && (ret = mbedtls_ssl_resend(ssl), ret != 0))
    {
      return ret;
    }
  }
  if (ssl->state == 0x10) {
LAB_2305d91a:
    bVar1 = false;
  }
  else {
    ret = mbedtls_ssl_handshake(ssl);
    if (ret != -0x6b00) {
      if (ret != 0) {
        text = "mbedtls_ssl_handshake";
        line = 0x1a02;
        goto LAB_2305d8d8;
      }
      goto LAB_2305d91a;
    }
    bVar1 = true;
  }
  if (ssl->in_offt != (uchar *)0x0) {
LAB_2305da00:
    __n = ssl->in_msglen;
    if (len < ssl->in_msglen) {
      __n = len;
    }
    memcpy(buf,ssl->in_offt,__n);
    puVar3 = (uchar *)0x0;
    sVar2 = ssl->in_msglen - __n;
    ssl->in_msglen = sVar2;
    if (sVar2 != 0) {
      puVar3 = ssl->in_offt + __n;
    }
    ssl->in_offt = puVar3;
    mbedtls_debug_print_msg(ssl,2,"file1",0x1ad0,"<= read");
    return __n;
  }
  if ((ssl->f_get_timer != (mbedtls_ssl_get_timer_t *)0x0) &&
     (ret = (*ssl->f_get_timer)(ssl->p_timer), ret == -1)) {
    ssl_set_timer(ssl,ssl->conf->read_timeout);
  }
  if ((bVar1) || (ret = mbedtls_ssl_read_record(ssl), ret == 0)) {
    if ((ssl->in_msglen != 0) ||
       ((ssl->in_msgtype != 0x17 || (ret = mbedtls_ssl_read_record(ssl), ret == 0)))) {
      if (ssl->in_msgtype == 0x15) {
        mbedtls_debug_print_msg(ssl,2,"file1",0x1aa0,"ignoring non-fatal non-closure alert");
        return -0x6900;
      }
      if (ssl->in_msgtype != 0x17) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x1aa6,"bad application data message");
        return -0x7700;
      }
      ssl->in_offt = ssl->in_msg;
      if (ssl->state == 0x10) {
        ssl_set_timer(ssl,0);
      }
      goto LAB_2305da00;
    }
    if (ret == -0x7280) {
      return 0;
    }
    text = "mbedtls_ssl_read_record";
    line = 0x1a27;
  }
  else {
    if (ret == -0x7280) {
      return 0;
    }
    text = "mbedtls_ssl_read_record";
    line = 0x1a17;
  }
LAB_2305d8d8:
  mbedtls_debug_print_ret(ssl,1,"file1",line,text,ret);
  return ret;
}



int mbedtls_ssl_set_calc_verify_md(mbedtls_ssl_context *ssl,int md)

{
  if ((ssl->minor_ver == 3) && (md == 4)) {
    ssl->handshake->calc_verify = ssl_calc_verify_tls_sha256;
    return 0;
  }
  return -0x6600;
}



void mbedtls_zeroize(void *v,size_t n)

{
  undefined *puVar1;
  
  puVar1 = (undefined *)(n + (int)v);
  while ((undefined *)v != puVar1) {
    *(undefined *)v = 0;
    v = (undefined *)v + 1;
  }
  return;
}



int x509_memcasecmp(void *s1,void *s2,size_t len)

{
  byte bVar1;
  size_t sVar2;
  
  sVar2 = 0;
  while( true ) {
    if (sVar2 == len) {
      return 0;
    }
    bVar1 = *(byte *)((int)s1 + sVar2);
    if ((bVar1 != *(byte *)((int)s2 + sVar2)) &&
       (((bVar1 ^ *(byte *)((int)s2 + sVar2)) != 0x20 || (0x19 < (byte)((bVar1 & 0xdf) + 0xbf)))))
    break;
    sVar2 = sVar2 + 1;
  }
  return -1;
}



int x509_name_cmp(mbedtls_x509_name *a,mbedtls_x509_name *b)

{
  int iVar1;
  size_t __n;
  size_t len;
  
  while( true ) {
    if (a == (mbedtls_x509_name *)0x0) {
      return -(uint)(b != (mbedtls_x509_name *)0x0);
    }
    if ((((((b == (mbedtls_x509_name *)0x0) || ((a->oid).tag != (b->oid).tag)) ||
          (__n = (a->oid).len, __n != (b->oid).len)) ||
         (iVar1 = memcmp((a->oid).p,(b->oid).p,__n), iVar1 != 0)) ||
        (((((a->val).tag != (b->val).tag || (__n = (a->val).len, __n != (b->val).len)) ||
          (iVar1 = memcmp((a->val).p,(b->val).p,__n), iVar1 != 0)) &&
         (((iVar1 = (a->val).tag, iVar1 != 0xc && (iVar1 != 0x13)) ||
          (((iVar1 = (b->val).tag, iVar1 != 0xc && (iVar1 != 0x13)) ||
           ((len = (a->val).len, len != (b->val).len ||
            (iVar1 = x509_memcasecmp((a->val).p,(b->val).p,len), iVar1 != 0)))))))))) ||
       (a->next_merged != b->next_merged)) break;
    a = (mbedtls_x509_name *)a->next;
    b = (mbedtls_x509_name *)b->next;
  }
  return -1;
}



