pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int x509_check_wildcard(char *cn,mbedtls_x509_buf *name)

{
  size_t sVar1;
  size_t sVar2;
  uchar *puVar3;
  int iVar4;
  
  sVar1 = strlen(cn);
  if (name->len < 3) {
    iVar4 = 0;
  }
  else {
    puVar3 = name->p;
    iVar4 = 0;
    if ((*puVar3 == '*') && (puVar3[1] == '.')) {
      sVar2 = 0;
      while (sVar2 != sVar1) {
        if (cn[sVar2] == '.') {
          if (sVar2 == 0) {
            return -1;
          }
          if (sVar1 - sVar2 != name->len - 1) {
            return -1;
          }
          iVar4 = x509_memcasecmp(puVar3 + 1,cn + sVar2,sVar1 - sVar2);
          return -(uint)(iVar4 != 0);
        }
        sVar2 = sVar2 + 1;
      }
      iVar4 = -1;
    }
  }
  return iVar4;
}



int x509_profile_check_key
              (mbedtls_x509_crt_profile *profile,mbedtls_pk_type_t pk_alg,mbedtls_pk_context *pk)

{
  bool bVar1;
  size_t sVar2;
  undefined3 in_register_0000202d;
  int iVar3;
  
  iVar3 = CONCAT31(in_register_0000202d,pk_alg);
  if ((iVar3 == 1) || (iVar3 == 6)) {
    sVar2 = mbedtls_pk_get_bitlen(pk);
    bVar1 = sVar2 < profile->rsa_min_bitlen;
  }
  else {
    if (2 < (iVar3 - 2U & 0xff)) {
      return -1;
    }
    bVar1 = (1 << ((uint)*(byte *)pk->pk_ctx - 1 & 0x1f) & profile->allowed_curves) == 0;
  }
  return -(uint)bVar1;
}



// WARNING: Variable defined which should be unmapped: key_size_str

int mbedtls_x509_crt_info(char *buf,size_t size,char *prefix,mbedtls_x509_crt *crt)

{
  byte bVar1;
  uint __maxlen;
  uchar *__s;
  uint uVar2;
  char *name;
  int iVar3;
  size_t sVar4;
  uint uVar5;
  uchar *puVar6;
  undefined *puVar7;
  uchar *puVar8;
  int iVar9;
  mbedtls_x509_sequence *oid;
  char *pcStack56;
  char *desc;
  char key_size_str [18];
  
  if (crt == (mbedtls_x509_crt *)0x0) {
    uVar2 = snprintf(buf,size,"\nCertificate is uninitialised!\n");
    if ((-1 < (int)uVar2) && (uVar2 < size)) {
      return uVar2;
    }
  }
  else {
    uVar2 = snprintf(buf,size,"%scert. version     : %d\r\n",prefix,crt->version);
    if ((-1 < (int)uVar2) && (uVar2 < size)) {
      __maxlen = size - uVar2;
      buf = buf + uVar2;
      uVar2 = snprintf(buf,__maxlen,"%sserial number     : ",prefix);
      if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
        __maxlen = __maxlen - uVar2;
        buf = buf + uVar2;
        uVar2 = mbedtls_x509_serial_gets(buf,__maxlen,&crt->serial);
        if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
          __maxlen = __maxlen - uVar2;
          buf = buf + uVar2;
          uVar2 = snprintf(buf,__maxlen,"\r\n%sissuer name       : ",prefix);
          if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
            __maxlen = __maxlen - uVar2;
            buf = buf + uVar2;
            uVar2 = mbedtls_x509_dn_gets(buf,__maxlen,&crt->issuer);
            if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
              __maxlen = __maxlen - uVar2;
              buf = buf + uVar2;
              uVar2 = snprintf(buf,__maxlen,"\r\n%ssubject name      : ",prefix);
              if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                __maxlen = __maxlen - uVar2;
                buf = buf + uVar2;
                uVar2 = mbedtls_x509_dn_gets(buf,__maxlen,&crt->subject);
                if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                  __maxlen = __maxlen - uVar2;
                  buf = buf + uVar2;
                  uVar2 = snprintf(buf,__maxlen,
                                   "\r\n%sissued  on        : %04d-%02d-%02d %02d:%02d:%02d",prefix,
                                   (crt->valid_from).year,(crt->valid_from).mon,
                                   (crt->valid_from).day,(crt->valid_from).hour);
                  if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                    __maxlen = __maxlen - uVar2;
                    buf = buf + uVar2;
                    uVar2 = snprintf(buf,__maxlen,
                                     "\r\n%sexpires on        : %04d-%02d-%02d %02d:%02d:%02d",
                                     prefix,(crt->valid_to).year,(crt->valid_to).mon,
                                     (crt->valid_to).day,(crt->valid_to).hour);
                    if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                      __maxlen = __maxlen - uVar2;
                      buf = buf + uVar2;
                      uVar2 = snprintf(buf,__maxlen,"\r\n%ssigned using      : ",prefix);
                      if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                        __maxlen = __maxlen - uVar2;
                        buf = buf + uVar2;
                        uVar2 = mbedtls_x509_sig_alg_gets
                                          (buf,__maxlen,&crt->sig_oid,crt->sig_pk,crt->sig_md,
                                           crt->sig_opts);
                        if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                          name = mbedtls_pk_get_name(&crt->pk);
                          iVar3 = mbedtls_x509_key_size_helper((char *)&desc,0x12,name);
                          if (iVar3 != 0) {
                            return iVar3;
                          }
                          sVar4 = mbedtls_pk_get_bitlen(&crt->pk);
                          __maxlen = __maxlen - uVar2;
                          uVar5 = snprintf(buf + uVar2,__maxlen,"\r\n%s%-18s: %d bits",prefix,&desc,
                                           sVar4);
                          if ((-1 < (int)uVar5) && (uVar5 < __maxlen)) {
                            __maxlen = __maxlen - uVar5;
                            __s = (uchar *)(buf + uVar2 + uVar5);
                            if ((crt->ext_types & 0x100U) != 0) {
                              if (crt->ca_istrue == 0) {
                                name = "false";
                              }
                              else {
                                name = "true";
                              }
                              uVar2 = snprintf((char *)__s,__maxlen,
                                               "\r\n%sbasic constraints : CA=%s",prefix,name);
                              if ((int)uVar2 < 0) {
                                return -0x2980;
                              }
                              if (__maxlen <= uVar2) {
                                return -0x2980;
                              }
                              __maxlen = __maxlen - uVar2;
                              __s = __s + uVar2;
                              if (0 < crt->max_pathlen) {
                                uVar2 = snprintf((char *)__s,__maxlen,", max_pathlen=%d",
                                                 crt->max_pathlen + -1);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                              }
                            }
                            if ((crt->ext_types & 0x20U) != 0) {
                              uVar2 = snprintf((char *)__s,__maxlen,"\r\n%ssubject alt name  : ",
                                               prefix);
                              if ((int)uVar2 < 0) {
                                return -0x2980;
                              }
                              if (__maxlen <= uVar2) {
                                return -0x2980;
                              }
                              __maxlen = __maxlen - uVar2;
                              __s = __s + uVar2;
                              oid = &crt->subject_alt_names;
                              iVar3 = 0;
                              puVar7 = &DAT_23088e60;
                              do {
                                uVar2 = (oid->buf).len + iVar3;
                                if (__maxlen <= uVar2) {
                                  *__s = '\0';
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                iVar9 = 0;
                                while (puVar6 = __s + iVar9, iVar9 != iVar3) {
                                  puVar8 = puVar7 + iVar9;
                                  iVar9 = iVar9 + 1;
                                  *puVar6 = *puVar8;
                                }
                                uVar2 = 0;
                                while (__s = puVar6 + uVar2, uVar2 < (oid->buf).len) {
                                  puVar8 = (oid->buf).p + uVar2;
                                  uVar2 = uVar2 + 1;
                                  *__s = *puVar8;
                                }
                                oid = (mbedtls_x509_sequence *)oid->next;
                                iVar3 = 2;
                                puVar7 = &DAT_23080648;
                              } while (oid != (mbedtls_x509_sequence *)0x0);
                              *__s = '\0';
                            }
                            if (crt->ext_types << 0xf < 0) {
                              uVar2 = snprintf((char *)__s,__maxlen,"\r\n%scert. type        : ",
                                               prefix);
                              if ((int)uVar2 < 0) {
                                return -0x2980;
                              }
                              if (__maxlen <= uVar2) {
                                return -0x2980;
                              }
                              bVar1 = crt->ns_cert_type;
                              __maxlen = __maxlen - uVar2;
                              __s = __s + uVar2;
                              puVar7 = &DAT_23088e60;
                              if ((char)bVar1 < '\0') {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sSSL Client",&DAT_23088e60);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 0x40) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sSSL Server",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 0x20) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sEmail",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 0x10) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sObject Signing",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 8) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sReserved",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 4) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sSSL CA",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 2) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sEmail CA",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((bVar1 & 1) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sObject Signing CA",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                              }
                            }
                            if ((crt->ext_types & 4U) != 0) {
                              uVar2 = snprintf((char *)__s,__maxlen,"\r\n%skey usage         : ",
                                               prefix);
                              if ((int)uVar2 < 0) {
                                return -0x2980;
                              }
                              if (__maxlen <= uVar2) {
                                return -0x2980;
                              }
                              uVar5 = crt->key_usage;
                              __maxlen = __maxlen - uVar2;
                              __s = __s + uVar2;
                              puVar7 = &DAT_23088e60;
                              if ((uVar5 & 0x80) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sDigital Signature",
                                                 &DAT_23088e60);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 0x40) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sNon Repudiation",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 0x20) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sKey Encipherment",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 0x10) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sData Encipherment",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 8) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sKey Agreement",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 4) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sKey Cert Sign",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 2) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sCRL Sign",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((uVar5 & 1) != 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sEncipher Only",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              }
                              if ((int)(uVar5 << 0x10) < 0) {
                                uVar2 = snprintf((char *)__s,__maxlen,"%sDecipher Only",puVar7);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                              }
                            }
                            if (crt->ext_types << 0x14 < 0) {
                              uVar2 = snprintf((char *)__s,__maxlen,"\r\n%sext key usage     : ",
                                               prefix);
                              if ((int)uVar2 < 0) {
                                return -0x2980;
                              }
                              if (__maxlen <= uVar2) {
                                return -0x2980;
                              }
                              __maxlen = __maxlen - uVar2;
                              __s = __s + uVar2;
                              oid = &crt->ext_key_usage;
                              puVar7 = &DAT_23088e60;
                              do {
                                iVar3 = mbedtls_oid_get_extended_key_usage
                                                  ((mbedtls_asn1_buf *)oid,&pcStack56);
                                if (iVar3 != 0) {
                                  pcStack56 = "???";
                                }
                                uVar2 = snprintf((char *)__s,__maxlen,"%s%s",puVar7,pcStack56);
                                if ((int)uVar2 < 0) {
                                  return -0x2980;
                                }
                                if (__maxlen <= uVar2) {
                                  return -0x2980;
                                }
                                oid = (mbedtls_x509_sequence *)oid->next;
                                __maxlen = __maxlen - uVar2;
                                __s = __s + uVar2;
                                puVar7 = &DAT_23080648;
                              } while (oid != (mbedtls_x509_sequence *)0x0);
                            }
                            uVar2 = snprintf((char *)__s,__maxlen,"\r\n");
                            if ((-1 < (int)uVar2) && (uVar2 < __maxlen)) {
                              return (uVar2 - __maxlen) + size;
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
