pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  }
  return -0x2980;
}



int mbedtls_x509_crt_verify_info(char *buf,size_t size,char *prefix,uint32_t flags)

{
  size_t __maxlen;
  uint uVar1;
  x509_crt_verify_string *pxVar2;
  
  pxVar2 = x509_crt_verify_strings;
  __maxlen = size;
  do {
    if (pxVar2->string == (char *)0x0) {
      if (flags != 0) {
        uVar1 = snprintf(buf,__maxlen,"%sUnknown reason (this should not happen)\n",prefix);
        if (((int)uVar1 < 0) || (__maxlen <= uVar1)) {
          return -0x2980;
        }
        __maxlen = __maxlen - uVar1;
      }
      return size - __maxlen;
    }
    if ((flags & pxVar2->code) != 0) {
      uVar1 = snprintf(buf,__maxlen,"%s%s\n",prefix);
      if ((int)uVar1 < 0) {
        return -0x2980;
      }
      if (__maxlen <= uVar1) {
        return -0x2980;
      }
      __maxlen = __maxlen - uVar1;
      buf = buf + uVar1;
      flags = flags ^ pxVar2->code;
    }
    pxVar2 = pxVar2 + 1;
  } while( true );
}



int mbedtls_x509_crt_check_key_usage(mbedtls_x509_crt *crt,uint usage)

{
  uint uVar1;
  
  uVar1 = crt->ext_types & 4;
  if ((uVar1 != 0) &&
     (((usage & 0xffff7ffe) != (usage & 0xffff7ffe & crt->key_usage) ||
      (uVar1 = 0, (usage & 0x8001) != ((usage | crt->key_usage) & 0x8001))))) {
    uVar1 = 0xffffd800;
  }
  return uVar1;
}



int x509_crt_check_parent(mbedtls_x509_crt *child,mbedtls_x509_crt *parent,int top,int bottom)

{
  int iVar1;
  int iVar2;
  size_t __n;
  
  iVar1 = x509_name_cmp(&child->issuer,&parent->subject);
  if (iVar1 == 0) {
    if (top != 0) {
      iVar1 = parent->version;
      if (((bottom != 0) && (__n = (child->raw).len, __n == (parent->raw).len)) &&
         (iVar2 = memcmp((child->raw).p,(parent->raw).p,__n), iVar2 == 0)) {
        return 0;
      }
      if (iVar1 < 3) {
        return 0;
      }
    }
    if (parent->ca_istrue != 0) {
      iVar1 = mbedtls_x509_crt_check_key_usage(parent,4);
      return -(uint)(iVar1 != 0);
    }
  }
  return -1;
}



int x509_crt_verify_top(mbedtls_x509_crt *child,mbedtls_x509_crt *trust_ca,
                       mbedtls_x509_crt_profile *profile,int path_cnt,int self_cnt,uint32_t *flags,
                       anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *f_vrfy,
                       void *p_vrfy)

{
  mbedtls_pk_type_t type;
  mbedtls_md_type_t md_alg;
  uchar uVar1;
  int iVar2;
  mbedtls_md_info_t *md_info;
  int iVar3;
  undefined3 extraout_var;
  void *options;
  mbedtls_x509_crt *pmVar4;
  uint32_t uStack100;
  uint32_t ca_flags;
  uchar hash [32];
  
  uStack100 = 0;
  iVar2 = mbedtls_x509_time_is_past(&child->valid_to);
  if (iVar2 != 0) {
    *flags = *flags | 1;
  }
  iVar2 = mbedtls_x509_time_is_future(&child->valid_from);
  if (iVar2 != 0) {
    *flags = *flags | 0x200;
  }
  if ((1 << ((uint)child->sig_md - 1 & 0x1f) & profile->allowed_mds) == 0) {
    *flags = *flags | 0x4000;
  }
  if ((1 << ((uint)child->sig_pk - 1 & 0x1f) & profile->allowed_pks) == 0) {
    *flags = *flags | 0x8000;
  }
  *flags = *flags | 8;
  md_info = mbedtls_md_info_from_type(child->sig_md);
  if (md_info == (mbedtls_md_info_t *)0x0) {
LAB_2305e504:
    if (f_vrfy == (anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *)0x0)
    goto LAB_2305e5fe;
  }
  else {
    pmVar4 = (mbedtls_x509_crt *)0x0;
    mbedtls_md(md_info,(child->tbs).p,(child->tbs).len,(uchar *)&ca_flags);
    while (trust_ca != (mbedtls_x509_crt *)0x0) {
      iVar2 = x509_crt_check_parent(child,trust_ca,1,(uint)(path_cnt == 0));
      if (iVar2 == 0) {
        iVar2 = path_cnt + 1;
        if (((child->subject_raw).len == (trust_ca->subject_raw).len) &&
           (iVar3 = memcmp((child->subject_raw).p,(trust_ca->subject_raw).p,(child->issuer_raw).len)
           , iVar3 == 0)) {
          iVar2 = path_cnt;
        }
        if ((trust_ca->max_pathlen < 1) || (iVar2 - self_cnt <= trust_ca->max_pathlen)) {
          type = child->sig_pk;
          options = child->sig_opts;
          md_alg = child->sig_md;
          uVar1 = mbedtls_md_get_size(md_info);
          iVar2 = mbedtls_pk_verify_ext
                            (type,options,&trust_ca->pk,md_alg,(uchar *)&ca_flags,
                             CONCAT31(extraout_var,uVar1),(child->sig).p,(child->sig).len);
          if (iVar2 == 0) {
            iVar2 = mbedtls_x509_time_is_past(&trust_ca->valid_to);
            if ((iVar2 == 0) &&
               (iVar2 = mbedtls_x509_time_is_future(&trust_ca->valid_from), iVar2 == 0))
            goto LAB_2305e5a0;
            if (pmVar4 == (mbedtls_x509_crt *)0x0) {
              pmVar4 = trust_ca;
            }
          }
        }
      }
      trust_ca = trust_ca->next;
    }
    trust_ca = pmVar4;
    if (pmVar4 == (mbedtls_x509_crt *)0x0) goto LAB_2305e504;
LAB_2305e5a0:
    *flags = *flags & 0xfffffff7;
    iVar2 = x509_profile_check_key(profile,child->sig_pk,&trust_ca->pk);
    if (iVar2 != 0) {
      *flags = *flags | 0x10000;
    }
    if (((child->subject_raw).len == (trust_ca->subject_raw).len) &&
       (iVar2 = memcmp((child->subject_raw).p,(trust_ca->subject_raw).p,(child->issuer_raw).len),
       iVar2 == 0)) goto LAB_2305e504;
    iVar2 = mbedtls_x509_time_is_past(&trust_ca->valid_to);
    if (iVar2 != 0) {
      uStack100 = uStack100 | 1;
    }
    iVar2 = mbedtls_x509_time_is_future(&trust_ca->valid_from);
    if (iVar2 != 0) {
      uStack100 = uStack100 | 0x200;
    }
    if (f_vrfy == (anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *)0x0)
    goto LAB_2305e5fe;
    iVar2 = (*f_vrfy)(p_vrfy,trust_ca,path_cnt + 1,&uStack100);
    if (iVar2 != 0) {
      return iVar2;
    }
  }
  iVar2 = (*f_vrfy)(p_vrfy,child,path_cnt,flags);
  if (iVar2 != 0) {
    return iVar2;
  }
LAB_2305e5fe:
  *flags = *flags | uStack100;
  return 0;
}



int x509_crt_verify_child
              (mbedtls_x509_crt *child,mbedtls_x509_crt *parent,mbedtls_x509_crt *trust_ca,
              mbedtls_x509_crl *ca_crl,mbedtls_x509_crt_profile *profile,int path_cnt,int self_cnt,
              uint32_t *flags,anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *f_vrfy,
              void *p_vrfy)

{
  mbedtls_pk_type_t type;
  mbedtls_md_type_t md_alg;
  uchar uVar1;
  int iVar2;
  mbedtls_md_info_t *md_info;
  undefined3 extraout_var;
  void *options;
  mbedtls_x509_crt *parent_00;
  mbedtls_x509_crt *parent_01;
  anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *extraout_fa0;
  anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *f_vrfy_00;
  void *extraout_fa1;
  void *p_vrfy_00;
  anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *in_stack_00000000;
  void *in_stack_00000004;
  uint32_t uStack100;
  uint32_t parent_flags;
  uchar hash [32];
  
  uStack100 = 0;
  if (path_cnt != 0) {
    iVar2 = x509_name_cmp(&child->issuer,&child->subject);
    if (iVar2 == 0) {
      self_cnt = self_cnt + 1;
    }
    if (path_cnt == 8) {
      *flags = *flags | 8;
      return -0x2700;
    }
  }
  iVar2 = mbedtls_x509_time_is_past(&child->valid_to);
  if (iVar2 != 0) {
    *flags = *flags | 1;
  }
  iVar2 = mbedtls_x509_time_is_future(&child->valid_from);
  if (iVar2 != 0) {
    *flags = *flags | 0x200;
  }
  if ((1 << ((uint)child->sig_md - 1 & 0x1f) & profile->allowed_mds) == 0) {
    *flags = *flags | 0x4000;
  }
  if ((1 << ((uint)child->sig_pk - 1 & 0x1f) & profile->allowed_pks) == 0) {
    *flags = *flags | 0x8000;
  }
  f_vrfy_00 = extraout_fa0;
  p_vrfy_00 = extraout_fa1;
  md_info = mbedtls_md_info_from_type(child->sig_md);
  if (md_info != (mbedtls_md_info_t *)0x0) {
    mbedtls_md(md_info,(child->tbs).p,(child->tbs).len,(uchar *)&parent_flags);
    iVar2 = x509_profile_check_key(profile,child->sig_pk,&parent->pk);
    if (iVar2 != 0) {
      *flags = *flags | 0x10000;
    }
    type = child->sig_pk;
    options = child->sig_opts;
    md_alg = child->sig_md;
    uVar1 = mbedtls_md_get_size(md_info);
    iVar2 = mbedtls_pk_verify_ext
                      (type,options,&parent->pk,md_alg,(uchar *)&parent_flags,
                       CONCAT31(extraout_var,uVar1),(child->sig).p,(child->sig).len);
    if (iVar2 == 0) goto LAB_2305e786;
  }
  *flags = *flags | 8;
LAB_2305e786:
  parent_01 = trust_ca;
  while (parent_01 != (mbedtls_x509_crt *)0x0) {
    iVar2 = x509_crt_check_parent(parent,parent_01,0,(uint)(path_cnt == 0));
    if (iVar2 == 0) goto LAB_2305e7da;
    parent_01 = parent_01->next;
  }
  parent_00 = parent->next;
  do {
    parent_01 = trust_ca;
    if (parent_00 == (mbedtls_x509_crt *)0x0) {
LAB_2305e7da:
      iVar2 = x509_crt_verify_top(parent,parent_01,profile,path_cnt + 1,self_cnt,&uStack100,
                                  in_stack_00000000,in_stack_00000004);
LAB_2305e80e:
      if ((iVar2 == 0) &&
         ((in_stack_00000000 == (anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *)0x0
          || (iVar2 = (*in_stack_00000000)(in_stack_00000004,child,path_cnt,flags), iVar2 == 0)))) {
        iVar2 = 0;
        *flags = *flags | uStack100;
      }
      return iVar2;
    }
    if (((parent_00->max_pathlen < 1) || ((path_cnt + 2) - self_cnt <= parent_00->max_pathlen)) &&
       (iVar2 = x509_crt_check_parent(parent,parent_00,0,(uint)(path_cnt == 0)), iVar2 == 0)) {
      iVar2 = x509_crt_verify_child
                        (parent,parent_00,trust_ca,ca_crl,profile,path_cnt + 1,self_cnt,&uStack100,
                         f_vrfy_00,p_vrfy_00);
      goto LAB_2305e80e;
    }
    parent_00 = parent_00->next;
  } while( true );
}



int mbedtls_x509_crt_check_extended_key_usage
              (mbedtls_x509_crt *crt,char *usage_oid,size_t usage_len)

{
  mbedtls_x509_sequence *pmVar1;
  int iVar2;
  
