pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (-1 < crt->ext_types << 0x14) {
    return 0;
  }
  pmVar1 = &crt->ext_key_usage;
  while ((((pmVar1->buf).len != usage_len ||
          (iVar2 = memcmp((pmVar1->buf).p,usage_oid,usage_len), iVar2 != 0)) &&
         (((pmVar1->buf).len != 4 || (iVar2 = memcmp(&DAT_2308a3ac,(pmVar1->buf).p,4), iVar2 != 0)))
         )) {
    pmVar1 = (mbedtls_x509_sequence *)pmVar1->next;
    if (pmVar1 == (mbedtls_x509_sequence *)0x0) {
      return -0x2800;
    }
  }
  return 0;
}



int mbedtls_x509_crt_verify_with_profile
              (mbedtls_x509_crt *crt,mbedtls_x509_crt *trust_ca,mbedtls_x509_crl *ca_crl,
              mbedtls_x509_crt_profile *profile,char *cn,uint32_t *flags,
              anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *f_vrfy,void *p_vrfy)

{
  mbedtls_pk_type_t pk_alg;
  size_t len;
  int iVar1;
  mbedtls_x509_crt *parent;
  uint uVar2;
  mbedtls_x509_crt *parent_00;
  mbedtls_x509_name *pmVar3;
  mbedtls_x509_sequence *name;
  anon_subr_int_void_ptr_mbedtls_x509_crt_ptr_int_uint32_t_ptr *in_fa0;
  void *in_fa1;
  
  if (profile == (mbedtls_x509_crt_profile *)0x0) {
    return -0x2800;
  }
  *flags = 0;
  if (cn != (char *)0x0) {
    len = strlen(cn);
    if ((crt->ext_types & 0x20U) == 0) {
      pmVar3 = &crt->subject;
      do {
        if ((((pmVar3->oid).len == 3) &&
            (iVar1 = memcmp(&DAT_2308a724,(pmVar3->oid).p,3), iVar1 == 0)) &&
           (((uVar2 = (pmVar3->val).len, uVar2 == len &&
             (iVar1 = x509_memcasecmp((pmVar3->val).p,cn,len), iVar1 == 0)) ||
            (((2 < uVar2 && (iVar1 = memcmp((pmVar3->val).p,&DAT_2308a720,2), iVar1 == 0)) &&
             (iVar1 = x509_check_wildcard(cn,(mbedtls_x509_buf *)&pmVar3->val), iVar1 == 0))))))
        goto LAB_2305e96c;
        pmVar3 = (mbedtls_x509_name *)pmVar3->next;
      } while (pmVar3 != (mbedtls_x509_name *)0x0);
    }
    else {
      name = &crt->subject_alt_names;
      do {
        uVar2 = (name->buf).len;
        if (((uVar2 == len) && (iVar1 = x509_memcasecmp(cn,(name->buf).p,len), iVar1 == 0)) ||
           ((2 < uVar2 &&
            ((iVar1 = memcmp((name->buf).p,&DAT_2308a720,2), iVar1 == 0 &&
             (iVar1 = x509_check_wildcard(cn,(mbedtls_x509_buf *)name), iVar1 == 0))))))
        goto LAB_2305e96c;
        name = (mbedtls_x509_sequence *)name->next;
      } while (name != (mbedtls_x509_sequence *)0x0);
    }
    *flags = *flags | 4;
  }
LAB_2305e96c:
  pk_alg = mbedtls_pk_get_type(&crt->pk);
  if ((1 << ((uint)pk_alg - 1 & 0x1f) & profile->allowed_pks) == 0) {
    *flags = *flags | 0x8000;
  }
  iVar1 = x509_profile_check_key(profile,pk_alg,&crt->pk);
  parent = trust_ca;
  if (iVar1 != 0) {
    *flags = *flags | 0x10000;
  }
  while (parent != (mbedtls_x509_crt *)0x0) {
    iVar1 = x509_crt_check_parent(crt,parent,0,1);
    if (iVar1 == 0) goto LAB_2305ea38;
    parent = parent->next;
  }
  parent_00 = crt->next;
  do {
    parent = trust_ca;
    if (parent_00 == (mbedtls_x509_crt *)0x0) {
LAB_2305ea38:
      iVar1 = x509_crt_verify_top(crt,parent,profile,0,0,flags,f_vrfy,p_vrfy);
LAB_2305ea60:
      if ((iVar1 == 0) && (iVar1 = 0, *flags != 0)) {
        iVar1 = -0x2700;
      }
      return iVar1;
    }
    iVar1 = x509_crt_check_parent(crt,parent_00,0,1);
    if (iVar1 == 0) {
      iVar1 = x509_crt_verify_child(crt,parent_00,trust_ca,ca_crl,profile,0,0,flags,in_fa0,in_fa1);
      goto LAB_2305ea60;
    }
    parent_00 = parent_00->next;
  } while( true );
}



void mbedtls_x509_crt_init(mbedtls_x509_crt *crt)

{
  memset(crt,0,0x134);
  return;
}



void mbedtls_x509_crt_free(mbedtls_x509_crt *crt)

{
  mbedtls_x509_crt **ppmVar1;
  mbedtls_x509_crt *v;
  uchar *v_00;
  mbedtls_asn1_named_data *v_01;
  mbedtls_asn1_sequence *v_02;
  mbedtls_x509_crt *pmVar2;
  mbedtls_asn1_named_data *pmVar3;
  mbedtls_asn1_sequence *pmVar4;
  
  pmVar2 = crt;
  if (crt == (mbedtls_x509_crt *)0x0) {
    return;
  }
  do {
    mbedtls_pk_free(&pmVar2->pk);
    v_01 = (pmVar2->issuer).next;
    while (v_01 != (mbedtls_asn1_named_data *)0x0) {
      pmVar3 = v_01->next;
      mbedtls_zeroize(v_01,0x20);
      vPortFree(v_01);
      v_01 = pmVar3;
    }
    v_01 = (pmVar2->subject).next;
    while (v_01 != (mbedtls_asn1_named_data *)0x0) {
      pmVar3 = v_01->next;
      mbedtls_zeroize(v_01,0x20);
      vPortFree(v_01);
      v_01 = pmVar3;
    }
    v_02 = (pmVar2->ext_key_usage).next;
    while (v_02 != (mbedtls_asn1_sequence *)0x0) {
      pmVar4 = v_02->next;
      mbedtls_zeroize(v_02,0x10);
      vPortFree(v_02);
      v_02 = pmVar4;
    }
    v_02 = (pmVar2->subject_alt_names).next;
    while (v_02 != (mbedtls_asn1_sequence *)0x0) {
      pmVar4 = v_02->next;
      mbedtls_zeroize(v_02,0x10);
      vPortFree(v_02);
      v_02 = pmVar4;
    }
    v_00 = (pmVar2->raw).p;
    if (v_00 != (uchar *)0x0) {
      mbedtls_zeroize(v_00,(pmVar2->raw).len);
      vPortFree((pmVar2->raw).p);
    }
    ppmVar1 = &pmVar2->next;
    v = crt;
    pmVar2 = *ppmVar1;
  } while (*ppmVar1 != (mbedtls_x509_crt *)0x0);
  do {
    pmVar2 = v->next;
    mbedtls_zeroize(v,0x134);
    if (crt != v) {
      vPortFree(v);
    }
    v = pmVar2;
  } while (pmVar2 != (mbedtls_x509_crt *)0x0);
  return;
}



int mbedtls_x509_crt_parse_der(mbedtls_x509_crt *chain,uchar *buf,size_t buflen)

{
  uchar uVar1;
  uchar *end;
  mbedtls_x509_crt *crt;
  mbedtls_x509_crt *crt_00;
  int iVar2;
  size_t __n;
  size_t sVar3;
  byte *pbVar4;
  byte *pbVar5;
  uchar *end_00;
  mbedtls_x509_crt *pmVar6;
  uchar *end_01;
  uchar *end_02;
  mbedtls_x509_sequence *pmVar7;
  mbedtls_x509_sequence *pmVar8;
  uchar *puStack132;
  size_t len;
  uchar *p;
  size_t len_2;
  int is_critical;
  int ext_type;
  size_t len_3;
  mbedtls_x509_buf sig_params1;
  mbedtls_x509_buf sig_params2;
  mbedtls_x509_buf sig_oid2;
  mbedtls_x509_buf extn_oid;
  size_t len_1;
  
