pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if ((chain == (mbedtls_x509_crt *)0x0) || (buf == (uchar *)0x0)) {
    return -0x2800;
  }
  crt_00 = chain;
  pmVar6 = (mbedtls_x509_crt *)0x0;
  do {
    crt = crt_00;
    if (crt->version == 0) goto LAB_2305ebe0;
    crt_00 = crt->next;
    pmVar6 = crt;
  } while (crt->next != (mbedtls_x509_crt *)0x0);
  crt_00 = (mbedtls_x509_crt *)mycalloc(1,0x134);
  crt->next = crt_00;
  if (crt_00 == (mbedtls_x509_crt *)0x0) {
    return -0x2880;
  }
  mbedtls_x509_crt_init(crt_00);
  crt = crt->next;
LAB_2305ebe0:
  memset(&len_3,0,0xc);
  memset(&sig_params1.p,0,0xc);
  memset(&sig_params2.p,0,0xc);
  if (crt == (mbedtls_x509_crt *)0x0) {
    iVar2 = -0x2800;
    if (pmVar6 == (mbedtls_x509_crt *)0x0) goto LAB_2305f1cc;
LAB_2305ec28:
    pmVar6->next = (mbedtls_x509_crt *)0x0;
  }
  else {
    puStack132 = (uchar *)buflen;
    len = (size_t)buf;
    iVar2 = mbedtls_asn1_get_tag((uchar **)&len,buf + buflen,(size_t *)&puStack132,0x30);
    if (iVar2 == 0) {
      if (buf + buflen + -len < puStack132) goto LAB_2305ec3c;
      *(uchar **)&(crt->raw).len = puStack132 + (int)(len - (int)buf);
      len = (size_t)mycalloc(1,(size_t)(puStack132 + (int)(len - (int)buf)));
      *(size_t *)&(crt->raw).p = len;
      if ((uchar *)len == (uchar *)0x0) {
        iVar2 = -0x2880;
      }
      else {
        memcpy((void *)len,buf,(crt->raw).len);
        sVar3 = (crt->raw).len;
        end_01 = (uchar *)((sVar3 - (int)puStack132) + len);
        end_00 = (uchar *)(len + sVar3);
        (crt->tbs).p = end_01;
        len = (size_t)end_01;
        iVar2 = mbedtls_asn1_get_tag((uchar **)&len,end_00,(size_t *)&puStack132,0x30);
        if (iVar2 == 0) {
          end_01 = puStack132 + len;
          *(uchar **)&(crt->tbs).len = end_01 + -(int)(crt->tbs).p;
          iVar2 = mbedtls_asn1_get_tag((uchar **)&len,end_01,(size_t *)&extn_oid.p,0xa0);
          if (iVar2 == 0) {
            end_02 = extn_oid.p + len;
            iVar2 = mbedtls_asn1_get_int((uchar **)&len,end_02,&crt->version);
            if (iVar2 == 0) {
              if (end_02 == (uchar *)len) goto LAB_2305ecea;
              iVar2 = -0x2266;
            }
            else {
              iVar2 = iVar2 + -0x2200;
              if (iVar2 == 0) {
LAB_2305ecea:
                iVar2 = mbedtls_x509_get_serial((uchar **)&len,end_01,&crt->serial);
                if (iVar2 == 0) {
                  iVar2 = mbedtls_x509_get_alg
                                    ((uchar **)&len,end_01,&crt->sig_oid,(mbedtls_x509_buf *)&len_3)
                  ;
                  if (iVar2 == 0) {
                    iVar2 = crt->version + 1;
                    crt->version = iVar2;
                    if (3 < iVar2) {
                      mbedtls_x509_crt_free(crt);
                      iVar2 = -0x2580;
                      goto LAB_2305ec24;
                    }
                    iVar2 = mbedtls_x509_get_sig_alg
                                      (&crt->sig_oid,(mbedtls_x509_buf *)&len_3,&crt->sig_md,
                                       &crt->sig_pk,&crt->sig_opts);
                    if (iVar2 == 0) {
                      *(size_t *)&(crt->issuer_raw).p = len;
                      iVar2 = mbedtls_asn1_get_tag((uchar **)&len,end_01,(size_t *)&puStack132,0x30)
                      ;
                      if (iVar2 != 0) goto LAB_2305ec92;
                      iVar2 = mbedtls_x509_get_name((uchar **)&len,puStack132 + len,&crt->issuer);
                      if (iVar2 == 0) {
                        *(uchar **)&(crt->issuer_raw).len =
                             (uchar *)(len - (int)(crt->issuer_raw).p);
                        iVar2 = mbedtls_asn1_get_tag
                                          ((uchar **)&len,end_01,(size_t *)&extn_oid.p,0x30);
                        if (iVar2 == 0) {
                          len = (size_t)(extn_oid.p + len);
                        }
                        else {
                          if (iVar2 != -0x62) goto LAB_2305ed46;
                        }
                        *(size_t *)&(crt->subject_raw).p = len;
                        iVar2 = mbedtls_asn1_get_tag
                                          ((uchar **)&len,end_01,(size_t *)&puStack132,0x30);
                        if (iVar2 != 0) goto LAB_2305ec92;
                        if ((puStack132 == (uchar *)0x0) ||
                           (iVar2 = mbedtls_x509_get_name
                                              ((uchar **)&len,puStack132 + len,&crt->subject),
                           iVar2 == 0)) {
                          *(uchar **)&(crt->subject_raw).len =
                               (uchar *)(len - (int)(crt->subject_raw).p);
                          iVar2 = mbedtls_pk_parse_subpubkey((uchar **)&len,end_01,&crt->pk);
                          if (iVar2 == 0) {
                            if (crt->version - 2U < 2) {
                              if (end_01 != (uchar *)len) {
                                (crt->issuer_id).tag = (uint)*(byte *)len;
                                iVar2 = mbedtls_asn1_get_tag
                                                  ((uchar **)&len,end_01,&(crt->issuer_id).len,0xa1)
                                ;
                                if (iVar2 == 0) {
                                  *(size_t *)&(crt->issuer_id).p = len;
                                  len = len + (crt->issuer_id).len;
                                }
                                else {
                                  if (iVar2 != -0x62) goto LAB_2305ed46;
                                }
                                if (1 < crt->version - 2U) goto LAB_2305ee1e;
                              }
                              if (end_01 != (uchar *)len) {
                                (crt->subject_id).tag = (uint)*(byte *)len;
                                iVar2 = mbedtls_asn1_get_tag
                                                  ((uchar **)&len,end_01,&(crt->subject_id).len,0xa2
                                                  );
                                if (iVar2 == 0) {
                                  *(size_t *)&(crt->subject_id).p = len;
                                  len = len + (crt->subject_id).len;
                                }
                                else {
                                  if (iVar2 != -0x62) goto LAB_2305ed46;
                                }
                              }
                            }
LAB_2305ee1e:
                            if (crt->version == 3) {
                              iVar2 = mbedtls_x509_get_ext((uchar **)&len,end_01,&crt->v3_ext,3);
                              if (iVar2 == 0) {
LAB_2305ee3e:
                                if (end_01 <= len) {
                                  if (end_01 == (uchar *)len) goto LAB_2305ee48;
LAB_2305f11c:
                                  iVar2 = -0x2566;
                                  goto LAB_2305ed46;
                                }
                                sig_oid2.p = (uchar *)0x0;
                                extn_oid.tag = 0;
                                extn_oid.len = 0;
                                len_2 = 0;
                                is_critical = 0;
                                iVar2 = mbedtls_asn1_get_tag
                                                  ((uchar **)&len,end_01,(size_t *)&p,0x30);
                                if (iVar2 != 0) {
LAB_2305ef1a:
                                  iVar2 = iVar2 + -0x2500;
                                  if (iVar2 == 0) goto LAB_2305eef8;
                                  goto LAB_2305ed46;
                                }
                                end_02 = p + len;
                                sig_oid2.p = (uchar *)(uint)*(byte *)len;
                                iVar2 = mbedtls_asn1_get_tag
                                                  ((uchar **)&len,end_01,(size_t *)&extn_oid,6);
                                if (iVar2 != 0) goto LAB_2305ef1a;
                                extn_oid.len = len;
                                len = len + extn_oid.tag;
                                if ((int)(end_01 + -len) < 1) {
LAB_2305f1e4:
                                  iVar2 = -0x2560;
                                  goto LAB_2305ed46;
                                }
                                iVar2 = mbedtls_asn1_get_bool((uchar **)&len,end_02,(int *)&len_2);
                                if (((iVar2 != 0) && (iVar2 != -0x62)) ||
                                   (iVar2 = mbedtls_asn1_get_tag
                                                      ((uchar **)&len,end_02,(size_t *)&p,4),
                                   iVar2 != 0)) goto LAB_2305ef1a;
                                end = p + len;
                                if (end_02 != end) goto LAB_2305f11c;
                                iVar2 = mbedtls_oid_get_x509_ext_type
                                                  ((mbedtls_asn1_buf *)&sig_oid2.p,&is_critical);
                                if (iVar2 != 0) {
                                  len = (size_t)end_02;
                                  if (len_2 != 0) goto LAB_2305ef90;
                                  goto LAB_2305ee3e;
                                }
                                if ((crt->ext_types & is_critical) != 0) {
LAB_2305f1ec:
                                  iVar2 = -0x2500;
                                  goto LAB_2305ed46;
                                }
                                crt->ext_types = crt->ext_types | is_critical;
                                if (is_critical == 0x100) {
                                  crt->ca_istrue = 0;
                                  crt->max_pathlen = 0;
                                  iVar2 = mbedtls_asn1_get_tag
                                                    ((uchar **)&len,end_02,(size_t *)&extn_oid.p,
                                                     0x30);
                                  if (iVar2 == 0) {
                                    if (end == (uchar *)len) goto LAB_2305ee3e;
                                    iVar2 = mbedtls_asn1_get_bool
                                                      ((uchar **)&len,end,&crt->ca_istrue);
                                    if (iVar2 != 0) {
                                      if ((iVar2 != -0x62) ||
                                         (iVar2 = mbedtls_asn1_get_int
                                                            ((uchar **)&len,end,&crt->ca_istrue),
                                         iVar2 != 0)) goto LAB_2305f01c;
                                      if (crt->ca_istrue != 0) {
                                        crt->ca_istrue = 1;
                                      }
                                    }
                                    if (end == (uchar *)len) goto LAB_2305ee3e;
                                    iVar2 = mbedtls_asn1_get_int
                                                      ((uchar **)&len,end,&crt->max_pathlen);
                                    if (iVar2 == 0) {
                                      if (end != (uchar *)len) goto LAB_2305f11c;
                                      crt->max_pathlen = crt->max_pathlen + 1;
                                      goto LAB_2305ee3e;
                                    }
                                  }
                                }
                                else {
                                  if (is_critical < 0x101) {
                                    if (is_critical == 4) {
                                      extn_oid.p = (uchar *)0x0;
                                      iVar2 = mbedtls_asn1_get_bitstring
                                                        ((uchar **)&len,end_02,
                                                         (mbedtls_asn1_bitstring *)&extn_oid.p);
                                      if (iVar2 == 0) {
                                        if (extn_oid.p == (uchar *)0x0) goto LAB_2305f09a;
                                        crt->key_usage = 0;
                                        pbVar4 = (byte *)0x0;
                                        do {
                                          pbVar5 = pbVar4 + 1;
                                          crt->key_usage =
                                               crt->key_usage |
                                               (uint)*pbVar4 << (((uint)pbVar4 & 3) << 3);
                                          if (extn_oid.p == pbVar5) break;
                                          pbVar4 = pbVar5;
                                        } while (pbVar5 != &DAT_00000004);
                                        goto LAB_2305ee3e;
                                      }
                                    }
                                    else {
                                      if (is_critical != 0x20) {
LAB_2305efc6:
                                        iVar2 = -0x2080;
                                        goto LAB_2305ed46;
                                      }
                                      iVar2 = mbedtls_asn1_get_tag
                                                        ((uchar **)&len,end_02,(size_t *)&ext_type,
                                                         0x30);
                                      if (iVar2 == 0) {
                                        if (end == (uchar *)(len + ext_type)) {
                                          pmVar7 = &crt->subject_alt_names;
                                          while (len < end) {
                                            if ((int)(end + -len) < 1) goto LAB_2305f1e4;
                                            uVar1 = *(uchar *)len;
                                            len = len + 1;
                                            iVar2 = mbedtls_asn1_get_len
                                                              ((uchar **)&len,end,
                                                               (size_t *)&extn_oid.p);
                                            if (iVar2 != 0) goto LAB_2305f01c;
                                            if (-1 < (char)uVar1) goto LAB_2305ef90;
                                            if (uVar1 == -0x7e) {
                                              pmVar8 = pmVar7;
                                              if ((pmVar7->buf).p != (uchar *)0x0) {
                                                if (pmVar7->next != (mbedtls_asn1_sequence *)0x0)
                                                goto LAB_2305f1ec;
                                                pmVar8 = (mbedtls_x509_sequence *)mycalloc(1,0x10);
                                                *(mbedtls_x509_sequence **)&pmVar7->next = pmVar8;
                                                if (pmVar8 == (mbedtls_x509_sequence *)0x0) {
                                                  iVar2 = -0x256a;
                                                  goto LAB_2305ed46;
                                                }
                                              }
                                              (pmVar8->buf).tag = 0x82;
                                              *(size_t *)&(pmVar8->buf).p = len;
                                              *(uchar **)&(pmVar8->buf).len = extn_oid.p;
                                              pmVar7 = pmVar8;
                                            }
                                            len = (size_t)((uchar *)len + (int)extn_oid.p);
                                          }
                                          pmVar7->next = (mbedtls_asn1_sequence *)0x0;
                                          if (end != (uchar *)len) goto LAB_2305f11c;
                                          goto LAB_2305ee3e;
                                        }
                                        goto LAB_2305f11c;
                                      }
                                    }
                                  }
                                  else {
                                    if (is_critical == 0x800) {
                                      iVar2 = mbedtls_asn1_get_sequence_of
                                                        ((uchar **)&len,end_02,
                                                         (mbedtls_asn1_sequence *)
                                                         &crt->ext_key_usage,6);
                                      if (iVar2 == 0) {
                                        if ((crt->ext_key_usage).buf.p == (uchar *)0x0) {
LAB_2305f09a:
                                          iVar2 = -0x2564;
                                          goto LAB_2305ed46;
                                        }
                                        goto LAB_2305ee3e;
                                      }
                                    }
                                    else {
                                      if (is_critical != 0x10000) goto LAB_2305efc6;
                                      extn_oid.p = (uchar *)0x0;
                                      iVar2 = mbedtls_asn1_get_bitstring
                                                        ((uchar **)&len,end_02,
                                                         (mbedtls_asn1_bitstring *)&extn_oid.p);
                                      if (iVar2 == 0) {
                                        if (extn_oid.p != (uchar *)0x1) goto LAB_2305f09a;
                                        crt->ns_cert_type = __EM_SIZE;
                                        goto LAB_2305ee3e;
                                      }
                                    }
                                  }
                                }
LAB_2305f01c:
                                iVar2 = iVar2 + -0x2500;
                                if (iVar2 != 0) goto LAB_2305ed46;
                                goto LAB_2305ee3e;
                              }
                              if (iVar2 != -0x62) goto LAB_2305ed46;
                            }
LAB_2305eef8:
                            if (end_01 != (uchar *)len) {
LAB_2305ec3c:
                              mbedtls_x509_crt_free(crt);
                              iVar2 = -0x21e6;
                              goto LAB_2305ec24;
                            }
LAB_2305ee48:
                            iVar2 = mbedtls_x509_get_alg
                                              ((uchar **)&len,end_00,
                                               (mbedtls_x509_buf *)&sig_params2.p,
                                               (mbedtls_x509_buf *)&sig_params1.p);
                            if (iVar2 == 0) {
                              __n = (crt->sig_oid).len;
                              if (((__n != sig_oid2.tag) ||
                                  (iVar2 = memcmp((crt->sig_oid).p,(void *)sig_oid2.len,__n),
                                  iVar2 != 0)) ||
                                 ((sig_params1.tag != sig_params2.tag ||
                                  ((sig_params1.tag != 0 &&
                                   (iVar2 = memcmp((void *)sig_params1.len,(void *)sig_params2.len,
                                                   sig_params1.tag), iVar2 != 0)))))) {
                                mbedtls_x509_crt_free(crt);
                                iVar2 = -0x2680;
                                goto LAB_2305ec24;
                              }
                              iVar2 = mbedtls_x509_get_sig((uchar **)&len,end_00,&crt->sig);
                              if (iVar2 == 0) {
                                if (end_00 == (uchar *)len) {
                                  return 0;
                                }
                                goto LAB_2305ec3c;
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
          else {
            if (iVar2 == -0x62) {
              crt->version = 0;
              goto LAB_2305ecea;
            }
          }
LAB_2305ed46:
          mbedtls_x509_crt_free(crt);
        }
        else {
LAB_2305ec92:
          mbedtls_x509_crt_free(crt);
          iVar2 = iVar2 + -0x2180;
          if (iVar2 == 0) {
            return 0;
          }
        }
      }
    }
    else {
      mbedtls_x509_crt_free(crt);
      iVar2 = -0x2180;
    }
LAB_2305ec24:
    if (pmVar6 != (mbedtls_x509_crt *)0x0) goto LAB_2305ec28;
  }
  if (chain == crt) {
    return iVar2;
  }
LAB_2305f1cc:
  vPortFree(crt);
  return iVar2;
LAB_2305ef90:
  iVar2 = -0x2562;
  goto LAB_2305ed46;
}



int mbedtls_x509_crt_parse(mbedtls_x509_crt *chain,uchar *buf,size_t buflen)

{
  bool bVar1;
  int iVar2;
  char *pcVar3;
  int iVar4;
  int iVar5;
  size_t local_50;
  size_t use_len;
  mbedtls_pem_context pem;
  
  if ((chain == (mbedtls_x509_crt *)0x0) || (buf == (uchar *)0x0)) {
    iVar4 = -0x2800;
  }
  else {
    if (((buflen != 0) && (buf[buflen - 1] == '\0')) &&
       (pcVar3 = strstr((char *)buf,"-----BEGIN CERTIFICATE-----"), pcVar3 != (char *)0x0)) {
      iVar4 = 0;
      iVar2 = 0;
      bVar1 = false;
      while (1 < buflen) {
        mbedtls_pem_init((mbedtls_pem_context *)&use_len);
        iVar5 = mbedtls_pem_read_buffer
                          ((mbedtls_pem_context *)&use_len,"-----BEGIN CERTIFICATE-----",
                           "-----END CERTIFICATE-----",buf,(uchar *)0x0,0,&local_50);
        if (iVar5 == 0) {
          buflen = buflen - local_50;
          buf = buf + local_50;
          iVar5 = mbedtls_x509_crt_parse_der(chain,(uchar *)use_len,(size_t)pem.buf);
          mbedtls_pem_free((mbedtls_pem_context *)&use_len);
          if (iVar5 != 0) {
            if (iVar5 == -0x2880) {
              return -0x2880;
            }
            goto LAB_2305f2be;
          }
          bVar1 = true;
        }
        else {
          if (iVar5 == -0x1480) {
            return -0x1480;
          }
          if (iVar5 == -0x1080) break;
          mbedtls_pem_free((mbedtls_pem_context *)&use_len);
          buflen = buflen - local_50;
          buf = buf + local_50;
LAB_2305f2be:
          if (iVar2 == 0) {
            iVar2 = iVar5;
          }
          iVar4 = iVar4 + 1;
        }
      }
      if (bVar1) {
        return iVar4;
      }
      if (iVar2 != 0) {
        return iVar2;
      }
      return -0x2780;
    }
    iVar4 = mbedtls_x509_crt_parse_der(chain,buf,buflen);
  }
  return iVar4;
}



int mbedtls_x509_crt_parse_file(mbedtls_x509_crt *chain,char *path)

{
  int iVar1;
  size_t local_18;
  size_t n;
  uchar *buf;
  
  iVar1 = mbedtls_pk_load_file(path,(uchar **)&n,&local_18);
  if (iVar1 == 0) {
    iVar1 = mbedtls_x509_crt_parse(chain,(uchar *)n,local_18);
    mbedtls_zeroize((void *)n,local_18);
    vPortFree((void *)n);
  }
  return iVar1;
}



int net_would_block(void)

{
  int in_a0;
  uint uVar1;
  
  uVar1 = lwip_fcntl(in_a0,3,0);
  uVar1 = uVar1 & 1;
  if (uVar1 != 0) {
    uVar1 = (uint)(errno == 0xb);
  }
  return uVar1;
}



void mbedtls_net_init(mbedtls_net_context *ctx)

{
  ctx->fd = -1;
  return;
}



int mbedtls_net_connect(mbedtls_net_context *ctx,char *host,char *port,int proto)

