pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
{
  char "mbedtls_net_connect" [20];
  addrinfo *paVar1;
  int iVar2;
  addrinfo *paStack68;
  addrinfo *addr_list;
  addrinfo hints;
  
  memset(&addr_list,0,0x20);
  iVar2 = lwip_getaddrinfo(host,port,(addrinfo *)&addr_list,&paStack68);
  if (iVar2 == 0) {
    iVar2 = -0x52;
    paVar1 = paStack68;
    while (paVar1 != (addrinfo *)0x0) {
      iVar2 = lwip_socket(paVar1->ai_family,paVar1->ai_socktype,paVar1->ai_protocol);
      ctx->fd = iVar2;
      if (iVar2 < 0) {
        iVar2 = -0x42;
      }
      else {
        do {
          iVar2 = lwip_connect(ctx->fd,paVar1->ai_addr,paVar1->ai_addrlen);
          if (iVar2 == 0) goto _out;
        } while (errno == 4);
        iVar2 = -0x44;
        lwip_close(ctx->fd);
      }
      paVar1 = paVar1->ai_next;
    }
_out:
    lwip_freeaddrinfo(paStack68);
  }
  else {
    printf("%s %d: getaddrinfo fail- errno: %d\n","mbedtls_net_connect",0xf6,errno);
    iVar2 = -0x52;
  }
  return iVar2;
}



int mbedtls_net_set_block(mbedtls_net_context *ctx)

{
  uint uVar1;
  int iVar2;
  
  uVar1 = lwip_fcntl(ctx->fd,3,0);
  iVar2 = lwip_fcntl(ctx->fd,4,uVar1 & 0xfffffffe);
  return iVar2;
}



int mbedtls_net_recv(void *ctx,uchar *buf,size_t len)

{
  int iVar1;
  
  if (*(int *)ctx < 0) {
    printf("%s %d: invalid socket fd\n","mbedtls_net_recv",0x141);
    iVar1 = -0x45;
  }
  else {
    iVar1 = lwip_read(*(int *)ctx,buf,len);
    if (iVar1 < 0) {
      iVar1 = net_would_block();
      if (iVar1 == 0) {
        if ((errno == 0x20) || (errno == 0x68)) {
          printf("%s %d: net reset - errno: %d\n","mbedtls_net_recv",0x14d);
          return -0x50;
        }
        if (errno != 4) {
          printf("%s %d: net recv failed - errno: %d\n","mbedtls_net_recv",0x155);
          return -0x4c;
        }
      }
      iVar1 = -0x6900;
    }
  }
  return iVar1;
}



int mbedtls_net_send(void *ctx,uchar *buf,size_t len)

{
  char "mbedtls_net_send" [17];
  ssize_t sVar1;
  int iVar2;
  
  if (*(int *)ctx < 0) {
    return -0x45;
  }
  sVar1 = lwip_write(*(int *)ctx,buf,len);
  if (sVar1 < 0) {
    iVar2 = net_would_block();
    if (iVar2 == 0) {
      if ((errno == 0x20) || (errno == 0x68)) {
        printf("%s %d: net reset - errno: %d\n","mbedtls_net_send",0x16d);
        return -0x50;
      }
      if (errno != 4) {
        printf("%s %d: net send failed - errno: %d\n",0x2308ac00,0x175);
        return -0x4e;
      }
    }
    return -0x6880;
  }
  return sVar1;
}



// WARNING: Variable defined which should be unmapped: tv

int mbedtls_net_recv_timeout(void *ctx,uchar *buf,size_t len,uint32_t timeout)

{
  int iVar1;
  timeval *timeout_00;
  uint uVar2;
  undefined local_28 [4];
  _types_fd_set read_fds;
  timeval tv;
  
  uVar2 = *(uint *)ctx;
  if (-1 < (int)uVar2) {
    iVar1 = 0;
    do {
      local_28[iVar1] = 0;
      iVar1 = iVar1 + 1;
    } while (iVar1 != 8);
    iVar1 = (uVar2 >> 5) * 4;
    *(uint *)(local_28 + iVar1) = 1 << (uVar2 & 0x1f) | *(uint *)(local_28 + iVar1);
    read_fds.fds_bits[1] = timeout / 1000;
    timeout_00 = (timeval *)(read_fds.fds_bits + 1);
    if (timeout == 0) {
      timeout_00 = (timeval *)0x0;
    }
    iVar1 = lwip_select(uVar2 + 1,(_types_fd_set *)local_28,(_types_fd_set *)0x0,
                        (_types_fd_set *)0x0,timeout_00);
    if (iVar1 == 0) {
      iVar1 = -0x6800;
    }
    else {
      if (iVar1 < 0) {
        iVar1 = -0x4c;
        if (errno == 4) {
          iVar1 = -0x6900;
        }
      }
      else {
        iVar1 = mbedtls_net_recv(ctx,buf,len);
      }
    }
    return iVar1;
  }
  return -0x45;
}



void mbedtls_net_free(mbedtls_net_context *ctx)

{
  if (ctx->fd != -1) {
    lwip_shutdown(ctx->fd,2);
    lwip_close(ctx->fd);
    ctx->fd = -1;
  }
  return;
}



void * mycalloc(size_t numitems,size_t size)

{
  void *__s;
  
  __s = pvPortMalloc(numitems * size);
  memset(__s,0,numitems * size);
  return __s;
}



void aes_gen_tables(void)

{
  byte bVar1;
  int *piVar2;
  uint uVar3;
  uchar *puVar4;
  uint *puVar5;
  uchar *puVar6;
  int iVar7;
  uint32_t *puVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  uint uVar13;
  uint local_820;
  int pow [256];
  int log [256];
  
  puVar5 = &local_820;
  uVar9 = 1;
  iVar7 = 0;
  do {
    pow[uVar9 + 0xff] = iVar7;
    *puVar5 = uVar9;
    uVar3 = uVar9 & 0x80;
    if (uVar3 != 0) {
      uVar3 = 0x1b;
    }
    iVar7 = iVar7 + 1;
    uVar9 = (uVar9 ^ uVar9 << 1 ^ uVar3) & 0xff;
    puVar5 = puVar5 + 1;
  } while (iVar7 != 0x100);
  puVar8 = RCON;
  uVar9 = 1;
  do {
    *puVar8 = uVar9;
    uVar3 = uVar9 & 0x80;
    if (uVar3 != 0) {
      uVar3 = 0x1b;
    }
    puVar8 = puVar8 + 1;
    uVar9 = (uVar3 ^ uVar9 << 1) & 0xff;
  } while (puVar8 != (uint32_t *)RSb);
  FSb[0] = 'c';
  RSb[99] = '\0';
  piVar2 = pow + 0xff;
  iVar7 = 1;
  puVar4 = FSb;
  puVar6 = RSb;
  do {
    uVar13 = (&local_820)[0xff - piVar2[1]];
    piVar2 = piVar2 + 1;
    uVar9 = uVar13 << 1 | (int)uVar13 >> 7;
    uVar12 = uVar9 & 0xff;
    uVar10 = (int)uVar12 >> 7;
    uVar9 = (uVar9 & 0x7f) << 1;
    uVar11 = (int)(uVar9 | uVar10) >> 7;
    uVar3 = (uVar9 & 0x7f | uVar10) << 1 | uVar11;
    uVar9 = ((int)uVar3 >> 7 | ((uVar9 & 0x3f | uVar10) << 1 | uVar11) << 1) ^ uVar13 ^ uVar12 ^
            (uVar9 | uVar10) ^ uVar3 ^ 99;
    FSb[iVar7] = (uchar)uVar9;
    RSb[uVar9] = (uchar)iVar7;
    iVar7 = iVar7 + 1;
  } while (iVar7 != 0x100);
  iVar7 = 0;
  do {
    uVar9 = (uint)*puVar4;
    uVar11 = (uVar9 << 1 ^ (int)(char)*puVar4 >> 0x1f & 0x1bU) & 0xff;
    uVar3 = uVar9 << 8 ^ uVar9 << 0x10 ^ uVar11;
    uVar10 = uVar3 ^ (uVar9 ^ uVar11) << 0x18;
    *(uint *)((int)FT0 + iVar7) = uVar10;
    *(uint *)((int)FT1 + iVar7) = uVar3 << 8 | uVar9 ^ uVar11;
    *(uint *)((int)FT2 + iVar7) = uVar3 << 0x10 | uVar10 >> 0x10;
    *(uint *)((int)FT3 + iVar7) = uVar11 << 0x18 | uVar10 >> 8;
    bVar1 = *puVar6;
    uVar9 = (uint)bVar1;
    if (bVar1 == 0) {
      uVar3 = 0;
      uVar10 = 0;
    }
    else {
      uVar3 = (&local_820)[(log[13] + pow[uVar9 + 0xff]) % 0xff];
      uVar10 = (&local_820)[(pow[uVar9 + 0xff] + log[8]) % 0xff] << 8;
    }
    uVar11 = 0;
    if (bVar1 != 0) {
      uVar11 = (&local_820)[(pow[uVar9 + 0xff] + log[12]) % 0xff] << 0x10;
    }
    uVar11 = uVar10 ^ uVar3 ^ uVar11;
    uVar12 = 0;
    if (bVar1 != 0) {
      uVar12 = (&local_820)[(pow[uVar9 + 0xff] + log[10]) % 0xff] << 0x18;
    }
    uVar12 = uVar11 ^ uVar12;
    *(uint *)((int)RT0 + iVar7) = uVar12;
    *(uint *)((int)RT1 + iVar7) = uVar11 << 8 | uVar12 >> 0x18;
    *(uint *)((int)RT2 + iVar7) = (uVar10 ^ uVar3) << 0x10 | uVar12 >> 0x10;
    *(uint *)((int)RT3 + iVar7) = uVar3 << 0x18 | uVar12 >> 8;
    iVar7 = iVar7 + 4;
    puVar4 = puVar4 + 1;
    puVar6 = puVar6 + 1;
  } while (iVar7 != 0x400);
  return;
}



void mbedtls_aes_init(mbedtls_aes_context *ctx)

{
  memset(ctx,0,0x118);
  return;
}



void mbedtls_aes_free(mbedtls_aes_context *ctx)

{
  mbedtls_aes_context *pmVar1;
  
  pmVar1 = ctx + 1;
  if (ctx != (mbedtls_aes_context *)0x0) {
    while (ctx != pmVar1) {
      *(undefined *)&ctx->nr = 0;
      ctx = (mbedtls_aes_context *)((int)&ctx->nr + 1);
    }
  }
  return;
}



int mbedtls_aes_setkey_enc(mbedtls_aes_context *ctx,uchar *key,uint keybits)

{
  byte *pbVar1;
  uint32_t *puVar2;
  uint uVar3;
  int iVar4;
  uint32_t *puVar5;
  uint32_t *puVar6;
  uint uVar7;
  
  if (aes_init_done == 0) {
    aes_gen_tables();
    aes_init_done = 1;
  }
  if (keybits == 0xc0) {
    iVar4 = 0xc;
  }
  else {
    if (keybits == 0x100) {
      iVar4 = 0xe;
    }
    else {
      if (keybits != 0x80) {
        return -0x20;
      }
      iVar4 = 10;
    }
  }
  ctx->nr = iVar4;
  puVar5 = ctx->buf;
  ctx->rk = puVar5;
  pbVar1 = key;
  puVar2 = puVar5;
  while (key + (keybits >> 5) * 4 != pbVar1) {
    *puVar2 = (uint)pbVar1[1] << 8 | (uint)pbVar1[2] << 0x10 | (uint)*pbVar1 |
              (uint)pbVar1[3] << 0x18;
    pbVar1 = pbVar1 + 4;
    puVar2 = puVar2 + 1;
  }
  iVar4 = ctx->nr;
  if (iVar4 == 0xc) {
    puVar2 = RCON;
    do {
      uVar3 = puVar5[5];
      uVar7 = *puVar2;
      puVar6 = puVar5 + 6;
      puVar2 = puVar2 + 1;
      uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
              (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
      *puVar6 = uVar7;
      uVar7 = uVar7 ^ puVar5[1];
      puVar5[7] = uVar7;
      uVar7 = uVar7 ^ puVar5[2];
      puVar5[8] = uVar7;
      uVar7 = uVar7 ^ puVar5[3];
      puVar5[9] = uVar7;
      uVar7 = uVar7 ^ puVar5[4];
      puVar5[10] = uVar7;
      puVar5[0xb] = uVar7 ^ uVar3;
      puVar5 = puVar6;
    } while (puVar6 != ctx->buf + 0x30);
  }
  else {
    if (iVar4 == 0xe) {
      puVar2 = RCON;
      do {
        uVar3 = puVar5[7];
        uVar7 = *puVar2;
        puVar6 = puVar5 + 8;
        puVar2 = puVar2 + 1;
        uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
                (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
        *puVar6 = uVar7;
        uVar7 = uVar7 ^ puVar5[1];
        puVar5[9] = uVar7;
        uVar7 = uVar7 ^ puVar5[2];
        puVar5[10] = uVar7;
        uVar7 = uVar7 ^ puVar5[3];
        puVar5[0xb] = uVar7;
        uVar7 = (uint)FSb[uVar7 >> 0x10 & 0xff] << 0x10 ^
                (uint)FSb[uVar7 & 0xff] ^ puVar5[4] ^ (uint)FSb[uVar7 >> 0x18] << 0x18 ^
                (uint)FSb[uVar7 >> 8 & 0xff] << 8;
        puVar5[0xc] = uVar7;
        uVar7 = uVar7 ^ puVar5[5];
        puVar5[0xd] = uVar7;
        uVar7 = uVar7 ^ puVar5[6];
        puVar5[0xe] = uVar7;
        puVar5[0xf] = uVar7 ^ uVar3;
        puVar5 = puVar6;
      } while (puVar6 != ctx->buf + 0x38);
    }
    else {
      if (iVar4 != 10) {
        return 0;
      }
      puVar2 = RCON;
      do {
        uVar3 = puVar5[3];
        uVar7 = *puVar2;
        puVar6 = puVar5 + 4;
        puVar2 = puVar2 + 1;
        uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
                (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
        *puVar6 = uVar7;
        uVar7 = uVar7 ^ puVar5[1];
        puVar5[5] = uVar7;
        uVar7 = uVar7 ^ puVar5[2];
        puVar5[6] = uVar7;
        puVar5[7] = uVar7 ^ uVar3;
        puVar5 = puVar6;
      } while (puVar6 != ctx->buf + 0x28);
    }
  }
  return 0;
}



int mbedtls_aes_setkey_dec(mbedtls_aes_context *ctx,uchar *key,uint keybits)

{
  uint *puVar1;
  int iVar2;
  uint32_t *puVar3;
  uint uVar4;
  uint32_t *puVar5;
  uint32_t *puVar6;
  int iVar7;
  int iStack296;
  mbedtls_aes_context cty;
  
  mbedtls_aes_init((mbedtls_aes_context *)&iStack296);
  ctx->rk = ctx->buf;
  iVar2 = mbedtls_aes_setkey_enc((mbedtls_aes_context *)&iStack296,key,keybits);
  if (iVar2 == 0) {
    ctx->nr = iStack296;
    puVar6 = (uint32_t *)(cty.nr + iStack296 * 0x10);
    ctx->buf[0] = *puVar6;
    ctx->buf[1] = puVar6[1];
    puVar3 = ctx->buf;
    ctx->buf[2] = puVar6[2];
    ctx->buf[3] = puVar6[3];
    while( true ) {
      puVar3 = puVar3 + 4;
      puVar5 = puVar6 + -4;
      iStack296 = iStack296 + -1;
      if (iStack296 < 1) break;
      iVar7 = 0;
      do {
        uVar4 = *(uint *)((int)puVar5 + iVar7);
        puVar1 = (uint *)((int)puVar3 + iVar7);
        iVar7 = iVar7 + 4;
        *puVar1 = RT2[FSb[uVar4 >> 0x10 & 0xff]] ^
                  RT0[FSb[uVar4 & 0xff]] ^ RT3[FSb[uVar4 >> 0x18]] ^ RT1[FSb[uVar4 >> 8 & 0xff]];
        puVar6 = puVar5;
      } while (iVar7 != 0x10);
    }
    *puVar3 = *puVar5;
    puVar3[1] = puVar6[-3];
    puVar3[2] = puVar6[-2];
    puVar3[3] = puVar6[-1];
  }
  mbedtls_aes_free((mbedtls_aes_context *)&iStack296);
  return iVar2;
}



void mbedtls_aes_encrypt(mbedtls_aes_context *ctx,uchar *input,uchar *output)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  byte bVar4;
  byte bVar5;
  byte bVar6;
  byte bVar7;
  byte bVar8;
  byte bVar9;
  byte bVar10;
  byte bVar11;
  byte bVar12;
  byte bVar13;
  byte bVar14;
  byte bVar15;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  uint uVar20;
  uint32_t *puVar21;
  uint uVar22;
  uint uVar23;
  uint uVar24;
  int iVar25;
  uint uVar26;
  uint uVar27;
  uint uVar28;
  uint uVar29;
  uint uVar30;
  uint uVar31;
  uint uVar32;
  uint uVar33;
  uint32_t *puVar34;
  
  puVar21 = ctx->rk;
  puVar34 = puVar21 + 4;
  uVar23 = *(uint *)input ^ *puVar21;
  uVar30 = *(uint *)(input + 4) ^ puVar21[1];
  uVar28 = *(uint *)(input + 8) ^ puVar21[2];
  iVar25 = ctx->nr >> 1;
  uVar26 = *(uint *)(input + 0xc) ^ puVar21[3];
  while( true ) {
    iVar25 = iVar25 + -1;
    uVar17 = FT0[uVar23 & 0xff] ^ FT3[uVar26 >> 0x18] ^ *puVar34 ^
             *(uint *)((int)FT1 + (uVar30 >> 6 & 0x3fc)) ^
             *(uint *)((int)FT2 + (uVar28 >> 0xe & 0x3fc));
    uVar31 = puVar34[4];
    uVar19 = FT0[uVar30 & 0xff] ^ FT3[uVar23 >> 0x18] ^ puVar34[1] ^
             *(uint *)((int)FT1 + (uVar28 >> 6 & 0x3fc)) ^
             *(uint *)((int)FT2 + (uVar26 >> 0xe & 0x3fc));
    uVar16 = FT0[uVar28 & 0xff] ^ FT3[uVar30 >> 0x18] ^ puVar34[2] ^
             *(uint *)((int)FT1 + (uVar26 >> 6 & 0x3fc)) ^
             *(uint *)((int)FT2 + (uVar23 >> 0xe & 0x3fc));
    uVar22 = FT0[uVar26 & 0xff] ^ FT3[uVar28 >> 0x18] ^ puVar34[3] ^
             *(uint *)((int)FT1 + (uVar23 >> 6 & 0x3fc)) ^
             *(uint *)((int)FT2 + (uVar30 >> 0xe & 0x3fc));
    uVar33 = uVar19 >> 8 & 0xff;
    uVar23 = uVar16 >> 0x10 & 0xff;
    uVar30 = puVar34[5];
    uVar32 = uVar16 >> 8 & 0xff;
    uVar26 = uVar22 >> 0x10 & 0xff;
    uVar29 = puVar34[6];
    uVar24 = uVar22 >> 8 & 0xff;
    uVar28 = uVar17 >> 0x10 & 0xff;
    uVar27 = puVar34[7];
    uVar18 = uVar17 >> 8 & 0xff;
    uVar20 = uVar19 >> 0x10 & 0xff;
    if (iVar25 < 1) break;
    uVar23 = FT0[uVar17 & 0xff] ^ FT3[uVar22 >> 0x18] ^ uVar31 ^ FT1[uVar33] ^ FT2[uVar23];
    uVar30 = FT0[uVar19 & 0xff] ^ FT3[uVar17 >> 0x18] ^ uVar30 ^ FT1[uVar32] ^ FT2[uVar26];
    uVar28 = FT0[uVar16 & 0xff] ^ FT3[uVar19 >> 0x18] ^ uVar29 ^ FT1[uVar24] ^ FT2[uVar28];
    puVar34 = puVar34 + 8;
    uVar26 = FT0[uVar22 & 0xff] ^ FT3[uVar16 >> 0x18] ^ uVar27 ^ FT1[uVar18] ^ FT2[uVar20];
  }
  bVar1 = FSb[uVar33];
  bVar2 = FSb[uVar23];
  bVar3 = FSb[uVar22 >> 0x18];
  bVar4 = FSb[uVar32];
  bVar5 = FSb[uVar19 & 0xff];
  bVar6 = FSb[uVar26];
  bVar7 = FSb[uVar17 >> 0x18];
  bVar8 = FSb[uVar24];
  bVar9 = FSb[uVar16 & 0xff];
  bVar10 = FSb[uVar28];
  bVar11 = FSb[uVar19 >> 0x18];
  bVar12 = FSb[uVar22 & 0xff];
  bVar13 = FSb[uVar18];
  bVar14 = FSb[uVar20];
  bVar15 = FSb[uVar16 >> 0x18];
  *output = FSb[uVar17 & 0xff] ^ (byte)uVar31;
  output[4] = bVar5 ^ (byte)uVar30;
  output[1] = bVar1 ^ (byte)(uVar31 >> 8);
  output[2] = (byte)(uVar31 >> 0x10) ^ bVar2;
  output[5] = bVar4 ^ (byte)(uVar30 >> 8);
  output[6] = (byte)(uVar30 >> 0x10) ^ bVar6;
  output[9] = bVar8 ^ (byte)(uVar29 >> 8);
  output[10] = (byte)(uVar29 >> 0x10) ^ bVar10;
  output[8] = bVar9 ^ (byte)uVar29;
  output[0xc] = bVar12 ^ (byte)uVar27;
  output[0xd] = (byte)(uVar27 >> 8) ^ bVar13;
  output[3] = (byte)(uVar31 >> 0x18) ^ bVar3;
  output[7] = (byte)(uVar30 >> 0x18) ^ bVar7;
  output[0xb] = (byte)(uVar29 >> 0x18) ^ bVar11;
  output[0xf] = (byte)(uVar27 >> 0x18) ^ bVar15;
  output[0xe] = (byte)(uVar27 >> 0x10) ^ bVar14;
  return;
}



void mbedtls_aes_decrypt(mbedtls_aes_context *ctx,uchar *input,uchar *output)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  byte bVar4;
  byte bVar5;
  byte bVar6;
  byte bVar7;
  byte bVar8;
  byte bVar9;
  byte bVar10;
  byte bVar11;
  byte bVar12;
  byte bVar13;
  byte bVar14;
  byte bVar15;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  uint uVar20;
  uint32_t *puVar21;
  uint uVar22;
  uint uVar23;
  int iVar24;
  uint uVar25;
  uint uVar26;
  uint uVar27;
  uint uVar28;
  uint uVar29;
  uint uVar30;
  uint uVar31;
  uint uVar32;
  uint uVar33;
  uint32_t *puVar34;
  
  puVar21 = ctx->rk;
  uVar29 = *(uint *)(input + 4) ^ puVar21[1];
  puVar34 = puVar21 + 4;
  uVar27 = *(uint *)(input + 8) ^ puVar21[2];
  iVar24 = ctx->nr >> 1;
  uVar23 = *(uint *)input ^ *puVar21;
  uVar25 = *(uint *)(input + 0xc) ^ puVar21[3];
  while( true ) {
    iVar24 = iVar24 + -1;
    uVar17 = RT0[uVar23 & 0xff] ^ RT3[uVar29 >> 0x18] ^ *puVar34 ^
             *(uint *)((int)RT1 + (uVar25 >> 6 & 0x3fc)) ^
             *(uint *)((int)RT2 + (uVar27 >> 0xe & 0x3fc));
    uVar31 = puVar34[4];
    uVar16 = uVar17 >> 8 & 0xff;
    uVar22 = RT0[uVar25 & 0xff] ^ RT3[uVar23 >> 0x18] ^ puVar34[3] ^
             *(uint *)((int)RT1 + (uVar27 >> 6 & 0x3fc)) ^
             *(uint *)((int)RT2 + (uVar29 >> 0xe & 0x3fc));
    uVar18 = RT0[uVar27 & 0xff] ^ RT3[uVar25 >> 0x18] ^ puVar34[2] ^
             *(uint *)((int)RT1 + (uVar29 >> 6 & 0x3fc)) ^
             *(uint *)((int)RT2 + (uVar23 >> 0xe & 0x3fc));
    uVar23 = RT0[uVar29 & 0xff] ^ RT3[uVar27 >> 0x18] ^ puVar34[1] ^
             *(uint *)((int)RT1 + (uVar23 >> 6 & 0x3fc)) ^
             *(uint *)((int)RT2 + (uVar25 >> 0xe & 0x3fc));
    uVar33 = uVar22 >> 8 & 0xff;
    uVar32 = uVar18 >> 0x10 & 0xff;
    uVar30 = puVar34[5];
    uVar29 = uVar22 >> 0x10 & 0xff;
    uVar28 = puVar34[6];
    uVar27 = uVar23 >> 8 & 0xff;
    uVar25 = uVar17 >> 0x10 & 0xff;
    uVar26 = puVar34[7];
    uVar19 = uVar18 >> 8 & 0xff;
    uVar20 = uVar23 >> 0x10 & 0xff;
    if (iVar24 < 1) break;
    uVar29 = RT0[uVar23 & 0xff] ^ RT3[uVar18 >> 0x18] ^ uVar30 ^ RT1[uVar16] ^ RT2[uVar29];
    uVar23 = RT0[uVar17 & 0xff] ^ RT3[uVar23 >> 0x18] ^ uVar31 ^ RT1[uVar33] ^ RT2[uVar32];
    uVar27 = RT0[uVar18 & 0xff] ^ RT3[uVar22 >> 0x18] ^ uVar28 ^ RT1[uVar27] ^ RT2[uVar25];
    puVar34 = puVar34 + 8;
    uVar25 = RT0[uVar22 & 0xff] ^ RT3[uVar17 >> 0x18] ^ uVar26 ^ RT1[uVar19] ^ RT2[uVar20];
  }
  bVar1 = RSb[uVar17 & 0xff];
  bVar2 = RSb[uVar32];
  bVar3 = RSb[uVar23 >> 0x18];
  bVar4 = RSb[uVar22 & 0xff];
  bVar5 = RSb[uVar16];
  bVar6 = RSb[uVar23 & 0xff];
  bVar7 = RSb[uVar29];
  bVar8 = RSb[uVar19];
  bVar9 = RSb[uVar18 >> 0x18];
  bVar10 = RSb[uVar20];
  bVar11 = RSb[uVar27];
  bVar12 = RSb[uVar18 & 0xff];
  bVar13 = RSb[uVar25];
  bVar14 = RSb[uVar17 >> 0x18];
  bVar15 = RSb[uVar22 >> 0x18];
  output[1] = RSb[uVar33] ^ (byte)(uVar31 >> 8);
  output[2] = (byte)(uVar31 >> 0x10) ^ bVar2;
  output[5] = bVar5 ^ (byte)(uVar30 >> 8);
  output[6] = (byte)(uVar30 >> 0x10) ^ bVar7;
  output[9] = bVar11 ^ (byte)(uVar28 >> 8);
  output[10] = (byte)(uVar28 >> 0x10) ^ bVar13;
  *output = bVar1 ^ (byte)uVar31;
  output[4] = bVar6 ^ (byte)uVar30;
  output[8] = bVar12 ^ (byte)uVar28;
  output[0xc] = bVar4 ^ (byte)uVar26;
  output[0xd] = (byte)(uVar26 >> 8) ^ bVar8;
  output[3] = (byte)(uVar31 >> 0x18) ^ bVar3;
  output[7] = (byte)(uVar30 >> 0x18) ^ bVar9;
  output[0xb] = (byte)(uVar28 >> 0x18) ^ bVar15;
  output[0xf] = (byte)(uVar26 >> 0x18) ^ bVar14;
  output[0xe] = (byte)(uVar26 >> 0x10) ^ bVar10;
  return;
}



int mbedtls_aes_crypt_ecb(mbedtls_aes_context *ctx,int mode,uchar *input,uchar *output)

{
  if (mode == 1) {
    mbedtls_aes_encrypt(ctx,input,output);
  }
  else {
    mbedtls_aes_decrypt(ctx,input,output);
  }
  return 0;
}



