pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_aes_crypt_cbc
              (mbedtls_aes_context *ctx,int mode,size_t length,uchar *iv,uchar *input,uchar *output)

{
  uint uVar1;
  int iVar2;
  byte *pbVar3;
  byte *pbVar4;
  byte *pbVar5;
  uchar *input_00;
  undefined auStack64 [4];
  uchar temp [16];
  
  uVar1 = length & 0xf;
  if (uVar1 == 0) {
    if (mode == 0) {
      while( true ) {
        input_00 = output + -uVar1;
        if (uVar1 + length == 0) break;
        memcpy(auStack64,input + -uVar1,0x10);
        mbedtls_aes_decrypt(ctx,input + -uVar1,input_00);
        iVar2 = 0;
        do {
          pbVar3 = input_00 + iVar2;
          pbVar4 = iv + iVar2;
          iVar2 = iVar2 + 1;
          *pbVar3 = *pbVar4 ^ *pbVar3;
        } while (iVar2 != 0x10);
        memcpy(iv,auStack64,0x10);
        uVar1 = uVar1 - 0x10;
      }
    }
    else {
      while( true ) {
        input_00 = output + -uVar1;
        if (length + uVar1 == 0) break;
        iVar2 = 0;
        do {
          pbVar5 = input + -uVar1 + iVar2;
          pbVar3 = iv + iVar2;
          pbVar4 = input_00 + iVar2;
          iVar2 = iVar2 + 1;
          *pbVar4 = *pbVar5 ^ *pbVar3;
        } while (iVar2 != 0x10);
        mbedtls_aes_crypt_ecb(ctx,mode,input_00,input_00);
        memcpy(iv,input_00,0x10);
        uVar1 = uVar1 - 0x10;
      }
    }
    iVar2 = 0;
  }
  else {
    iVar2 = -0x22;
  }
  return iVar2;
}



int mbedtls_aes_crypt_cfb128
              (mbedtls_aes_context *ctx,int mode,size_t length,size_t *iv_off,uchar *iv,uchar *input
              ,uchar *output)

{
  uint uVar1;
  byte *pbVar2;
  byte bVar3;
  
  uVar1 = *iv_off;
  pbVar2 = output;
  if (mode == 0) {
    while (pbVar2 != output + length) {
      if (uVar1 == 0) {
        mbedtls_aes_encrypt(ctx,iv,iv);
      }
      bVar3 = *input;
      *pbVar2 = iv[uVar1] ^ bVar3;
      iv[uVar1] = bVar3;
      uVar1 = uVar1 + 1 & 0xf;
      pbVar2 = pbVar2 + 1;
      input = input + 1;
    }
  }
  else {
    while (pbVar2 != output + length) {
      if (uVar1 == 0) {
        mbedtls_aes_encrypt(ctx,iv,iv);
      }
      bVar3 = iv[uVar1] ^ *input;
      *pbVar2 = bVar3;
      iv[uVar1] = bVar3;
      uVar1 = uVar1 + 1 & 0xf;
      pbVar2 = pbVar2 + 1;
      input = input + 1;
    }
  }
  *iv_off = uVar1;
  return 0;
}



int mbedtls_aes_crypt_ctr
              (mbedtls_aes_context *ctx,size_t length,size_t *nc_off,uchar *nonce_counter,
              uchar *stream_block,uchar *input,uchar *output)

{
  bool bVar1;
  uchar uVar2;
  uint uVar3;
  uchar *puVar4;
  byte *pbVar5;
  
  uVar3 = *nc_off;
  pbVar5 = output;
  do {
    if (pbVar5 == output + length) {
      *nc_off = uVar3;
      return 0;
    }
    if (uVar3 == 0) {
      mbedtls_aes_encrypt(ctx,nonce_counter,stream_block);
      puVar4 = nonce_counter + 0xf;
      do {
        uVar2 = *puVar4;
        *puVar4 = uVar2 + '\x01';
        if ((uchar)(uVar2 + '\x01') != '\0') break;
        bVar1 = nonce_counter != puVar4;
        puVar4 = puVar4 + -1;
      } while (bVar1);
    }
    *pbVar5 = stream_block[uVar3] ^ *input;
    uVar3 = uVar3 + 1 & 0xf;
    input = input + 1;
    pbVar5 = pbVar5 + 1;
  } while( true );
}



int mbedtls_asn1_get_len(uchar **p,uchar *end,size_t *len)

{
  uchar *puVar1;
  byte bVar2;
  byte *pbVar3;
  
  pbVar3 = *p;
  puVar1 = end + -(int)pbVar3;
  if ((int)puVar1 < 1) {
    return -0x60;
  }
  if ((char)*pbVar3 < '\0') {
    bVar2 = *pbVar3 & 0x7f;
    if (bVar2 == 2) {
      if ((int)puVar1 < 3) {
        return -0x60;
      }
      *len = (uint)(*(ushort *)(pbVar3 + 1) >> 8) | ((uint)*(ushort *)(pbVar3 + 1) & 0xff) << 8;
      puVar1 = *p + 3;
    }
    else {
      if (bVar2 < 3) {
        if (bVar2 != 1) {
          return -100;
        }
        if (puVar1 == (uchar *)0x1) {
          return -0x60;
        }
        *len = (uint)pbVar3[1];
        puVar1 = *p + 2;
      }
      else {
        if (bVar2 == 3) {
          if ((int)puVar1 < 4) {
            return -0x60;
          }
          *len = (uint)pbVar3[3] | (uint)pbVar3[1] << 0x10 | (uint)pbVar3[2] << 8;
          puVar1 = *p + 4;
        }
        else {
          if (bVar2 != 4) {
            return -100;
          }
          if ((int)puVar1 < 5) {
            return -0x60;
          }
          *len = (uint)pbVar3[3] << 8 |
                 (uint)pbVar3[1] << 0x18 | (uint)pbVar3[2] << 0x10 | (uint)pbVar3[4];
          puVar1 = *p + 5;
        }
      }
    }
    *p = puVar1;
  }
  else {
    *p = pbVar3 + 1;
    *len = (uint)*pbVar3;
  }
  if (end + -(int)*p < (uchar *)*len) {
    return -0x60;
  }
  return 0;
}



int mbedtls_asn1_get_tag(uchar **p,uchar *end,size_t *len,int tag)

{
  int iVar1;
  byte *pbVar2;
  
  pbVar2 = *p;
  if ((int)(end + -(int)pbVar2) < 1) {
    return -0x60;
  }
  if ((uint)*pbVar2 == tag) {
    *p = pbVar2 + 1;
    iVar1 = mbedtls_asn1_get_len(p,end,len);
    return iVar1;
  }
  return -0x62;
}



int mbedtls_asn1_get_bool(uchar **p,uchar *end,int *val)

{
  int iVar1;
  size_t sStack20;
  size_t len;
  
  iVar1 = mbedtls_asn1_get_tag(p,end,&sStack20,1);
  if (iVar1 == 0) {
    if (sStack20 == 1) {
      *val = (uint)(**p != '\0');
      *p = *p + 1;
    }
    else {
      iVar1 = -100;
    }
  }
  return iVar1;
}



int mbedtls_asn1_get_int(uchar **p,uchar *end,int *val)

{
  int iVar1;
  size_t sStack20;
  size_t len;
  
  iVar1 = mbedtls_asn1_get_tag(p,end,&sStack20,2);
  if (iVar1 == 0) {
    if ((sStack20 - 1 < 4) && (-1 < (char)**p)) {
      *val = 0;
      while (sStack20 != 0) {
        *val = *val << 8 | (uint)**p;
        *p = *p + 1;
        sStack20 = sStack20 - 1;
      }
    }
    else {
      iVar1 = -100;
    }
  }
  return iVar1;
}



int mbedtls_asn1_get_mpi(uchar **p,uchar *end,mbedtls_mpi *X)

{
  int iVar1;
  size_t local_14;
  size_t len;
  
