pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  iVar1 = mbedtls_asn1_get_tag(p,end,&local_14,2);
  if (iVar1 == 0) {
    iVar1 = mbedtls_mpi_read_binary(X,*p,local_14);
    *p = *p + local_14;
  }
  return iVar1;
}



int mbedtls_asn1_get_bitstring(uchar **p,uchar *end,mbedtls_asn1_bitstring *bs)

{
  byte bVar1;
  int iVar2;
  size_t sVar3;
  uchar *puVar4;
  
  iVar2 = mbedtls_asn1_get_tag(p,end,(size_t *)bs,3);
  if (iVar2 == 0) {
    if (bs->len == 0) {
      iVar2 = -0x60;
    }
    else {
      bs->len = bs->len - 1;
      bVar1 = **p;
      bs->unused_bits = bVar1;
      if (bVar1 < 8) {
        puVar4 = *p + 1;
        *p = puVar4;
        sVar3 = bs->len;
        bs->p = puVar4;
        *p = puVar4 + sVar3;
        if (puVar4 + sVar3 != end) {
          iVar2 = -0x66;
        }
      }
      else {
        iVar2 = -100;
      }
    }
  }
  return iVar2;
}



int mbedtls_asn1_get_bitstring_null(uchar **p,uchar *end,size_t *len)

{
  int iVar1;
  uint uVar2;
  uchar *puVar3;
  
  iVar1 = mbedtls_asn1_get_tag(p,end,len,3);
  if ((iVar1 == 0) &&
     ((uVar2 = *len, *len = uVar2 - 1, uVar2 < 2 || (puVar3 = *p, *p = puVar3 + 1, *puVar3 != '\0'))
     )) {
    iVar1 = -0x68;
  }
  return iVar1;
}



int mbedtls_asn1_get_sequence_of(uchar **p,uchar *end,mbedtls_asn1_sequence *cur,int tag)

{
  int iVar1;
  mbedtls_asn1_sequence *pmVar2;
  uchar *puVar3;
  size_t sStack36;
  size_t len;
  
  iVar1 = mbedtls_asn1_get_tag(p,end,&sStack36,0x30);
  if (iVar1 == 0) {
    if (end == *p + sStack36) {
      do {
        do {
          if (end <= *p) {
            cur->next = (mbedtls_asn1_sequence *)0x0;
            if (*p == end) {
              return 0;
            }
            goto LAB_23060ab6;
          }
          (cur->buf).tag = (uint)**p;
          iVar1 = mbedtls_asn1_get_tag(p,end,&(cur->buf).len,tag);
          if (iVar1 != 0) {
            return iVar1;
          }
          puVar3 = *p;
          (cur->buf).p = puVar3;
          puVar3 = puVar3 + (cur->buf).len;
          *p = puVar3;
        } while (end <= puVar3);
        pmVar2 = (mbedtls_asn1_sequence *)mycalloc(1,0x10);
        cur->next = pmVar2;
        cur = pmVar2;
      } while (pmVar2 != (mbedtls_asn1_sequence *)0x0);
      iVar1 = -0x6a;
    }
    else {
LAB_23060ab6:
      iVar1 = -0x66;
    }
  }
  return iVar1;
}



int mbedtls_asn1_get_alg(uchar **p,uchar *end,mbedtls_asn1_buf *alg,mbedtls_asn1_buf *params)

{
  int iVar1;
  int iVar2;
  uchar *puVar3;
  byte *pbVar4;
  mbedtls_asn1_buf *pmVar5;
  byte *end_00;
  size_t sStack36;
  size_t len;
  
  iVar1 = mbedtls_asn1_get_tag(p,end,&sStack36,0x30);
  if (iVar1 == 0) {
    iVar1 = -0x60;
    if (0 < (int)(end + -(int)*p)) {
      alg->tag = (uint)**p;
      end_00 = *p + sStack36;
      iVar2 = mbedtls_asn1_get_tag(p,end_00,&alg->len,6);
      iVar1 = iVar2;
      if (iVar2 == 0) {
        puVar3 = *p;
        alg->p = puVar3;
        pbVar4 = puVar3 + alg->len;
        *p = pbVar4;
        if (pbVar4 == end_00) {
          pmVar5 = params + 1;
          while (params != pmVar5) {
            *(undefined *)&params->tag = 0;
            params = (mbedtls_asn1_buf *)((int)&params->tag + 1);
          }
        }
        else {
          params->tag = (uint)*pbVar4;
          *p = *p + 1;
          iVar1 = mbedtls_asn1_get_len(p,end_00,&params->len);
          if (iVar1 == 0) {
            puVar3 = *p;
            params->p = puVar3;
            pbVar4 = puVar3 + params->len;
            *p = pbVar4;
            iVar1 = iVar2;
            if (pbVar4 != end_00) {
              iVar1 = -0x66;
            }
          }
        }
      }
    }
  }
  return iVar1;
}



void mpi_sub_hlp(size_t n,mbedtls_mpi_uint *s,mbedtls_mpi_uint *d)

{
  mbedtls_mpi_uint *pmVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  mbedtls_mpi_uint *pmVar5;
  uint uVar6;
  size_t sVar7;
  
  uVar4 = 0;
  sVar7 = 0;
  pmVar1 = d;
  while (sVar7 != n) {
    uVar3 = *pmVar1;
    pmVar5 = s + sVar7;
    sVar7 = sVar7 + 1;
    uVar2 = uVar3 - uVar4;
    *pmVar1 = uVar2;
    uVar6 = *pmVar5;
    *pmVar1 = uVar2 - uVar6;
    uVar4 = (uint)(uVar2 < uVar6) + (uint)(uVar3 < uVar4);
    pmVar1 = pmVar1 + 1;
  }
  pmVar1 = d + sVar7;
  while (uVar4 != 0) {
    uVar3 = *pmVar1;
    *pmVar1 = uVar3 - uVar4;
    uVar4 = (uint)(uVar3 < uVar4);
    pmVar1 = pmVar1 + 1;
  }
  return;
}



void mpi_mul_hlp(size_t i,mbedtls_mpi_uint *s,mbedtls_mpi_uint *d,mbedtls_mpi_uint b)

{
  size_t sVar1;
  uint uVar2;
  uint *puVar3;
  uint *puVar4;
  mbedtls_mpi_uint *pmVar5;
  uint uVar6;
  uint uVar7;
  mbedtls_mpi_uint mVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  mbedtls_mpi_uint *pmVar12;
  uint uVar13;
  
  uVar9 = 0;
  sVar1 = i;
  pmVar5 = d;
  pmVar12 = s;
  while (uVar11 = *pmVar5, 0xf < sVar1) {
    uVar10 = *pmVar12;
    sVar1 = sVar1 - 0x10;
    uVar6 = b * uVar10 + uVar9;
    uVar7 = uVar6 + uVar11;
    *pmVar5 = uVar7;
    uVar2 = pmVar12[1];
    uVar11 = (uint)(uVar7 < uVar11) +
             (int)((ulonglong)b * (ulonglong)uVar10 >> 0x20) + (uint)(uVar6 < uVar9);
    uVar6 = b * uVar2 + uVar11;
    uVar9 = pmVar5[1];
    uVar7 = uVar6 + uVar9;
    pmVar5[1] = uVar7;
    uVar9 = (uint)(uVar7 < uVar9) +
            (uint)(uVar6 < uVar11) + (int)((ulonglong)b * (ulonglong)uVar2 >> 0x20);
    uVar11 = pmVar12[2];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[2];
    uVar7 = uVar6 + uVar2;
    pmVar5[2] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[3];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[3];
    uVar7 = uVar6 + uVar11;
    pmVar5[3] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[4];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[4];
    uVar7 = uVar6 + uVar2;
    pmVar5[4] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[5];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[5];
    uVar7 = uVar6 + uVar11;
    pmVar5[5] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[6];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[6];
    uVar7 = uVar6 + uVar2;
    pmVar5[6] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[7];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[7];
    uVar7 = uVar6 + uVar11;
    pmVar5[7] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[8];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[8];
    uVar7 = uVar6 + uVar2;
    pmVar5[8] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[9];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[9];
    uVar7 = uVar6 + uVar11;
    pmVar5[9] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[10];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[10];
    uVar7 = uVar6 + uVar2;
    pmVar5[10] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[0xb];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[0xb];
    uVar7 = uVar6 + uVar11;
    pmVar5[0xb] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[0xc];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[0xc];
    uVar7 = uVar6 + uVar2;
    pmVar5[0xc] = uVar7;
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = pmVar12[0xd];
    uVar6 = b * uVar9 + uVar2;
    uVar11 = pmVar5[0xd];
    uVar7 = uVar6 + uVar11;
    pmVar5[0xd] = uVar7;
    uVar9 = (uint)(uVar7 < uVar11) +
            (uint)(uVar6 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar11 = pmVar12[0xe];
    uVar6 = b * uVar11 + uVar9;
    uVar2 = pmVar5[0xe];
    uVar7 = uVar6 + uVar2;
    pmVar5[0xe] = uVar7;
    uVar10 = pmVar12[0xf];
    uVar2 = (uint)(uVar7 < uVar2) +
            (uint)(uVar6 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar11 >> 0x20);
    uVar9 = b * uVar10 + uVar2;
    uVar6 = pmVar5[0xf];
    uVar11 = uVar9 + uVar6;
    pmVar5[0xf] = uVar11;
    uVar9 = (uint)(uVar11 < uVar6) +
            (uint)(uVar9 < uVar2) + (int)((ulonglong)b * (ulonglong)uVar10 >> 0x20);
    pmVar5 = pmVar5 + 0x10;
    pmVar12 = pmVar12 + 0x10;
  }
  puVar4 = s + (i & 0xfffffff0);
  d = d + (i & 0xfffffff0);
  uVar2 = i + (i >> 4) * -0x10;
  puVar3 = puVar4;
  pmVar5 = d;
  if (7 < uVar2) {
    uVar13 = *puVar4;
    uVar2 = uVar2 - 8;
    pmVar5 = d + 8;
    puVar3 = puVar4 + 8;
    uVar6 = b * uVar13 + uVar9;
    uVar7 = uVar6 + uVar11;
    *d = uVar7;
    uVar10 = puVar4[1];
    uVar13 = (uint)(uVar7 < uVar11) +
             (int)((ulonglong)b * (ulonglong)uVar13 >> 0x20) + (uint)(uVar6 < uVar9);
    uVar9 = b * uVar10 + uVar13;
    uVar7 = d[1];
    uVar11 = uVar9 + uVar7;
    d[1] = uVar11;
    uVar6 = puVar4[2];
    uVar7 = (uint)(uVar9 < uVar13) + (int)((ulonglong)b * (ulonglong)uVar10 >> 0x20) +
            (uint)(uVar11 < uVar7);
    uVar9 = b * uVar6 + uVar7;
    uVar10 = d[2];
    uVar11 = uVar9 + uVar10;
    d[2] = uVar11;
    uVar7 = (uint)(uVar11 < uVar10) +
            (int)((ulonglong)b * (ulonglong)uVar6 >> 0x20) + (uint)(uVar9 < uVar7);
    uVar9 = puVar4[3];
    uVar10 = b * uVar9 + uVar7;
    uVar11 = d[3];
    uVar13 = uVar10 + uVar11;
    d[3] = uVar13;
    uVar6 = puVar4[4];
    uVar9 = (uint)(uVar13 < uVar11) +
            (uint)(uVar10 < uVar7) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar10 = b * uVar6 + uVar9;
    uVar11 = d[4];
    uVar13 = uVar10 + uVar11;
    d[4] = uVar13;
    uVar7 = puVar4[5];
    uVar11 = (uint)(uVar13 < uVar11) +
             (uint)(uVar10 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar6 >> 0x20);
    uVar10 = b * uVar7 + uVar11;
    uVar6 = d[5];
    uVar13 = uVar10 + uVar6;
    d[5] = uVar13;
    uVar9 = puVar4[6];
    uVar7 = (uint)(uVar13 < uVar6) +
            (uint)(uVar10 < uVar11) + (int)((ulonglong)b * (ulonglong)uVar7 >> 0x20);
    uVar10 = b * uVar9 + uVar7;
    uVar11 = d[6];
    uVar13 = uVar10 + uVar11;
    d[6] = uVar13;
    uVar6 = puVar4[7];
    uVar9 = (uint)(uVar13 < uVar11) +
            (uint)(uVar10 < uVar7) + (int)((ulonglong)b * (ulonglong)uVar9 >> 0x20);
    uVar7 = b * uVar6 + uVar9;
    uVar11 = d[7];
    uVar10 = uVar7 + uVar11;
    d[7] = uVar10;
    uVar9 = (uint)(uVar10 < uVar11) +
            (uint)(uVar7 < uVar9) + (int)((ulonglong)b * (ulonglong)uVar6 >> 0x20);
  }
  puVar4 = puVar3;
  pmVar12 = pmVar5;
  while( true ) {
    uVar11 = *pmVar12;
    if (puVar4 == puVar3 + uVar2) break;
    uVar6 = *puVar4;
    uVar7 = b * uVar6 + uVar9;
    uVar10 = uVar7 + uVar11;
    *pmVar12 = uVar10;
    uVar9 = (uint)(uVar10 < uVar11) +
            (int)((ulonglong)b * (ulonglong)uVar6 >> 0x20) + (uint)(uVar7 < uVar9);
    puVar4 = puVar4 + 1;
    pmVar12 = pmVar12 + 1;
  }
  pmVar5 = pmVar5 + uVar2;
  while( true ) {
    mVar8 = *pmVar5;
    *pmVar5 = mVar8 + uVar9;
    if (uVar9 <= mVar8 + uVar9) break;
    uVar9 = 1;
    pmVar5 = pmVar5 + 1;
  }
  return;
}



