pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mbedtls_mpi_init(mbedtls_mpi *X)

{
  if (X != (mbedtls_mpi *)0x0) {
    X->s = 1;
    X->n = 0;
    X->p = (mbedtls_mpi_uint *)0x0;
  }
  return;
}



void mbedtls_mpi_free(mbedtls_mpi *X)

{
  size_t sVar1;
  mbedtls_mpi_uint *pmVar2;
  
  if (X != (mbedtls_mpi *)0x0) {
    pmVar2 = X->p;
    if (pmVar2 != (mbedtls_mpi_uint *)0x0) {
      sVar1 = X->n;
      while (sVar1 = sVar1 - 1, sVar1 != 0xffffffff) {
        *pmVar2 = 0;
        pmVar2 = pmVar2 + 1;
      }
      vPortFree(X->p);
    }
    X->s = 1;
    X->n = 0;
    X->p = (mbedtls_mpi_uint *)0x0;
    return;
  }
  return;
}



int mbedtls_mpi_grow(mbedtls_mpi *X,size_t nblimbs)

{
  mbedtls_mpi_uint *__dest;
  int iVar1;
  mbedtls_mpi_uint *pmVar2;
  size_t sVar3;
  
  if (10000 < nblimbs) {
    return -0x10;
  }
  iVar1 = 0;
  if (X->n < nblimbs) {
    __dest = (mbedtls_mpi_uint *)mycalloc(nblimbs,4);
    if (__dest == (mbedtls_mpi_uint *)0x0) {
      iVar1 = -0x10;
    }
    else {
      if (X->p != (mbedtls_mpi_uint *)0x0) {
        memcpy(__dest,X->p,X->n << 2);
        pmVar2 = X->p;
        sVar3 = X->n;
        while (sVar3 = sVar3 - 1, sVar3 != 0xffffffff) {
          *pmVar2 = 0;
          pmVar2 = pmVar2 + 1;
        }
        vPortFree(X->p);
      }
      X->n = nblimbs;
      X->p = __dest;
      iVar1 = 0;
    }
  }
  return iVar1;
}



int mbedtls_mpi_shrink(mbedtls_mpi *X,size_t nblimbs)

{
  uint uVar1;
  int iVar2;
  mbedtls_mpi_uint *__dest;
  mbedtls_mpi_uint *pmVar3;
  size_t sVar4;
  uint uVar5;
  
  uVar5 = X->n;
  if (X->n <= nblimbs) {
    iVar2 = mbedtls_mpi_grow(X,nblimbs);
    return iVar2;
  }
  do {
    uVar1 = uVar5;
    uVar5 = uVar1 - 1;
    if (uVar5 == 0) break;
  } while (X->p[uVar5] == 0);
  if (nblimbs < uVar1) {
    nblimbs = uVar1;
  }
  __dest = (mbedtls_mpi_uint *)mycalloc(nblimbs,4);
  iVar2 = -0x10;
  if (__dest != (mbedtls_mpi_uint *)0x0) {
    if (X->p != (mbedtls_mpi_uint *)0x0) {
      memcpy(__dest,X->p,nblimbs << 2);
      pmVar3 = X->p;
      sVar4 = X->n;
      while (sVar4 = sVar4 - 1, sVar4 != 0xffffffff) {
        *pmVar3 = 0;
        pmVar3 = pmVar3 + 1;
      }
      vPortFree(X->p);
    }
    X->n = nblimbs;
    X->p = __dest;
    iVar2 = 0;
  }
  return iVar2;
}



int mbedtls_mpi_copy(mbedtls_mpi *X,mbedtls_mpi *Y)

{
  int iVar1;
  size_t nblimbs;
  
  if (X != Y) {
    if (Y->p != (mbedtls_mpi_uint *)0x0) {
      nblimbs = Y->n;
      do {
        nblimbs = nblimbs;
        nblimbs = nblimbs - 1;
        if (nblimbs == 0) break;
      } while (Y->p[nblimbs] == 0);
      X->s = Y->s;
      iVar1 = mbedtls_mpi_grow(X,nblimbs);
      if (iVar1 != 0) {
        return iVar1;
      }
      memset(X->p,0,X->n << 2);
      memcpy(X->p,Y->p,nblimbs << 2);
      return 0;
    }
    mbedtls_mpi_free(X);
  }
  return 0;
}



int mbedtls_mpi_safe_cond_assign(mbedtls_mpi *X,mbedtls_mpi *Y,uchar assign)

{
  int iVar1;
  mbedtls_mpi_uint *pmVar2;
  uint uVar3;
  mbedtls_mpi_uint *pmVar4;
  int iVar5;
  uint uVar6;
  
  iVar1 = mbedtls_mpi_grow(X,Y->n);
  if (iVar1 == 0) {
    uVar3 = ((uint)assign | -(uint)assign & 0xff) >> 7;
    iVar5 = 1 - uVar3;
    X->s = iVar5 * X->s + uVar3 * Y->s;
    uVar6 = 0;
    while (uVar6 < Y->n) {
      pmVar2 = X->p + uVar6;
      pmVar4 = Y->p + uVar6;
      uVar6 = uVar6 + 1;
      *pmVar2 = uVar3 * *pmVar4 + iVar5 * *pmVar2;
    }
    while (uVar6 < X->n) {
      X->p[uVar6] = X->p[uVar6] * iVar5;
      uVar6 = uVar6 + 1;
    }
  }
  return iVar1;
}



int mbedtls_mpi_lset(mbedtls_mpi *X,mbedtls_mpi_sint z)

{
  int iVar1;
  int iVar2;
  
  iVar1 = mbedtls_mpi_grow(X,1);
  if (iVar1 == 0) {
    memset(X->p,0,X->n << 2);
    *X->p = (z >> 0x1f ^ z) - (z >> 0x1f);
    iVar2 = -1;
    if (-1 < z) {
      iVar2 = 1;
    }
    X->s = iVar2;
  }
  return iVar1;
}



int mbedtls_mpi_get_bit(mbedtls_mpi *X,size_t pos)

{
  if (pos < X->n << 5) {
    return X->p[pos >> 5] >> (pos & 0x1f) & 1;
  }
  return 0;
}



size_t mbedtls_mpi_lsb(mbedtls_mpi *X)

{
  int iVar1;
  size_t sVar2;
  uint uVar3;
  
  sVar2 = 0;
  iVar1 = 0;
  do {
    if (X->n == sVar2) {
      return 0;
    }
    uVar3 = 0;
    do {
      if ((X->p[sVar2] >> (uVar3 & 0x1f) & 1) != 0) {
        return iVar1 + uVar3;
      }
      uVar3 = uVar3 + 1;
    } while (uVar3 != 0x20);
    sVar2 = sVar2 + 1;
    iVar1 = iVar1 + uVar3;
  } while( true );
}



size_t mbedtls_mpi_bitlen(mbedtls_mpi *X)

{
  int iVar1;
  uint uVar2;
  size_t sVar3;
  size_t sVar4;
  
  sVar3 = X->n;
  if (sVar3 != 0) {
    do {
      sVar4 = sVar3;
      sVar3 = sVar4 - 1;
      if (sVar3 == 0) break;
    } while (X->p[sVar3] == 0);
    iVar1 = 0;
    uVar2 = 0x80000000;
    do {
      if ((X->p[sVar3] & uVar2) != 0) break;
      iVar1 = iVar1 + 1;
      uVar2 = uVar2 >> 1;
    } while (iVar1 != 0x20);
    sVar3 = sVar4 * 0x20 - iVar1;
  }
  return sVar3;
}



size_t mbedtls_mpi_size(mbedtls_mpi *X)

{
  size_t sVar1;
  
  sVar1 = mbedtls_mpi_bitlen(X);
  return sVar1 + 7 >> 3;
}



int mbedtls_mpi_read_binary(mbedtls_mpi *X,uchar *buf,size_t buflen)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uint *puVar4;
  uint uVar5;
  
  uVar2 = 0;
  while ((uVar2 != buflen && (buf[uVar2] == '\0'))) {
    uVar2 = uVar2 + 1;
  }
  iVar3 = mbedtls_mpi_grow(X,(uint)((buflen - uVar2 & 3) != 0) + (buflen - uVar2 >> 2));
  if (iVar3 == 0) {
    iVar3 = mbedtls_mpi_lset(X,0);
    uVar5 = 0;
    if (iVar3 == 0) {
      while (uVar2 < buflen) {
        buflen = buflen - 1;
        puVar4 = (uint *)((int)X->p + (uVar5 & 0xfffffffc));
        uVar1 = uVar5 & 3;
        uVar5 = uVar5 + 1;
        *puVar4 = *puVar4 | (uint)buf[buflen] << (uVar1 << 3);
      }
    }
  }
  return iVar3;
}



int mbedtls_mpi_write_binary(mbedtls_mpi *X,uchar *buf,size_t buflen)

{
  uint uVar1;
  size_t sVar2;
  int iVar3;
  uint uVar4;
  uint uVar5;
  
  sVar2 = mbedtls_mpi_size(X);
  if (buflen < sVar2) {
    iVar3 = -8;
  }
  else {
    memset(buf,0,buflen);
    buf = buf + buflen;
    uVar5 = 0;
    while (buf = buf + -1, uVar5 != sVar2) {
      uVar4 = uVar5 & 0xfffffffc;
      uVar1 = uVar5 & 3;
      uVar5 = uVar5 + 1;
      *buf = (uchar)(*(uint *)((int)X->p + uVar4) >> (uVar1 << 3));
    }
    iVar3 = 0;
  }
  return iVar3;
}



