pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_mpi_shift_l(mbedtls_mpi *X,size_t count)

{
  uint uVar1;
  size_t sVar2;
  uint uVar3;
  int iVar4;
  uint uVar5;
  uint uVar6;
  
  uVar1 = count >> 5;
  uVar6 = count & 0x1f;
  sVar2 = mbedtls_mpi_bitlen(X);
  uVar3 = sVar2 + count;
  if ((uVar3 <= X->n << 5) ||
     (iVar4 = mbedtls_mpi_grow(X,(uint)((uVar3 & 0x1f) != 0) + (uVar3 >> 5)), iVar4 == 0)) {
    if (0x1f < count) {
      uVar3 = X->n;
      iVar4 = uVar3 << 2;
      while (iVar4 = iVar4 + -4, uVar1 < uVar3) {
        uVar3 = uVar3 - 1;
        *(undefined4 *)((int)X->p + iVar4) = *(undefined4 *)((int)X->p + iVar4 + uVar1 * -4);
      }
      iVar4 = uVar3 << 2;
      while (iVar4 = iVar4 + -4, iVar4 != -4) {
        *(undefined4 *)((int)X->p + iVar4) = 0;
      }
    }
    if (uVar6 != 0) {
      uVar3 = 0;
      while (uVar1 < X->n) {
        uVar5 = X->p[uVar1];
        X->p[uVar1] = uVar5 << uVar6;
        X->p[uVar1] = X->p[uVar1] | uVar3;
        uVar3 = uVar5 >> (0x20 - uVar6 & 0x1f);
        uVar1 = uVar1 + 1;
      }
    }
    iVar4 = 0;
  }
  return iVar4;
}



int mbedtls_mpi_shift_r(mbedtls_mpi *X,size_t count)

{
  int iVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  size_t sVar5;
  mbedtls_mpi_uint *pmVar6;
  
  uVar3 = count >> 5;
  uVar4 = count & 0x1f;
  if (X->n < uVar3) {
LAB_230614f4:
    iVar1 = mbedtls_mpi_lset(X,0);
    return iVar1;
  }
  if (X->n == uVar3) {
    if (uVar4 != 0) goto LAB_230614f4;
    if (count < 0x20) {
      return 0;
    }
    uVar2 = 0;
  }
  else {
    if (count < 0x20) goto LAB_23061514;
    iVar1 = uVar3 << 2;
    uVar2 = 0;
    while (uVar2 < X->n - uVar3) {
      pmVar6 = (mbedtls_mpi_uint *)((int)X->p + iVar1);
      iVar1 = iVar1 + 4;
      X->p[uVar2] = *pmVar6;
      uVar2 = uVar2 + 1;
    }
  }
  while (uVar2 < X->n) {
    X->p[uVar2] = 0;
    uVar2 = uVar2 + 1;
  }
LAB_23061514:
  if (uVar4 != 0) {
    sVar5 = X->n;
    uVar3 = 0;
    while (sVar5 = sVar5 - 1, sVar5 != 0xffffffff) {
      uVar2 = X->p[sVar5];
      X->p[sVar5] = uVar2 >> uVar4;
      X->p[sVar5] = X->p[sVar5] | uVar3;
      uVar3 = uVar2 << (0x20 - uVar4 & 0x1f);
    }
  }
  return 0;
}



int mbedtls_mpi_cmp_abs(mbedtls_mpi *X,mbedtls_mpi *Y)

{
  uint uVar1;
  uint uVar2;
  
  uVar2 = X->n;
  while ((uVar2 != 0 && (X->p[uVar2 - 1] == 0))) {
    uVar2 = uVar2 - 1;
  }
  uVar1 = Y->n;
  while( true ) {
    if (uVar1 == 0) {
      return (uint)(uVar2 != 0);
    }
    if (Y->p[uVar1 - 1] != 0) break;
    uVar1 = uVar1 - 1;
  }
  if (uVar2 <= uVar1) {
    if (uVar2 < uVar1) {
      return -1;
    }
    while( true ) {
      uVar2 = uVar2 - 1;
      if (uVar2 == 0xffffffff) {
        return 0;
      }
      uVar1 = Y->p[uVar2];
      if (uVar1 < X->p[uVar2]) break;
      if (X->p[uVar2] < uVar1) {
        return -1;
      }
    }
    return 1;
  }
  return 1;
}



int mpi_montmul(mbedtls_mpi *A,mbedtls_mpi *B,mbedtls_mpi *N,mbedtls_mpi_uint mm,mbedtls_mpi *T)

{
  int iVar1;
  mbedtls_mpi_uint *d;
  mbedtls_mpi_uint mVar2;
  mbedtls_mpi_uint *s;
  mbedtls_mpi_uint mVar3;
  size_t n;
  uint i;
  uint i_00;
  mbedtls_mpi_uint b;
  
  if ((N->n + 1 <= T->n) && (T->p != (mbedtls_mpi_uint *)0x0)) {
    memset(T->p,0,T->n << 2);
    i = N->n;
    s = T->p;
    i_00 = B->n;
    if (i < B->n) {
      i_00 = i;
    }
    n = 0;
    d = s;
    while (n != i) {
      b = A->p[n];
      mVar3 = *B->p;
      mVar2 = *d;
      n = n + 1;
      mpi_mul_hlp(i_00,B->p,d,b);
      mpi_mul_hlp(i,N->p,d,(b * mVar3 + mVar2) * mm);
      *d = b;
      (d + 1)[i + 1] = 0;
      d = d + 1;
    }
    memcpy(A->p,s + i,(i + 1) * 4);
    iVar1 = mbedtls_mpi_cmp_abs(A,N);
    if (iVar1 < 0) {
      d = T->p;
      s = A->p;
    }
    else {
      s = N->p;
      d = A->p;
    }
    mpi_sub_hlp(n,s,d);
    return 0;
  }
  return -4;
}



int mbedtls_mpi_cmp_mpi(mbedtls_mpi *X,mbedtls_mpi *Y)

{
  int iVar1;
  uint uVar2;
  int iVar3;
  uint uVar4;
  
  uVar4 = X->n;
  while ((uVar4 != 0 && (X->p[uVar4 - 1] == 0))) {
    uVar4 = uVar4 - 1;
  }
  uVar2 = Y->n;
  do {
    if (uVar2 == 0) {
      if (uVar4 == 0) {
        return 0;
      }
LAB_23061736:
      return X->s;
    }
    if (Y->p[uVar2 - 1] != 0) {
      if (uVar4 <= uVar2) {
        iVar1 = Y->s;
        if (uVar4 < uVar2) {
          return -iVar1;
        }
        iVar3 = X->s;
        if (iVar3 < 1) {
          if ((0 < iVar1) && (iVar3 != 0)) {
            return -1;
          }
        }
        else {
          if (iVar1 < 0) {
            return 1;
          }
        }
        while( true ) {
          uVar4 = uVar4 - 1;
          if (uVar4 == 0xffffffff) {
            return 0;
          }
          uVar2 = Y->p[uVar4];
          if (uVar2 < X->p[uVar4]) break;
          if (X->p[uVar4] < uVar2) {
            return -iVar3;
          }
        }
        return iVar3;
      }
      goto LAB_23061736;
    }
    uVar2 = uVar2 - 1;
  } while( true );
}



int mbedtls_mpi_cmp_int(mbedtls_mpi *X,mbedtls_mpi_sint z)

{
  int iVar1;
  mbedtls_mpi_uint p [1];
  mbedtls_mpi Y;
  
  p = 1;
  if (z < 0) {
    p = 0xffffffff;
  }
  iVar1 = mbedtls_mpi_cmp_mpi(X,(mbedtls_mpi *)p);
  return iVar1;
}



int mbedtls_mpi_add_abs(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *B)

{
  size_t nblimbs;
  mbedtls_mpi *pmVar1;
  uint uVar2;
  int iVar3;
  mbedtls_mpi_uint *pmVar4;
  int iVar5;
  uint uVar6;
  mbedtls_mpi_uint *pmVar7;
  size_t sVar8;
  mbedtls_mpi_uint mVar9;
  uint uVar10;
  mbedtls_mpi_uint *pmVar11;
  
  pmVar1 = A;
  if (((X == B) || (pmVar1 = B, X == A)) || (iVar3 = mbedtls_mpi_copy(X,A), iVar3 == 0)) {
    X->s = 1;
    nblimbs = pmVar1->n;
    while ((nblimbs != 0 && (pmVar1->p[nblimbs - 1] == 0))) {
      nblimbs = nblimbs - 1;
    }
    iVar3 = mbedtls_mpi_grow(X,nblimbs);
    if (iVar3 == 0) {
      pmVar11 = X->p;
      pmVar4 = pmVar1->p;
      sVar8 = 0;
      uVar2 = 0;
      pmVar7 = pmVar11;
      while (nblimbs != sVar8) {
        uVar6 = pmVar4[sVar8];
        mVar9 = *pmVar7;
        sVar8 = sVar8 + 1;
        uVar10 = mVar9 + uVar2 + uVar6;
        *pmVar7 = uVar10;
        uVar2 = (uint)(mVar9 + uVar2 < uVar2) + (uint)(uVar10 < uVar6);
        pmVar7 = pmVar7 + 1;
      }
      pmVar7 = pmVar11 + nblimbs;
      while (uVar2 != 0) {
        if (X->n <= nblimbs) {
          iVar5 = mbedtls_mpi_grow(X,nblimbs + 1);
          if (iVar5 != 0) {
            return iVar5;
          }
          pmVar7 = X->p + nblimbs;
        }
        mVar9 = *pmVar7;
        *pmVar7 = mVar9 + uVar2;
        uVar2 = (uint)(mVar9 + uVar2 < uVar2);
        nblimbs = nblimbs + 1;
        pmVar7 = pmVar7 + 1;
      }
    }
  }
  return iVar3;
}



int mbedtls_mpi_sub_abs(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  size_t n;
  int iStack44;
  mbedtls_mpi TB;
  
  iVar1 = mbedtls_mpi_cmp_abs(A,B);
  if (iVar1 < 0) {
    return -10;
  }
  iStack44 = 1;
  TB.s = 0;
  TB.n = 0;
  if (B == X) {
    iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)&iStack44,B);
    if (iVar1 != 0) goto cleanup;
    B = (mbedtls_mpi *)&iStack44;
  }
  if ((A == X) || (iVar1 = mbedtls_mpi_copy(X,A), iVar1 == 0)) {
    X->s = 1;
    n = B->n;
    while ((n != 0 && (B->p[n - 1] == 0))) {
      n = n - 1;
    }
    iVar1 = 0;
    mpi_sub_hlp(n,B->p,X->p);
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)&iStack44);
  return iVar1;
}



int mbedtls_mpi_add_mpi(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  int iVar2;
  
  iVar1 = A->s;
  if (iVar1 * B->s < 0) {
    iVar2 = mbedtls_mpi_cmp_abs(A,B);
    if (iVar2 < 0) {
      iVar2 = mbedtls_mpi_sub_abs(X,B,A);
      iVar1 = -iVar1;
    }
    else {
      iVar2 = mbedtls_mpi_sub_abs(X,A,B);
    }
  }
  else {
    iVar2 = mbedtls_mpi_add_abs(X,A,B);
  }
  if (iVar2 == 0) {
    X->s = iVar1;
  }
  return iVar2;
}



int mbedtls_mpi_sub_mpi(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  int iVar2;
  
  iVar1 = A->s;
  if (iVar1 * B->s < 1) {
    iVar2 = mbedtls_mpi_add_abs(X,A,B);
  }
  else {
    iVar2 = mbedtls_mpi_cmp_abs(A,B);
    if (iVar2 < 0) {
      iVar2 = mbedtls_mpi_sub_abs(X,B,A);
      iVar1 = -iVar1;
    }
    else {
      iVar2 = mbedtls_mpi_sub_abs(X,A,B);
    }
  }
  if (iVar2 == 0) {
    X->s = iVar1;
  }
  return iVar2;
}



int mbedtls_mpi_sub_int(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi_sint b)

{
  int iVar1;
  mbedtls_mpi_uint p [1];
  mbedtls_mpi _B;
  
