pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  p = 1;
  if (b < 0) {
    p = 0xffffffff;
  }
  iVar1 = mbedtls_mpi_sub_mpi(X,A,(mbedtls_mpi *)p);
  return iVar1;
}



// WARNING: Variable defined which should be unmapped: TB

int mbedtls_mpi_mul_mpi(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  size_t sVar2;
  size_t i;
  int local_38;
  mbedtls_mpi TA;
  mbedtls_mpi TB;
  
  local_38 = 1;
  TA.s = 0;
  TA.n = 0;
  TA.p = (mbedtls_mpi_uint *)0x1;
  if (X == A) {
    iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)&local_38,A);
    A = (mbedtls_mpi *)&local_38;
    if (iVar1 != 0) goto cleanup;
  }
  if (X == B) {
    iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)&TA.p,X);
    if (iVar1 != 0) goto cleanup;
    B = (mbedtls_mpi *)&TA.p;
  }
  i = A->n;
  while ((i != 0 && (A->p[i - 1] == 0))) {
    i = i - 1;
  }
  sVar2 = B->n;
  while ((sVar2 != 0 && (B->p[sVar2 - 1] == 0))) {
    sVar2 = sVar2 - 1;
  }
  iVar1 = mbedtls_mpi_grow(X,i + sVar2);
  if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_lset(X,0), iVar1 == 0)) {
    while (sVar2 = sVar2 - 1, sVar2 != 0xffffffff) {
      mpi_mul_hlp(i,A->p,X->p + sVar2,B->p[sVar2]);
    }
    X->s = A->s * B->s;
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)&TA.p);
  mbedtls_mpi_free((mbedtls_mpi *)&local_38);
  return iVar1;
}



int mbedtls_mpi_mul_int(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi_uint b)

{
  int iVar1;
  mbedtls_mpi_uint p [1];
  mbedtls_mpi _B;
  
  p = 1;
  iVar1 = mbedtls_mpi_mul_mpi(X,A,(mbedtls_mpi *)p);
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mbedtls_mpi_div_mpi(mbedtls_mpi *Q,mbedtls_mpi *R,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  int iVar2;
  int iVar3;
  size_t count;
  int iVar4;
  undefined4 uVar5;
  uint uVar6;
  uint uVar7;
  undefined4 uVar8;
  int *piVar9;
  size_t count_00;
  uint uVar10;
  int iVar11;
  uint uVar12;
  undefined4 *puVar13;
  int iStack124;
  mbedtls_mpi X;
  mbedtls_mpi Y;
  mbedtls_mpi Z;
  mbedtls_mpi T1;
  mbedtls_mpi T2;
  
  iVar3 = mbedtls_mpi_cmp_int(B,0);
  if (iVar3 == 0) {
    return -0xc;
  }
  iStack124 = 1;
  X.s = 0;
  X.n = 0;
  X.p = (mbedtls_mpi_uint *)0x1;
  Y.s = 0;
  Y.n = 0;
  Y.p = (mbedtls_mpi_uint *)0x1;
  Z.s = 0;
  Z.n = 0;
  Z.p = (mbedtls_mpi_uint *)0x1;
  T1.s = 0;
  T1.n = 0;
  T1.p = (mbedtls_mpi_uint *)0x1;
  iVar3 = mbedtls_mpi_cmp_abs(A,B);
  if (iVar3 < 0) {
    if (((Q == (mbedtls_mpi *)0x0) || (iVar3 = mbedtls_mpi_lset(Q,0), iVar3 == 0)) &&
       ((R == (mbedtls_mpi *)0x0 || (iVar3 = mbedtls_mpi_copy(R,A), iVar3 == 0)))) {
      return 0;
    }
  }
  else {
    iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&iStack124,A);
    if ((iVar3 == 0) && (iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&X.p,B), iVar3 == 0)) {
      X.p = (mbedtls_mpi_uint *)0x1;
      iStack124 = 1;
      iVar3 = mbedtls_mpi_grow((mbedtls_mpi *)&Y.p,A->n + 2);
      if ((iVar3 == 0) &&
         (((iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&Y.p,0), iVar3 == 0 &&
           (iVar3 = mbedtls_mpi_grow((mbedtls_mpi *)&Z.p,2), iVar3 == 0)) &&
          (iVar3 = mbedtls_mpi_grow((mbedtls_mpi *)&T1.p,3), iVar3 == 0)))) {
        count = mbedtls_mpi_bitlen((mbedtls_mpi *)&X.p);
        if ((count & 0x1f) == 0x1f) {
          count = 0;
        }
        else {
          count = 0x1f - (count & 0x1f);
          iVar3 = mbedtls_mpi_shift_l((mbedtls_mpi *)&iStack124,count);
          if ((iVar3 != 0) || (iVar3 = mbedtls_mpi_shift_l((mbedtls_mpi *)&X.p,count), iVar3 != 0))
          goto cleanup;
        }
        iVar4 = Y.s;
        uVar10 = X.s;
        iVar1 = X.s - Y.s;
        count_00 = iVar1 * 0x20;
        iVar3 = mbedtls_mpi_shift_l((mbedtls_mpi *)&X.p,count_00);
        while (iVar3 == 0) {
          iVar3 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&iStack124,(mbedtls_mpi *)&X.p);
          if (iVar3 < 0) {
            iVar1 = mbedtls_mpi_shift_r((mbedtls_mpi *)&X.p,count_00);
            iVar3 = iVar1;
            if (iVar1 == 0) {
              uVar12 = iVar4 - 1;
              iVar2 = ((uVar10 + 0x3fffffff) - iVar4) * 4;
              goto LAB_23061c8a;
            }
            break;
          }
          piVar9 = (int *)(Z.n + iVar1 * 4);
          *piVar9 = *piVar9 + 1;
          iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&iStack124,(mbedtls_mpi *)&iStack124,
                                      (mbedtls_mpi *)&X.p);
        }
      }
    }
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)&iStack124);
  mbedtls_mpi_free((mbedtls_mpi *)&X.p);
  mbedtls_mpi_free((mbedtls_mpi *)&Y.p);
  mbedtls_mpi_free((mbedtls_mpi *)&Z.p);
  mbedtls_mpi_free((mbedtls_mpi *)&T1.p);
  return iVar3;
LAB_23061c8a:
  uVar10 = uVar10 - 1;
  if (uVar10 <= uVar12) goto code_r0x23061c8e;
  iVar11 = uVar10 * 4;
  uVar6 = *(uint *)(X.n + iVar11);
  uVar7 = *(uint *)(Y.n + uVar12 * 4);
  puVar13 = (undefined4 *)(Z.n + iVar2);
  if (uVar6 < uVar7) {
    uVar5 = *(undefined4 *)(X.n + iVar11 + -4);
    uVar8 = 0xffffffff;
    if ((uVar7 != 0) && (__udivdi3(), uVar8 = uVar5, uVar6 != 0)) {
      uVar8 = 0xffffffff;
    }
    *puVar13 = uVar8;
  }
  else {
    *puVar13 = 0xffffffff;
  }
  *(int *)(Z.n + iVar2) = *(int *)(Z.n + iVar2) + 1;
  do {
    *(int *)(Z.n + iVar2) = *(int *)(Z.n + iVar2) + -1;
    iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&Z.p,0);
    if (iVar3 != 0) goto cleanup;
    uVar8 = 0;
    if (uVar12 != 0) {
      uVar8 = *(undefined4 *)(Y.n + iVar4 * 4 + -8);
    }
    *(undefined4 *)T1.n = uVar8;
    *(undefined4 *)(T1.n + 4) = *(undefined4 *)(Y.n + uVar12 * 4);
    iVar3 = mbedtls_mpi_mul_int((mbedtls_mpi *)&Z.p,(mbedtls_mpi *)&Z.p,
                                *(mbedtls_mpi_uint *)(Z.n + iVar2));
    if ((iVar3 != 0) || (iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&T1.p,0), iVar3 != 0))
    goto cleanup;
    ___EM_SIZE = 0;
    if (uVar10 != 1) {
      ___EM_SIZE = *(undefined4 *)(X.n + iVar11 + -8);
    }
    _DAT_00000004 = *(undefined4 *)(X.n + iVar11 + -4);
    _DAT_00000008 = *(mbedtls_mpi_uint *)(X.n + iVar11);
    iVar3 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&Z.p,(mbedtls_mpi *)&T1.p);
  } while (0 < iVar3);
  iVar3 = mbedtls_mpi_mul_int((mbedtls_mpi *)&Z.p,(mbedtls_mpi *)&X.p,
                              *(mbedtls_mpi_uint *)(Z.n + iVar2));
  if (iVar3 != 0) goto cleanup;
  iVar3 = mbedtls_mpi_shift_l((mbedtls_mpi *)&Z.p,iVar2 << 3);
  if ((iVar3 != 0) ||
     (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&iStack124,(mbedtls_mpi *)&iStack124,
                                  (mbedtls_mpi *)&Z.p), iVar3 != 0)) goto cleanup;
  iVar3 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&iStack124,0);
  if (iVar3 < 0) {
    iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&Z.p,(mbedtls_mpi *)&X.p);
    if (((iVar3 != 0) || (iVar3 = mbedtls_mpi_shift_l((mbedtls_mpi *)&Z.p,iVar2 << 3), iVar3 != 0))
       || (iVar3 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&iStack124,(mbedtls_mpi *)&iStack124,
                                       (mbedtls_mpi *)&Z.p), iVar3 != 0)) goto cleanup;
    *(int *)(Z.n + iVar2) = *(int *)(Z.n + iVar2) + -1;
  }
  iVar2 = iVar2 + -4;
  goto LAB_23061c8a;
code_r0x23061c8e:
  if (Q != (mbedtls_mpi *)0x0) {
    iVar3 = mbedtls_mpi_copy(Q,(mbedtls_mpi *)&Y.p);
    if (iVar3 != 0) goto cleanup;
    Q->s = A->s * B->s;
  }
  iVar3 = iVar1;
  if ((R != (mbedtls_mpi *)0x0) &&
     (iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&iStack124,count), iVar3 == 0)) {
    iStack124 = A->s;
    iVar3 = mbedtls_mpi_copy(R,(mbedtls_mpi *)&iStack124);
    if ((iVar3 == 0) && (iVar4 = mbedtls_mpi_cmp_int(R,0), iVar3 = iVar1, iVar4 == 0)) {
      R->s = 1;
      iVar3 = 0;
    }
  }
  goto cleanup;
}



int mbedtls_mpi_mod_mpi(mbedtls_mpi *R,mbedtls_mpi *A,mbedtls_mpi *B)

{
  int iVar1;
  int iVar2;
  
  iVar1 = mbedtls_mpi_cmp_int(B,0);
  if (iVar1 < 0) {
    return -10;
  }
  iVar2 = mbedtls_mpi_div_mpi((mbedtls_mpi *)0x0,R,A,B);
  iVar1 = iVar2;
  while( true ) {
    if (iVar1 != 0) {
      return iVar1;
    }
    iVar1 = mbedtls_mpi_cmp_int(R,0);
    if (-1 < iVar1) break;
    iVar1 = mbedtls_mpi_add_mpi(R,R,B);
  }
  do {
    iVar1 = mbedtls_mpi_cmp_mpi(R,B);
    if (iVar1 < 0) {
      return iVar2;
    }
    iVar1 = mbedtls_mpi_sub_mpi(R,R,B);
  } while (iVar1 == 0);
  return iVar1;
}



int mbedtls_mpi_exp_mod(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *E,mbedtls_mpi *N,mbedtls_mpi *_RR
                       )

{
  uint uVar1;
  mbedtls_mpi_uint mm;
  int iVar2;
  size_t nblimbs;
  mbedtls_mpi *X_00;
  mbedtls_mpi *X_01;
  uint uVar3;
  int iVar4;
  int iVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint uVar9;
  size_t sVar10;
  mbedtls_mpi_uint mStack1652;
  mbedtls_mpi_uint z;
  mbedtls_mpi RR;
  mbedtls_mpi T;
  mbedtls_mpi Apos;
  mbedtls_mpi U;
  mbedtls_mpi W [128];
  
