pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  iVar2 = mbedtls_mpi_cmp_int(N,0);
  if (iVar2 < 0) {
    return -4;
  }
  uVar6 = *N->p;
  uVar9 = uVar6 & 1;
  if (uVar9 == 0) {
    return -4;
  }
  iVar2 = mbedtls_mpi_cmp_int(E,0);
  if (iVar2 < 0) {
    return -4;
  }
  iVar2 = ((uVar6 + 2) * 2 & 8) + uVar6;
  iVar4 = 3;
  do {
    iVar4 = iVar4 + -1;
    iVar2 = iVar2 * (2 - uVar6 * iVar2);
  } while (iVar4 != 0);
  z = 1;
  RR.p = (mbedtls_mpi_uint *)0x1;
  T.p = (mbedtls_mpi_uint *)0x1;
  RR.s = 0;
  RR.n = 0;
  T.s = 0;
  T.n = 0;
  Apos.s = 0;
  Apos.n = 0;
  memset(&U.p,0,0x600);
  nblimbs = mbedtls_mpi_bitlen(E);
  uVar6 = 6;
  if ((((nblimbs < 0x2a0) && (uVar6 = 5, nblimbs < 0xf0)) && (uVar6 = 4, nblimbs < 0x50)) &&
     (uVar6 = 3, nblimbs < 0x18)) {
    uVar6 = uVar9;
  }
  nblimbs = N->n + 1;
  iVar4 = mbedtls_mpi_grow(X,nblimbs);
  if (((iVar4 != 0) || (iVar4 = mbedtls_mpi_grow((mbedtls_mpi *)&W[0].p,nblimbs), iVar4 != 0)) ||
     (iVar4 = mbedtls_mpi_grow((mbedtls_mpi *)&RR.p,nblimbs * 2), iVar4 != 0)) goto cleanup;
  iVar5 = A->s;
  if (iVar5 == -1) {
    iVar4 = mbedtls_mpi_copy((mbedtls_mpi *)&T.p,A);
    if (iVar4 != 0) goto cleanup;
    T.p = (mbedtls_mpi_uint *)0x1;
    A = (mbedtls_mpi *)&T.p;
  }
  if ((_RR == (mbedtls_mpi *)0x0) || (_RR->p == (mbedtls_mpi_uint *)0x0)) {
    iVar4 = mbedtls_mpi_lset((mbedtls_mpi *)&z,1);
    if ((iVar4 != 0) ||
       ((iVar4 = mbedtls_mpi_shift_l((mbedtls_mpi *)&z,N->n << 6), iVar4 != 0 ||
        (iVar4 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&z,(mbedtls_mpi *)&z,N), iVar4 != 0))))
    goto cleanup;
    if (_RR != (mbedtls_mpi *)0x0) {
      X_00 = _RR;
      X_01 = (mbedtls_mpi *)&z;
      goto LAB_23062022;
    }
  }
  else {
    X_00 = (mbedtls_mpi *)&z;
    X_01 = _RR;
LAB_23062022:
    memcpy(X_00,X_01,0xc);
  }
  iVar4 = mbedtls_mpi_cmp_mpi(A,N);
  if (iVar4 < 0) {
    iVar4 = mbedtls_mpi_copy((mbedtls_mpi *)&W[0].p,A);
  }
  else {
    iVar4 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&W[0].p,A,N);
  }
  if (iVar4 == 0) {
    mm = -iVar2;
    iVar4 = mpi_montmul((mbedtls_mpi *)&W[0].p,(mbedtls_mpi *)&z,N,mm,(mbedtls_mpi *)&RR.p);
    if ((iVar4 == 0) && (iVar4 = mbedtls_mpi_copy(X,(mbedtls_mpi *)&z), iVar4 == 0)) {
      U.n = (size_t)&mStack1652;
      mStack1652 = 1;
      Apos.p = (mbedtls_mpi_uint *)0x1;
      U.s = 1;
      iVar4 = mpi_montmul(X,(mbedtls_mpi *)&Apos.p,N,mm,(mbedtls_mpi *)&RR.p);
      if (iVar4 == 0) {
        if (uVar6 == 1) {
LAB_2306208c:
          nblimbs = E->n;
          uVar7 = 0;
          uVar1 = 0;
          do {
            sVar10 = 0;
            uVar8 = 0;
LAB_23062182:
            do {
              if (uVar7 == 0) {
                if (nblimbs == 0) {
                  goto LAB_23062190;
                }
                nblimbs = nblimbs - 1;
                uVar7 = 0x20;
              }
              uVar7 = uVar7 - 1;
              uVar3 = E->p[nblimbs] >> (uVar7 & 0x1f) & 1;
              if (uVar3 == 0) {
                if (uVar1 == 0) goto LAB_23062182;
                if (uVar1 == 1) {
                  iVar4 = mpi_montmul(X,X,N,mm,(mbedtls_mpi *)&RR.p);
                  if (iVar4 != 0) goto cleanup;
                  goto LAB_23062182;
                }
              }
              sVar10 = sVar10 + 1;
              uVar8 = uVar8 | uVar3 << (uVar6 - sVar10 & 0x1f);
              uVar1 = 2;
            } while (uVar6 != sVar10);
            uVar1 = 0;
            do {
              iVar4 = mpi_montmul(X,X,N,mm,(mbedtls_mpi *)&RR.p);
              if (iVar4 != 0) goto cleanup;
              uVar1 = uVar1 + 1;
            } while (uVar1 < sVar10);
            iVar4 = mpi_montmul(X,(mbedtls_mpi *)&(&U)[uVar8].p,N,mm,(mbedtls_mpi *)&RR.p);
            uVar1 = uVar9;
          } while (iVar4 == 0);
        }
        else {
          uVar7 = uVar6 - 1;
          X_00 = (mbedtls_mpi *)((int)&U.p + (0xc << (uVar7 & 0x1f)));
          iVar4 = mbedtls_mpi_grow(X_00,N->n + 1);
          uVar1 = 1 << (uVar7 & 0x1f);
          if ((iVar4 == 0) && (iVar4 = mbedtls_mpi_copy(X_00,(mbedtls_mpi *)&W[0].p), iVar4 == 0)) {
            uVar8 = 0;
            do {
              iVar4 = mpi_montmul(X_00,X_00,N,mm,(mbedtls_mpi *)&RR.p);
              if (iVar4 != 0) goto cleanup;
              uVar8 = uVar8 + 1;
            } while (uVar8 < uVar7);
            do {
              uVar1 = uVar1 + 1;
              if ((uint)(1 << uVar6) <= uVar1) goto LAB_2306208c;
              X_01 = X_00 + 1;
              iVar4 = mbedtls_mpi_grow(X_01,N->n + 1);
            } while (((iVar4 == 0) && (iVar4 = mbedtls_mpi_copy(X_01,X_00), iVar4 == 0)) &&
                    (iVar4 = mpi_montmul(X_01,(mbedtls_mpi *)&W[0].p,N,mm,(mbedtls_mpi *)&RR.p),
                    X_00 = X_01, iVar4 == 0));
          }
        }
      }
    }
  }
cleanup:
  uVar9 = 1 << (uVar6 - 1 & 0x1f);
  while (uVar9 < (uint)(1 << uVar6)) {
    mbedtls_mpi_free((mbedtls_mpi *)&(&U)[uVar9].p);
    uVar9 = uVar9 + 1;
  }
  mbedtls_mpi_free((mbedtls_mpi *)&W[0].p);
  mbedtls_mpi_free((mbedtls_mpi *)&RR.p);
  mbedtls_mpi_free((mbedtls_mpi *)&T.p);
  if ((_RR == (mbedtls_mpi *)0x0) || (_RR->p == (mbedtls_mpi_uint *)0x0)) {
    mbedtls_mpi_free((mbedtls_mpi *)&z);
  }
  return iVar4;
LAB_23062190:
  if (nblimbs == sVar10) goto code_r0x23062194;
  iVar4 = mpi_montmul(X,X,N,mm,(mbedtls_mpi *)&RR.p);
  if ((iVar4 != 0) ||
     ((uVar8 = uVar8 << 1, (1 << uVar6 & uVar8) != 0 &&
      (iVar4 = mpi_montmul(X,(mbedtls_mpi *)&W[0].p,N,mm,(mbedtls_mpi *)&RR.p), iVar4 != 0))))
  goto cleanup;
  nblimbs = nblimbs + 1;
  goto LAB_23062190;
code_r0x23062194:
  mStack1652 = 1;
  Apos.p = (mbedtls_mpi_uint *)0x1;
  U.s = 1;
  U.n = (size_t)&mStack1652;
  iVar4 = mpi_montmul(X,(mbedtls_mpi *)&Apos.p,N,mm,(mbedtls_mpi *)&RR.p);
  if ((iVar4 == 0) && (iVar5 == -1)) {
    X->s = -1;
    iVar4 = mbedtls_mpi_add_mpi(X,N,X);
  }
  goto cleanup;
}



// WARNING: Variable defined which should be unmapped: TB

