pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_mpi_gcd(mbedtls_mpi *G,mbedtls_mpi *A,mbedtls_mpi *B)

{
  mbedtls_mpi *pmVar1;
  int iVar2;
  size_t count;
  size_t count_00;
  int iStack52;
  mbedtls_mpi TG;
  mbedtls_mpi TA;
  mbedtls_mpi TB;
  
  iStack52 = 1;
  TG.s = 0;
  TG.n = 0;
  TG.p = (mbedtls_mpi_uint *)0x1;
  TA.s = 0;
  TA.n = 0;
  TA.p = (mbedtls_mpi_uint *)0x1;
  iVar2 = mbedtls_mpi_copy((mbedtls_mpi *)&TG.p,A);
  if ((iVar2 == 0) && (iVar2 = mbedtls_mpi_copy((mbedtls_mpi *)&TA.p,B), iVar2 == 0)) {
    count = mbedtls_mpi_lsb((mbedtls_mpi *)&TG.p);
    count_00 = mbedtls_mpi_lsb((mbedtls_mpi *)&TA.p);
    if (count_00 < count) {
      count = count_00;
    }
    iVar2 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TG.p,count);
    if ((iVar2 == 0) && (iVar2 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TA.p,count), iVar2 == 0)) {
      TA.p = (mbedtls_mpi_uint *)0x1;
      TG.p = (mbedtls_mpi_uint *)0x1;
      do {
        iVar2 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&TG.p,0);
        if (iVar2 == 0) {
          iVar2 = mbedtls_mpi_shift_l((mbedtls_mpi *)&TA.p,count);
          if (iVar2 == 0) {
            iVar2 = mbedtls_mpi_copy(G,(mbedtls_mpi *)&TA.p);
          }
          break;
        }
        count_00 = mbedtls_mpi_lsb((mbedtls_mpi *)&TG.p);
        iVar2 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TG.p,count_00);
        if (iVar2 != 0) break;
        count_00 = mbedtls_mpi_lsb((mbedtls_mpi *)&TA.p);
        iVar2 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TA.p,count_00);
        if (iVar2 != 0) break;
        iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&TG.p,(mbedtls_mpi *)&TA.p);
        if (iVar2 < 0) {
          iVar2 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&TA.p,(mbedtls_mpi *)&TA.p,(mbedtls_mpi *)&TG.p
                                     );
          if (iVar2 != 0) break;
          pmVar1 = &TA;
        }
        else {
          iVar2 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&TG.p,(mbedtls_mpi *)&TG.p,(mbedtls_mpi *)&TA.p
                                     );
          if (iVar2 != 0) break;
          pmVar1 = &TG;
        }
        iVar2 = mbedtls_mpi_shift_r((mbedtls_mpi *)&pmVar1->p,1);
      } while (iVar2 == 0);
    }
  }
  mbedtls_mpi_free((mbedtls_mpi *)&iStack52);
  mbedtls_mpi_free((mbedtls_mpi *)&TG.p);
  mbedtls_mpi_free((mbedtls_mpi *)&TA.p);
  return iVar2;
}



int mbedtls_mpi_fill_random
              (mbedtls_mpi *X,size_t size,anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng
              )

{
  int iVar1;
  uchar auStack1040 [4];
  uchar buf [1024];
  
  if (size < 0x401) {
    iVar1 = (*f_rng)(p_rng,auStack1040,size);
    if (iVar1 == 0) {
      iVar1 = mbedtls_mpi_read_binary(X,auStack1040,size);
    }
    return iVar1;
  }
  return -4;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int mbedtls_mpi_inv_mod(mbedtls_mpi *X,mbedtls_mpi *A,mbedtls_mpi *N)

{
  mbedtls_mpi *pmVar1;
  mbedtls_mpi *pmVar2;
  int iVar3;
  int iVar4;
  int iStack140;
  mbedtls_mpi G;
  mbedtls_mpi TA;
  mbedtls_mpi TU;
  mbedtls_mpi U1;
  mbedtls_mpi U2;
  mbedtls_mpi TB;
  mbedtls_mpi TV;
  mbedtls_mpi V1;
  mbedtls_mpi V2;
  
  iVar3 = mbedtls_mpi_cmp_int(N,0);
  if (iVar3 < 1) {
    return -4;
  }
  G.p = (mbedtls_mpi_uint *)0x1;
  TA.s = 0;
  TA.n = 0;
  TA.p = (mbedtls_mpi_uint *)0x1;
  TU.s = 0;
  TU.n = 0;
  TU.p = (mbedtls_mpi_uint *)0x1;
  U1.s = 0;
  U1.n = 0;
  U1.p = (mbedtls_mpi_uint *)0x1;
  U2.s = 0;
  U2.n = 0;
  iStack140 = 1;
  G.s = 0;
  G.n = 0;
  U2.p = (mbedtls_mpi_uint *)0x1;
  TB.s = 0;
  TB.n = 0;
  TB.p = (mbedtls_mpi_uint *)0x1;
  TV.s = 0;
  TV.n = 0;
  TV.p = (mbedtls_mpi_uint *)0x1;
  V1.s = 0;
  V1.n = 0;
  V1.p = (mbedtls_mpi_uint *)0x1;
  iVar3 = mbedtls_mpi_gcd((mbedtls_mpi *)&iStack140,A,N);
  if (iVar3 == 0) {
    iVar4 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&iStack140,1);
    iVar3 = -0xe;
    if (((((iVar4 == 0) && (iVar3 = mbedtls_mpi_mod_mpi((mbedtls_mpi *)&G.p,A,N), iVar3 == 0)) &&
         (iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&TA.p,(mbedtls_mpi *)&G.p), iVar3 == 0)) &&
        ((iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&U2.p,N), iVar3 == 0 &&
         (iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&TB.p,N), iVar3 == 0)))) &&
       ((iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&TU.p,1), iVar3 == 0 &&
        ((iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&U1.p,0), iVar3 == 0 &&
         (iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&TV.p,0), iVar3 == 0)))))) {
      iVar3 = mbedtls_mpi_lset((mbedtls_mpi *)&V1.p,1);
      while (iVar3 == 0) {
        while ((*(uint *)TU.n & 1) != 0) {
          while ((*(uint *)TV.n & 1) == 0) {
            iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TB.p,1);
            if ((iVar3 != 0) ||
               (((((*(uint *)V1.n & 1) != 0 || ((___EM_SIZE & 1) != 0)) &&
                 ((iVar3 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&TV.p,(mbedtls_mpi *)&TV.p,
                                               (mbedtls_mpi *)&U2.p), iVar3 != 0 ||
                  (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&V1.p,(mbedtls_mpi *)&V1.p,
                                               (mbedtls_mpi *)&G.p), iVar3 != 0)))) ||
                ((iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TV.p,1), iVar3 != 0 ||
                 (iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&V1.p,1), iVar3 != 0))))))
            goto cleanup;
          }
          iVar3 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&TA.p,(mbedtls_mpi *)&TB.p);
          if (iVar3 < 0) {
            iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&TB.p,(mbedtls_mpi *)&TB.p,
                                        (mbedtls_mpi *)&TA.p);
            if ((iVar3 != 0) ||
               (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&TV.p,(mbedtls_mpi *)&TV.p,
                                            (mbedtls_mpi *)&TU.p), iVar3 != 0)) goto cleanup;
            pmVar1 = &U1;
            pmVar2 = &V1;
          }
          else {
            iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&TA.p,(mbedtls_mpi *)&TA.p,
                                        (mbedtls_mpi *)&TB.p);
            if ((iVar3 != 0) ||
               (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&TU.p,(mbedtls_mpi *)&TU.p,
                                            (mbedtls_mpi *)&TV.p), iVar3 != 0)) goto cleanup;
            pmVar1 = &V1;
            pmVar2 = &U1;
          }
          iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&pmVar2->p,(mbedtls_mpi *)&pmVar2->p,
                                      (mbedtls_mpi *)&pmVar1->p);
          if (iVar3 != 0) goto cleanup;
          iVar3 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&TA.p,0);
          if (iVar3 == 0) goto LAB_23062556;
        }
        iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TA.p,1);
        if (((iVar3 != 0) ||
            ((((*(uint *)U1.n & 1) != 0 || ((*(uint *)U2.n & 1) != 0)) &&
             ((iVar3 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&TU.p,(mbedtls_mpi *)&TU.p,
                                           (mbedtls_mpi *)&U2.p), iVar3 != 0 ||
              (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&U1.p,(mbedtls_mpi *)&U1.p,
                                           (mbedtls_mpi *)&G.p), iVar3 != 0)))))) ||
           (iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&TU.p,1), iVar3 != 0)) break;
        iVar3 = mbedtls_mpi_shift_r((mbedtls_mpi *)&U1.p,1);
      }
    }
  }
  goto cleanup;
  while (iVar3 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&TV.p,(mbedtls_mpi *)&TV.p,N), iVar3 == 0) {
LAB_23062556:
    iVar3 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&TV.p,0);
    if (-1 < iVar3) goto LAB_23062562;
  }
  goto cleanup;
  while (iVar3 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&TV.p,(mbedtls_mpi *)&TV.p,N), iVar3 == 0) {
LAB_23062562:
    iVar3 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&TV.p,N);
    if (iVar3 < 0) {
      iVar3 = mbedtls_mpi_copy(X,(mbedtls_mpi *)&TV.p);
      break;
    }
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)&G.p);
  mbedtls_mpi_free((mbedtls_mpi *)&TA.p);
  mbedtls_mpi_free((mbedtls_mpi *)&TU.p);
  mbedtls_mpi_free((mbedtls_mpi *)&U1.p);
  mbedtls_mpi_free((mbedtls_mpi *)&iStack140);
  mbedtls_mpi_free((mbedtls_mpi *)&U2.p);
  mbedtls_mpi_free((mbedtls_mpi *)&TB.p);
  mbedtls_mpi_free((mbedtls_mpi *)&TV.p);
  mbedtls_mpi_free((mbedtls_mpi *)&V1.p);
  return iVar3;
}



uint mbedtls_cipher_get_block_size(mbedtls_cipher_context_t *ctx)

{
  if ((ctx != (mbedtls_cipher_context_t *)0x0) && (ctx->cipher_info != (mbedtls_cipher_info_t *)0x0)
     ) {
    return ctx->cipher_info->block_size;
  }
  return 0;
}



void add_pkcs_padding(uchar *output,size_t output_len,size_t data_len)

{
  uint uVar1;
  
  uVar1 = 0;
  while (uVar1 < output_len - data_len) {
    output[data_len + uVar1] = (uchar)(output_len - data_len);
    uVar1 = uVar1 + 1 & 0xff;
  }
  return;
}



int get_pkcs_padding(uchar *input,size_t input_len,size_t *data_len)

{
  byte bVar1;
  bool bVar2;
  byte *pbVar3;
  uint uVar4;
  bool bVar5;
  uint uVar6;
  
