pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if ((input == (uchar *)0x0) || (data_len == (size_t *)0x0)) {
    return -0x6100;
  }
  bVar1 = input[input_len - 1];
  uVar6 = input_len - bVar1;
  bVar5 = input_len < bVar1 || bVar1 == 0;
  *data_len = uVar6;
  uVar4 = 0;
  while (uVar4 != input_len) {
    pbVar3 = input + uVar4;
    bVar2 = uVar6 <= uVar4;
    uVar4 = uVar4 + 1;
    bVar5 = (bool)(bVar5 | bVar2 * (bVar1 ^ *pbVar3));
  }
  if (bVar5 == false) {
    return 0;
  }
  return -0x6200;
}



void add_zeros_padding(uchar *output,size_t output_len,size_t data_len)

{
  if (output_len <= data_len) {
    return;
  }
  output[data_len] = '\0';
  add_zeros_padding(output,output_len,data_len + 1);
  return;
}



int get_no_padding(uchar *input,size_t input_len,size_t *data_len)

{
  if ((input != (uchar *)0x0) && (data_len != (size_t *)0x0)) {
    *data_len = input_len;
    return 0;
  }
  return -0x6100;
}



int get_zeros_padding(uchar *input,size_t input_len,size_t *data_len)

{
  uint uVar1;
  uint uVar2;
  
  if ((input != (uchar *)0x0) && (data_len != (size_t *)0x0)) {
    *data_len = 0;
    uVar2 = 0;
    while (input_len != 0) {
      uVar1 = input[input_len - 1] != '\0' | uVar2;
      *data_len = (uVar2 ^ uVar1) * input_len | *data_len;
      input_len = input_len - 1;
      uVar2 = uVar1;
    }
    return 0;
  }
  return -0x6100;
}



mbedtls_cipher_info_t * mbedtls_cipher_info_from_type(mbedtls_cipher_type_t cipher_type)

{
  undefined3 in_register_00002029;
  mbedtls_cipher_definition_t *pmVar1;
  
  pmVar1 = mbedtls_cipher_definitions;
  while ((pmVar1->info != (mbedtls_cipher_info_t *)0x0 &&
         ((uint)pmVar1->type != CONCAT31(in_register_00002029,cipher_type)))) {
    pmVar1 = pmVar1 + 1;
  }
  return pmVar1->info;
}



mbedtls_cipher_info_t *
mbedtls_cipher_info_from_values
          (mbedtls_cipher_id_t cipher_id,int key_bitlen,mbedtls_cipher_mode_t mode)

{
  undefined3 in_register_00002029;
  undefined3 in_register_00002031;
  mbedtls_cipher_definition_t *pmVar1;
  mbedtls_cipher_info_t *pmVar2;
  
  pmVar1 = mbedtls_cipher_definitions;
  while ((pmVar2 = pmVar1->info, pmVar2 != (mbedtls_cipher_info_t *)0x0 &&
         ((((uint)pmVar2->base->cipher != CONCAT31(in_register_00002029,cipher_id) ||
           (pmVar2->key_bitlen != key_bitlen)) ||
          ((uint)pmVar2->mode != CONCAT31(in_register_00002031,mode)))))) {
    pmVar1 = pmVar1 + 1;
  }
  return pmVar2;
}



void mbedtls_cipher_init(mbedtls_cipher_context_t *ctx)

{
  memset(ctx,0,0x40);
  return;
}



void mbedtls_cipher_free(mbedtls_cipher_context_t *ctx)

{
  mbedtls_cipher_context_t *pmVar1;
  
  if (ctx != (mbedtls_cipher_context_t *)0x0) {
    if (ctx->cipher_ctx != (void *)0x0) {
      (*ctx->cipher_info->base->ctx_free_func)(ctx->cipher_ctx);
    }
    pmVar1 = ctx + 1;
    while (ctx != pmVar1) {
      *(undefined *)&ctx->cipher_info = 0;
      ctx = (mbedtls_cipher_context_t *)((int)&ctx->cipher_info + 1);
    }
    return;
  }
  return;
}



// WARNING: Exceeded maximum restarts with more pending

int mbedtls_cipher_setkey
              (mbedtls_cipher_context_t *ctx,uchar *key,int key_bitlen,mbedtls_operation_t operation
              )

{
  anon_subr_int_void_ptr_uchar_ptr_uint_for_setkey_enc_func *UNRECOVERED_JUMPTABLE;
  int iVar1;
  undefined3 in_register_00002035;
  mbedtls_cipher_info_t *pmVar2;
  
  if (((ctx != (mbedtls_cipher_context_t *)0x0) &&
      (pmVar2 = ctx->cipher_info, pmVar2 != (mbedtls_cipher_info_t *)0x0)) &&
     (((pmVar2->flags & 2U) != 0 || (pmVar2->key_bitlen == key_bitlen)))) {
    ctx->key_bitlen = key_bitlen;
    ctx->operation = operation;
    if ((CONCAT31(in_register_00002035,operation) == 1) ||
       ((pmVar2->mode + ~MBEDTLS_MODE_CBC & 0xfd) == 0)) {
      UNRECOVERED_JUMPTABLE = pmVar2->base->setkey_enc_func;
    }
    else {
      if (CONCAT31(in_register_00002035,operation) != 0) {
        return -0x6100;
      }
      UNRECOVERED_JUMPTABLE =
           (anon_subr_int_void_ptr_uchar_ptr_uint_for_setkey_enc_func *)
           pmVar2->base->setkey_dec_func;
    }
                    // WARNING: Could not recover jumptable at 0x2306284c. Too many branches
                    // WARNING: Treating indirect jump as call
    iVar1 = (*UNRECOVERED_JUMPTABLE)(ctx->cipher_ctx);
    return iVar1;
  }
  return -0x6100;
}



int mbedtls_cipher_set_iv(mbedtls_cipher_context_t *ctx,uchar *iv,size_t iv_len)

{
  mbedtls_cipher_info_t *pmVar1;
  size_t __n;
  
  if (ctx == (mbedtls_cipher_context_t *)0x0) {
    return -0x6100;
  }
  pmVar1 = ctx->cipher_info;
  if ((pmVar1 != (mbedtls_cipher_info_t *)0x0) && (iv != (uchar *)0x0)) {
    if (0x10 < iv_len) {
      return -0x6080;
    }
    __n = iv_len;
    if (((pmVar1->flags & 1U) != 0) || (__n = pmVar1->iv_size, __n <= iv_len)) {
      memcpy(ctx->iv,iv,__n);
      ctx->iv_size = __n;
      return 0;
    }
  }
  return -0x6100;
}



int mbedtls_cipher_reset(mbedtls_cipher_context_t *ctx)

{
  if ((ctx != (mbedtls_cipher_context_t *)0x0) && (ctx->cipher_info != (mbedtls_cipher_info_t *)0x0)
     ) {
    ctx->unprocessed_len = 0;
    return 0;
  }
  return -0x6100;
}



int mbedtls_cipher_update
              (mbedtls_cipher_context_t *ctx,uchar *input,size_t ilen,uchar *output,size_t *olen)

{
  mbedtls_cipher_mode_t mVar1;
  uint uVar2;
  int iVar3;
  mbedtls_cipher_info_t *pmVar4;
  size_t sVar5;
  uint __n;
  
  if (ctx == (mbedtls_cipher_context_t *)0x0) {
    return -0x6100;
  }
  if ((ctx->cipher_info == (mbedtls_cipher_info_t *)0x0) || (olen == (size_t *)0x0)) {
    return -0x6100;
  }
  *olen = 0;
  uVar2 = mbedtls_cipher_get_block_size(ctx);
  pmVar4 = ctx->cipher_info;
  mVar1 = pmVar4->mode;
  if (mVar1 == MBEDTLS_MODE_ECB) {
    if (uVar2 != ilen) {
      return -0x6280;
    }
    *olen = uVar2;
                    // WARNING: Could not recover jumptable at 0x2306295c. Too many branches
                    // WARNING: Treating indirect jump as call
    iVar3 = (*ctx->cipher_info->base->ecb_func)(ctx->cipher_ctx,ctx->operation,input,output);
    return iVar3;
  }
  if (mVar1 == MBEDTLS_MODE_GCM) {
    *olen = ilen;
    iVar3 = mbedtls_gcm_update((mbedtls_gcm_context *)ctx->cipher_ctx,ilen,input,output);
    return iVar3;
  }
  if (uVar2 == 0) {
    return -0x6380;
  }
  if (input == output) {
    if (ctx->unprocessed_len != 0) {
      return -0x6100;
    }
    if (ilen % uVar2 != 0) {
      return -0x6100;
    }
  }
  if (mVar1 == MBEDTLS_MODE_CBC) {
    sVar5 = ctx->unprocessed_len;
    if (ctx->operation == MBEDTLS_DECRYPT) {
      if (ilen <= uVar2 - sVar5) {
LAB_230629b2:
        memcpy(ctx->unprocessed_data + sVar5,input,ilen);
        ctx->unprocessed_len = ilen + ctx->unprocessed_len;
        return 0;
      }
    }
    else {
      if ((ctx->operation == MBEDTLS_ENCRYPT) && (ilen < uVar2 - sVar5)) goto LAB_230629b2;
    }
    if (sVar5 != 0) {
      memcpy(ctx->unprocessed_data + sVar5,input,uVar2 - sVar5);
      iVar3 = (*ctx->cipher_info->base->cbc_func)
                        (ctx->cipher_ctx,ctx->operation,uVar2,ctx->iv,ctx->unprocessed_data,output);
      if (iVar3 != 0) {
        return iVar3;
      }
      output = output + uVar2;
      *olen = *olen + uVar2;
      ctx->unprocessed_len = 0;
      input = input + (uVar2 - sVar5);
      ilen = (ilen + sVar5) - uVar2;
    }
    if (ilen != 0) {
      __n = ilen % uVar2;
      if ((__n == 0) && (ctx->operation == MBEDTLS_DECRYPT)) {
        __n = uVar2;
      }
      ilen = ilen - __n;
      memcpy(ctx->unprocessed_data,input + ilen,__n);
      ctx->unprocessed_len = __n + ctx->unprocessed_len;
      if (ilen != 0) {
        iVar3 = (*ctx->cipher_info->base->cbc_func)
                          (ctx->cipher_ctx,ctx->operation,ilen,ctx->iv,input,output);
        if (iVar3 != 0) {
          return iVar3;
        }
        ilen = ilen + *olen;
        goto LAB_23062a78;
      }
    }
    return 0;
  }
  if (mVar1 == MBEDTLS_MODE_CFB) {
    iVar3 = (*pmVar4->base->cfb_func)
                      (ctx->cipher_ctx,ctx->operation,ilen,&ctx->unprocessed_len,ctx->iv,input,
                       output);
  }
  else {
    if (mVar1 != MBEDTLS_MODE_CTR) {
      return -0x6080;
    }
    iVar3 = (*pmVar4->base->ctr_func)
                      (ctx->cipher_ctx,ilen,&ctx->unprocessed_len,ctx->iv,ctx->unprocessed_data,
                       input,output);
  }
  if (iVar3 != 0) {
    return iVar3;
  }
LAB_23062a78:
  *olen = ilen;
  return iVar3;
}



int mbedtls_cipher_finish(mbedtls_cipher_context_t *ctx,uchar *output,size_t *olen)

{
  mbedtls_cipher_mode_t mVar1;
  int iVar2;
  uint uVar3;
  size_t sVar4;
  size_t sVar5;
  
  if (((ctx == (mbedtls_cipher_context_t *)0x0) ||
      (ctx->cipher_info == (mbedtls_cipher_info_t *)0x0)) || (olen == (size_t *)0x0)) {
    return -0x6100;
  }
  *olen = 0;
  mVar1 = ctx->cipher_info->mode;
  if ((mVar1 == MBEDTLS_MODE_CFB) || ((byte)(mVar1 + ~MBEDTLS_MODE_OFB) < 3)) {
    return 0;
  }
  if (mVar1 == MBEDTLS_MODE_ECB) {
    sVar5 = ctx->unprocessed_len;
joined_r0x23062b46:
    if (sVar5 == 0) {
      return 0;
    }
LAB_23062b24:
    iVar2 = -0x6280;
  }
  else {
    if (mVar1 != MBEDTLS_MODE_CBC) {
      return -0x6080;
    }
    sVar5 = ctx->unprocessed_len;
    if (ctx->operation == MBEDTLS_ENCRYPT) {
      if (ctx->add_padding == (anon_subr_void_uchar_ptr_size_t_size_t_for_add_padding *)0x0)
      goto joined_r0x23062b46;
      sVar4 = ctx->iv_size;
      if (sVar4 == 0) {
        sVar4 = ctx->cipher_info->iv_size;
      }
      (*ctx->add_padding)(ctx->unprocessed_data,sVar4,sVar5);
    }
    else {
      uVar3 = mbedtls_cipher_get_block_size(ctx);
      if (uVar3 != sVar5) {
        if ((ctx->add_padding == (anon_subr_void_uchar_ptr_size_t_size_t_for_add_padding *)0x0) &&
           (sVar5 == 0)) {
          return 0;
        }
        goto LAB_23062b24;
      }
    }
    uVar3 = mbedtls_cipher_get_block_size(ctx);
    iVar2 = (*ctx->cipher_info->base->cbc_func)
                      (ctx->cipher_ctx,ctx->operation,uVar3,ctx->iv,ctx->unprocessed_data,output);
    if (iVar2 == 0) {
      uVar3 = mbedtls_cipher_get_block_size(ctx);
      if (ctx->operation == MBEDTLS_DECRYPT) {
                    // WARNING: Could not recover jumptable at 0x23062bb2. Too many branches
                    // WARNING: Treating indirect jump as call
        iVar2 = (*ctx->get_padding)(output,uVar3,olen);
        return iVar2;
      }
      *olen = uVar3;
    }
  }
  return iVar2;
}



int mbedtls_cipher_set_padding_mode(mbedtls_cipher_context_t *ctx,mbedtls_cipher_padding_t mode)

{
  undefined3 in_register_0000202d;
  int iVar1;
  code *pcVar2;
  
  iVar1 = CONCAT31(in_register_0000202d,mode);
  if ((ctx != (mbedtls_cipher_context_t *)0x0) && (ctx->cipher_info->mode == MBEDTLS_MODE_CBC)) {
    if (iVar1 == 3) {
      ctx->add_padding = add_zeros_padding;
      pcVar2 = get_zeros_padding;
    }
    else {
      if (iVar1 == 4) {
        ctx->add_padding = (anon_subr_void_uchar_ptr_size_t_size_t_for_add_padding *)0x0;
        pcVar2 = get_no_padding;
      }
      else {
        if (iVar1 != 0) {
          return -0x6080;
        }
        ctx->add_padding = add_pkcs_padding;
        pcVar2 = get_pkcs_padding;
      }
    }
    ctx->get_padding = pcVar2;
    return 0;
  }
  return -0x6100;
}



int mbedtls_cipher_setup(mbedtls_cipher_context_t *ctx,mbedtls_cipher_info_t *cipher_info)

{
  void *pvVar1;
  int iVar2;
  anon_subr_void_ptr_for_ctx_alloc_func *paVar3;
  
  if (cipher_info != (mbedtls_cipher_info_t *)0x0) {
    if (ctx == (mbedtls_cipher_context_t *)0x0) {
      iVar2 = -0x6100;
    }
    else {
      memset(ctx,0,0x40);
      paVar3 = cipher_info->base->ctx_alloc_func;
      pvVar1 = (*paVar3)(paVar3);
      ctx->cipher_ctx = pvVar1;
      if (pvVar1 == (void *)0x0) {
        iVar2 = -0x6180;
      }
      else {
        ctx->cipher_info = cipher_info;
        mbedtls_cipher_set_padding_mode(ctx,MBEDTLS_PADDING_PKCS7);
        iVar2 = 0;
      }
    }
    return iVar2;
  }
  return -0x6100;
}



int mbedtls_cipher_crypt
              (mbedtls_cipher_context_t *ctx,uchar *iv,size_t iv_len,uchar *input,size_t ilen,
              uchar *output,size_t *olen)

{
  int iVar1;
  size_t sStack36;
  size_t finish_olen;
  
  iVar1 = mbedtls_cipher_set_iv(ctx,iv,iv_len);
  if ((((iVar1 == 0) && (iVar1 = mbedtls_cipher_reset(ctx), iVar1 == 0)) &&
      (iVar1 = mbedtls_cipher_update(ctx,input,ilen,output,olen), iVar1 == 0)) &&
     (iVar1 = mbedtls_cipher_finish(ctx,output + *olen,&sStack36), iVar1 == 0)) {
    *olen = *olen + sStack36;
  }
  return iVar1;
}



int mbedtls_cipher_auth_encrypt
              (mbedtls_cipher_context_t *ctx,uchar *iv,size_t iv_len,uchar *ad,size_t ad_len,
              uchar *input,size_t ilen,uchar *output,size_t *olen,uchar *tag,size_t tag_len)

{
  int iVar1;
  size_t *in_stack_00000000;
  
