pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (ctx->cipher_info->mode == MBEDTLS_MODE_GCM) {
    *in_stack_00000000 = ilen;
    iVar1 = mbedtls_gcm_crypt_and_tag
                      ((mbedtls_gcm_context *)ctx->cipher_ctx,1,ilen,iv,iv_len,ad,ad_len,input,
                       (uchar *)olen,(size_t)tag,(uchar *)tag_len);
    return iVar1;
  }
  return -0x6080;
}



int mbedtls_cipher_auth_decrypt
              (mbedtls_cipher_context_t *ctx,uchar *iv,size_t iv_len,uchar *ad,size_t ad_len,
              uchar *input,size_t ilen,uchar *output,size_t *olen,uchar *tag,size_t tag_len)

{
  int iVar1;
  size_t *in_stack_00000000;
  uchar *in_stack_00000004;
  size_t in_stack_00000008;
  
  if (ctx->cipher_info->mode == MBEDTLS_MODE_GCM) {
    *in_stack_00000000 = ilen;
    iVar1 = mbedtls_gcm_auth_decrypt
                      ((mbedtls_gcm_context *)ctx->cipher_ctx,ilen,iv,iv_len,ad,ad_len,
                       in_stack_00000004,in_stack_00000008,(uchar *)olen,tag);
    if (iVar1 == -0x12) {
      iVar1 = -0x6300;
    }
    return iVar1;
  }
  return -0x6080;
}



void gcm_ctx_free(void *ctx)

{
  mbedtls_gcm_free((mbedtls_gcm_context *)ctx);
  vPortFree(ctx);
  return;
}



void * gcm_ctx_alloc(void)

{
  mbedtls_gcm_context *ctx;
  
  ctx = (mbedtls_gcm_context *)mycalloc(1,0x188);
  if (ctx != (mbedtls_gcm_context *)0x0) {
    mbedtls_gcm_init(ctx);
  }
  return ctx;
}



int gcm_aes_setkey_wrap(void *ctx,uchar *key,uint key_bitlen)

{
  int iVar1;
  
  iVar1 = mbedtls_gcm_setkey((mbedtls_gcm_context *)ctx,MBEDTLS_CIPHER_ID_AES,key,key_bitlen);
  return iVar1;
}



void aes_ctx_free(void *ctx)

{
  mbedtls_aes_free((mbedtls_aes_context *)ctx);
  vPortFree(ctx);
  return;
}



void * aes_ctx_alloc(void)

{
  mbedtls_aes_context *ctx;
  
  ctx = (mbedtls_aes_context *)mycalloc(1,0x118);
  if (ctx != (mbedtls_aes_context *)0x0) {
    mbedtls_aes_init(ctx);
  }
  return ctx;
}



int aes_setkey_dec_wrap(mbedtls_aes_context *ctx,uchar *key,uint keybits)

{
  uint *puVar1;
  int iVar2;
  uint32_t *puVar3;
  uint uVar4;
  uint32_t *puVar5;
  int iVar6;
  mbedtls_aes_context mStack296;
  
  mbedtls_aes_init(&mStack296);
  ctx->rk = ctx->buf;
  iVar2 = mbedtls_aes_setkey_enc(&mStack296,key,keybits);
  if (iVar2 == 0) {
    ctx->nr = mStack296.nr;
    mStack296.rk = mStack296.rk + mStack296.nr * 4;
    ctx->buf[0] = *mStack296.rk;
    ctx->buf[1] = mStack296.rk[1];
    puVar3 = ctx->buf;
    ctx->buf[2] = mStack296.rk[2];
    ctx->buf[3] = mStack296.rk[3];
    while( true ) {
      puVar3 = puVar3 + 4;
      puVar5 = mStack296.rk + -4;
      mStack296.nr = mStack296.nr + -1;
      if (mStack296.nr < 1) break;
      iVar6 = 0;
      do {
        uVar4 = *(uint *)((int)puVar5 + iVar6);
        puVar1 = (uint *)((int)puVar3 + iVar6);
        iVar6 = iVar6 + 4;
        *puVar1 = RT2[FSb[uVar4 >> 0x10 & 0xff]] ^
                  RT0[FSb[uVar4 & 0xff]] ^ RT3[FSb[uVar4 >> 0x18]] ^ RT1[FSb[uVar4 >> 8 & 0xff]];
        mStack296.rk = puVar5;
      } while (iVar6 != 0x10);
    }
    *puVar3 = *puVar5;
    puVar3[1] = mStack296.rk[-3];
    puVar3[2] = mStack296.rk[-2];
    puVar3[3] = mStack296.rk[-1];
  }
  mbedtls_aes_free(&mStack296);
  return iVar2;
}



int aes_setkey_enc_wrap(mbedtls_aes_context *ctx,uchar *key,uint keybits)

{
  byte *pbVar1;
  uint32_t *puVar2;
  uint uVar3;
  int iVar4;
  uint32_t *puVar5;
  uint32_t *puVar6;
  uint uVar7;
  
  if (aes_init_done == 0) {
    aes_gen_tables();
    aes_init_done = 1;
  }
  if (keybits == 0xc0) {
    iVar4 = 0xc;
  }
  else {
    if (keybits == 0x100) {
      iVar4 = 0xe;
    }
    else {
      if (keybits != 0x80) {
        return -0x20;
      }
      iVar4 = 10;
    }
  }
  ctx->nr = iVar4;
  puVar5 = ctx->buf;
  ctx->rk = puVar5;
  pbVar1 = key;
  puVar2 = puVar5;
  while (key + (keybits >> 5) * 4 != pbVar1) {
    *puVar2 = (uint)pbVar1[1] << 8 | (uint)pbVar1[2] << 0x10 | (uint)*pbVar1 |
              (uint)pbVar1[3] << 0x18;
    pbVar1 = pbVar1 + 4;
    puVar2 = puVar2 + 1;
  }
  iVar4 = ctx->nr;
  if (iVar4 == 0xc) {
    puVar2 = RCON;
    do {
      uVar3 = puVar5[5];
      uVar7 = *puVar2;
      puVar6 = puVar5 + 6;
      puVar2 = puVar2 + 1;
      uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
              (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
      *puVar6 = uVar7;
      uVar7 = uVar7 ^ puVar5[1];
      puVar5[7] = uVar7;
      uVar7 = uVar7 ^ puVar5[2];
      puVar5[8] = uVar7;
      uVar7 = uVar7 ^ puVar5[3];
      puVar5[9] = uVar7;
      uVar7 = uVar7 ^ puVar5[4];
      puVar5[10] = uVar7;
      puVar5[0xb] = uVar7 ^ uVar3;
      puVar5 = puVar6;
    } while (puVar6 != ctx->buf + 0x30);
  }
  else {
    if (iVar4 == 0xe) {
      puVar2 = RCON;
      do {
        uVar3 = puVar5[7];
        uVar7 = *puVar2;
        puVar6 = puVar5 + 8;
        puVar2 = puVar2 + 1;
        uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
                (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
        *puVar6 = uVar7;
        uVar7 = uVar7 ^ puVar5[1];
        puVar5[9] = uVar7;
        uVar7 = uVar7 ^ puVar5[2];
        puVar5[10] = uVar7;
        uVar7 = uVar7 ^ puVar5[3];
        puVar5[0xb] = uVar7;
        uVar7 = (uint)FSb[uVar7 >> 0x10 & 0xff] << 0x10 ^
                (uint)FSb[uVar7 & 0xff] ^ puVar5[4] ^ (uint)FSb[uVar7 >> 0x18] << 0x18 ^
                (uint)FSb[uVar7 >> 8 & 0xff] << 8;
        puVar5[0xc] = uVar7;
        uVar7 = uVar7 ^ puVar5[5];
        puVar5[0xd] = uVar7;
        uVar7 = uVar7 ^ puVar5[6];
        puVar5[0xe] = uVar7;
        puVar5[0xf] = uVar7 ^ uVar3;
        puVar5 = puVar6;
      } while (puVar6 != ctx->buf + 0x38);
    }
    else {
      if (iVar4 != 10) {
        return 0;
      }
      puVar2 = RCON;
      do {
        uVar3 = puVar5[3];
        uVar7 = *puVar2;
        puVar6 = puVar5 + 4;
        puVar2 = puVar2 + 1;
        uVar7 = (uint)FSb[uVar3 >> 8 & 0xff] ^ *puVar5 ^ uVar7 ^ (uint)FSb[uVar3 >> 0x18] << 0x10 ^
                (uint)FSb[uVar3 & 0xff] << 0x18 ^ (uint)FSb[uVar3 >> 0x10 & 0xff] << 8;
        *puVar6 = uVar7;
        uVar7 = uVar7 ^ puVar5[1];
        puVar5[5] = uVar7;
        uVar7 = uVar7 ^ puVar5[2];
        puVar5[6] = uVar7;
        puVar5[7] = uVar7 ^ uVar3;
        puVar5 = puVar6;
      } while (puVar6 != ctx->buf + 0x28);
    }
  }
  return 0;
}



int aes_crypt_ctr_wrap(mbedtls_aes_context *ctx,size_t length,size_t *nc_off,uchar *nonce_counter,
                      uchar *stream_block,uchar *input,uchar *output)

{
  bool bVar1;
  uchar uVar2;
  uint uVar3;
  uchar *puVar4;
  byte *pbVar5;
  
