pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar3 = *nc_off;
  pbVar5 = output;
  do {
    if (pbVar5 == output + length) {
      *nc_off = uVar3;
      return 0;
    }
    if (uVar3 == 0) {
      mbedtls_aes_encrypt(ctx,nonce_counter,stream_block);
      puVar4 = nonce_counter + 0xf;
      do {
        uVar2 = *puVar4;
        *puVar4 = uVar2 + '\x01';
        if ((uchar)(uVar2 + '\x01') != '\0') break;
        bVar1 = nonce_counter != puVar4;
        puVar4 = puVar4 + -1;
      } while (bVar1);
    }
    *pbVar5 = stream_block[uVar3] ^ *input;
    uVar3 = uVar3 + 1 & 0xf;
    input = input + 1;
    pbVar5 = pbVar5 + 1;
  } while( true );
}



int aes_crypt_cfb128_wrap
              (mbedtls_aes_context *ctx,int mode,size_t length,size_t *iv_off,uchar *iv,uchar *input
              ,uchar *output)

{
  uint uVar1;
  byte *pbVar2;
  byte bVar3;
  
  uVar1 = *iv_off;
  pbVar2 = output;
  if (mode == 0) {
    while (pbVar2 != output + length) {
      if (uVar1 == 0) {
        mbedtls_aes_encrypt(ctx,iv,iv);
      }
      bVar3 = *input;
      *pbVar2 = iv[uVar1] ^ bVar3;
      iv[uVar1] = bVar3;
      uVar1 = uVar1 + 1 & 0xf;
      pbVar2 = pbVar2 + 1;
      input = input + 1;
    }
  }
  else {
    while (pbVar2 != output + length) {
      if (uVar1 == 0) {
        mbedtls_aes_encrypt(ctx,iv,iv);
      }
      bVar3 = iv[uVar1] ^ *input;
      *pbVar2 = bVar3;
      iv[uVar1] = bVar3;
      uVar1 = uVar1 + 1 & 0xf;
      pbVar2 = pbVar2 + 1;
      input = input + 1;
    }
  }
  *iv_off = uVar1;
  return 0;
}



int aes_crypt_cbc_wrap(mbedtls_aes_context *ctx,int mode,size_t length,uchar *iv,uchar *input,
                      uchar *output)

{
  uint uVar1;
  int iVar2;
  byte *pbVar3;
  byte *pbVar4;
  byte *pbVar5;
  uchar *input_00;
  undefined auStack64 [24];
  
  uVar1 = length & 0xf;
  if (uVar1 == 0) {
    if (mode == 0) {
      while( true ) {
        input_00 = output + -uVar1;
        if (uVar1 + length == 0) break;
        memcpy(auStack64,input + -uVar1,0x10);
        mbedtls_aes_decrypt(ctx,input + -uVar1,input_00);
        iVar2 = 0;
        do {
          pbVar3 = input_00 + iVar2;
          pbVar4 = iv + iVar2;
          iVar2 = iVar2 + 1;
          *pbVar3 = *pbVar4 ^ *pbVar3;
        } while (iVar2 != 0x10);
        memcpy(iv,auStack64,0x10);
        uVar1 = uVar1 - 0x10;
      }
    }
    else {
      while( true ) {
        input_00 = output + -uVar1;
        if (length + uVar1 == 0) break;
        iVar2 = 0;
        do {
          pbVar5 = input + -uVar1 + iVar2;
          pbVar3 = iv + iVar2;
          pbVar4 = input_00 + iVar2;
          iVar2 = iVar2 + 1;
          *pbVar4 = *pbVar5 ^ *pbVar3;
        } while (iVar2 != 0x10);
        mbedtls_aes_crypt_ecb(ctx,mode,input_00,input_00);
        memcpy(iv,input_00,0x10);
        uVar1 = uVar1 - 0x10;
      }
    }
    iVar2 = 0;
  }
  else {
    iVar2 = -0x22;
  }
  return iVar2;
}



int aes_crypt_ecb_wrap(mbedtls_aes_context *ctx,int mode,uchar *input,uchar *output)

{
  if (mode == 1) {
    mbedtls_aes_encrypt(ctx,input,output);
  }
  else {
    mbedtls_aes_decrypt(ctx,input,output);
  }
  return 0;
}



void debug_send_line(int level,char *file,int line,char *str)

{
                    // WARNING: Could not recover jumptable at 0x23062e18. Too many branches
                    // WARNING: Treating indirect jump as call
  (**(code **)(level + 0x10))(*(undefined4 *)(level + 0x14));
  return;
}



void mbedtls_debug_print_mpi
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,mbedtls_mpi *X)

{
  int iVar1;
  size_t sVar2;
  int iVar3;
  bool bVar4;
  uint uVar5;
  uint uVar6;
  char acStack576 [4];
  char str [512];
  
  sVar2 = X->n;
  do {
    sVar2 = sVar2 - 1;
    if (sVar2 == 0) break;
  } while (X->p[sVar2] == 0);
  uVar5 = 0x1f;
  do {
    if ((X->p[sVar2] >> (uVar5 & 0x1f) & 1) != 0) break;
    uVar5 = uVar5 - 1;
  } while (uVar5 != 0xffffffff);
  snprintf(acStack576,0x200,"value of \'%s\' (%d bits) is:\n",text,sVar2 * 0x20 + 1 + uVar5);
  debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
  iVar1 = 0;
  bVar4 = true;
  uVar5 = 0;
  while (sVar2 != 0xffffffff) {
    if ((!bVar4) || (X->p[sVar2] != 0)) {
      uVar6 = 0x18;
      do {
        if ((!bVar4) || ((X->p[sVar2] >> (uVar6 & 0x1f) & 0xff) != 0)) {
          if (((uVar5 & 0xf) == 0) && (uVar5 != 0)) {
            snprintf(acStack576 + iVar1,0x200 - iVar1,"\n");
            debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
            iVar1 = 0;
          }
          iVar3 = snprintf(acStack576 + iVar1,0x200 - iVar1," %02x",
                           X->p[sVar2] >> (uVar6 & 0x1f) & 0xff);
          iVar1 = iVar1 + iVar3;
          uVar5 = uVar5 + 1;
          bVar4 = false;
        }
        uVar6 = uVar6 - 8;
      } while (uVar6 != 0xfffffff8);
    }
    sVar2 = sVar2 - 1;
  }
  if (bVar4) {
    iVar3 = snprintf(acStack576 + iVar1,0x200 - iVar1," 00");
    iVar1 = iVar1 + iVar3;
  }
  snprintf(acStack576 + iVar1,0x200 - iVar1,"\n");
  debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
  return;
}



void mbedtls_debug_print_msg
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *format,...)

{
  uint uVar1;
  undefined4 in_a5;
  undefined4 in_a6;
  undefined4 in_a7;
  va_list argp;
  char str [512];
  undefined4 uStack12;
  undefined4 uStack8;
  undefined4 uStack4;
  
  if ((((ssl != (mbedtls_ssl_context *)0x0) && (ssl->conf != (mbedtls_ssl_config *)0x0)) &&
      (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
     (level <= debug_threshold)) {
    uStack12 = in_a5;
    uStack8 = in_a6;
    uStack4 = in_a7;
    uVar1 = vsnprintf((char *)&argp,0x200,format,&uStack12);
    if (uVar1 < 0x1ff) {
      *(undefined *)((int)&argp + uVar1) = 10;
      *(undefined *)((int)&argp + uVar1 + 1) = 0;
    }
    debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
  }
  return;
}



void mbedtls_debug_print_ret
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,int ret)

{
  char acStack544 [4];
  char str [512];
  
  if ((((ssl->conf != (mbedtls_ssl_config *)0x0) &&
       (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
      (level <= debug_threshold)) && (ret != -0x6900)) {
    snprintf(acStack544,0x200,"%s() returned %d (-0x%04x)\n",text,ret,-ret);
    debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
  }
  return;
}



void mbedtls_debug_print_buf
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,uchar *buf,
               size_t len)

{
  int iVar1;
  byte bVar2;
  int iVar3;
  uint uVar4;
  byte abStack596 [4];
  char txt [17];
  char str [512];
  
