pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  if (((ssl->conf != (mbedtls_ssl_config *)0x0) &&
      (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
     (level <= debug_threshold)) {
    snprintf(txt + 0x10,0x200,"dumping \'%s\' (%u bytes)\n",text,len);
    debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
    memset(abStack596,0,0x11);
    iVar3 = 0;
    uVar4 = 0;
    while (uVar4 != len) {
      if (uVar4 == 0x1000) goto LAB_23063198;
      if ((uVar4 & 0xf) == 0) {
        if (uVar4 != 0) {
          snprintf(txt + iVar3 + 0x10,0x200 - iVar3,"  %s\n",abStack596);
          debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
          memset(abStack596,0,0x11);
          iVar3 = 0;
        }
        iVar1 = snprintf(txt + iVar3 + 0x10,0x200 - iVar3,"%04x: ",uVar4);
        iVar3 = iVar3 + iVar1;
      }
      iVar1 = snprintf(txt + iVar3 + 0x10,0x200 - iVar3," %02x",(uint)buf[uVar4]);
      iVar3 = iVar3 + iVar1;
      bVar2 = buf[uVar4];
      if (0x5e < (byte)(bVar2 - 0x20)) {
        bVar2 = 0x2e;
      }
      abStack596[uVar4 & 0xf] = bVar2;
      uVar4 = uVar4 + 1;
    }
    if (len != 0) {
      while( true ) {
        if ((len & 0xf) == 0) break;
        iVar1 = snprintf(txt + iVar3 + 0x10,0x200 - iVar3,"   ");
        iVar3 = iVar3 + iVar1;
        len = len + 1;
      }
LAB_23063198:
      snprintf(txt + iVar3 + 0x10,0x200 - iVar3,"  %s\n",abStack596);
      debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
    }
  }
  return;
}



void mbedtls_debug_print_mpi
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,mbedtls_mpi *X)

{
  if ((((ssl->conf != (mbedtls_ssl_config *)0x0) &&
       (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
      (X != (mbedtls_mpi *)0x0)) && (level <= debug_threshold)) {
    mbedtls_debug_print_mpi(ssl,level,file,line,text,X);
    return;
  }
  return;
}



void mbedtls_debug_print_ecp
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,
               mbedtls_ecp_point *X)

{
  char acStack544 [4];
  char str [512];
  
  snprintf(acStack544,0x200,"%s(X)",text);
  mbedtls_debug_print_mpi(ssl,level,file,line,acStack544,(mbedtls_mpi *)X);
  snprintf(acStack544,0x200,"%s(Y)",text);
  mbedtls_debug_print_mpi(ssl,level,file,line,acStack544,&X->Y);
  return;
}



void mbedtls_debug_print_ecp
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,
               mbedtls_ecp_point *X)

{
  if (((ssl->conf != (mbedtls_ssl_config *)0x0) &&
      (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
     (level <= debug_threshold)) {
    mbedtls_debug_print_ecp(ssl,level,file,line,text,X);
    return;
  }
  return;
}



void mbedtls_debug_print_crt
               (mbedtls_ssl_context *ssl,int level,char *file,int line,char *text,
               mbedtls_x509_crt *crt)

{
  int iVar1;
  mbedtls_ssl_config *level_00;
  char *__src;
  int iVar2;
  void **ppvVar3;
  char *__n;
  char *pcVar4;
  char *pcStack2132;
  char acStack2128 [4];
  char name [16];
  char str [512];
  mbedtls_pk_debug_item items [3];
  char local_440 [4];
  char buf [1024];
  
  if ((((ssl->conf != (mbedtls_ssl_config *)0x0) &&
       (ssl->conf->f_dbg != (anon_subr_void_void_ptr_int_char_ptr_int_char_ptr_for_f_dbg *)0x0)) &&
      (crt != (mbedtls_x509_crt *)0x0)) && (iVar2 = 0, level <= debug_threshold)) {
    pcStack2132 = text;
    do {
      iVar2 = iVar2 + 1;
      snprintf(name + 0xc,0x200,"%s #%d:\n",pcStack2132,iVar2);
      debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
      mbedtls_x509_crt_info(local_440,0x3ff,"",crt);
      __src = local_440;
      pcVar4 = local_440;
      while (__n = pcVar4, *__n != '\0') {
        pcVar4 = __n + 1;
        if (*__n == '\n') {
          __n = __n + (1 - (int)__src);
          if ((char *)0x1ff < __n) {
            __n = (char *)0x1ff;
          }
          memcpy(str + 0x1fc,__src,(size_t)__n);
          level_00 = ssl->conf;
          *(undefined *)((int)__n + (int)register0x00002008 + -0x640) = 0;
          debug_send_line((int)level_00,(char *)level,(int)file,(char *)line);
          __src = pcVar4;
        }
      }
      memset(str + 0x1fc,0,0x24);
      iVar1 = mbedtls_pk_debug(&crt->pk,(mbedtls_pk_debug_item *)(str + 0x1fc));
      if (iVar1 == 0) {
        ppvVar3 = (void **)(str + 0x1fc);
        do {
          if (*(char *)ppvVar3 == '\0') break;
          snprintf(acStack2128,0x10,"%s%s",&UNK_2308b034,ppvVar3[1]);
          name[11] = '\0';
          if (*(char *)ppvVar3 == '\x01') {
            mbedtls_debug_print_mpi(ssl,level,file,line,acStack2128,(mbedtls_mpi *)ppvVar3[2]);
          }
          else {
            if (*(char *)ppvVar3 == '\x02') {
              mbedtls_debug_print_ecp
                        (ssl,level,file,line,acStack2128,(mbedtls_ecp_point *)ppvVar3[2]);
            }
            else {
              debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
            }
          }
          ppvVar3 = ppvVar3 + 3;
        } while (ppvVar3 != &items[2].value);
      }
      else {
        debug_send_line((int)ssl->conf,(char *)level,(int)file,(char *)line);
      }
      crt = crt->next;
    } while (crt != (mbedtls_x509_crt *)0x0);
  }
  return;
}



ecp_curve_type ecp_get_type(mbedtls_ecp_group *grp)

{
  if ((grp->G).X.p != (mbedtls_mpi_uint *)0x0) {
    return ((grp->G).Y.p == (mbedtls_mpi_uint *)0x0) + ECP_TYPE_SHORT_WEIERSTRASS;
  }
  return ECP_TYPE_NONE;
}



// WARNING: Variable defined which should be unmapped: mQY

int ecp_safe_invert_jac(mbedtls_ecp_group *grp,mbedtls_ecp_point *Q,uchar inv)

{
  mbedtls_mpi *B;
  int iVar1;
  undefined auStack28 [4];
  mbedtls_mpi mQY;
  
