pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  B = &Q->Y;
  mbedtls_mpi_init((mbedtls_mpi *)auStack28);
  iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)auStack28,&grp->P,B);
  if (iVar1 == 0) {
    iVar1 = mbedtls_mpi_cmp_int(B,0);
    iVar1 = mbedtls_mpi_safe_cond_assign(B,(mbedtls_mpi *)auStack28,inv & iVar1 != 0);
  }
  mbedtls_mpi_free((mbedtls_mpi *)auStack28);
  return iVar1;
}



int ecp_select_comb(mbedtls_ecp_group *grp,mbedtls_ecp_point *R,mbedtls_ecp_point *T,uchar t_len,
                   uchar i)

{
  bool assign;
  uint uVar1;
  int iVar2;
  undefined3 in_register_00002035;
  undefined3 in_register_00002039;
  
  uVar1 = 0;
  while( true ) {
    assign = ((uint)i & 0x7e) >> 1 == uVar1;
    iVar2 = mbedtls_mpi_safe_cond_assign((mbedtls_mpi *)R,(mbedtls_mpi *)T,assign);
    if ((iVar2 != 0) || (iVar2 = mbedtls_mpi_safe_cond_assign(&R->Y,&T->Y,assign), iVar2 != 0))
    break;
    uVar1 = uVar1 + 1 & 0xff;
    T = T + 1;
    if (CONCAT31(in_register_00002035,t_len) == uVar1) {
      iVar2 = ecp_safe_invert_jac(grp,R,(uchar)(CONCAT31(in_register_00002039,i) >> 7));
      return iVar2;
    }
  }
  return iVar2;
}



int ecp_modp(mbedtls_mpi *N,mbedtls_ecp_group *grp)

{
  mbedtls_mpi *B;
  int iVar1;
  size_t sVar2;
  int iVar3;
  
  if (grp->modp == (anon_subr_int_mbedtls_mpi_ptr_for_modp *)0x0) {
    iVar1 = mbedtls_mpi_mod_mpi(N,N,&grp->P);
    return iVar1;
  }
  if (((-1 < N->s) || (iVar1 = mbedtls_mpi_cmp_int(N,0), iVar1 == 0)) &&
     (sVar2 = mbedtls_mpi_bitlen(N), sVar2 <= grp->pbits << 1)) {
    B = &grp->P;
    iVar3 = (*grp->modp)(N);
    iVar1 = iVar3;
    while( true ) {
      if (iVar1 != 0) {
        return iVar1;
      }
      if ((-1 < N->s) || (iVar1 = mbedtls_mpi_cmp_int(N,0), iVar1 == 0)) break;
      iVar1 = mbedtls_mpi_add_mpi(N,N,B);
    }
    do {
      iVar1 = mbedtls_mpi_cmp_mpi(N,B);
      if (iVar1 < 0) {
        return iVar3;
      }
      iVar1 = mbedtls_mpi_sub_abs(N,N,B);
    } while (iVar1 == 0);
    return iVar1;
  }
  return -0x4f80;
}



int ecp_double_jac(mbedtls_ecp_group *grp,mbedtls_ecp_point *R,mbedtls_ecp_point *P)

{
  mbedtls_mpi *X;
  int iVar1;
  mbedtls_mpi *Y;
  mbedtls_mpi *Y_00;
  undefined auStack96 [4];
  mbedtls_mpi M;
  mbedtls_mpi S;
  mbedtls_mpi T;
  mbedtls_mpi U;
  
  X = (mbedtls_mpi *)&M.p;
  mbedtls_mpi_init((mbedtls_mpi *)auStack96);
  mbedtls_mpi_init(X);
  mbedtls_mpi_init((mbedtls_mpi *)&S.p);
  mbedtls_mpi_init((mbedtls_mpi *)&T.p);
  if ((grp->A).p == (mbedtls_mpi_uint *)0x0) {
    iVar1 = mbedtls_mpi_mul_mpi(X,&P->Z,&P->Z);
    if ((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)P,X);
      Y = &grp->P;
      while (iVar1 == 0) {
        iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&S.p,Y);
        if (iVar1 < 0) {
          iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&T.p,(mbedtls_mpi *)P,X);
          goto LAB_230637aa;
        }
        iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,Y);
      }
    }
  }
  else {
    iVar1 = mbedtls_mpi_mul_mpi(X,(mbedtls_mpi *)P,(mbedtls_mpi *)P);
    if ((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_mul_int((mbedtls_mpi *)auStack96,X,3);
      Y = &grp->P;
      while (iVar1 == 0) {
        iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack96,Y);
        if (iVar1 < 0) {
          iVar1 = mbedtls_mpi_cmp_int(&grp->A,0);
          if (iVar1 == 0) goto LAB_230637e8;
          iVar1 = mbedtls_mpi_mul_mpi(X,&P->Z,&P->Z);
          if (((((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) &&
               (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&S.p,X,X), iVar1 == 0)) &&
              ((iVar1 = ecp_modp((mbedtls_mpi *)&S.p,grp), iVar1 == 0 &&
               (iVar1 = mbedtls_mpi_mul_mpi(X,(mbedtls_mpi *)&S.p,&grp->A), iVar1 == 0)))) &&
             (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
            iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)auStack96,(mbedtls_mpi *)auStack96,X);
            goto LAB_23063a66;
          }
          break;
        }
        iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)auStack96,(mbedtls_mpi *)auStack96,Y);
      }
    }
  }
  goto cleanup;
LAB_23063a66:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack96,Y);
  if (iVar1 < 0) goto LAB_230637e8;
  iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)auStack96,(mbedtls_mpi *)auStack96,Y);
  goto LAB_23063a66;
LAB_230637aa:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)T.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&T.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_mul_mpi(X,(mbedtls_mpi *)&S.p,(mbedtls_mpi *)&T.p);
    if ((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_mul_int((mbedtls_mpi *)auStack96,X,3);
      goto LAB_230637d8;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&T.p,(mbedtls_mpi *)&T.p,Y);
  goto LAB_230637aa;
LAB_230637d8:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack96,Y);
  if (iVar1 < 0) goto LAB_230637e8;
  iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)auStack96,(mbedtls_mpi *)auStack96,Y);
  goto LAB_230637d8;
LAB_23063848:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi(X,Y_00);
  if (iVar1 < 0) {
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T.p,(mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p);
    if ((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&T.p,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_shift_l((mbedtls_mpi *)&T.p,1);
      goto LAB_23063880;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_sub_abs(X,X,Y_00);
  goto LAB_23063848;
LAB_23063880:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&T.p,Y_00);
  if (iVar1 < 0) {
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)auStack96,
                                (mbedtls_mpi *)auStack96);
    if ((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&S.p,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,X);
      goto LAB_230638ba;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&T.p,(mbedtls_mpi *)&T.p,Y_00);
  goto LAB_23063880;
LAB_230638ba:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)S.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&S.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,X);
    goto LAB_230638d0;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,Y_00);
  goto LAB_230638ba;
LAB_230638d0:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)S.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&S.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_sub_mpi(X,X,(mbedtls_mpi *)&S.p);
    goto LAB_230638e6;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,Y_00);
  goto LAB_230638d0;
LAB_230638e6:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)M.p) || (iVar1 = mbedtls_mpi_cmp_int(X,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_mul_mpi(X,X,(mbedtls_mpi *)auStack96);
    if ((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_sub_mpi(X,X,(mbedtls_mpi *)&T.p);
      goto joined_r0x2306391e;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi(X,X,Y_00);
  goto LAB_230638e6;
joined_r0x2306391e:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)M.p) || (iVar1 = mbedtls_mpi_cmp_int(X,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T.p,Y,&P->Z);
    if ((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&T.p,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_shift_l((mbedtls_mpi *)&T.p,1);
      goto LAB_23063950;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi(X,X,Y_00);
  goto joined_r0x2306391e;
LAB_23063950:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&T.p,Y_00);
  if (iVar1 < 0) {
    iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)R,(mbedtls_mpi *)&S.p);
    if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_copy(&R->Y,(mbedtls_mpi *)&M.p), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_copy(&R->Z,(mbedtls_mpi *)&T.p);
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&T.p,(mbedtls_mpi *)&T.p,Y_00);
  goto LAB_23063950;
LAB_230637e8:
  Y = &P->Y;
  iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&S.p,Y,Y);
  if ((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&S.p,grp), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_shift_l((mbedtls_mpi *)&S.p,1);
    Y_00 = &grp->P;
    while (iVar1 == 0) {
      iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&S.p,Y_00);
      if (iVar1 < 0) {
        iVar1 = mbedtls_mpi_mul_mpi(X,(mbedtls_mpi *)P,(mbedtls_mpi *)&S.p);
        if ((iVar1 == 0) && (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
          iVar1 = mbedtls_mpi_shift_l(X,1);
          goto LAB_23063848;
        }
        break;
      }
      iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&S.p,(mbedtls_mpi *)&S.p,Y_00);
    }
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)auStack96);
  mbedtls_mpi_free(X);
  mbedtls_mpi_free((mbedtls_mpi *)&S.p);
  mbedtls_mpi_free((mbedtls_mpi *)&T.p);
  return iVar1;
}



