pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int ecp_normalize_jac(mbedtls_ecp_group *grp,mbedtls_ecp_point *pt)

{
  mbedtls_mpi *X;
  int iVar1;
  mbedtls_mpi *X_00;
  undefined auStack56 [4];
  mbedtls_mpi Zi;
  mbedtls_mpi ZZi;
  
  X_00 = &pt->Z;
  iVar1 = mbedtls_mpi_cmp_int(X_00,0);
  if (iVar1 != 0) {
    mbedtls_mpi_init((mbedtls_mpi *)auStack56);
    mbedtls_mpi_init((mbedtls_mpi *)&Zi.p);
    iVar1 = mbedtls_mpi_inv_mod((mbedtls_mpi *)auStack56,X_00,&grp->P);
    if ((((iVar1 == 0) &&
         (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&Zi.p,(mbedtls_mpi *)auStack56,
                                      (mbedtls_mpi *)auStack56), iVar1 == 0)) &&
        (iVar1 = ecp_modp((mbedtls_mpi *)&Zi.p,grp), iVar1 == 0)) &&
       ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)pt,(mbedtls_mpi *)pt,(mbedtls_mpi *)&Zi.p),
        iVar1 == 0 && (iVar1 = ecp_modp((mbedtls_mpi *)pt,grp), iVar1 == 0)))) {
      X = &pt->Y;
      iVar1 = mbedtls_mpi_mul_mpi(X,X,(mbedtls_mpi *)&Zi.p);
      if (((iVar1 == 0) &&
          ((iVar1 = ecp_modp(X,grp), iVar1 == 0 &&
           (iVar1 = mbedtls_mpi_mul_mpi(X,X,(mbedtls_mpi *)auStack56), iVar1 == 0)))) &&
         (iVar1 = ecp_modp(X,grp), iVar1 == 0)) {
        iVar1 = mbedtls_mpi_lset(X_00,1);
      }
    }
    mbedtls_mpi_free((mbedtls_mpi *)auStack56);
    mbedtls_mpi_free((mbedtls_mpi *)&Zi.p);
  }
  return iVar1;
}



int ecp_normalize_jac_many(mbedtls_ecp_group *grp,mbedtls_ecp_point **T,size_t t_len)

{
  mbedtls_ecp_point **ppmVar1;
  size_t sVar2;
  mbedtls_mpi *A;
  int iVar3;
  mbedtls_mpi *X;
  size_t sVar4;
  mbedtls_mpi *X_00;
  undefined auStack84 [4];
  mbedtls_mpi u;
  mbedtls_mpi Zi;
  mbedtls_mpi ZZi;
  
  if (t_len < 2) {
    iVar3 = ecp_normalize_jac(grp,*T);
  }
  else {
    X = (mbedtls_mpi *)mycalloc(t_len,0xc);
    if (X == (mbedtls_mpi *)0x0) {
      iVar3 = -0x4d80;
    }
    else {
      mbedtls_mpi_init((mbedtls_mpi *)auStack84);
      mbedtls_mpi_init((mbedtls_mpi *)&u.p);
      mbedtls_mpi_init((mbedtls_mpi *)&Zi.p);
      iVar3 = mbedtls_mpi_copy(X,&(*T)->Z);
      if (iVar3 == 0) {
        sVar2 = 1;
        A = X;
        do {
          sVar4 = sVar2;
          X_00 = A + 1;
          iVar3 = mbedtls_mpi_mul_mpi(X_00,A,&T[sVar4]->Z);
          if ((iVar3 != 0) || (iVar3 = ecp_modp(X_00,grp), iVar3 != 0)) goto cleanup;
          sVar2 = sVar4 + 1;
          A = X_00;
        } while (t_len != sVar4 + 1);
        iVar3 = mbedtls_mpi_inv_mod((mbedtls_mpi *)auStack84,X + (t_len - 1),&grp->P);
        if (iVar3 == 0) {
          T = T + t_len;
          do {
            if (sVar4 == 0) {
              iVar3 = mbedtls_mpi_copy((mbedtls_mpi *)&u.p,(mbedtls_mpi *)auStack84);
            }
            else {
              iVar3 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&u.p,(mbedtls_mpi *)auStack84,
                                          X + (sVar4 - 1));
              if (((iVar3 != 0) || (iVar3 = ecp_modp((mbedtls_mpi *)&u.p,grp), iVar3 != 0)) ||
                 (iVar3 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)auStack84,(mbedtls_mpi *)auStack84,
                                              &T[-1]->Z), iVar3 != 0)) break;
              iVar3 = ecp_modp((mbedtls_mpi *)auStack84,grp);
            }
            if (((((iVar3 != 0) ||
                  (iVar3 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&Zi.p,(mbedtls_mpi *)&u.p,
                                               (mbedtls_mpi *)&u.p), iVar3 != 0)) ||
                 ((iVar3 = ecp_modp((mbedtls_mpi *)&Zi.p,grp), iVar3 != 0 ||
                  ((iVar3 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)T[-1],(mbedtls_mpi *)T[-1],
                                                (mbedtls_mpi *)&Zi.p), iVar3 != 0 ||
                   (iVar3 = ecp_modp((mbedtls_mpi *)T[-1],grp), iVar3 != 0)))))) ||
                (iVar3 = mbedtls_mpi_mul_mpi(&T[-1]->Y,&T[-1]->Y,(mbedtls_mpi *)&Zi.p), iVar3 != 0))
               || ((((iVar3 = ecp_modp(&T[-1]->Y,grp), iVar3 != 0 ||
                     (iVar3 = mbedtls_mpi_mul_mpi(&T[-1]->Y,&T[-1]->Y,(mbedtls_mpi *)&u.p),
                     iVar3 != 0)) || (iVar3 = ecp_modp(&T[-1]->Y,grp), iVar3 != 0)) ||
                   ((iVar3 = mbedtls_mpi_shrink((mbedtls_mpi *)T[-1],(grp->P).n), iVar3 != 0 ||
                    (iVar3 = mbedtls_mpi_shrink(&T[-1]->Y,(grp->P).n), iVar3 != 0)))))) break;
            ppmVar1 = T + -1;
            T = T + -1;
            mbedtls_mpi_free(&(*ppmVar1)->Z);
            if (sVar4 == 0) break;
            sVar4 = sVar4 - 1;
          } while( true );
        }
      }
cleanup:
      mbedtls_mpi_free((mbedtls_mpi *)auStack84);
      mbedtls_mpi_free((mbedtls_mpi *)&u.p);
      mbedtls_mpi_free((mbedtls_mpi *)&Zi.p);
      A = X;
      do {
        X_00 = A + 1;
        mbedtls_mpi_free(A);
        A = X_00;
      } while (X + t_len != X_00);
      vPortFree(X);
    }
  }
  return iVar3;
}



void mbedtls_ecp_point_init(mbedtls_ecp_point *pt)

{
  mbedtls_mpi_init((mbedtls_mpi *)pt);
  mbedtls_mpi_init(&pt->Y);
  mbedtls_mpi_init(&pt->Z);
  return;
}



void mbedtls_ecp_point_free(mbedtls_ecp_point *pt)

{
  mbedtls_mpi_free((mbedtls_mpi *)pt);
  mbedtls_mpi_free(&pt->Y);
  mbedtls_mpi_free(&pt->Z);
  return;
}



mbedtls_ecp_group_id * mbedtls_ecp_grp_id_list(void)

{
  int init_done;
  int iVar1;
  mbedtls_ecp_curve_info *pmVar2;
  
  if (init_done == 0) {
    iVar1 = 0;
    pmVar2 = ecp_supported_curves;
    while (pmVar2->grp_id != MBEDTLS_ECP_DP_NONE) {
      ecp_supported_grp_id[iVar1] = pmVar2->grp_id;
      pmVar2 = pmVar2 + 1;
      iVar1 = iVar1 + 1;
    }
    ecp_supported_grp_id[iVar1] = MBEDTLS_ECP_DP_NONE;
  }
  return ecp_supported_grp_id;
}



void mbedtls_ecp_point_init(mbedtls_ecp_point *pt)

{
  if (pt != (mbedtls_ecp_point *)0x0) {
    mbedtls_ecp_point_init(pt);
    return;
  }
  return;
}



void mbedtls_ecp_group_init(mbedtls_ecp_group *grp)

{
  if (grp != (mbedtls_ecp_group *)0x0) {
    memset(grp,0,0x7c);
    return;
  }
  return;
}



void mbedtls_ecp_keypair_init(mbedtls_ecp_keypair *key)

{
  if (key != (mbedtls_ecp_keypair *)0x0) {
    mbedtls_ecp_group_init((mbedtls_ecp_group *)key);
    mbedtls_mpi_init(&key->d);
    mbedtls_ecp_point_init(&key->Q);
    return;
  }
  return;
}



void mbedtls_ecp_point_free(mbedtls_ecp_point *pt)

{
  if (pt != (mbedtls_ecp_point *)0x0) {
    mbedtls_ecp_point_free(pt);
    return;
  }
  return;
}



void mbedtls_ecp_group_free(mbedtls_ecp_group *grp)

{
  uint uVar1;
  mbedtls_ecp_group *pmVar2;
  
  if (grp != (mbedtls_ecp_group *)0x0) {
    if (grp->h != 1) {
      mbedtls_mpi_free(&grp->P);
      mbedtls_mpi_free(&grp->A);
      mbedtls_mpi_free(&grp->B);
      mbedtls_ecp_point_free(&grp->G);
      mbedtls_mpi_free(&grp->N);
    }
    uVar1 = 0;
    if (grp->T != (mbedtls_ecp_point *)0x0) {
      while (uVar1 < grp->T_size) {
        mbedtls_ecp_point_free(grp->T + uVar1);
        uVar1 = uVar1 + 1;
      }
      vPortFree(grp->T);
    }
    pmVar2 = grp + 1;
    while (grp != pmVar2) {
      grp->id = MBEDTLS_ECP_DP_NONE;
      grp = (mbedtls_ecp_group *)&grp->field_0x1;
    }
    return;
  }
  return;
}



void mbedtls_ecp_keypair_free(mbedtls_ecp_keypair *key)

{
  if (key != (mbedtls_ecp_keypair *)0x0) {
    mbedtls_ecp_group_free((mbedtls_ecp_group *)key);
    mbedtls_mpi_free(&key->d);
    mbedtls_ecp_point_free(&key->Q);
    return;
  }
  return;
}



int mbedtls_ecp_copy(mbedtls_ecp_point *P,mbedtls_ecp_point *Q)

{
  int iVar1;
  
  iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)P,(mbedtls_mpi *)Q);
  if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_copy(&P->Y,&Q->Y), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_copy(&P->Z,&Q->Z);
    return iVar1;
  }
  return iVar1;
}



int mbedtls_ecp_group_copy(mbedtls_ecp_group *dst,mbedtls_ecp_group *src)

{
  int iVar1;
  
  iVar1 = mbedtls_ecp_group_load(dst,src->id);
  return iVar1;
}



