pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_ecp_set_zero(mbedtls_ecp_point *pt)

{
  int iVar1;
  
  iVar1 = mbedtls_mpi_lset((mbedtls_mpi *)pt,1);
  if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_lset(&pt->Y,1), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_lset(&pt->Z,0);
    return iVar1;
  }
  return iVar1;
}



int ecp_add_mixed(mbedtls_ecp_group *grp,mbedtls_ecp_point *R,mbedtls_ecp_point *P,
                 mbedtls_ecp_point *Q)

{
  int iVar1;
  mbedtls_ecp_point *Q_00;
  mbedtls_mpi *X_00;
  mbedtls_mpi *X_01;
  int iStack132;
  mbedtls_mpi T1;
  mbedtls_mpi T2;
  mbedtls_mpi T3;
  mbedtls_mpi T4;
  mbedtls_mpi X;
  mbedtls_mpi Y;
  mbedtls_mpi Z;
  
  X_01 = &P->Z;
  iVar1 = mbedtls_mpi_cmp_int(X_01,0);
  Q_00 = Q;
  if (iVar1 == 0) {
LAB_2306410a:
    iVar1 = mbedtls_ecp_copy(R,Q_00);
  }
  else {
    if ((Q->Z).p != (mbedtls_mpi_uint *)0x0) {
      iVar1 = mbedtls_mpi_cmp_int(&Q->Z,0);
      Q_00 = P;
      if (iVar1 == 0) goto LAB_2306410a;
      if (((Q->Z).p != (mbedtls_mpi_uint *)0x0) &&
         (iVar1 = mbedtls_mpi_cmp_int(&Q->Z,1), iVar1 != 0)) {
        return -0x4f80;
      }
    }
    mbedtls_mpi_init((mbedtls_mpi *)&iStack132);
    mbedtls_mpi_init((mbedtls_mpi *)&T1.p);
    mbedtls_mpi_init((mbedtls_mpi *)&T2.p);
    mbedtls_mpi_init((mbedtls_mpi *)&T3.p);
    X_00 = (mbedtls_mpi *)&T4.p;
    mbedtls_mpi_init(X_00);
    mbedtls_mpi_init((mbedtls_mpi *)&X.p);
    mbedtls_mpi_init((mbedtls_mpi *)&Y.p);
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&iStack132,X_01,X_01);
    if ((((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&iStack132,grp), iVar1 == 0)) &&
        (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T1.p,(mbedtls_mpi *)&iStack132,X_01),
        iVar1 == 0)) &&
       (((iVar1 = ecp_modp((mbedtls_mpi *)&T1.p,grp), iVar1 == 0 &&
         (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&iStack132,(mbedtls_mpi *)&iStack132,
                                      (mbedtls_mpi *)Q), iVar1 == 0)) &&
        ((iVar1 = ecp_modp((mbedtls_mpi *)&iStack132,grp), iVar1 == 0 &&
         ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T1.p,(mbedtls_mpi *)&T1.p,&Q->Y), iVar1 == 0
          && (iVar1 = ecp_modp((mbedtls_mpi *)&T1.p,grp), iVar1 == 0)))))))) {
      iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&iStack132,(mbedtls_mpi *)&iStack132,
                                  (mbedtls_mpi *)P);
      while (iVar1 == 0) {
        if ((-1 < iStack132) ||
           (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&iStack132,0), iVar1 == 0)) {
          iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&T1.p,(mbedtls_mpi *)&T1.p,&P->Y);
          goto joined_r0x23064178;
        }
        iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&iStack132,(mbedtls_mpi *)&iStack132,&grp->P);
      }
    }
cleanup:
    mbedtls_mpi_free((mbedtls_mpi *)&iStack132);
    mbedtls_mpi_free((mbedtls_mpi *)&T1.p);
    mbedtls_mpi_free((mbedtls_mpi *)&T2.p);
    mbedtls_mpi_free((mbedtls_mpi *)&T3.p);
    mbedtls_mpi_free(X_00);
    mbedtls_mpi_free((mbedtls_mpi *)&X.p);
    mbedtls_mpi_free((mbedtls_mpi *)&Y.p);
  }
  return iVar1;
joined_r0x23064178:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)T1.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&T1.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&iStack132,0);
    if (iVar1 == 0) {
      iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&T1.p,0);
      if (iVar1 == 0) {
        iVar1 = ecp_double_jac(grp,R,P);
      }
      else {
        iVar1 = mbedtls_ecp_set_zero(R);
      }
    }
    else {
      iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&Y.p,X_01,(mbedtls_mpi *)&iStack132);
      if (((((iVar1 == 0) && (iVar1 = ecp_modp((mbedtls_mpi *)&Y.p,grp), iVar1 == 0)) &&
           (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&iStack132,
                                        (mbedtls_mpi *)&iStack132), iVar1 == 0)) &&
          ((iVar1 = ecp_modp((mbedtls_mpi *)&T2.p,grp), iVar1 == 0 &&
           (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T3.p,(mbedtls_mpi *)&T2.p,
                                        (mbedtls_mpi *)&iStack132), iVar1 == 0)))) &&
         ((iVar1 = ecp_modp((mbedtls_mpi *)&T3.p,grp), iVar1 == 0 &&
          ((iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T2.p,(mbedtls_mpi *)P),
           iVar1 == 0 && (iVar1 = ecp_modp((mbedtls_mpi *)&T2.p,grp), iVar1 == 0)))))) {
        iVar1 = mbedtls_mpi_mul_int((mbedtls_mpi *)&iStack132,(mbedtls_mpi *)&T2.p,2);
        X_01 = &grp->P;
        goto joined_r0x23064214;
      }
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&T1.p,(mbedtls_mpi *)&T1.p,&grp->P);
  goto joined_r0x23064178;
joined_r0x23064214:
  if (iVar1 != 0) goto cleanup;
  iVar1 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&iStack132,X_01);
  if (iVar1 < 0) {
    iVar1 = mbedtls_mpi_mul_mpi(X_00,(mbedtls_mpi *)&T1.p,(mbedtls_mpi *)&T1.p);
    if ((iVar1 == 0) && (iVar1 = ecp_modp(X_00,grp), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_sub_mpi(X_00,X_00,(mbedtls_mpi *)&iStack132);
      goto joined_r0x23064250;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&iStack132,(mbedtls_mpi *)&iStack132,X_01);
  goto joined_r0x23064214;
joined_r0x23064250:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)T4.p) || (iVar1 = mbedtls_mpi_cmp_int(X_00,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_sub_mpi(X_00,X_00,(mbedtls_mpi *)&T3.p);
    goto LAB_23064264;
  }
  iVar1 = mbedtls_mpi_add_mpi(X_00,X_00,X_01);
  goto joined_r0x23064250;
LAB_23064264:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)T4.p) || (iVar1 = mbedtls_mpi_cmp_int(X_00,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T2.p,X_00);
    goto LAB_2306427a;
  }
  iVar1 = mbedtls_mpi_add_mpi(X_00,X_00,X_01);
  goto LAB_23064264;
LAB_2306427a:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)T2.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&T2.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T1.p);
    if ((iVar1 == 0) &&
       (((iVar1 = ecp_modp((mbedtls_mpi *)&T2.p,grp), iVar1 == 0 &&
         (iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&T3.p,(mbedtls_mpi *)&T3.p,&P->Y), iVar1 == 0))
        && (iVar1 = ecp_modp((mbedtls_mpi *)&T3.p,grp), iVar1 == 0)))) {
      iVar1 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&X.p,(mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T3.p);
      goto LAB_230642cc;
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&T2.p,(mbedtls_mpi *)&T2.p,X_01);
  goto LAB_2306427a;
LAB_230642cc:
  if (iVar1 != 0) goto cleanup;
  if ((-1 < (int)X.p) || (iVar1 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&X.p,0), iVar1 == 0)) {
    iVar1 = mbedtls_mpi_copy((mbedtls_mpi *)R,X_00);
    if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_copy(&R->Y,(mbedtls_mpi *)&X.p), iVar1 == 0)) {
      iVar1 = mbedtls_mpi_copy(&R->Z,(mbedtls_mpi *)&Y.p);
    }
    goto cleanup;
  }
  iVar1 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&X.p,(mbedtls_mpi *)&X.p,X_01);
  goto LAB_230642cc;
}



int ecp_mul_comb(mbedtls_ecp_group *grp,mbedtls_ecp_point *R,mbedtls_mpi *m,mbedtls_ecp_point *P,
                anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
  byte bVar1;
  byte bVar2;
  byte bVar3;
  uint uVar4;
  mbedtls_mpi_uint **ppmVar5;
  int iVar6;
  int iVar7;
  int iVar8;
  int iVar9;
  uint uVar10;
  uchar t_len;
  uint uVar11;
  uint uVar12;
  mbedtls_ecp_point *P_00;
  mbedtls_ecp_point *P_01;
  uint uVar13;
  uint uVar14;
  size_t pos;
  mbedtls_mpi *X;
  uint numitems;
  uint uVar15;
  mbedtls_mpi_uint **ppmVar16;
  int iVar17;
  size_t t_len_00;
  undefined auStack412 [4];
  mbedtls_mpi M;
  mbedtls_mpi mm;
  mbedtls_mpi l;
  mbedtls_mpi ll;
  mbedtls_ecp_point Txi;
  uchar k [262];
  
  mbedtls_mpi_init((mbedtls_mpi *)auStack412);
  mbedtls_mpi_init((mbedtls_mpi *)&M.p);
  iVar6 = mbedtls_mpi_get_bit(&grp->N,0);
  if (iVar6 != 1) {
    return -0x4f80;
  }
  uVar13 = (uint)(0x17f < grp->nbits);
  iVar6 = mbedtls_mpi_cmp_mpi(&P->Y,&(grp->G).Y);
  uVar14 = uVar13 + 4;
  if (iVar6 == 0) {
    iVar7 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)P,(mbedtls_mpi *)&grp->G);
    if (iVar7 == 0) {
      uVar14 = uVar13 + 5;
      iVar6 = 1;
    }
  }
  else {
    iVar6 = 0;
  }
  if (grp->nbits <= uVar14) {
    uVar14 = 2;
  }
  uVar15 = uVar14 - 1;
  numitems = 1 << (uVar15 & 0x1f);
  uVar13 = ((grp->nbits - 1) + uVar14) / uVar14;
  if ((iVar6 == 0) || (P_01 = grp->T, P_01 == (mbedtls_ecp_point *)0x0)) {
    P_01 = (mbedtls_ecp_point *)mycalloc(numitems,0x24);
    if (P_01 == (mbedtls_ecp_point *)0x0) {
      iVar7 = -0x4d80;
      goto LAB_2306451a;
    }
    iVar7 = mbedtls_ecp_copy(P_01,P);
    if (iVar7 == 0) {
      t_len_00 = 0;
      uVar11 = 1;
      while (uVar12 = uVar11 >> (uVar15 & 0x1f), uVar12 == 0) {
        P_00 = P_01 + uVar11;
        iVar7 = mbedtls_ecp_copy(P_00,P_01 + (uVar11 >> 1));
        if (iVar7 != 0) goto LAB_230644f6;
        while (uVar13 != uVar12) {
          iVar7 = ecp_double_jac(grp,P_00,P_00);
          if (iVar7 != 0) goto LAB_230644f6;
          uVar12 = uVar12 + 1;
        }
        *(mbedtls_ecp_point **)(&Txi.Z.p + t_len_00) = P_00;
        uVar11 = (uVar11 & 0x7f) << 1;
        t_len_00 = t_len_00 + 1 & 0xff;
      }
      iVar7 = ecp_normalize_jac_many(grp,(mbedtls_ecp_point **)&Txi.Z.p,t_len_00);
      if (iVar7 == 0) {
        t_len_00 = 0;
        uVar11 = 1;
        while (uVar11 >> (uVar15 & 0x1f) == 0) {
          uVar10 = t_len_00 + uVar11;
          P_00 = P_01 + uVar11;
          uVar12 = uVar11;
          while( true ) {
            t_len_00 = (uVar10 & 0xff) - uVar12 & 0xff;
            uVar4 = uVar12 - 1;
            if (uVar12 == 0) break;
            iVar7 = ecp_add_mixed(grp,P_00 + uVar4,P_01 + uVar4,P_00);
            if (iVar7 != 0) goto LAB_230644f6;
            *(mbedtls_ecp_point **)(&Txi.Z.p + t_len_00) = P_00 + uVar4;
            uVar12 = uVar4;
          }
          uVar11 = (uVar11 & 0x7f) << 1;
        }
        iVar7 = ecp_normalize_jac_many(grp,(mbedtls_ecp_point **)&Txi.Z.p,t_len_00);
        if (iVar7 == 0) {
          if (iVar6 != 0) {
            grp->T = P_01;
            grp->T_size = numitems;
          }
          goto LAB_23064618;
        }
      }
    }
  }
  else {
LAB_23064618:
    iVar8 = mbedtls_mpi_get_bit(m,0);
    iVar7 = mbedtls_mpi_copy((mbedtls_mpi *)auStack412,m);
    if ((iVar7 == 0) && (iVar7 = mbedtls_mpi_sub_mpi((mbedtls_mpi *)&M.p,&grp->N,m), iVar7 == 0)) {
      iVar7 = mbedtls_mpi_safe_cond_assign((mbedtls_mpi *)auStack412,(mbedtls_mpi *)&M.p,iVar8 != 1)
      ;
      if (iVar7 == 0) {
        ppmVar5 = &Txi.Z.p;
        memset(&Txi.Z.p,0,uVar13 + 1);
        t_len_00 = 0;
        ppmVar16 = ppmVar5;
        while (uVar13 != t_len_00) {
          uVar15 = 0;
          pos = t_len_00;
          do {
            iVar7 = mbedtls_mpi_get_bit((mbedtls_mpi *)auStack412,pos);
            *(byte *)ppmVar16 = (byte)(iVar7 << (uVar15 & 0x1f)) | *(byte *)ppmVar16;
            uVar15 = uVar15 + 1;
            pos = pos + uVar13;
          } while (uVar15 < uVar14);
          t_len_00 = t_len_00 + 1;
          ppmVar16 = (mbedtls_mpi_uint **)((int)ppmVar16 + 1);
        }
        uVar13 = 0;
        while (ppmVar5 != (mbedtls_mpi_uint **)((int)&Txi.Z.p + t_len_00)) {
          bVar1 = *(byte *)((int)ppmVar5 + 1);
          uVar14 = bVar1 ^ uVar13;
          uVar15 = ~uVar14 & 1;
          bVar3 = *(byte *)ppmVar5 * (char)uVar15;
          *(byte *)ppmVar5 = (byte)(uVar15 << 7) | *(byte *)ppmVar5;
          bVar2 = (byte)uVar14;
          *(byte *)(mbedtls_mpi_uint **)((int)ppmVar5 + 1) = bVar2 ^ bVar3;
          uVar13 = bVar1 & uVar13 | (int)(char)(bVar2 & bVar3) & 0xffU;
          ppmVar5 = (mbedtls_mpi_uint **)((int)ppmVar5 + 1);
        }
        mbedtls_ecp_point_init((mbedtls_ecp_point *)&ll.p);
        t_len = (uchar)(numitems & 0xff);
        iVar7 = ecp_select_comb(grp,R,P_01,t_len,*(uchar *)((int)&Txi.Z.p + t_len_00));
        if (iVar7 == 0) {
          X = &R->Z;
          iVar9 = mbedtls_mpi_lset(X,1);
          iVar7 = iVar9;
          if (iVar9 == 0) {
            if (f_rng != (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0) {
              pos = grp->pbits;
              mbedtls_mpi_init((mbedtls_mpi *)&mm.p);
              mbedtls_mpi_init((mbedtls_mpi *)&l.p);
              iVar17 = 0xc;
              do {
                mbedtls_mpi_fill_random((mbedtls_mpi *)&mm.p,pos + 7 >> 3,f_rng,p_rng);
                while (iVar7 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&mm.p,&grp->P), -1 < iVar7) {
                  iVar7 = mbedtls_mpi_shift_r((mbedtls_mpi *)&mm.p,1);
                  if (iVar7 != 0) goto cleanup;
                }
                iVar17 = iVar17 + -1;
                if (iVar17 == 0) {
                  iVar7 = -0x4d00;
                  goto cleanup;
                }
                iVar7 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&mm.p,1);
              } while (iVar7 < 1);
              iVar7 = mbedtls_mpi_mul_mpi(X,X,(mbedtls_mpi *)&mm.p);
              if ((((iVar7 == 0) && (iVar7 = ecp_modp(X,grp), iVar7 == 0)) &&
                  (iVar7 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&l.p,(mbedtls_mpi *)&mm.p,
                                               (mbedtls_mpi *)&mm.p), iVar7 == 0)) &&
                 (((iVar7 = ecp_modp((mbedtls_mpi *)&l.p,grp), iVar7 == 0 &&
                   (iVar7 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)R,(mbedtls_mpi *)R,
                                                (mbedtls_mpi *)&l.p), iVar7 == 0)) &&
                  ((iVar7 = ecp_modp((mbedtls_mpi *)R,grp), iVar7 == 0 &&
                   ((iVar7 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&l.p,(mbedtls_mpi *)&l.p,
                                                 (mbedtls_mpi *)&mm.p), iVar7 == 0 &&
                    (iVar7 = ecp_modp((mbedtls_mpi *)&l.p,grp), iVar7 == 0)))))))) {
                X = &R->Y;
                iVar7 = mbedtls_mpi_mul_mpi(X,X,(mbedtls_mpi *)&l.p);
                if (iVar7 == 0) {
                  iVar7 = ecp_modp(X,grp);
                }
              }
cleanup:
              mbedtls_mpi_free((mbedtls_mpi *)&mm.p);
              mbedtls_mpi_free((mbedtls_mpi *)&l.p);
              if (iVar7 != 0) goto cleanup;
            }
            do {
              iVar7 = iVar9;
              if (((t_len_00 - 1 == 0xffffffff) || (iVar7 = ecp_double_jac(grp,R,R), iVar7 != 0)) ||
                 (iVar7 = ecp_select_comb(grp,(mbedtls_ecp_point *)&ll.p,P_01,t_len,
                                          *(uchar *)((int)&Txi.Z.n + t_len_00 + 3)), iVar7 != 0))
              break;
              iVar7 = ecp_add_mixed(grp,R,R,(mbedtls_ecp_point *)&ll.p);
              t_len_00 = t_len_00 - 1;
            } while (iVar7 == 0);
          }
        }
cleanup:
        mbedtls_ecp_point_free((mbedtls_ecp_point *)&ll.p);
        if ((iVar7 == 0) && (iVar7 = ecp_safe_invert_jac(grp,R,iVar8 != 1), iVar7 == 0)) {
          iVar7 = ecp_normalize_jac(grp,R);
        }
      }
    }
  }
LAB_230644f6:
  if (iVar6 == 0) {
    uVar13 = 0;
    do {
      uVar14 = uVar13 + 1;
      mbedtls_ecp_point_free(P_01 + uVar13);
      uVar13 = uVar14;
    } while ((uVar14 & 0xff) < (numitems & 0xff));
    vPortFree(P_01);
  }
LAB_2306451a:
  mbedtls_mpi_free((mbedtls_mpi *)auStack412);
  mbedtls_mpi_free((mbedtls_mpi *)&M.p);
  if (iVar7 != 0) {
    mbedtls_ecp_point_free(R);
  }
  return iVar7;
}



