pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_ecp_point_read_binary
              (mbedtls_ecp_group *grp,mbedtls_ecp_point *pt,uchar *buf,size_t ilen)

{
  int iVar1;
  size_t buflen;
  
  if (ilen != 0) {
    if (*buf != '\0') {
      buflen = mbedtls_mpi_size(&grp->P);
      if (*buf == '\x04') {
        if (ilen == buflen * 2 + 1) {
          iVar1 = mbedtls_mpi_read_binary((mbedtls_mpi *)pt,buf + 1,buflen);
          if ((iVar1 == 0) &&
             (iVar1 = mbedtls_mpi_read_binary(&pt->Y,buf + buflen + 1,buflen), iVar1 == 0)) {
            iVar1 = mbedtls_mpi_lset(&pt->Z,1);
            return iVar1;
          }
        }
        else {
          iVar1 = -0x4f80;
        }
      }
      else {
        iVar1 = -0x4e80;
      }
      return iVar1;
    }
    if (ilen == 1) {
      iVar1 = mbedtls_ecp_set_zero(pt);
      return iVar1;
    }
  }
  return -0x4f80;
}



int mbedtls_ecp_check_pubkey(mbedtls_ecp_group *grp,mbedtls_ecp_point *pt)

{
  mbedtls_mpi *X;
  ecp_curve_type eVar1;
  int iVar2;
  undefined3 extraout_var;
  mbedtls_mpi *Y;
  undefined auStack56 [4];
  mbedtls_mpi YY;
  mbedtls_mpi RHS;
  
  iVar2 = mbedtls_mpi_cmp_int(&pt->Z,1);
  if (iVar2 == 0) {
    eVar1 = ecp_get_type(grp);
    if (CONCAT31(extraout_var,eVar1) != 1) {
      return -0x4f80;
    }
    iVar2 = mbedtls_mpi_cmp_int((mbedtls_mpi *)pt,0);
    if (-1 < iVar2) {
      X = &pt->Y;
      iVar2 = mbedtls_mpi_cmp_int(X,0);
      if (-1 < iVar2) {
        Y = &grp->P;
        iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)pt,Y);
        if ((iVar2 < 0) && (iVar2 = mbedtls_mpi_cmp_mpi(X,Y), iVar2 < 0)) {
          mbedtls_mpi_init((mbedtls_mpi *)auStack56);
          mbedtls_mpi_init((mbedtls_mpi *)&YY.p);
          iVar2 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)auStack56,X,X);
          if ((iVar2 == 0) &&
             (((iVar2 = ecp_modp((mbedtls_mpi *)auStack56,grp), iVar2 == 0 &&
               (iVar2 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)pt,(mbedtls_mpi *)pt
                                           ), iVar2 == 0)) &&
              (iVar2 = ecp_modp((mbedtls_mpi *)&YY.p,grp), iVar2 == 0)))) {
            if ((grp->A).p == (mbedtls_mpi_uint *)0x0) {
              iVar2 = mbedtls_mpi_sub_int((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,3);
              while (iVar2 == 0) {
                if ((-1 < (int)YY.p) ||
                   (iVar2 = mbedtls_mpi_cmp_int((mbedtls_mpi *)&YY.p,0), iVar2 == 0))
                goto LAB_230649e4;
                iVar2 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,Y);
              }
            }
            else {
              iVar2 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,&grp->A);
              while (iVar2 == 0) {
                iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&YY.p,Y);
                if (iVar2 < 0) goto LAB_230649e4;
                iVar2 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,Y);
              }
            }
          }
          goto cleanup;
        }
      }
    }
  }
  return -0x4c80;
LAB_230649e4:
  iVar2 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,(mbedtls_mpi *)pt);
  if ((iVar2 == 0) && (iVar2 = ecp_modp((mbedtls_mpi *)&YY.p,grp), iVar2 == 0)) {
    iVar2 = mbedtls_mpi_add_mpi((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,&grp->B);
    while (iVar2 == 0) {
      iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&YY.p,Y);
      if (iVar2 < 0) {
        iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack56,(mbedtls_mpi *)&YY.p);
        if (iVar2 != 0) {
          iVar2 = -0x4c80;
        }
        break;
      }
      iVar2 = mbedtls_mpi_sub_abs((mbedtls_mpi *)&YY.p,(mbedtls_mpi *)&YY.p,Y);
    }
  }
cleanup:
  mbedtls_mpi_free((mbedtls_mpi *)auStack56);
  mbedtls_mpi_free((mbedtls_mpi *)&YY.p);
  return iVar2;
}



int mbedtls_ecp_check_privkey(mbedtls_ecp_group *grp,mbedtls_mpi *d)

{
  ecp_curve_type eVar1;
  undefined3 extraout_var;
  int iVar2;
  
  eVar1 = ecp_get_type(grp);
  if (CONCAT31(extraout_var,eVar1) == 1) {
    iVar2 = mbedtls_mpi_cmp_int(d,1);
    if ((-1 < iVar2) && (iVar2 = mbedtls_mpi_cmp_mpi(d,&grp->N), iVar2 < 0)) {
      return 0;
    }
    iVar2 = -0x4c80;
  }
  else {
    iVar2 = -0x4f80;
  }
  return iVar2;
}



int mbedtls_ecp_mul(mbedtls_ecp_group *grp,mbedtls_ecp_point *R,mbedtls_mpi *m,mbedtls_ecp_point *P,
                   anon_subr_int_void_ptr_uchar_ptr_size_t *f_rng,void *p_rng)

{
  ecp_curve_type eVar1;
  int iVar2;
  undefined3 extraout_var;
  
  iVar2 = mbedtls_mpi_cmp_int(&P->Z,1);
  if (iVar2 == 0) {
    iVar2 = mbedtls_ecp_check_privkey(grp,m);
    if (((iVar2 == 0) && (iVar2 = mbedtls_ecp_check_pubkey(grp,P), iVar2 == 0)) &&
       (eVar1 = ecp_get_type(grp), CONCAT31(extraout_var,eVar1) == 1)) {
      iVar2 = ecp_mul_comb(grp,R,m,P,f_rng,p_rng);
      return iVar2;
    }
  }
  else {
    iVar2 = -0x4f80;
  }
  return iVar2;
}



int mbedtls_ecp_check_pub_priv(mbedtls_ecp_keypair *pub,mbedtls_ecp_keypair *prv)

{
  mbedtls_ecp_group_id mVar1;
  int iVar2;
  mbedtls_mpi *Y;
  mbedtls_mpi *Y_00;
  undefined auStack192 [4];
  mbedtls_ecp_point Q;
  mbedtls_ecp_group grp;
  
  mVar1 = (pub->grp).id;
  if ((mVar1 != MBEDTLS_ECP_DP_NONE) && ((prv->grp).id == mVar1)) {
    iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&pub->Q,(mbedtls_mpi *)&prv->Q);
    if (iVar2 == 0) {
      Y_00 = &(prv->Q).Y;
      iVar2 = mbedtls_mpi_cmp_mpi(&(pub->Q).Y,Y_00);
      if (iVar2 == 0) {
        Y = &(prv->Q).Z;
        iVar2 = mbedtls_mpi_cmp_mpi(&(pub->Q).Z,Y);
        if (iVar2 == 0) {
          mbedtls_ecp_point_init((mbedtls_ecp_point *)auStack192);
          memset(&Q.Z.p,0,0x7c);
          mbedtls_ecp_group_copy((mbedtls_ecp_group *)&Q.Z.p,(mbedtls_ecp_group *)prv);
          iVar2 = mbedtls_ecp_mul((mbedtls_ecp_group *)&Q.Z.p,(mbedtls_ecp_point *)auStack192,
                                  &prv->d,&(prv->grp).G,
                                  (anon_subr_int_void_ptr_uchar_ptr_size_t *)0x0,(void *)0x0);
          if ((iVar2 == 0) &&
             (((iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)auStack192,(mbedtls_mpi *)&prv->Q),
               iVar2 != 0 || (iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&Q.X.p,Y_00), iVar2 != 0))
              || (iVar2 = mbedtls_mpi_cmp_mpi((mbedtls_mpi *)&Q.Y.p,Y), iVar2 != 0)))) {
            iVar2 = -0x4f80;
          }
          mbedtls_ecp_point_free((mbedtls_ecp_point *)auStack192);
          mbedtls_ecp_group_free((mbedtls_ecp_group *)&Q.Z.p);
          return iVar2;
        }
      }
    }
  }
  return -0x4f80;
}



int ecp_mod_koblitz(mbedtls_mpi *N,mbedtls_mpi_uint *Rp,size_t p_limbs)

{
  int iVar1;
  uint uVar2;
  size_t sVar3;
  mbedtls_mpi_uint **__s;
  int iStack100;
  mbedtls_mpi M;
  mbedtls_mpi R;
  mbedtls_mpi_uint Mp [11];
  
  if (N->n < p_limbs) {
    return 0;
  }
  __s = &R.p;
  M.p = (mbedtls_mpi_uint *)0x1;
  R.s = 2;
  iStack100 = 1;
  uVar2 = N->n - p_limbs;
  M.s = p_limbs;
  if (uVar2 <= p_limbs) {
    M.s = uVar2;
  }
  M.n = (size_t)__s;
  R.n = (size_t)Rp;
  memset(__s,0,0x2c);
  memcpy(__s,N->p + p_limbs,M.s << 2);
  M.s = M.s + R.s;
  sVar3 = p_limbs;
  while (sVar3 < N->n) {
    N->p[sVar3] = 0;
    sVar3 = sVar3 + 1;
  }
  iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&iStack100,(mbedtls_mpi *)&iStack100,
                              (mbedtls_mpi *)&M.p);
  if ((iVar1 == 0) && (iVar1 = mbedtls_mpi_add_abs(N,N,(mbedtls_mpi *)&iStack100), iVar1 == 0)) {
    uVar2 = N->n - p_limbs;
    M.s = p_limbs;
    if (uVar2 <= p_limbs) {
      M.s = uVar2;
    }
    memset(__s,0,0x2c);
    memcpy(__s,N->p + p_limbs,M.s << 2);
    M.s = M.s + R.s;
    while (p_limbs < N->n) {
      N->p[p_limbs] = 0;
      p_limbs = p_limbs + 1;
    }
    iVar1 = mbedtls_mpi_mul_mpi((mbedtls_mpi *)&iStack100,(mbedtls_mpi *)&iStack100,
                                (mbedtls_mpi *)&M.p);
    if (iVar1 == 0) {
      iVar1 = mbedtls_mpi_add_abs(N,N,(mbedtls_mpi *)&iStack100);
    }
  }
  return iVar1;
}



int ecp_mod_p224k1(mbedtls_mpi *N)

{
  mbedtls_mpi_uint Rp [2];
  int iVar1;
  
  iVar1 = ecp_mod_koblitz(N,(mbedtls_mpi_uint *)&ram0x4200d980,7);
  return iVar1;
}



