pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int ecp_mod_p256k1(mbedtls_mpi *N)

{
  mbedtls_mpi_uint Rp [2];
  int iVar1;
  
  iVar1 = ecp_mod_koblitz(N,(mbedtls_mpi_uint *)&ram0x4200d988,8);
  return iVar1;
}



int mbedtls_ecp_group_load(mbedtls_ecp_group *grp,mbedtls_ecp_group_id id)

{
  size_t sVar1;
  undefined3 in_register_0000202d;
  int iVar2;
  mbedtls_mpi_uint *pmVar3;
  
  iVar2 = CONCAT31(in_register_0000202d,id);
  mbedtls_ecp_group_free(grp);
  grp->id = id;
  if (iVar2 == 0xb) {
    (grp->P).p = secp224k1_p;
    (grp->A).p = secp224k1_a;
    (grp->B).p = secp224k1_b;
    (grp->N).n = 8;
    grp->modp = ecp_mod_p224k1;
    (grp->N).p = secp224k1_n;
    (grp->P).n = 7;
    (grp->G).X.n = 7;
    (grp->G).Y.n = 7;
    (grp->P).s = 1;
    (grp->A).s = 1;
    (grp->A).n = 1;
    (grp->B).s = 1;
    (grp->B).n = 1;
    (grp->N).s = 1;
    (grp->G).X.s = 1;
    (grp->G).X.p = secp224k1_gx;
    (grp->G).Y.s = 1;
    pmVar3 = secp224k1_gy;
  }
  else {
    if (iVar2 == 0xc) {
      (grp->P).p = secp256k1_p;
      (grp->A).p = secp256k1_a;
      (grp->B).p = secp256k1_b;
      grp->modp = ecp_mod_p256k1;
      (grp->N).p = secp256k1_n;
      (grp->P).n = 8;
      (grp->N).n = 8;
      (grp->G).X.n = 8;
      (grp->G).Y.n = 8;
      (grp->P).s = 1;
      (grp->A).s = 1;
      (grp->A).n = 1;
      (grp->B).s = 1;
      (grp->B).n = 1;
      (grp->N).s = 1;
      (grp->G).X.s = 1;
      (grp->G).X.p = secp256k1_gx;
      (grp->G).Y.s = 1;
      pmVar3 = secp256k1_gy;
    }
    else {
      if (iVar2 != 3) {
        mbedtls_ecp_group_free(grp);
        return -0x4e80;
      }
      (grp->P).p = secp256r1_p;
      (grp->B).p = secp256r1_b;
      (grp->N).p = secp256r1_n;
      (grp->P).n = 8;
      (grp->B).n = 8;
      (grp->N).n = 8;
      (grp->G).X.n = 8;
      (grp->G).Y.n = 8;
      (grp->P).s = 1;
      (grp->B).s = 1;
      (grp->N).s = 1;
      (grp->G).X.s = 1;
      (grp->G).X.p = secp256r1_gx;
      (grp->G).Y.s = 1;
      pmVar3 = secp256r1_gy;
    }
  }
  (grp->G).Y.p = pmVar3;
  (grp->G).Z.p = &one_2614;
  (grp->G).Z.s = 1;
  (grp->G).Z.n = 1;
  sVar1 = mbedtls_mpi_bitlen(&grp->P);
  grp->pbits = sVar1;
  sVar1 = mbedtls_mpi_bitlen(&grp->N);
  grp->nbits = sVar1;
  grp->h = 1;
  return 0;
}



void gcm_mult(mbedtls_gcm_context *ctx,uchar *x,uchar *output)

{
  mbedtls_cipher_info_t *pmVar1;
  mbedtls_cipher_info_t **ppmVar2;
  mbedtls_cipher_info_t *pmVar3;
  mbedtls_cipher_info_t *pmVar4;
  mbedtls_cipher_info_t *pmVar5;
  uint uVar6;
  int iVar7;
  uint uVar8;
  uint uVar9;
  
  iVar7 = 0xf;
  ppmVar2 = &(ctx->cipher_ctx).cipher_info + ((uint)x[0xf] & 0xf) * 2;
  pmVar1 = ppmVar2[0x30];
  pmVar4 = ppmVar2[0x31];
  pmVar5 = ppmVar2[0x10];
  pmVar3 = ppmVar2[0x11];
  do {
    uVar8 = (int)pmVar1 << 0x1c;
    uVar6 = (int)pmVar4 << 0x1c;
    if (iVar7 != 0xf) {
      ppmVar2 = &(ctx->cipher_ctx).cipher_info + ((uint)x[iVar7] & 0xf) * 2;
      pmVar4 = (mbedtls_cipher_info_t *)
               ((uint)ppmVar2[0x31] ^
               *(int *)(last4 + ((uint)pmVar5 & 0xf)) << 0x10 ^ (uint)pmVar4 >> 4);
      pmVar1 = (mbedtls_cipher_info_t *)((uint)ppmVar2[0x30] ^ (uVar6 | (uint)pmVar1 >> 4));
      pmVar5 = (mbedtls_cipher_info_t *)
               ((uint)ppmVar2[0x10] ^ ((uint)pmVar5 >> 4 | (int)pmVar3 << 0x1c));
      pmVar3 = (mbedtls_cipher_info_t *)((uint)ppmVar2[0x11] ^ (uVar8 | (uint)pmVar3 >> 4));
    }
    ppmVar2 = &(ctx->cipher_ctx).cipher_info + (uint)(x[iVar7] >> 4) * 2;
    uVar8 = (int)pmVar1 << 0x1c;
    uVar9 = (int)pmVar4 << 0x1c;
    uVar6 = (uint)ppmVar2[0x31] ^ (uint)pmVar4 >> 4;
    pmVar4 = (mbedtls_cipher_info_t *)(uVar6 ^ *(int *)(last4 + ((uint)pmVar5 & 0xf)) << 0x10);
    iVar7 = iVar7 + -1;
    pmVar1 = (mbedtls_cipher_info_t *)((uint)ppmVar2[0x30] ^ (uVar9 | (uint)pmVar1 >> 4));
    pmVar5 = (mbedtls_cipher_info_t *)
             ((uint)ppmVar2[0x10] ^ ((int)pmVar3 << 0x1c | (uint)pmVar5 >> 4));
    pmVar3 = (mbedtls_cipher_info_t *)((uint)ppmVar2[0x11] ^ (uVar8 | (uint)pmVar3 >> 4));
  } while (iVar7 != -1);
  *output = (uchar)((uint)pmVar4 >> 0x18);
  output[1] = (uchar)((uint)pmVar4 >> 0x10);
  output[3] = (uchar)uVar6;
  output[4] = (uchar)((uint)pmVar1 >> 0x18);
  output[5] = (uchar)((uint)pmVar1 >> 0x10);
  output[6] = (uchar)((uint)pmVar1 >> 8);
  output[8] = (uchar)((uint)pmVar3 >> 0x18);
  output[9] = (uchar)((uint)pmVar3 >> 0x10);
  output[10] = (uchar)((uint)pmVar3 >> 8);
  output[0xc] = (uchar)((uint)pmVar5 >> 0x18);
  output[0xd] = (uchar)((uint)pmVar5 >> 0x10);
  output[2] = (uchar)(uVar6 >> 8);
  output[7] = (uchar)pmVar1;
  output[0xb] = (uchar)pmVar3;
  output[0xe] = (uchar)((uint)pmVar5 >> 8);
  output[0xf] = (uchar)pmVar5;
  return;
}



void mbedtls_gcm_init(mbedtls_gcm_context *ctx)

{
  memset(ctx,0,0x188);
  return;
}



// WARNING: Variable defined which should be unmapped: h
// WARNING: Could not reconcile some variable overlaps

int mbedtls_gcm_setkey(mbedtls_gcm_context *ctx,mbedtls_cipher_id_t cipher,uchar *key,uint keybits)

{
  uint64_t *puVar1;
  uint uVar2;
  uint64_t *puVar3;
  mbedtls_cipher_info_t *cipher_info;
  int iVar4;
  uint uVar5;
  mbedtls_cipher_info_t **ppmVar6;
  mbedtls_cipher_info_t *pmVar7;
  mbedtls_cipher_info_t *pmVar8;
  int iVar9;
  mbedtls_cipher_info_t *pmVar10;
  uint64_t *puVar11;
  int iVar12;
  int iVar13;
  uint64_t *puVar14;
  uint uVar15;
  uint *puVar16;
  uint uVar17;
  size_t sStack36;
  size_t olen;
  uchar h [16];
  
  cipher_info = mbedtls_cipher_info_from_values(cipher,keybits,MBEDTLS_MODE_ECB);
  if (cipher_info == (mbedtls_cipher_info_t *)0x0) {
    iVar4 = -0x14;
  }
  else {
    iVar4 = -0x14;
    if (cipher_info->block_size == 0x10) {
      mbedtls_cipher_free((mbedtls_cipher_context_t *)ctx);
      iVar4 = mbedtls_cipher_setup((mbedtls_cipher_context_t *)ctx,cipher_info);
      if ((iVar4 == 0) &&
         (iVar4 = mbedtls_cipher_setkey((mbedtls_cipher_context_t *)ctx,key,keybits,MBEDTLS_ENCRYPT)
         , iVar4 == 0)) {
        sStack36 = 0;
        memset(&olen,0,0x10);
        iVar4 = mbedtls_cipher_update
                          ((mbedtls_cipher_context_t *)ctx,(uchar *)&olen,0x10,(uchar *)&olen,
                           &sStack36);
        if (iVar4 == 0) {
          cipher_info = (mbedtls_cipher_info_t *)
                        ((uint)h[0] << 0x18 | (uint)h[1] << 0x10 | (uint)h[3] | (uint)h[2] << 8);
          pmVar10 = (mbedtls_cipher_info_t *)
                    ((uint)(byte)olen << 0x18 | (uint)olen._1_1_ << 0x10 | (uint)olen._3_1_ |
                    (uint)olen._2_1_ << 8);
          pmVar8 = (mbedtls_cipher_info_t *)
                   ((uint)h[4] << 0x18 | (uint)h[5] << 0x10 | (uint)h[7] | (uint)h[6] << 8);
          *(undefined4 *)((int)ctx->HH + 4) = 0;
          *(undefined4 *)((int)ctx->HL + 4) = 0;
          *(mbedtls_cipher_info_t **)((int)ctx->HL + 0x44) = pmVar8;
          *(mbedtls_cipher_info_t **)(ctx->HH + 8) = cipher_info;
          *(mbedtls_cipher_info_t **)((int)ctx->HH + 0x44) = pmVar10;
          pmVar7 = (mbedtls_cipher_info_t *)
                   ((uint)h[8] << 0x18 | (uint)h[9] << 0x10 | (uint)h[11] | (uint)h[10] << 8);
          *(undefined4 *)ctx->HH = 0;
          *(undefined4 *)ctx->HL = 0;
          *(mbedtls_cipher_info_t **)(ctx->HL + 8) = pmVar7;
          iVar12 = 3;
          iVar13 = 4;
          do {
            uVar5 = (uint)pmVar7 & 1;
            uVar15 = (int)pmVar8 << 0x1f;
            pmVar8 = (mbedtls_cipher_info_t *)((int)cipher_info << 0x1f | (uint)pmVar8 >> 1);
            uVar2 = (int)pmVar10 << 0x1f;
            pmVar7 = (mbedtls_cipher_info_t *)(uVar15 | (uint)pmVar7 >> 1);
            pmVar10 = (mbedtls_cipher_info_t *)((uint)pmVar10 >> 1 ^ uVar5 * -0x1f000000);
            ppmVar6 = &(ctx->cipher_ctx).cipher_info + iVar13 * 2;
            cipher_info = (mbedtls_cipher_info_t *)(uVar2 | (uint)cipher_info >> 1);
            ppmVar6[0x10] = pmVar7;
            ppmVar6[0x11] = pmVar8;
            ppmVar6[0x30] = cipher_info;
            ppmVar6[0x31] = pmVar10;
            iVar12 = iVar12 + -1;
            iVar13 = iVar13 >> 1;
          } while (iVar12 != 0);
          iVar13 = 3;
          iVar12 = 2;
          do {
            puVar14 = ctx->HL + iVar12;
            puVar3 = ctx->HH + iVar12;
            uVar15 = *(uint *)puVar3;
            uVar5 = *(uint *)((int)puVar3 + 4);
            uVar2 = *(uint *)puVar14;
            uVar17 = *(uint *)((int)puVar14 + 4);
            iVar9 = 8;
            puVar1 = ctx->HL;
            do {
              puVar11 = puVar1 + 1;
              *(uint *)((int)puVar3 + iVar9) = *(uint *)(puVar11 + 0x10) ^ uVar15;
              ((uint *)((int)puVar3 + iVar9))[1] = *(uint *)((int)puVar1 + 0x8c) ^ uVar5;
              puVar16 = (uint *)((int)puVar14 + iVar9);
              iVar9 = iVar9 + 8;
              *puVar16 = *(uint *)puVar11 ^ uVar2;
              puVar16[1] = *(uint *)((int)puVar1 + 0xc) ^ uVar17;
              puVar1 = puVar11;
            } while (iVar12 * 8 != iVar9);
            iVar13 = iVar13 + -1;
            iVar12 = iVar12 << 1;
          } while (iVar13 != 0);
        }
      }
    }
  }
  return iVar4;
}



int mbedtls_gcm_starts(mbedtls_gcm_context *ctx,int mode,uchar *iv,size_t iv_len,uchar *add,
                      size_t add_len)

{
  byte bVar1;
  uint uVar2;
  int iVar3;
  byte *pbVar4;
  byte *pbVar5;
  byte *x;
  size_t *psVar6;
  uint uVar7;
  byte *x_00;
  size_t sStack68;
  size_t olen;
  uchar work_buf [16];
  
  x = ctx->y;
  sStack68 = 0;
  x_00 = ctx->buf;
  memset(x,0,0x10);
  memset(x_00,0,0x10);
  *(undefined4 *)&ctx->len = 0;
  *(undefined4 *)&ctx->add_len = 0;
  ctx->mode = mode;
  *(undefined4 *)((int)&ctx->len + 4) = 0;
  *(undefined4 *)((int)&ctx->add_len + 4) = 0;
  if (iv_len == 0xc) {
    memcpy(x,iv,0xc);
    ctx->y[0xf] = '\x01';
  }
  else {
    memset(&olen,0,0x10);
    while (iv_len != 0) {
      uVar2 = iv_len;
      if (0x10 < iv_len) {
        uVar2 = 0x10;
      }
      uVar7 = 0;
      pbVar4 = x;
      do {
        pbVar5 = iv + uVar7;
        uVar7 = uVar7 + 1;
        *pbVar4 = *pbVar5 ^ *pbVar4;
        pbVar4 = pbVar4 + 1;
      } while (uVar2 != uVar7);
      gcm_mult(ctx,x,x);
      iv_len = iv_len - uVar2;
      iv = iv + uVar2;
    }
    psVar6 = &olen;
    pbVar4 = x;
    do {
      bVar1 = *(byte *)psVar6;
      pbVar5 = pbVar4 + 1;
      psVar6 = (size_t *)((int)psVar6 + 1);
      *pbVar4 = *pbVar4 ^ bVar1;
      pbVar4 = pbVar5;
    } while (x_00 != pbVar5);
    gcm_mult(ctx,x,x);
  }
  iVar3 = mbedtls_cipher_update((mbedtls_cipher_context_t *)ctx,x,0x10,ctx->base_ectr,&sStack68);
  if (iVar3 == 0) {
    *(size_t *)&ctx->add_len = add_len;
    *(undefined4 *)((int)&ctx->add_len + 4) = 0;
    while (add_len != 0) {
      uVar2 = add_len;
      if (0x10 < add_len) {
        uVar2 = 0x10;
      }
      uVar7 = 0;
      x = x_00;
      do {
        pbVar4 = add + uVar7;
        uVar7 = uVar7 + 1;
        *x = *pbVar4 ^ *x;
        x = x + 1;
      } while (uVar2 != uVar7);
      gcm_mult(ctx,x_00,x_00);
      add_len = add_len - uVar2;
      add = add + uVar2;
    }
  }
  return iVar3;
}



int mbedtls_gcm_update(mbedtls_gcm_context *ctx,size_t length,uchar *input,uchar *output)

{
  uchar uVar1;
  int iVar2;
  byte bVar3;
  uint uVar4;
  uint uVar5;
  uchar *puVar6;
  uint uVar7;
  byte *x;
  byte *pbVar8;
  size_t sStack68;
  size_t olen;
  uchar ectr [16];
  
