pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  sStack68 = 0;
  if ((output <= input) || (iVar2 = -0x14, length <= output + -(int)input)) {
    uVar4 = *(uint *)((int)&ctx->len + 4);
    uVar5 = length + *(uint *)&ctx->len;
    uVar7 = (uVar5 < length) + uVar4;
    if (((uVar7 < uVar4) || (((uVar4 == uVar7 && (uVar5 < *(uint *)&ctx->len)) || (0xf < uVar7))))
       || ((uVar7 == 0xf && (0xffffffe0 < uVar5)))) {
      iVar2 = -0x14;
    }
    else {
      *(uint *)&ctx->len = uVar5;
      *(uint *)((int)&ctx->len + 4) = uVar7;
      while (length != 0) {
        uVar4 = length;
        if (0x10 < length) {
          uVar4 = 0x10;
        }
        puVar6 = ctx->y + 0xf;
        do {
          uVar1 = *puVar6;
          *puVar6 = uVar1 + '\x01';
          if ((uchar)(uVar1 + '\x01') != '\0') break;
          puVar6 = puVar6 + -1;
        } while (puVar6 != ctx->y + 0xb);
        iVar2 = mbedtls_cipher_update
                          ((mbedtls_cipher_context_t *)ctx,ctx->y,0x10,(uchar *)&olen,&sStack68);
        if (iVar2 != 0) {
          return iVar2;
        }
        x = ctx->buf;
        uVar5 = 0;
        pbVar8 = x;
        do {
          if (ctx->mode == 0) {
            *pbVar8 = input[uVar5] ^ *pbVar8;
          }
          bVar3 = *(byte *)((int)&olen + uVar5) ^ input[uVar5];
          output[uVar5] = bVar3;
          if (ctx->mode == 1) {
            *pbVar8 = bVar3 ^ *pbVar8;
          }
          uVar5 = uVar5 + 1;
          pbVar8 = pbVar8 + 1;
        } while (uVar4 != uVar5);
        gcm_mult(ctx,x,x);
        length = length - uVar4;
        input = input + uVar4;
        output = output + uVar4;
      }
      iVar2 = 0;
    }
  }
  return iVar2;
}



// WARNING: Could not reconcile some variable overlaps

int mbedtls_gcm_finish(mbedtls_gcm_context *ctx,uchar *tag,size_t tag_len)

{
  byte bVar1;
  uint uVar2;
  uint uVar3;
  int *x;
  int iVar4;
  byte *pbVar5;
  int *piVar6;
  int *piVar7;
  byte *pbVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint uVar12;
  byte local_40 [4];
  uchar work_buf [16];
  
  pbVar8 = local_40;
  uVar11 = *(uint *)&ctx->len;
  uVar12 = *(uint *)&ctx->add_len;
  uVar2 = *(int *)((int)&ctx->len + 4) << 3;
  uVar3 = uVar2 | uVar11 >> 0x1d;
  uVar9 = *(int *)((int)&ctx->add_len + 4) << 3;
  uVar10 = uVar12 >> 0x1d | uVar9;
  if (tag_len - 4 < 0xd) {
    memcpy(tag,ctx->base_ectr,tag_len);
    if (((uVar11 | uVar12) << 3 | uVar3 | uVar10) != 0) {
      memset(local_40,0,0x10);
      local_40[0] = (byte)(uVar9 >> 0x18);
      local_40[1] = (char)(uVar9 >> 0x10);
      local_40[2] = (char)(uVar9 >> 8);
      work_buf[0] = (uchar)((uVar12 << 3) >> 0x18);
      work_buf[1] = (uchar)((uVar12 << 3) >> 0x10);
      work_buf[4] = (uchar)(uVar2 >> 0x18);
      work_buf[5] = (uchar)(uVar2 >> 0x10);
      work_buf[6] = (uchar)(uVar2 >> 8);
      work_buf[8] = (uchar)((uVar11 << 3) >> 0x18);
      work_buf[7] = (uchar)uVar3;
      x = (int *)ctx->buf;
      work_buf[9] = (uchar)((uVar11 << 3) >> 0x10);
      local_40[3] = (char)uVar10;
      work_buf._2_2_ = (ushort)(uVar12 << 0xb) | (ushort)((uVar12 << 0x13) >> 0x18);
      work_buf._10_2_ = (ushort)(uVar11 << 0xb) | (ushort)((uVar11 << 0x13) >> 0x18);
      piVar6 = x;
      do {
        bVar1 = *pbVar8;
        piVar7 = (int *)((int)piVar6 + 1);
        pbVar8 = pbVar8 + 1;
        *(byte *)piVar6 = *(byte *)piVar6 ^ bVar1;
        piVar6 = piVar7;
      } while (piVar7 != &ctx->mode);
      gcm_mult(ctx,(uchar *)x,(uchar *)x);
      pbVar8 = tag;
      do {
        bVar1 = *(byte *)x;
        pbVar5 = pbVar8 + 1;
        x = (int *)((int)x + 1);
        *pbVar8 = *pbVar8 ^ bVar1;
        pbVar8 = pbVar5;
      } while (tag + tag_len != pbVar5);
    }
    iVar4 = 0;
  }
  else {
    iVar4 = -0x14;
  }
  return iVar4;
}



int mbedtls_gcm_crypt_and_tag
              (mbedtls_gcm_context *ctx,int mode,size_t length,uchar *iv,size_t iv_len,uchar *add,
              size_t add_len,uchar *input,uchar *output,size_t tag_len,uchar *tag)

{
  int iVar1;
  uchar *in_stack_00000000;
  size_t in_stack_00000004;
  uchar *in_stack_00000008;
  
  iVar1 = mbedtls_gcm_starts(ctx,mode,iv,iv_len,add,add_len);
  if ((iVar1 == 0) && (iVar1 = mbedtls_gcm_update(ctx,length,input,in_stack_00000000), iVar1 == 0))
  {
    iVar1 = mbedtls_gcm_finish(ctx,in_stack_00000008,in_stack_00000004);
    return iVar1;
  }
  return iVar1;
}



int mbedtls_gcm_auth_decrypt
              (mbedtls_gcm_context *ctx,size_t length,uchar *iv,size_t iv_len,uchar *add,
              size_t add_len,uchar *tag,size_t tag_len,uchar *input,uchar *output)

{
  undefined *puVar1;
  uint uVar2;
  byte *pbVar3;
  byte *pbVar4;
  size_t sVar5;
  uchar *in_fa2;
  uchar *in_stack_00000000;
  undefined *in_stack_00000004;
  byte local_30 [4];
  uchar check_tag [16];
  
  uVar2 = mbedtls_gcm_crypt_and_tag
                    (ctx,0,length,iv,iv_len,add,add_len,in_stack_00000000,input,(size_t)output,
                     in_fa2);
  sVar5 = 0;
  if (uVar2 == 0) {
    while (sVar5 != tag_len) {
      pbVar4 = tag + sVar5;
      pbVar3 = local_30 + sVar5;
      sVar5 = sVar5 + 1;
      uVar2 = uVar2 | *pbVar4 ^ *pbVar3;
    }
    puVar1 = in_stack_00000004 + length;
    if (uVar2 != 0) {
      while (in_stack_00000004 != puVar1) {
        *in_stack_00000004 = 0;
        in_stack_00000004 = in_stack_00000004 + 1;
      }
      uVar2 = 0xffffffee;
    }
  }
  return uVar2;
}



void mbedtls_gcm_free(mbedtls_gcm_context *ctx)

{
  mbedtls_gcm_context *pmVar1;
  
  mbedtls_cipher_free((mbedtls_cipher_context_t *)ctx);
  pmVar1 = ctx + 1;
  while (ctx != pmVar1) {
    *(undefined *)&(ctx->cipher_ctx).cipher_info = 0;
    ctx = (mbedtls_gcm_context *)((int)&(ctx->cipher_ctx).cipher_info + 1);
  }
  return;
}



mbedtls_md_info_t * mbedtls_md_info_from_type(mbedtls_md_type_t md_type)

{
  uint uVar1;
  
  uVar1 = (uint)md_type - 3 & 0xff;
  if (uVar1 < 4) {
    return *(mbedtls_md_info_t **)(CSWTCH_2 + uVar1 * 4);
  }
  return (mbedtls_md_info_t *)0x0;
}



void mbedtls_md_init(mbedtls_md_context_t *ctx)

{
  memset(ctx,0,0xc);
  return;
}



