pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mbedtls_md_free(mbedtls_md_context_t *ctx)

{
  undefined *puVar1;
  mbedtls_md_context_t *pmVar2;
  undefined *puVar3;
  
  if (ctx != (mbedtls_md_context_t *)0x0) {
    if (ctx->md_info != (mbedtls_md_info_t *)0x0) {
      if (ctx->md_ctx != (void *)0x0) {
        (*ctx->md_info->ctx_free_func)(ctx->md_ctx);
      }
      puVar3 = (undefined *)ctx->hmac_ctx;
      if (puVar3 != (undefined *)0x0) {
        puVar1 = puVar3 + ctx->md_info->block_size * 2;
        while (puVar3 != puVar1) {
          *puVar3 = 0;
          puVar3 = puVar3 + 1;
        }
        vPortFree(ctx->hmac_ctx);
      }
      pmVar2 = ctx + 1;
      while (ctx != pmVar2) {
        *(undefined *)&ctx->md_info = 0;
        ctx = (mbedtls_md_context_t *)((int)&ctx->md_info + 1);
      }
    }
    return;
  }
  return;
}



int mbedtls_md_setup(mbedtls_md_context_t *ctx,mbedtls_md_info_t *md_info,int hmac)

{
  void *pvVar1;
  int iVar2;
  
  if ((md_info == (mbedtls_md_info_t *)0x0) || (ctx == (mbedtls_md_context_t *)0x0)) {
    return -0x5100;
  }
  pvVar1 = (*md_info->ctx_alloc_func)(md_info->ctx_alloc_func);
  ctx->md_ctx = pvVar1;
  if (pvVar1 == (void *)0x0) {
LAB_230657a0:
    iVar2 = -0x5180;
  }
  else {
    if (hmac != 0) {
      pvVar1 = mycalloc(2,md_info->block_size);
      ctx->hmac_ctx = pvVar1;
      if (pvVar1 == (void *)0x0) {
        (*md_info->ctx_free_func)(ctx->md_ctx);
        goto LAB_230657a0;
      }
    }
    ctx->md_info = md_info;
    iVar2 = 0;
  }
  return iVar2;
}



int mbedtls_md_starts(mbedtls_md_context_t *ctx)

{
  if ((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) {
    (*ctx->md_info->starts_func)(ctx->md_ctx);
    return 0;
  }
  return -0x5100;
}



int mbedtls_md_update(mbedtls_md_context_t *ctx,uchar *input,size_t ilen)

{
  if ((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) {
    (*ctx->md_info->update_func)(ctx->md_ctx,input,ilen);
    return 0;
  }
  return -0x5100;
}



int mbedtls_md_finish(mbedtls_md_context_t *ctx,uchar *output)

{
  if ((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) {
    (*ctx->md_info->finish_func)(ctx->md_ctx,output);
    return 0;
  }
  return -0x5100;
}



int mbedtls_md(mbedtls_md_info_t *md_info,uchar *input,size_t ilen,uchar *output)

{
  if (md_info != (mbedtls_md_info_t *)0x0) {
    (*md_info->digest_func)(input,ilen,output);
    return 0;
  }
  return -0x5100;
}



int mbedtls_md_hmac_starts(mbedtls_md_context_t *ctx,uchar *key,size_t keylen)

{
  int iVar1;
  size_t __n;
  byte *pbVar2;
  byte *pbVar3;
  mbedtls_md_info_t *pmVar4;
  size_t sVar5;
  uchar *puVar6;
  uchar *__s;
  uchar *__s_00;
  uchar local_40 [4];
  uchar sum [32];
  
  if (ctx == (mbedtls_md_context_t *)0x0) {
    return -0x5100;
  }
  puVar6 = local_40;
  pmVar4 = ctx->md_info;
  if ((pmVar4 == (mbedtls_md_info_t *)0x0) || (ctx->hmac_ctx == (void *)0x0)) {
    iVar1 = -0x5100;
  }
  else {
    if ((uint)pmVar4->block_size < keylen) {
      (*pmVar4->starts_func)(ctx->md_ctx);
      (*ctx->md_info->update_func)(ctx->md_ctx,key,keylen);
      (*ctx->md_info->finish_func)(ctx->md_ctx,local_40);
      keylen = ctx->md_info->size;
      key = local_40;
    }
    __s = (uchar *)ctx->hmac_ctx;
    __n = ctx->md_info->block_size;
    __s_00 = __s + __n;
    memset(__s,0x36,__n);
    memset(__s_00,0x5c,ctx->md_info->block_size);
    sVar5 = 0;
    while (keylen != sVar5) {
      pbVar2 = key + sVar5;
      __s[sVar5] = __s[sVar5] ^ *pbVar2;
      pbVar3 = __s_00 + sVar5;
      sVar5 = sVar5 + 1;
      *pbVar3 = *pbVar3 ^ *pbVar2;
    }
    do {
      *puVar6 = '\0';
      puVar6 = puVar6 + 1;
    } while (puVar6 != sum + 0x1c);
    (*ctx->md_info->starts_func)(ctx->md_ctx);
    (*ctx->md_info->update_func)(ctx->md_ctx,__s,ctx->md_info->block_size);
    iVar1 = 0;
  }
  return iVar1;
}



int mbedtls_md_hmac_update(mbedtls_md_context_t *ctx,uchar *input,size_t ilen)

{
  if (((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) &&
     (ctx->hmac_ctx != (void *)0x0)) {
    (*ctx->md_info->update_func)(ctx->md_ctx,input,ilen);
    return 0;
  }
  return -0x5100;
}



// WARNING: Variable defined which should be unmapped: tmp

int mbedtls_md_hmac_finish(mbedtls_md_context_t *ctx,uchar *output)

{
  int iVar1;
  mbedtls_md_info_t *pmVar2;
  void *pvVar3;
  uchar auStack48 [4];
  uchar tmp [32];
  
  if (((ctx != (mbedtls_md_context_t *)0x0) &&
      (pmVar2 = ctx->md_info, pmVar2 != (mbedtls_md_info_t *)0x0)) &&
     (pvVar3 = ctx->hmac_ctx, pvVar3 != (void *)0x0)) {
    iVar1 = pmVar2->block_size;
    (*pmVar2->finish_func)(ctx->md_ctx,auStack48);
    (*ctx->md_info->starts_func)(ctx->md_ctx);
    (*ctx->md_info->update_func)
              (ctx->md_ctx,(uchar *)(iVar1 + (int)pvVar3),ctx->md_info->block_size);
    (*ctx->md_info->update_func)(ctx->md_ctx,auStack48,ctx->md_info->size);
    (*ctx->md_info->finish_func)(ctx->md_ctx,output);
    return 0;
  }
  return -0x5100;
}



int mbedtls_md_hmac_reset(mbedtls_md_context_t *ctx)

{
  int iVar1;
  uchar *puVar2;
  
  if ((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) {
    puVar2 = (uchar *)ctx->hmac_ctx;
    if (puVar2 == (uchar *)0x0) {
      iVar1 = -0x5100;
    }
    else {
      (*ctx->md_info->starts_func)(ctx->md_ctx);
      (*ctx->md_info->update_func)(ctx->md_ctx,puVar2,ctx->md_info->block_size);
      iVar1 = 0;
    }
    return iVar1;
  }
  return -0x5100;
}



int mbedtls_md_process(mbedtls_md_context_t *ctx,uchar *data)

{
  if ((ctx != (mbedtls_md_context_t *)0x0) && (ctx->md_info != (mbedtls_md_info_t *)0x0)) {
    (*ctx->md_info->process_func)(ctx->md_ctx,data);
    return 0;
  }
  return -0x5100;
}



uchar mbedtls_md_get_size(mbedtls_md_info_t *md_info)

{
  if (md_info != (mbedtls_md_info_t *)0x0) {
    return *(uchar *)&md_info->size;
  }
  return '\0';
}



