pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void md5_process_wrap(mbedtls_md5_context *ctx,uchar *data)

{
  int iVar1;
  int iVar2;
  int iVar3;
  int iVar4;
  int iVar5;
  int iVar6;
  int iVar7;
  int iVar8;
  int iVar9;
  int iVar10;
  int iVar11;
  int iVar12;
  int iVar13;
  int iVar14;
  int iVar15;
  int iVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  uint uVar20;
  uint uVar21;
  uint uVar22;
  uint uVar23;
  uint uVar24;
  uint uVar25;
  
  iVar1 = *(int *)data;
  iVar2 = *(int *)(data + 4);
  iVar3 = *(int *)(data + 0x10);
  iVar4 = *(int *)(data + 8);
  iVar5 = *(int *)(data + 0xc);
  iVar6 = *(int *)(data + 0x14);
  iVar7 = *(int *)(data + 0x18);
  iVar8 = *(int *)(data + 0x24);
  iVar9 = *(int *)(data + 0x1c);
  iVar10 = *(int *)(data + 0x20);
  iVar11 = *(int *)(data + 0x2c);
  iVar12 = *(int *)(data + 0x28);
  iVar13 = *(int *)(data + 0x30);
  uVar19 = ctx->state[3];
  iVar14 = *(int *)(data + 0x34);
  iVar15 = *(int *)(data + 0x38);
  iVar16 = *(int *)(data + 0x3c);
  uVar17 = ctx->state[2];
  uVar18 = ctx->state[1];
  uVar20 = ((uVar17 ^ uVar19) & uVar18 ^ uVar19) + ctx->state[0] + 0xd76aa478 + iVar1;
  uVar21 = (uVar20 >> 0x19 | uVar20 * 0x80) + uVar18;
  uVar20 = ((uVar18 ^ uVar17) & uVar21 ^ uVar17) + uVar19 + 0xe8c7b756 + iVar2;
  uVar23 = (uVar20 >> 0x14 | uVar20 * 0x1000) + uVar21;
  uVar20 = ((uVar18 ^ uVar21) & uVar23 ^ uVar18) + uVar17 + 0x242070db + iVar4;
  uVar22 = (uVar20 * 0x20000 | uVar20 >> 0xf) + uVar23;
  uVar20 = ((uVar21 ^ uVar23) & uVar22 ^ uVar21) + uVar18 + 0xc1bdceee + iVar5;
  uVar20 = (uVar20 * 0x400000 | uVar20 >> 10) + uVar22;
  uVar21 = ((uVar23 ^ uVar22) & uVar20 ^ uVar23) + iVar3 + -0xa83f051 + uVar21;
  uVar21 = (uVar21 >> 0x19 | uVar21 * 0x80) + uVar20;
  uVar23 = ((uVar22 ^ uVar20) & uVar21 ^ uVar22) + iVar6 + 0x4787c62a + uVar23;
  uVar23 = (uVar23 >> 0x14 | uVar23 * 0x1000) + uVar21;
  uVar22 = ((uVar20 ^ uVar21) & uVar23 ^ uVar20) + iVar7 + -0x57cfb9ed + uVar22;
  uVar22 = (uVar22 * 0x20000 | uVar22 >> 0xf) + uVar23;
  uVar20 = ((uVar21 ^ uVar23) & uVar22 ^ uVar21) + iVar9 + -0x2b96aff + uVar20;
  uVar20 = (uVar20 * 0x400000 | uVar20 >> 10) + uVar22;
  uVar21 = ((uVar23 ^ uVar22) & uVar20 ^ uVar23) + iVar10 + 0x698098d8 + uVar21;
  uVar21 = (uVar21 >> 0x19 | uVar21 * 0x80) + uVar20;
  uVar23 = ((uVar22 ^ uVar20) & uVar21 ^ uVar22) + iVar8 + -0x74bb0851 + uVar23;
  uVar23 = (uVar23 >> 0x14 | uVar23 * 0x1000) + uVar21;
  uVar22 = ((uVar20 ^ uVar21) & uVar23 ^ uVar20) + iVar12 + -0xa44f + uVar22;
  uVar22 = (uVar22 * 0x20000 | uVar22 >> 0xf) + uVar23;
  uVar20 = ((uVar21 ^ uVar23) & uVar22 ^ uVar21) + iVar11 + -0x76a32842 + uVar20;
  uVar20 = (uVar20 * 0x400000 | uVar20 >> 10) + uVar22;
  uVar21 = ((uVar23 ^ uVar22) & uVar20 ^ uVar23) + iVar13 + 0x6b901122 + uVar21;
  uVar21 = (uVar21 >> 0x19 | uVar21 * 0x80) + uVar20;
  uVar23 = ((uVar22 ^ uVar20) & uVar21 ^ uVar22) + iVar14 + -0x2678e6d + uVar23;
  uVar23 = (uVar23 >> 0x14 | uVar23 * 0x1000) + uVar21;
  uVar22 = ((uVar20 ^ uVar21) & uVar23 ^ uVar20) + iVar15 + -0x5986bc72 + uVar22;
  uVar22 = (uVar22 * 0x20000 | uVar22 >> 0xf) + uVar23;
  uVar20 = ((uVar21 ^ uVar23) & uVar22 ^ uVar21) + iVar16 + 0x49b40821 + uVar20;
  uVar20 = (uVar20 * 0x400000 | uVar20 >> 10) + uVar22;
  uVar21 = ((uVar22 ^ uVar20) & uVar23 ^ uVar22) + iVar2 + -0x9e1da9e + uVar21;
  uVar21 = (uVar21 >> 0x1b | uVar21 * 0x20) + uVar20;
  uVar23 = ((uVar20 ^ uVar21) & uVar22 ^ uVar20) + iVar7 + -0x3fbf4cc0 + uVar23;
  uVar23 = (uVar23 >> 0x17 | uVar23 * 0x200) + uVar21;
  uVar22 = ((uVar21 ^ uVar23) & uVar20 ^ uVar21) + iVar11 + 0x265e5a51 + uVar22;
  uVar22 = (uVar22 >> 0x12 | uVar22 * 0x4000) + uVar23;
  uVar20 = ((uVar23 ^ uVar22) & uVar21 ^ uVar23) + iVar1 + -0x16493856 + uVar20;
  uVar20 = (uVar20 * 0x100000 | uVar20 >> 0xc) + uVar22;
  uVar21 = ((uVar22 ^ uVar20) & uVar23 ^ uVar22) + iVar6 + -0x29d0efa3 + uVar21;
  uVar21 = (uVar21 >> 0x1b | uVar21 * 0x20) + uVar20;
  uVar23 = ((uVar20 ^ uVar21) & uVar22 ^ uVar20) + iVar12 + 0x2441453 + uVar23;
  uVar23 = (uVar23 >> 0x17 | uVar23 * 0x200) + uVar21;
  uVar22 = ((uVar21 ^ uVar23) & uVar20 ^ uVar21) + iVar16 + -0x275e197f + uVar22;
  uVar22 = (uVar22 >> 0x12 | uVar22 * 0x4000) + uVar23;
  uVar20 = ((uVar23 ^ uVar22) & uVar21 ^ uVar23) + iVar3 + -0x182c0438 + uVar20;
  uVar20 = (uVar20 * 0x100000 | uVar20 >> 0xc) + uVar22;
  uVar21 = ((uVar22 ^ uVar20) & uVar23 ^ uVar22) + iVar8 + 0x21e1cde6 + uVar21;
  uVar21 = (uVar21 >> 0x1b | uVar21 * 0x20) + uVar20;
  uVar23 = ((uVar20 ^ uVar21) & uVar22 ^ uVar20) + iVar15 + -0x3cc8f82a + uVar23;
  uVar23 = (uVar23 >> 0x17 | uVar23 * 0x200) + uVar21;
  uVar22 = ((uVar21 ^ uVar23) & uVar20 ^ uVar21) + iVar5 + -0xb2af279 + uVar22;
  uVar22 = (uVar22 >> 0x12 | uVar22 * 0x4000) + uVar23;
  uVar20 = ((uVar23 ^ uVar22) & uVar21 ^ uVar23) + iVar10 + 0x455a14ed + uVar20;
  uVar20 = (uVar20 * 0x100000 | uVar20 >> 0xc) + uVar22;
  uVar21 = ((uVar22 ^ uVar20) & uVar23 ^ uVar22) + iVar14 + -0x561c16fb + uVar21;
  uVar21 = (uVar21 >> 0x1b | uVar21 * 0x20) + uVar20;
  uVar23 = ((uVar20 ^ uVar21) & uVar22 ^ uVar20) + iVar4 + -0x3105c08 + uVar23;
  uVar24 = (uVar23 >> 0x17 | uVar23 * 0x200) + uVar21;
  uVar22 = ((uVar21 ^ uVar24) & uVar20 ^ uVar21) + iVar9 + 0x676f02d9 + uVar22;
  uVar23 = (uVar22 >> 0x12 | uVar22 * 0x4000) + uVar24;
  uVar20 = ((uVar24 ^ uVar23) & uVar21 ^ uVar24) + iVar13 + -0x72d5b376 + uVar20;
  uVar20 = (uVar20 * 0x100000 | uVar20 >> 0xc) + uVar23;
  uVar21 = (uVar24 ^ uVar23 ^ uVar20) + iVar6 + -0x5c6be + uVar21;
  uVar21 = (uVar21 >> 0x1c | uVar21 * 0x10) + uVar20;
  uVar22 = (uVar23 ^ uVar20 ^ uVar21) + uVar24 + iVar10 + -0x788e097f;
  uVar22 = (uVar22 >> 0x15 | uVar22 * 0x800) + uVar21;
  uVar23 = (uVar20 ^ uVar21 ^ uVar22) + uVar23 + iVar11 + 0x6d9d6122;
  uVar24 = (uVar23 >> 0x10 | uVar23 * 0x10000) + uVar22;
  uVar20 = (uVar21 ^ uVar22 ^ uVar24) + uVar20 + iVar15 + -0x21ac7f4;
  uVar23 = (uVar20 * 0x800000 | uVar20 >> 9) + uVar24;
  uVar20 = (uVar22 ^ uVar24 ^ uVar23) + iVar2 + -0x5b4115bc + uVar21;
  uVar21 = (uVar20 >> 0x1c | uVar20 * 0x10) + uVar23;
  uVar20 = (uVar24 ^ uVar23 ^ uVar21) + uVar22 + iVar3 + 0x4bdecfa9;
  uVar20 = (uVar20 >> 0x15 | uVar20 * 0x800) + uVar21;
  uVar22 = (uVar23 ^ uVar21 ^ uVar20) + iVar9 + -0x944b4a0 + uVar24;
  uVar24 = (uVar22 >> 0x10 | uVar22 * 0x10000) + uVar20;
  uVar22 = (uVar21 ^ uVar20 ^ uVar24) + uVar23 + iVar12 + -0x41404390;
  uVar22 = (uVar22 * 0x800000 | uVar22 >> 9) + uVar24;
  uVar21 = (uVar20 ^ uVar24 ^ uVar22) + uVar21 + iVar14 + 0x289b7ec6;
  uVar23 = (uVar21 >> 0x1c | uVar21 * 0x10) + uVar22;
  uVar20 = (uVar24 ^ uVar22 ^ uVar23) + iVar1 + -0x155ed806 + uVar20;
  uVar20 = (uVar20 >> 0x15 | uVar20 * 0x800) + uVar23;
  uVar21 = (uVar22 ^ uVar23 ^ uVar20) + iVar5 + -0x2b10cf7b + uVar24;
  uVar24 = (uVar21 >> 0x10 | uVar21 * 0x10000) + uVar20;
  uVar21 = (uVar23 ^ uVar20 ^ uVar24) + uVar22 + iVar7 + 0x4881d05;
  uVar21 = (uVar21 * 0x800000 | uVar21 >> 9) + uVar24;
  uVar22 = (uVar20 ^ uVar24 ^ uVar21) + iVar8 + -0x262b2fc7 + uVar23;
  uVar23 = (uVar22 >> 0x1c | uVar22 * 0x10) + uVar21;
  uVar20 = (uVar24 ^ uVar21 ^ uVar23) + uVar20 + iVar13 + -0x1924661b;
  uVar22 = (uVar20 >> 0x15 | uVar20 * 0x800) + uVar23;
  uVar20 = (uVar21 ^ uVar23 ^ uVar22) + uVar24 + iVar16 + 0x1fa27cf8;
  uVar20 = (uVar20 >> 0x10 | uVar20 * 0x10000) + uVar22;
  uVar21 = (uVar23 ^ uVar22 ^ uVar20) + iVar4 + -0x3b53a99b + uVar21;
  uVar21 = (uVar21 * 0x800000 | uVar21 >> 9) + uVar20;
  uVar23 = ((~uVar22 | uVar21) ^ uVar20) + uVar23 + iVar1 + -0xbd6ddbc;
  uVar24 = (uVar23 >> 0x1a | uVar23 * 0x40) + uVar21;
  uVar22 = ((~uVar20 | uVar24) ^ uVar21) + uVar22 + iVar9 + 0x432aff97;
  uVar23 = (uVar22 >> 0x16 | uVar22 * 0x400) + uVar24;
  uVar20 = ((~uVar21 | uVar23) ^ uVar24) + iVar15 + -0x546bdc59 + uVar20;
  uVar20 = (uVar20 >> 0x11 | uVar20 * 0x8000) + uVar23;
  uVar21 = ((~uVar24 | uVar20) ^ uVar23) + iVar6 + -0x36c5fc7 + uVar21;
  uVar22 = (uVar21 * 0x200000 | uVar21 >> 0xb) + uVar20;
  uVar21 = ((~uVar23 | uVar22) ^ uVar20) + iVar13 + 0x655b59c3 + uVar24;
  uVar24 = (uVar21 >> 0x1a | uVar21 * 0x40) + uVar22;
  uVar21 = ((~uVar20 | uVar24) ^ uVar22) + uVar23 + iVar5 + -0x70f3336e;
  uVar21 = (uVar21 >> 0x16 | uVar21 * 0x400) + uVar24;
  uVar20 = ((~uVar22 | uVar21) ^ uVar24) + iVar12 + -0x100b83 + uVar20;
  uVar20 = (uVar20 >> 0x11 | uVar20 * 0x8000) + uVar21;
  uVar22 = ((~uVar24 | uVar20) ^ uVar21) + iVar2 + -0x7a7ba22f + uVar22;
  uVar22 = (uVar22 * 0x200000 | uVar22 >> 0xb) + uVar20;
  uVar23 = ((~uVar21 | uVar22) ^ uVar20) + iVar10 + 0x6fa87e4f + uVar24;
  uVar25 = (uVar23 >> 0x1a | uVar23 * 0x40) + uVar22;
  uVar21 = ((~uVar20 | uVar25) ^ uVar22) + uVar21 + iVar16 + -0x1d31920;
  uVar24 = (uVar21 >> 0x16 | uVar21 * 0x400) + uVar25;
  uVar20 = ((~uVar22 | uVar24) ^ uVar25) + iVar7 + -0x5cfebcec + uVar20;
  uVar20 = (uVar20 >> 0x11 | uVar20 * 0x8000) + uVar24;
  uVar21 = ((~uVar25 | uVar20) ^ uVar24) + iVar14 + 0x4e0811a1 + uVar22;
  uVar23 = (uVar21 * 0x200000 | uVar21 >> 0xb) + uVar20;
  uVar21 = ((~uVar24 | uVar23) ^ uVar20) + uVar25 + iVar3 + -0x8ac817e;
  uVar22 = (uVar21 >> 0x1a | uVar21 * 0x40) + uVar23;
  uVar21 = ((~uVar20 | uVar22) ^ uVar23) + uVar24 + iVar11 + -0x42c50dcb;
  uVar21 = (uVar21 >> 0x16 | uVar21 * 0x400) + uVar22;
  uVar20 = ((~uVar23 | uVar21) ^ uVar22) + uVar20 + iVar4 + 0x2ad7d2bb;
  uVar20 = (uVar20 >> 0x11 | uVar20 * 0x8000) + uVar21;
  uVar23 = ((~uVar22 | uVar20) ^ uVar21) + uVar23 + iVar8 + -0x14792c6f;
  ctx->state[0] = ctx->state[0] + uVar22;
  ctx->state[1] = uVar18 + uVar20 + (uVar23 >> 0xb | uVar23 * 0x200000);
  ctx->state[2] = uVar20 + uVar17;
  ctx->state[3] = uVar21 + uVar19;
  return;
}



