pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
{
  mbedtls_sha1_context *ctx;
  
  ctx = (mbedtls_sha1_context *)mycalloc(1,0x5c);
  if (ctx != (mbedtls_sha1_context *)0x0) {
    mbedtls_sha1_init(ctx);
  }
  return ctx;
}



void sha1_finish_wrap(mbedtls_sha1_context *ctx,uchar *output)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uchar uStack24;
  undefined uStack23;
  ushort uStack22;
  undefined uStack20;
  undefined uStack19;
  ushort uStack18;
  
  uVar1 = ctx->total[0];
  uVar2 = ctx->total[1] << 3;
  uStack24 = (uchar)(uVar2 >> 0x18);
  uStack23 = (undefined)(uVar2 >> 0x10);
  uStack22 = (ushort)(uVar2 >> 8) & 0xff | (ushort)((uVar2 | uVar1 >> 0x1d) << 8);
  uStack20 = (undefined)((uVar1 << 3) >> 0x18);
  uStack19 = (undefined)((uVar1 << 3) >> 0x10);
  uStack18 = (ushort)((uVar1 << 0x13) >> 0x18) | (ushort)(uVar1 << 0xb);
  if ((uVar1 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  mbedtls_sha1_update(ctx,sha1_padding,iVar3 - (uVar1 & 0x3f));
  mbedtls_sha1_update(ctx,&uStack24,8);
  *output = *(uchar *)((int)ctx->state + 3);
  output[1] = (uchar)*(undefined2 *)((int)ctx->state + 2);
  output[2] = (uchar)(ctx->state[0] >> 8);
  output[3] = (uchar)ctx->state[0];
  output[4] = *(uchar *)((int)ctx->state + 7);
  output[5] = (uchar)*(undefined2 *)((int)ctx->state + 6);
  output[6] = (uchar)(ctx->state[1] >> 8);
  output[7] = (uchar)ctx->state[1];
  output[8] = *(uchar *)((int)ctx->state + 0xb);
  output[9] = (uchar)*(undefined2 *)((int)ctx->state + 10);
  output[10] = (uchar)(ctx->state[2] >> 8);
  output[0xb] = (uchar)ctx->state[2];
  output[0xc] = *(uchar *)((int)ctx->state + 0xf);
  output[0xd] = (uchar)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xe] = (uchar)(ctx->state[3] >> 8);
  output[0xf] = (uchar)ctx->state[3];
  output[0x10] = *(uchar *)((int)ctx->state + 0x13);
  output[0x11] = (uchar)*(undefined2 *)((int)ctx->state + 0x12);
  output[0x12] = (uchar)(ctx->state[4] >> 8);
  output[0x13] = (uchar)ctx->state[4];
  return;
}



void sha1_update_wrap(mbedtls_sha1_context *ctx,uchar *input,size_t ilen)

{
  if (ilen != 0) {
    mbedtls_sha1_update(ctx,input,ilen);
    return;
  }
  return;
}



void sha1_starts_wrap(mbedtls_sha1_context *ctx)

{
  ctx->state[0] = 0x67452301;
  ctx->state[1] = 0xefcdab89;
  ctx->state[2] = 0x98badcfe;
  ctx->state[3] = 0x10325476;
  ctx->total[0] = 0;
  ctx->total[1] = 0;
  ctx->state[4] = 0xc3d2e1f0;
  return;
}



void sha224_process_wrap(mbedtls_sha256_context *ctx,uchar *data)

{
  uint uVar1;
  uint32_t *puVar2;
  byte *pbVar3;
  byte *pbVar4;
  uint uVar5;
  uint uVar6;
  uint32_t uVar7;
  uint uVar8;
  uint32_t *puVar9;
  uint *puVar10;
  uint uVar11;
  uint uVar12;
  int iVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  uint uVar17;
  uint32_t *puVar18;
  uint uVar19;
  uint uVar20;
  uint uVar21;
  uint *puVar22;
  uint32_t *puVar23;
  uint uVar24;
  uint uVar25;
  uint32_t uStack336;
  uint uStack332;
  uint uStack328;
  uint uStack324;
  uint uStack320;
  uint uStack316;
  uint uStack312;
  uint uStack308;
  uint auStack304 [67];
  
  puVar18 = &uStack336;
  puVar9 = &uStack336;
  puVar2 = ctx->state;
  do {
    uVar7 = *puVar2;
    puVar2 = puVar2 + 1;
    *puVar9 = uVar7;
    puVar9 = puVar9 + 1;
  } while ((uint32_t *)ctx->buffer != puVar2);
  puVar22 = auStack304;
  pbVar3 = data;
  puVar10 = puVar22;
  do {
    pbVar4 = pbVar3 + 4;
    *puVar10 = (uint)*pbVar3 << 0x18 | (uint)pbVar3[1] << 0x10 | (uint)pbVar3[3] |
               (uint)pbVar3[2] << 8;
    pbVar3 = pbVar4;
    puVar10 = puVar10 + 1;
  } while (data + 0x40 != pbVar4);
  puVar2 = K;
  puVar9 = K;
  puVar10 = puVar22;
  do {
    puVar23 = puVar9 + 8;
    iVar13 = uStack308 +
             ((uStack320 >> 6 | uStack320 << 0x1a) ^ (uStack320 >> 0xb | uStack320 << 0x15) ^
             (uStack320 << 7 | uStack320 >> 0x19)) + *puVar9 + *puVar10 +
             ((uStack312 ^ uStack316) & uStack320 ^ uStack312);
    uVar12 = uStack324 + iVar13;
    uVar14 = iVar13 + ((uStack336 >> 2 | uStack336 << 0x1e) ^ (uStack336 >> 0xd | uStack336 << 0x13)
                      ^ (uStack336 << 10 | uStack336 >> 0x16)) +
                      ((uStack336 | uStack332) & uStack328 | uStack336 & uStack332);
    iVar13 = ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19)) +
             uStack312 + puVar9[1] + puVar10[1] + ((uStack320 ^ uStack316) & uVar12 ^ uStack316);
    uVar1 = ((uVar14 >> 2 | uVar14 * 0x40000000) ^ (uVar14 >> 0xd | uVar14 * 0x80000) ^
            (uVar14 * 0x400 | uVar14 >> 0x16)) +
            ((uVar14 | uStack336) & uStack332 | uVar14 & uStack336) + iVar13;
    uVar11 = uStack328 + iVar13;
    iVar13 = ((uVar11 >> 6 | uVar11 * 0x4000000) ^ (uVar11 >> 0xb | uVar11 * 0x200000) ^
             (uVar11 * 0x80 | uVar11 >> 0x19)) +
             uStack316 + puVar9[2] + puVar10[2] + ((uVar12 ^ uStack320) & uVar11 ^ uStack320);
    uVar5 = ((uVar1 >> 2 | uVar1 * 0x40000000) ^ (uVar1 >> 0xd | uVar1 * 0x80000) ^
            (uVar1 * 0x400 | uVar1 >> 0x16)) + ((uVar14 | uVar1) & uStack336 | uVar14 & uVar1) +
            iVar13;
    uVar8 = uStack332 + iVar13;
    iVar13 = ((uVar8 >> 6 | uVar8 * 0x4000000) ^ (uVar8 >> 0xb | uVar8 * 0x200000) ^
             (uVar8 * 0x80 | uVar8 >> 0x19)) +
             uStack320 + puVar9[3] + puVar10[3] + ((uVar12 ^ uVar11) & uVar8 ^ uVar12);
    uVar16 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
             (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar1 | uVar5) & uVar14 | uVar1 & uVar5) + iVar13;
    uVar6 = uStack336 + iVar13;
    iVar13 = ((uVar6 >> 6 | uVar6 * 0x4000000) ^ (uVar6 >> 0xb | uVar6 * 0x200000) ^
             (uVar6 * 0x80 | uVar6 >> 0x19)) +
             uVar12 + puVar9[4] + puVar10[4] + ((uVar11 ^ uVar8) & uVar6 ^ uVar11);
    uStack324 = ((uVar16 >> 2 | uVar16 * 0x40000000) ^ (uVar16 >> 0xd | uVar16 * 0x80000) ^
                (uVar16 * 0x400 | uVar16 >> 0x16)) + ((uVar5 | uVar16) & uVar1 | uVar5 & uVar16) +
                iVar13;
    uStack308 = uVar14 + iVar13;
    iVar13 = ((uStack308 >> 6 | uStack308 * 0x4000000) ^ (uStack308 >> 0xb | uStack308 * 0x200000) ^
             (uStack308 * 0x80 | uStack308 >> 0x19)) +
             uVar11 + puVar9[5] + puVar10[5] + ((uVar8 ^ uVar6) & uStack308 ^ uVar8);
    uStack328 = ((uStack324 >> 2 | uStack324 * 0x40000000) ^
                 (uStack324 >> 0xd | uStack324 * 0x80000) ^ (uStack324 * 0x400 | uStack324 >> 0x16))
                + ((uVar16 | uStack324) & uVar5 | uVar16 & uStack324) + iVar13;
    uStack312 = uVar1 + iVar13;
    iVar13 = ((uStack312 >> 6 | uStack312 * 0x4000000) ^ (uStack312 >> 0xb | uStack312 * 0x200000) ^
             (uStack312 * 0x80 | uStack312 >> 0x19)) +
             uVar8 + puVar9[6] + puVar10[6] + ((uVar6 ^ uStack308) & uStack312 ^ uVar6);
    uStack332 = ((uStack328 >> 2 | uStack328 * 0x40000000) ^
                 (uStack328 >> 0xd | uStack328 * 0x80000) ^ (uStack328 * 0x400 | uStack328 >> 0x16))
                + ((uStack324 | uStack328) & uVar16 | uStack324 & uStack328) + iVar13;
    uStack316 = uVar5 + iVar13;
    iVar13 = ((uStack316 >> 6 | uStack316 * 0x4000000) ^ (uStack316 >> 0xb | uStack316 * 0x200000) ^
             (uStack316 * 0x80 | uStack316 >> 0x19)) +
             uVar6 + puVar9[7] + puVar10[7] + ((uStack308 ^ uStack312) & uStack316 ^ uStack308);
    uStack320 = uVar16 + iVar13;
    uStack336 = ((uStack332 >> 2 | uStack332 * 0x40000000) ^
                 (uStack332 >> 0xd | uStack332 * 0x80000) ^ (uStack332 * 0x400 | uStack332 >> 0x16))
                + ((uStack328 | uStack332) & uStack324 | uStack328 & uStack332) + iVar13;
    puVar9 = puVar23;
    puVar10 = puVar10 + 8;
  } while (puVar23 != K + 0x10);
  do {
    uVar19 = puVar22[0xe];
    uVar1 = puVar22[1];
    uVar20 = puVar22[0xf];
    uVar24 = ((uVar19 << 0xf | uVar19 >> 0x11) ^ (uVar19 << 0xd | uVar19 >> 0x13) ^ uVar19 >> 10) +
             puVar22[9] + *puVar22 +
             ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    uVar11 = puVar22[3];
    iVar13 = uStack308 +
             ((uStack320 >> 6 | uStack320 << 0x1a) ^ (uStack320 >> 0xb | uStack320 << 0x15) ^
             (uStack320 << 7 | uStack320 >> 0x19)) +
             ((uStack312 ^ uStack316) & uStack320 ^ uStack312) + puVar2[0x10] + uVar24;
    uVar16 = uStack324 + iVar13;
    uVar15 = iVar13 + ((uStack336 >> 2 | uStack336 << 0x1e) ^ (uStack336 >> 0xd | uStack336 << 0x13)
                      ^ (uStack336 << 10 | uStack336 >> 0x16)) +
                      ((uStack336 | uStack332) & uStack328 | uStack336 & uStack332);
    uVar6 = puVar22[2];
    uVar1 = ((uVar20 << 0xf | uVar20 >> 0x11) ^ (uVar20 << 0xd | uVar20 >> 0x13) ^ uVar20 >> 10) +
            uVar1 + puVar22[10] +
            ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((uStack320 ^ uStack316) & uVar16 ^ uStack316) + uStack312 + puVar2[0x11] + uVar1 +
             ((uVar16 >> 6 | uVar16 * 0x4000000) ^ (uVar16 >> 0xb | uVar16 * 0x200000) ^
             (uVar16 * 0x80 | uVar16 >> 0x19));
    uVar5 = ((uVar15 >> 2 | uVar15 * 0x40000000) ^ (uVar15 >> 0xd | uVar15 * 0x80000) ^
            (uVar15 * 0x400 | uVar15 >> 0x16)) +
            ((uStack336 | uVar15) & uStack332 | uStack336 & uVar15) + iVar13;
    uVar14 = uStack328 + iVar13;
    uVar6 = ((uVar24 * 0x8000 | uVar24 >> 0x11) ^ (uVar24 * 0x2000 | uVar24 >> 0x13) ^ uVar24 >> 10)
            + uVar6 + puVar22[0xb] +
            ((uVar11 >> 7 | uVar11 << 0x19) ^ (uVar11 << 0xe | uVar11 >> 0x12) ^ uVar11 >> 3);
    iVar13 = ((uStack320 ^ uVar16) & uVar14 ^ uStack320) + uStack316 + puVar2[0x12] + uVar6 +
             ((uVar14 >> 6 | uVar14 * 0x4000000) ^ (uVar14 >> 0xb | uVar14 * 0x200000) ^
             (uVar14 * 0x80 | uVar14 >> 0x19));
    puVar22[0x11] = uVar1;
    uVar8 = ((uVar5 >> 2 | uVar5 * 0x40000000) ^ (uVar5 >> 0xd | uVar5 * 0x80000) ^
            (uVar5 * 0x400 | uVar5 >> 0x16)) + ((uVar15 | uVar5) & uStack336 | uVar15 & uVar5) +
            iVar13;
    uVar12 = uStack332 + iVar13;
    uVar25 = puVar22[4];
    uVar1 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
            uVar11 + puVar22[0xc] +
            ((uVar25 >> 7 | uVar25 << 0x19) ^ (uVar25 << 0xe | uVar25 >> 0x12) ^ uVar25 >> 3);
    iVar13 = ((uVar16 ^ uVar14) & uVar12 ^ uVar16) + uStack320 + puVar2[0x13] + uVar1 +
             ((uVar12 >> 6 | uVar12 * 0x4000000) ^ (uVar12 >> 0xb | uVar12 * 0x200000) ^
             (uVar12 * 0x80 | uVar12 >> 0x19));
    uVar17 = ((uVar8 >> 2 | uVar8 * 0x40000000) ^ (uVar8 >> 0xd | uVar8 * 0x80000) ^
             (uVar8 * 0x400 | uVar8 >> 0x16)) + ((uVar5 | uVar8) & uVar15 | uVar5 & uVar8) + iVar13;
    uVar11 = uStack336 + iVar13;
    puVar22[0x12] = uVar6;
    uVar21 = puVar22[5];
    uVar25 = ((uVar6 * 0x8000 | uVar6 >> 0x11) ^ (uVar6 * 0x2000 | uVar6 >> 0x13) ^ uVar6 >> 10) +
             uVar25 + puVar22[0xd] +
             ((uVar21 >> 7 | uVar21 << 0x19) ^ (uVar21 << 0xe | uVar21 >> 0x12) ^ uVar21 >> 3);
    iVar13 = ((uVar11 >> 6 | uVar11 * 0x4000000) ^ (uVar11 >> 0xb | uVar11 * 0x200000) ^
             (uVar11 * 0x80 | uVar11 >> 0x19)) +
             ((uVar14 ^ uVar12) & uVar11 ^ uVar14) + uVar16 + puVar2[0x14] + uVar25;
    uStack324 = ((uVar17 >> 2 | uVar17 * 0x40000000) ^ (uVar17 >> 0xd | uVar17 * 0x80000) ^
                (uVar17 * 0x400 | uVar17 >> 0x16)) + ((uVar8 | uVar17) & uVar5 | uVar8 & uVar17) +
                iVar13;
    uStack308 = uVar15 + iVar13;
    uVar6 = puVar22[6];
    puVar22[0x13] = uVar1;
    uVar16 = ((uVar1 * 0x8000 | uVar1 >> 0x11) ^ (uVar1 * 0x2000 | uVar1 >> 0x13) ^ uVar1 >> 10) +
             uVar19 + uVar21 +
             ((uVar6 >> 7 | uVar6 << 0x19) ^ (uVar6 << 0xe | uVar6 >> 0x12) ^ uVar6 >> 3);
    iVar13 = ((uStack308 >> 6 | uStack308 * 0x4000000) ^ (uStack308 >> 0xb | uStack308 * 0x200000) ^
             (uStack308 * 0x80 | uStack308 >> 0x19)) +
             ((uVar12 ^ uVar11) & uStack308 ^ uVar12) + uVar14 + puVar2[0x15] + uVar16;
    uStack328 = ((uStack324 >> 2 | uStack324 * 0x40000000) ^
                 (uStack324 >> 0xd | uStack324 * 0x80000) ^ (uStack324 * 0x400 | uStack324 >> 0x16))
                + ((uVar17 | uStack324) & uVar8 | uVar17 & uStack324) + iVar13;
    uStack312 = uVar5 + iVar13;
    uVar1 = puVar22[7];
    puVar22[0x14] = uVar25;
    uVar6 = uVar20 + uVar6 +
            ((uVar25 * 0x8000 | uVar25 >> 0x11) ^ (uVar25 * 0x2000 | uVar25 >> 0x13) ^ uVar25 >> 10)
            + ((uVar1 >> 7 | uVar1 << 0x19) ^ (uVar1 << 0xe | uVar1 >> 0x12) ^ uVar1 >> 3);
    iVar13 = ((uStack312 >> 6 | uStack312 * 0x4000000) ^ (uStack312 >> 0xb | uStack312 * 0x200000) ^
             (uStack312 * 0x80 | uStack312 >> 0x19)) +
             ((uVar11 ^ uStack308) & uStack312 ^ uVar11) + uVar12 + puVar2[0x16] + uVar6;
    uStack332 = ((uStack328 >> 2 | uStack328 * 0x40000000) ^
                 (uStack328 >> 0xd | uStack328 * 0x80000) ^ (uStack328 * 0x400 | uStack328 >> 0x16))
                + ((uStack324 | uStack328) & uVar17 | uStack324 & uStack328) + iVar13;
    uStack316 = uVar8 + iVar13;
    uVar5 = puVar22[8];
    puVar22[0x15] = uVar16;
    puVar22[0x10] = uVar24;
    uVar7 = puVar2[0x17];
    uVar1 = uVar24 + uVar1 +
            ((uVar16 * 0x8000 | uVar16 >> 0x11) ^ (uVar16 * 0x2000 | uVar16 >> 0x13) ^ uVar16 >> 10)
            + ((uVar5 >> 7 | uVar5 << 0x19) ^ (uVar5 << 0xe | uVar5 >> 0x12) ^ uVar5 >> 3);
    puVar22[0x17] = uVar1;
    iVar13 = ((uStack316 >> 6 | uStack316 * 0x4000000) ^ (uStack316 >> 0xb | uStack316 * 0x200000) ^
             (uStack316 * 0x80 | uStack316 >> 0x19)) +
             uVar11 + uVar7 + uVar1 + ((uStack308 ^ uStack312) & uStack316 ^ uStack308);
    puVar22[0x16] = uVar6;
    puVar22 = puVar22 + 8;
    uStack320 = uVar17 + iVar13;
    uStack336 = ((uStack332 >> 2 | uStack332 * 0x40000000) ^
                 (uStack332 >> 0xd | uStack332 * 0x80000) ^ (uStack332 * 0x400 | uStack332 >> 0x16))
                + ((uStack328 | uStack332) & uStack324 | uStack328 & uStack332) + iVar13;
    puVar2 = puVar2 + 8;
  } while (auStack304 + 0x30 != puVar22);
  puVar9 = ctx->state;
  do {
    iVar13 = *puVar18;
    puVar2 = puVar9 + 1;
    puVar18 = (uint32_t *)((int *)puVar18 + 1);
    *puVar9 = *puVar9 + iVar13;
    puVar9 = puVar2;
  } while ((uint32_t *)ctx->buffer != puVar2);
  return;
}



void sha224_clone_wrap(mbedtls_sha256_context *dst,mbedtls_sha256_context *src)

{
  memcpy(dst,src,0x74);
  return;
}



void sha224_ctx_free(void *ctx)

{
  mbedtls_sha256_free((mbedtls_sha256_context *)ctx);
  vPortFree(ctx);
  return;
}



void * sha224_ctx_alloc(void)

{
  mbedtls_sha256_context *ctx;
  
  ctx = (mbedtls_sha256_context *)mycalloc(1,0x74);
  if (ctx != (mbedtls_sha256_context *)0x0) {
    mbedtls_sha256_init(ctx);
  }
  return ctx;
}



