pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void sha224_wrap(uchar *input,size_t ilen,uchar *output)

{
  mbedtls_sha256(input,ilen,output,1);
  return;
}



void sha256_wrap(uchar *input,size_t ilen,uchar *output)

{
  mbedtls_sha256(input,ilen,output,0);
  return;
}



void sha224_finish_wrap(mbedtls_sha256_context *ctx,uchar *output)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uchar uStack24;
  undefined uStack23;
  ushort uStack22;
  undefined uStack20;
  undefined uStack19;
  ushort uStack18;
  
  uVar1 = ctx->total[0];
  uVar2 = ctx->total[1] << 3;
  uStack24 = (uchar)(uVar2 >> 0x18);
  uStack23 = (undefined)(uVar2 >> 0x10);
  uStack22 = (ushort)(uVar2 >> 8) & 0xff | (ushort)((uVar2 | uVar1 >> 0x1d) << 8);
  uStack20 = (undefined)((uVar1 << 3) >> 0x18);
  uStack19 = (undefined)((uVar1 << 3) >> 0x10);
  uStack18 = (ushort)((uVar1 << 0x13) >> 0x18) | (ushort)(uVar1 << 0xb);
  if ((uVar1 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  mbedtls_sha256_update(ctx,sha256_padding,iVar3 - (uVar1 & 0x3f));
  mbedtls_sha256_update(ctx,&uStack24,8);
  *output = *(uchar *)((int)ctx->state + 3);
  output[1] = (uchar)*(undefined2 *)((int)ctx->state + 2);
  output[2] = (uchar)(ctx->state[0] >> 8);
  output[3] = (uchar)ctx->state[0];
  output[4] = *(uchar *)((int)ctx->state + 7);
  output[5] = (uchar)*(undefined2 *)((int)ctx->state + 6);
  output[6] = (uchar)(ctx->state[1] >> 8);
  output[7] = (uchar)ctx->state[1];
  output[8] = *(uchar *)((int)ctx->state + 0xb);
  output[9] = (uchar)*(undefined2 *)((int)ctx->state + 10);
  output[10] = (uchar)(ctx->state[2] >> 8);
  output[0xb] = (uchar)ctx->state[2];
  output[0xc] = *(uchar *)((int)ctx->state + 0xf);
  output[0xd] = (uchar)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xe] = (uchar)(ctx->state[3] >> 8);
  output[0xf] = (uchar)ctx->state[3];
  output[0x10] = *(uchar *)((int)ctx->state + 0x13);
  output[0x11] = (uchar)*(undefined2 *)((int)ctx->state + 0x12);
  output[0x12] = (uchar)(ctx->state[4] >> 8);
  output[0x13] = (uchar)ctx->state[4];
  output[0x14] = *(uchar *)((int)ctx->state + 0x17);
  output[0x15] = (uchar)*(undefined2 *)((int)ctx->state + 0x16);
  output[0x16] = (uchar)(ctx->state[5] >> 8);
  output[0x17] = (uchar)ctx->state[5];
  output[0x18] = *(uchar *)((int)ctx->state + 0x1b);
  output[0x19] = (uchar)*(undefined2 *)((int)ctx->state + 0x1a);
  output[0x1a] = (uchar)(ctx->state[6] >> 8);
  output[0x1b] = (uchar)ctx->state[6];
  if (ctx->is224 == 0) {
    output[0x1c] = *(uchar *)((int)ctx->state + 0x1f);
    output[0x1d] = (uchar)*(undefined2 *)((int)ctx->state + 0x1e);
    output[0x1e] = (uchar)(ctx->state[7] >> 8);
    output[0x1f] = (uchar)ctx->state[7];
  }
  return;
}



void sha224_update_wrap(mbedtls_sha256_context *ctx,uchar *input,size_t ilen)

{
  if (ilen != 0) {
    mbedtls_sha256_update(ctx,input,ilen);
    return;
  }
  return;
}



void sha224_starts_wrap(void *ctx)

{
  mbedtls_sha256_starts((mbedtls_sha256_context *)ctx,1);
  return;
}



void sha256_starts_wrap(void *ctx)

{
  mbedtls_sha256_starts((mbedtls_sha256_context *)ctx,0);
  return;
}



oid_sig_alg_t * oid_sig_alg_from_asn1(mbedtls_asn1_buf *oid)

{
  oid_sig_alg_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  poVar1 = oid_sig_alg;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return (oid_sig_alg_t *)0x0;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  return poVar1;
}



int mbedtls_oid_get_attr_short_name(mbedtls_asn1_buf *oid,char **short_name)

{
  oid_x520_attr_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar1 = oid_x520_attr_type;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return -0x2e;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  *short_name = poVar1->short_name;
  return 0;
}



int mbedtls_oid_get_x509_ext_type(mbedtls_asn1_buf *oid,int *ext_type)

{
  oid_x509_ext_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar1 = oid_x509_ext;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return -0x2e;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  *ext_type = poVar1->ext_type;
  return 0;
}



int mbedtls_oid_get_extended_key_usage(mbedtls_asn1_buf *oid,char **description)

{
  mbedtls_oid_descriptor_t *pmVar1;
  int iVar2;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  pmVar1 = oid_ext_key_usage;
  while( true ) {
    if (pmVar1->asn1 == (char *)0x0) {
      return -0x2e;
    }
    if ((pmVar1->asn1_len == oid->len) &&
       (iVar2 = memcmp(pmVar1->asn1,oid->p,pmVar1->asn1_len), iVar2 == 0)) break;
    pmVar1 = pmVar1 + 1;
  }
  *description = pmVar1->description;
  return 0;
}



int mbedtls_oid_get_sig_alg_desc(mbedtls_asn1_buf *oid,char **description)

{
  int iVar1;
  oid_sig_alg_t *poVar2;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar2 = oid_sig_alg_from_asn1(oid);
  if (poVar2 == (oid_sig_alg_t *)0x0) {
    iVar1 = -0x2e;
  }
  else {
    iVar1 = 0;
    *description = (poVar2->descriptor).description;
  }
  return iVar1;
}



int mbedtls_oid_get_sig_alg
              (mbedtls_asn1_buf *oid,mbedtls_md_type_t *md_alg,mbedtls_pk_type_t *pk_alg)

{
  int iVar1;
  oid_sig_alg_t *poVar2;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar2 = oid_sig_alg_from_asn1(oid);
  if (poVar2 == (oid_sig_alg_t *)0x0) {
    iVar1 = -0x2e;
  }
  else {
    *md_alg = poVar2->md_alg;
    iVar1 = 0;
    *pk_alg = poVar2->pk_alg;
  }
  return iVar1;
}



int mbedtls_oid_get_pk_alg(mbedtls_asn1_buf *oid,mbedtls_pk_type_t *pk_alg)

{
  oid_pk_alg_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar1 = oid_pk_alg;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return -0x2e;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  *pk_alg = poVar1->pk_alg;
  return 0;
}



int mbedtls_oid_get_ec_grp(mbedtls_asn1_buf *oid,mbedtls_ecp_group_id *grp_id)

{
  oid_ecp_grp_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar1 = oid_ecp_grp;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return -0x2e;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  *grp_id = poVar1->grp_id;
  return 0;
}



int mbedtls_oid_get_md_alg(mbedtls_asn1_buf *oid,mbedtls_md_type_t *md_alg)

{
  oid_md_alg_t *poVar1;
  char *__s1;
  int iVar2;
  size_t __n;
  
  if (oid == (mbedtls_asn1_buf *)0x0) {
    return -0x2e;
  }
  poVar1 = oid_md_alg;
  while( true ) {
    __s1 = (poVar1->descriptor).asn1;
    if (__s1 == (char *)0x0) {
      return -0x2e;
    }
    __n = (poVar1->descriptor).asn1_len;
    if ((__n == oid->len) && (iVar2 = memcmp(__s1,oid->p,__n), iVar2 == 0)) break;
    poVar1 = poVar1 + 1;
  }
  *md_alg = poVar1->md_alg;
  return 0;
}



