pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_oid_get_oid_by_md(mbedtls_md_type_t md_alg,char **oid,size_t *olen)

{
  undefined3 in_register_00002029;
  char *pcVar1;
  oid_md_alg_t *poVar2;
  
  poVar2 = oid_md_alg;
  while( true ) {
    pcVar1 = (poVar2->descriptor).asn1;
    if (pcVar1 == (char *)0x0) {
      return -0x2e;
    }
    if ((uint)poVar2->md_alg == CONCAT31(in_register_00002029,md_alg)) break;
    poVar2 = poVar2 + 1;
  }
  *oid = pcVar1;
  *olen = (poVar2->descriptor).asn1_len;
  return 0;
}



// WARNING: Variable defined which should be unmapped: aes_ctx

void pem_aes_decrypt(uchar *aes_iv,uint keylen,uchar *buf,size_t buflen,uchar *pwd,size_t pwdlen)

{
  uchar *key;
  size_t __n;
  uchar *puVar1;
  uchar *puVar2;
  uchar local_1c0 [4];
  uchar md5sum [16];
  uchar aes_key [32];
  mbedtls_md5_context md5_ctx;
  mbedtls_aes_context aes_ctx;
  
  puVar1 = local_1c0;
  puVar2 = local_1c0;
  mbedtls_aes_init((mbedtls_aes_context *)(md5_ctx.buffer + 0x3c));
  mbedtls_md5_init((mbedtls_md5_context *)(aes_key + 0x1c));
  mbedtls_md5_starts((mbedtls_md5_context *)(aes_key + 0x1c));
  mbedtls_md5_update((mbedtls_md5_context *)(aes_key + 0x1c),pwd,pwdlen);
  mbedtls_md5_update((mbedtls_md5_context *)(aes_key + 0x1c),aes_iv,8);
  mbedtls_md5_finish((mbedtls_md5_context *)(aes_key + 0x1c),local_1c0);
  key = md5sum + 0xc;
  if (keylen == 0x10) {
    memcpy(key,local_1c0,0x10);
    mbedtls_md5_free((mbedtls_md5_context *)(aes_key + 0x1c));
    do {
      *puVar1 = '\0';
      puVar1 = puVar1 + 1;
    } while (puVar1 != key);
  }
  else {
    memcpy(key,local_1c0,0x10);
    mbedtls_md5_starts((mbedtls_md5_context *)(aes_key + 0x1c));
    mbedtls_md5_update((mbedtls_md5_context *)(aes_key + 0x1c),local_1c0,0x10);
    mbedtls_md5_update((mbedtls_md5_context *)(aes_key + 0x1c),pwd,pwdlen);
    mbedtls_md5_update((mbedtls_md5_context *)(aes_key + 0x1c),aes_iv,8);
    mbedtls_md5_finish((mbedtls_md5_context *)(aes_key + 0x1c),local_1c0);
    __n = 0x10;
    if (keylen != 0x20) {
      __n = keylen - 0x10;
    }
    memcpy(aes_key + 0xc,local_1c0,__n);
    mbedtls_md5_free((mbedtls_md5_context *)(aes_key + 0x1c));
    do {
      *puVar2 = '\0';
      puVar2 = puVar2 + 1;
    } while (puVar2 != key);
  }
  mbedtls_aes_setkey_dec((mbedtls_aes_context *)(md5_ctx.buffer + 0x3c),key,keylen << 3);
  mbedtls_aes_crypt_cbc((mbedtls_aes_context *)(md5_ctx.buffer + 0x3c),0,buflen,aes_iv,buf,buf);
  mbedtls_aes_free((mbedtls_aes_context *)(md5_ctx.buffer + 0x3c));
  while (keylen = keylen - 1, keylen != 0xffffffff) {
    *key = '\0';
    key = key + 1;
  }
  return;
}



void mbedtls_pem_init(mbedtls_pem_context *ctx)

{
  memset(ctx,0,0xc);
  return;
}



int mbedtls_pem_read_buffer
              (mbedtls_pem_context *ctx,char *header,char *footer,uchar *data,uchar *pwd,
              size_t pwdlen,size_t *use_len)

{
  uchar uVar1;
  bool bVar2;
  uchar *dst;
  uchar *puVar3;
  size_t sVar4;
  int iVar5;
  int iVar6;
  uchar *puVar7;
  byte bVar8;
  uint uVar9;
  uint uVar10;
  byte *pbVar11;
  uint keylen;
  uchar *src;
  size_t sStack68;
  size_t len;
  uchar pem_iv [16];
  
  if (ctx == (mbedtls_pem_context *)0x0) {
    return -0x1480;
  }
  dst = (uchar *)strstr((char *)data,header);
  if (((dst == (uchar *)0x0) ||
      (puVar3 = (uchar *)strstr((char *)data,footer), puVar3 == (uchar *)0x0)) || (puVar3 <= dst)) {
    return -0x1080;
  }
  sVar4 = strlen(header);
  dst = dst + sVar4;
  if (*dst == ' ') {
    dst = dst + 1;
  }
  if (*dst == '\r') {
    dst = dst + 1;
  }
  if (*dst != '\n') {
    return -0x1080;
  }
  sVar4 = strlen(footer);
  puVar7 = puVar3 + sVar4;
  src = dst + 1;
  if (*puVar7 == ' ') {
    puVar7 = puVar7 + 1;
  }
  if (*puVar7 == '\r') {
    puVar7 = puVar7 + 1;
  }
  if (*puVar7 == '\n') {
    puVar7 = puVar7 + 1;
  }
  *(uchar **)use_len = puVar7 + -(int)data;
  if (((int)(puVar3 + -(int)src) < 0x16) ||
     (iVar5 = memcmp(src,"Proc-Type: 4,ENCRYPTED",0x16), iVar5 != 0)) {
    iVar5 = 0;
    bVar2 = false;
  }
  else {
    uVar1 = dst[0x17];
    puVar7 = dst + 0x17;
    if (uVar1 == '\r') {
      uVar1 = dst[0x18];
      puVar7 = dst + 0x18;
    }
    if (uVar1 != '\n') {
      return -0x1100;
    }
    dst = puVar7 + 1;
    if ((((int)(puVar3 + -(int)dst) < 0xe) || (iVar5 = memcmp(dst,"DEK-Info: AES-",0xe), iVar5 != 0)
        ) || ((int)(puVar3 + -(int)dst) < 0x16)) {
      return -0x1280;
    }
    iVar6 = memcmp(dst,"DEK-Info: AES-128-CBC,",0x16);
    iVar5 = 5;
    if (iVar6 != 0) {
      iVar6 = memcmp(dst,"DEK-Info: AES-192-CBC,",0x16);
      iVar5 = 6;
      if (iVar6 != 0) {
        iVar5 = memcmp(dst,"DEK-Info: AES-256-CBC,",0x16);
        if (iVar5 != 0) {
          return -0x1280;
        }
        iVar5 = 7;
      }
    }
    if ((int)(puVar3 + -(int)(puVar7 + 0x17)) < 0x20) {
      return -0x1200;
    }
    memset(&len,0,0x10);
    keylen = 0;
    do {
      uVar10 = (uint)puVar7[keylen + 0x17];
      uVar9 = uVar10 - 0x30;
      if (9 < (uVar9 & 0xff)) {
        if ((uVar10 - 0x41 & 0xff) < 6) {
          uVar9 = uVar10 - 0x37;
        }
        else {
          if (5 < (uVar10 - 0x61 & 0xff)) {
            return -0x1200;
          }
          uVar9 = uVar10 - 0x57;
        }
      }
      bVar8 = (byte)uVar9;
      if ((keylen & 1) == 0) {
        bVar8 = (byte)(uVar9 << 4);
      }
      pbVar11 = (byte *)((int)&len + (keylen >> 1));
      keylen = keylen + 1;
      *pbVar11 = bVar8 | *pbVar11;
    } while (keylen != 0x20);
    src = puVar7 + 0x38;
    if (puVar7[0x37] != '\r') {
      src = puVar7 + 0x37;
    }
    if (*src != '\n') {
      return -0x1100;
    }
    src = src + 1;
    bVar2 = true;
  }
  if (puVar3 <= src) {
    return -0x1100;
  }
  iVar6 = mbedtls_base64_decode((uchar *)0x0,0,&sStack68,src,(size_t)(puVar3 + -(int)src));
  if (iVar6 == -0x2c) {
    return -0x112c;
  }
  dst = (uchar *)mycalloc(1,sStack68);
  if (dst == (uchar *)0x0) {
    return -0x1180;
  }
  iVar6 = mbedtls_base64_decode(dst,sStack68,&sStack68,src,(size_t)(puVar3 + -(int)src));
  if (iVar6 != 0) {
    vPortFree(dst);
    return iVar6 + -0x1100;
  }
  if (!bVar2) goto LAB_230661ca;
  if (pwd == (uchar *)0x0) {
    vPortFree(dst);
    return -0x1300;
  }
  if (iVar5 == 5) {
    keylen = 0x10;
LAB_23066174:
    pem_aes_decrypt((uchar *)&len,keylen,dst,sStack68,pwd,pwdlen);
  }
  else {
    if (iVar5 == 6) {
      keylen = 0x18;
      goto LAB_23066174;
    }
    if (iVar5 == 7) {
      keylen = 0x20;
      goto LAB_23066174;
    }
  }
  if (((sStack68 < 3) || (*dst != '0')) || (0x83 < dst[1])) {
    vPortFree(dst);
    return -0x1380;
  }
LAB_230661ca:
  ctx->buf = dst;
  ctx->buflen = sStack68;
  return 0;
}



void mbedtls_pem_free(mbedtls_pem_context *ctx)

{
  mbedtls_pem_context *pmVar1;
  
