pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
void mbedtls_md5_update(mbedtls_md5_context *ctx,uchar *input,size_t ilen)

{
  size_t __n;
  uint uVar1;
  uint uVar2;
  uint __n_00;
  
  uVar2 = ctx->total[0] & 0x3f;
  uVar1 = ctx->total[0] + ilen;
  ctx->total[0] = uVar1;
  if (uVar1 < ilen) {
    ctx->total[1] = ctx->total[1] + 1;
  }
  uVar1 = ilen;
  if ((uVar2 != 0) && (__n_00 = 0x40 - uVar2, __n_00 <= ilen)) {
    memcpy(ctx->buffer + uVar2,input,__n_00);
    ilen = (ilen - 0x40) + uVar2;
    mbedtls_md5_process(ctx,ctx->buffer);
    input = input + __n_00;
    uVar2 = 0;
    uVar1 = ilen;
  }
  while (0x3f < ilen) {
    mbedtls_md5_process(ctx,input + (uVar1 - ilen));
    ilen = ilen - 0x40;
  }
  __n = (uVar1 >> 6) * -0x40 + uVar1;
  if (__n == 0) {
    return;
  }
  memcpy(ctx->buffer + uVar2,input + (uVar1 & 0xffffffc0),__n);
  return;
}



void mbedtls_md5_update(mbedtls_md5_context *ctx,uchar *input,size_t ilen)

{
  if (ilen != 0) {
    mbedtls_md5_update(ctx,input,ilen);
    return;
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void mbedtls_md5_finish(mbedtls_md5_context *ctx,uchar *output)

{
  uint uVar1;
  int iVar2;
  int iStack24;
  uchar msglen [8];
  
  uVar1 = ctx->total[0];
  msglen._0_4_ = ctx->total[1] << 3 | uVar1 >> 0x1d;
  iStack24 = uVar1 << 3;
  if ((uVar1 & 0x3f) < 0x38) {
    iVar2 = 0x38;
  }
  else {
    iVar2 = 0x78;
  }
  mbedtls_md5_update(ctx,md5_padding,iVar2 - (uVar1 & 0x3f));
  mbedtls_md5_update(ctx,(uchar *)&iStack24,8);
  *output = (uchar)ctx->state[0];
  output[1] = (uchar)(ctx->state[0] >> 8);
  output[2] = (uchar)*(undefined2 *)((int)ctx->state + 2);
  output[3] = *(uchar *)((int)ctx->state + 3);
  output[4] = (uchar)ctx->state[1];
  output[5] = (uchar)(ctx->state[1] >> 8);
  output[6] = (uchar)*(undefined2 *)((int)ctx->state + 6);
  output[7] = *(uchar *)((int)ctx->state + 7);
  output[8] = (uchar)ctx->state[2];
  output[9] = (uchar)(ctx->state[2] >> 8);
  output[10] = (uchar)*(undefined2 *)((int)ctx->state + 10);
  output[0xb] = *(uchar *)((int)ctx->state + 0xb);
  output[0xc] = (uchar)ctx->state[3];
  output[0xd] = (uchar)(ctx->state[3] >> 8);
  output[0xe] = (uchar)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xf] = *(uchar *)((int)ctx->state + 0xf);
  return;
}



void mbedtls_md5(uchar *input,size_t ilen,uchar *output)

{
  undefined auStack104 [4];
  mbedtls_md5_context ctx;
  
  mbedtls_md5_init((mbedtls_md5_context *)auStack104);
  mbedtls_md5_starts((mbedtls_md5_context *)auStack104);
  mbedtls_md5_update((mbedtls_md5_context *)auStack104,input,ilen);
  mbedtls_md5_finish((mbedtls_md5_context *)auStack104,output);
  mbedtls_md5_free((mbedtls_md5_context *)auStack104);
  return;
}



void mbedtls_sha1_init(mbedtls_sha1_context *ctx)

{
  memset(ctx,0,0x5c);
  return;
}



void mbedtls_sha1_free(mbedtls_sha1_context *ctx)

{
  mbedtls_sha1_context *pmVar1;
  
  pmVar1 = ctx + 1;
  if (ctx != (mbedtls_sha1_context *)0x0) {
    while (ctx != pmVar1) {
      *(undefined *)ctx->total = 0;
      ctx = (mbedtls_sha1_context *)((int)ctx->total + 1);
    }
  }
  return;
}



void mbedtls_sha1_clone(mbedtls_sha1_context *dst,mbedtls_sha1_context *src)

{
  memcpy(dst,src,0x5c);
  return;
}



void mbedtls_sha1_starts(mbedtls_sha1_context *ctx)

{
  ctx->state[0] = 0x67452301;
  ctx->state[1] = 0xefcdab89;
  ctx->state[2] = 0x98badcfe;
  ctx->state[3] = 0x10325476;
  ctx->total[0] = 0;
  ctx->total[1] = 0;
  ctx->state[4] = 0xc3d2e1f0;
  return;
}



void mbedtls_sha1_process(mbedtls_sha1_context *ctx,uchar *data)

{
  uint uVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  uint uVar8;
  uint uVar9;
  uint uVar10;
  uint uVar11;
  uint32_t uVar12;
  uint uVar13;
  uint uVar14;
  uint uVar15;
  uint uVar16;
  uint uVar17;
  uint uVar18;
  uint uVar19;
  uint uVar20;
  uint uVar21;
  uint uVar22;
  uint uVar23;
  uint uVar24;
  uint uVar25;
  uint uVar26;
  uint uVar27;
  uint uVar28;
  
  uVar8 = (uint)*data << 0x18 | (uint)data[1] << 0x10 | (uint)data[3] | (uint)data[2] << 8;
  uVar10 = (uint)data[4] << 0x18 | (uint)data[5] << 0x10 | (uint)data[7] | (uint)data[6] << 8;
  uVar9 = (uint)data[8] << 0x18 | (uint)data[9] << 0x10 | (uint)data[0xb] | (uint)data[10] << 8;
  uVar1 = (uint)data[0xc] << 0x18 | (uint)data[0xd] << 0x10 | (uint)data[0xf] | (uint)data[0xe] << 8
  ;
  uVar27 = (uint)data[0x10] << 0x18 | (uint)data[0x11] << 0x10 | (uint)data[0x13] |
           (uint)data[0x12] << 8;
  uVar25 = (uint)data[0x14] << 0x18 | (uint)data[0x15] << 0x10 | (uint)data[0x17] |
           (uint)data[0x16] << 8;
  uVar14 = (uint)data[0x18] << 0x18 | (uint)data[0x19] << 0x10 | (uint)data[0x1b] |
           (uint)data[0x1a] << 8;
  uVar20 = (uint)data[0x1c] << 0x18 | (uint)data[0x1d] << 0x10 | (uint)data[0x1f] |
           (uint)data[0x1e] << 8;
  uVar28 = (uint)data[0x20] << 0x18 | (uint)data[0x21] << 0x10 | (uint)data[0x23] |
           (uint)data[0x22] << 8;
  uVar26 = (uint)data[0x24] << 0x18 | (uint)data[0x25] << 0x10 | (uint)data[0x27] |
           (uint)data[0x26] << 8;
  uVar2 = (uint)data[0x28] << 0x18 | (uint)data[0x29] << 0x10 | (uint)data[0x2b] |
          (uint)data[0x2a] << 8;
  uVar13 = (uint)data[0x2c] << 0x18 | (uint)data[0x2d] << 0x10 | (uint)data[0x2f] |
           (uint)data[0x2e] << 8;
  uVar11 = (uint)data[0x30] << 0x18 | (uint)data[0x31] << 0x10 | (uint)data[0x33] |
           (uint)data[0x32] << 8;
  uVar16 = ctx->state[2];
  uVar15 = ctx->state[0];
  uVar5 = (uint)data[0x34] << 0x18 | (uint)data[0x35] << 0x10 | (uint)data[0x37] |
          (uint)data[0x36] << 8;
  uVar4 = (uint)data[0x38] << 0x18 | (uint)data[0x39] << 0x10 | (uint)data[0x3b] |
          (uint)data[0x3a] << 8;
  uVar3 = (uint)data[0x3c] << 0x18 | (uint)data[0x3d] << 0x10 | (uint)data[0x3f] |
          (uint)data[0x3e] << 8;
  uVar6 = (uVar15 << 5 | uVar15 >> 0x1b) + ctx->state[4] + 0x5a827999 +
          ((uVar16 ^ ctx->state[3]) & ctx->state[1] ^ ctx->state[3]) + uVar8;
  uVar17 = ctx->state[1] << 0x1e | ctx->state[1] >> 2;
  uVar18 = (uVar6 * 0x20 | uVar6 >> 0x1b) +
           ((uVar16 ^ uVar17) & uVar15 ^ uVar16) + ctx->state[3] + 0x5a827999 + uVar10;
  uVar23 = uVar15 << 0x1e | uVar15 >> 2;
  uVar7 = uVar6 * 0x40000000 | uVar6 >> 2;
  uVar6 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
          ((uVar17 ^ uVar23) & uVar6 ^ uVar17) + uVar16 + 0x5a827999 + uVar9;
  uVar19 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar18 = (uVar6 * 0x20 | uVar6 >> 0x1b) +
           ((uVar23 ^ uVar7) & uVar18 ^ uVar23) + uVar17 + 0x5a827999 + uVar1;
  uVar21 = uVar6 * 0x40000000 | uVar6 >> 2;
  uVar17 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar7 ^ uVar19) & uVar6 ^ uVar7) + uVar23 + 0x5a827999 + uVar27;
  uVar23 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           ((uVar19 ^ uVar21) & uVar18 ^ uVar19) + uVar25 + 0x5a827999 + uVar7;
  uVar6 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar7 = (uVar23 * 0x20 | uVar23 >> 0x1b) +
          ((uVar21 ^ uVar6) & uVar17 ^ uVar21) + uVar14 + 0x5a827999 + uVar19;
  uVar24 = uVar23 * 0x40000000 | uVar23 >> 2;
  uVar19 = (uVar7 * 0x20 | uVar7 >> 0x1b) +
           ((uVar6 ^ uVar18) & uVar23 ^ uVar6) + uVar21 + uVar20 + 0x5a827999;
  uVar17 = uVar7 * 0x40000000 | uVar7 >> 2;
  uVar7 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
          ((uVar18 ^ uVar24) & uVar7 ^ uVar18) + uVar28 + 0x5a827999 + uVar6;
  uVar23 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar6 = (uVar7 * 0x20 | uVar7 >> 0x1b) +
          ((uVar24 ^ uVar17) & uVar19 ^ uVar24) + uVar18 + uVar26 + 0x5a827999;
  uVar22 = uVar7 * 0x40000000 | uVar7 >> 2;
  uVar19 = (uVar6 * 0x20 | uVar6 >> 0x1b) +
           ((uVar17 ^ uVar23) & uVar7 ^ uVar17) + uVar2 + 0x5a827999 + uVar24;
  uVar18 = uVar6 * 0x40000000 | uVar6 >> 2;
  uVar7 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
          ((uVar23 ^ uVar22) & uVar6 ^ uVar23) + uVar17 + uVar13 + 0x5a827999;
  uVar21 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar6 = (uVar7 * 0x20 | uVar7 >> 0x1b) +
          ((uVar22 ^ uVar18) & uVar19 ^ uVar22) + uVar11 + 0x5a827999 + uVar23;
  uVar17 = uVar7 * 0x40000000 | uVar7 >> 2;
  uVar19 = (uVar6 * 0x20 | uVar6 >> 0x1b) +
           ((uVar18 ^ uVar21) & uVar7 ^ uVar18) + uVar22 + uVar5 + 0x5a827999;
  uVar7 = uVar6 * 0x40000000 | uVar6 >> 2;
  uVar23 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           ((uVar21 ^ uVar17) & uVar6 ^ uVar21) + uVar4 + 0x5a827999 + uVar18;
  uVar22 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar6 = uVar8 ^ uVar9 ^ uVar28 ^ uVar5;
  uVar18 = (uVar23 * 0x20 | uVar23 >> 0x1b) +
           ((uVar17 ^ uVar7) & uVar19 ^ uVar17) + uVar21 + uVar3 + 0x5a827999;
  uVar8 = uVar6 >> 0x1f | uVar6 << 1;
  uVar6 = uVar10 ^ uVar1 ^ uVar26 ^ uVar4;
  uVar19 = uVar23 * 0x40000000 | uVar23 >> 2;
  uVar10 = uVar6 >> 0x1f | uVar6 << 1;
  uVar17 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar7 ^ uVar22) & uVar23 ^ uVar7) + uVar8 + 0x5a827999 + uVar17;
  uVar21 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar9 = uVar9 ^ uVar27 ^ uVar2 ^ uVar3;
  uVar6 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
          ((uVar22 ^ uVar19) & uVar18 ^ uVar22) + uVar7 + uVar10 + 0x5a827999;
  uVar9 = uVar9 >> 0x1f | uVar9 << 1;
  uVar1 = uVar1 ^ uVar25 ^ uVar13 ^ uVar8;
  uVar23 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar1 = uVar1 >> 0x1f | uVar1 << 1;
  uVar18 = (uVar6 * 0x20 | uVar6 >> 0x1b) +
           ((uVar19 ^ uVar21) & uVar17 ^ uVar19) + uVar9 + 0x5a827999 + uVar22;
  uVar17 = uVar27 ^ uVar14 ^ uVar11 ^ uVar10;
  uVar7 = uVar6 * 0x40000000 | uVar6 >> 2;
  uVar27 = uVar17 >> 0x1f | uVar17 << 1;
  uVar17 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar21 ^ uVar23) & uVar6 ^ uVar21) + uVar1 + 0x5a827999 + uVar19;
  uVar6 = uVar25 ^ uVar20 ^ uVar5 ^ uVar9;
  uVar19 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar24 = uVar6 >> 0x1f | uVar6 << 1;
  uVar21 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar23 ^ uVar7 ^ uVar18) + uVar21 + uVar27 + 0x6ed9eba1;
  uVar6 = uVar14 ^ uVar28 ^ uVar4 ^ uVar1;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar17 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar7 ^ uVar19 ^ uVar17) + uVar24 + 0x6ed9eba1 + uVar23;
  uVar14 = uVar6 >> 0x1f | uVar6 << 1;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar6 = uVar20 ^ uVar26 ^ uVar3 ^ uVar27;
  uVar6 = uVar6 >> 0x1f | uVar6 << 1;
  uVar21 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar19 ^ uVar18 ^ uVar21) + uVar14 + 0x6ed9eba1 + uVar7;
  uVar7 = uVar28 ^ uVar2 ^ uVar8 ^ uVar24;
  uVar20 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar28 = uVar7 >> 0x1f | uVar7 << 1;
  uVar7 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
          (uVar18 ^ uVar23 ^ uVar17) + uVar19 + uVar6 + 0x6ed9eba1;
  uVar17 = uVar26 ^ uVar13 ^ uVar10 ^ uVar14;
  uVar22 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar26 = uVar17 >> 0x1f | uVar17 << 1;
  uVar17 = (uVar7 * 0x20 | uVar7 >> 0x1b) +
           (uVar23 ^ uVar20 ^ uVar21) + uVar18 + uVar28 + 0x6ed9eba1;
  uVar2 = uVar2 ^ uVar11 ^ uVar9 ^ uVar6;
  uVar19 = uVar7 * 0x40000000 | uVar7 >> 2;
  uVar21 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar20 ^ uVar22 ^ uVar7) + uVar23 + uVar26 + 0x6ed9eba1;
  uVar2 = uVar2 >> 0x1f | uVar2 << 1;
  uVar7 = uVar13 ^ uVar5 ^ uVar1 ^ uVar28;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar13 = uVar7 >> 0x1f | uVar7 << 1;
  uVar20 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar22 ^ uVar19 ^ uVar17) + uVar2 + 0x6ed9eba1 + uVar20;
  uVar7 = uVar11 ^ uVar4 ^ uVar27 ^ uVar26;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar11 = uVar7 >> 0x1f | uVar7 << 1;
  uVar17 = (uVar20 * 0x20 | uVar20 >> 0x1b) +
           (uVar19 ^ uVar18 ^ uVar21) + uVar13 + 0x6ed9eba1 + uVar22;
  uVar5 = uVar5 ^ uVar3 ^ uVar24 ^ uVar2;
  uVar22 = uVar20 * 0x40000000 | uVar20 >> 2;
  uVar5 = uVar5 >> 0x1f | uVar5 << 1;
  uVar7 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
          (uVar18 ^ uVar23 ^ uVar20) + uVar19 + uVar11 + 0x6ed9eba1;
  uVar4 = uVar4 ^ uVar8 ^ uVar14 ^ uVar13;
  uVar20 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar4 = uVar4 >> 0x1f | uVar4 << 1;
  uVar17 = (uVar7 * 0x20 | uVar7 >> 0x1b) + (uVar23 ^ uVar22 ^ uVar17) + uVar18 + uVar5 + 0x6ed9eba1
  ;
  uVar3 = uVar3 ^ uVar10 ^ uVar6 ^ uVar11;
  uVar19 = uVar7 * 0x40000000 | uVar7 >> 2;
  uVar3 = uVar3 >> 0x1f | uVar3 << 1;
  uVar21 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar22 ^ uVar20 ^ uVar7) + uVar23 + uVar4 + 0x6ed9eba1;
  uVar7 = uVar8 ^ uVar9 ^ uVar28 ^ uVar5;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar17 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar20 ^ uVar19 ^ uVar17) + uVar3 + 0x6ed9eba1 + uVar22;
  uVar7 = uVar7 >> 0x1f | uVar7 << 1;
  uVar8 = uVar10 ^ uVar1 ^ uVar26 ^ uVar4;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar10 = uVar8 >> 0x1f | uVar8 << 1;
  uVar21 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar19 ^ uVar18 ^ uVar21) + uVar7 + 0x6ed9eba1 + uVar20;
  uVar8 = uVar9 ^ uVar27 ^ uVar2 ^ uVar3;
  uVar20 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar8 = uVar8 >> 0x1f | uVar8 << 1;
  uVar17 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar18 ^ uVar23 ^ uVar17) + uVar19 + uVar10 + 0x6ed9eba1;
  uVar1 = uVar1 ^ uVar24 ^ uVar13 ^ uVar7;
  uVar22 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar9 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
          (uVar23 ^ uVar20 ^ uVar21) + uVar18 + uVar8 + 0x6ed9eba1;
  uVar1 = uVar1 >> 0x1f | uVar1 << 1;
  uVar19 = uVar27 ^ uVar14 ^ uVar11 ^ uVar10;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar21 = (uVar9 * 0x20 | uVar9 >> 0x1b) + (uVar20 ^ uVar22 ^ uVar17) + uVar1 + 0x6ed9eba1 + uVar23
  ;
  uVar27 = uVar19 >> 0x1f | uVar19 << 1;
  uVar19 = uVar24 ^ uVar6 ^ uVar5 ^ uVar8;
  uVar17 = uVar9 * 0x40000000 | uVar9 >> 2;
  uVar25 = uVar19 >> 0x1f | uVar19 << 1;
  uVar19 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar22 ^ uVar18 ^ uVar9) + uVar27 + 0x6ed9eba1 + uVar20;
  uVar9 = uVar14 ^ uVar28 ^ uVar4 ^ uVar1;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar14 = uVar9 >> 0x1f | uVar9 << 1;
  uVar20 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           (uVar18 ^ uVar17 ^ uVar21) + uVar22 + uVar25 + 0x6ed9eba1;
  uVar6 = uVar6 ^ uVar26 ^ uVar3 ^ uVar27;
  uVar21 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar6 = uVar6 >> 0x1f | uVar6 << 1;
  uVar9 = (uVar20 * 0x20 | uVar20 >> 0x1b) +
          (uVar17 ^ uVar23 ^ uVar19) + uVar14 + 0x6ed9eba1 + uVar18;
  uVar18 = uVar28 ^ uVar2 ^ uVar7 ^ uVar25;
  uVar22 = uVar20 * 0x40000000 | uVar20 >> 2;
  uVar28 = uVar18 >> 0x1f | uVar18 << 1;
  uVar17 = (uVar9 * 0x20 | uVar9 >> 0x1b) + (uVar23 ^ uVar21 ^ uVar20) + uVar6 + 0x6ed9eba1 + uVar17
  ;
  uVar19 = uVar9 * 0x40000000 | uVar9 >> 2;
  uVar20 = uVar26 ^ uVar13 ^ uVar10 ^ uVar14;
  uVar18 = ((uVar9 | uVar22) & uVar21 | uVar9 & uVar22) +
           uVar28 + 0x8f1bbcdc + uVar23 + (uVar17 * 0x20 | uVar17 >> 0x1b);
  uVar26 = uVar20 >> 0x1f | uVar20 << 1;
  uVar2 = uVar2 ^ uVar11 ^ uVar8 ^ uVar6;
  uVar23 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar2 = uVar2 >> 0x1f | uVar2 << 1;
  uVar17 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar17 | uVar19) & uVar22 | uVar17 & uVar19) + uVar26 + 0x8f1bbcdc + uVar21;
  uVar9 = uVar13 ^ uVar5 ^ uVar1 ^ uVar28;
  uVar21 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar13 = uVar9 >> 0x1f | uVar9 << 1;
  uVar20 = ((uVar18 | uVar23) & uVar19 | uVar18 & uVar23) +
           uVar2 + 0x8f1bbcdc + uVar22 + (uVar17 * 0x20 | uVar17 >> 0x1b);
  uVar9 = uVar11 ^ uVar4 ^ uVar27 ^ uVar26;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar11 = uVar9 >> 0x1f | uVar9 << 1;
  uVar9 = (uVar20 * 0x20 | uVar20 >> 0x1b) +
          ((uVar17 | uVar21) & uVar23 | uVar17 & uVar21) + uVar13 + 0x8f1bbcdc + uVar19;
  uVar24 = uVar20 * 0x40000000 | uVar20 >> 2;
  uVar5 = uVar5 ^ uVar3 ^ uVar25 ^ uVar2;
  uVar19 = ((uVar20 | uVar18) & uVar21 | uVar20 & uVar18) +
           uVar11 + 0x8f1bbcdc + uVar23 + (uVar9 * 0x20 | uVar9 >> 0x1b);
  uVar5 = uVar5 >> 0x1f | uVar5 << 1;
  uVar4 = uVar4 ^ uVar7 ^ uVar14 ^ uVar13;
  uVar17 = uVar9 * 0x40000000 | uVar9 >> 2;
  uVar4 = uVar4 >> 0x1f | uVar4 << 1;
  uVar9 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
          ((uVar9 | uVar24) & uVar18 | uVar9 & uVar24) + uVar5 + 0x8f1bbcdc + uVar21;
  uVar3 = uVar3 ^ uVar10 ^ uVar6 ^ uVar11;
  uVar22 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar3 = uVar3 >> 0x1f | uVar3 << 1;
  uVar18 = ((uVar19 | uVar17) & uVar24 | uVar19 & uVar17) +
           uVar4 + 0x8f1bbcdc + uVar18 + (uVar9 * 0x20 | uVar9 >> 0x1b);
  uVar7 = uVar7 ^ uVar8 ^ uVar28 ^ uVar5;
  uVar20 = uVar9 * 0x40000000 | uVar9 >> 2;
  uVar7 = uVar7 >> 0x1f | uVar7 << 1;
  uVar21 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar9 | uVar22) & uVar17 | uVar9 & uVar22) + uVar3 + 0x8f1bbcdc + uVar24;
  uVar9 = uVar10 ^ uVar1 ^ uVar26 ^ uVar4;
  uVar19 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar9 = uVar9 >> 0x1f | uVar9 << 1;
  uVar10 = ((uVar18 | uVar20) & uVar22 | uVar18 & uVar20) +
           uVar7 + 0x8f1bbcdc + uVar17 + (uVar21 * 0x20 | uVar21 >> 0x1b);
  uVar8 = uVar8 ^ uVar27 ^ uVar2 ^ uVar3;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar8 = uVar8 >> 0x1f | uVar8 << 1;
  uVar18 = (uVar10 * 0x20 | uVar10 >> 0x1b) +
           ((uVar21 | uVar19) & uVar20 | uVar21 & uVar19) + uVar9 + 0x8f1bbcdc + uVar22;
  uVar1 = uVar1 ^ uVar25 ^ uVar13 ^ uVar7;
  uVar17 = uVar10 * 0x40000000 | uVar10 >> 2;
  uVar1 = uVar1 >> 0x1f | uVar1 << 1;
  uVar10 = ((uVar10 | uVar23) & uVar19 | uVar10 & uVar23) +
           uVar8 + 0x8f1bbcdc + uVar20 + (uVar18 * 0x20 | uVar18 >> 0x1b);
  uVar21 = uVar27 ^ uVar14 ^ uVar11 ^ uVar9;
  uVar22 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar27 = uVar21 >> 0x1f | uVar21 << 1;
  uVar18 = (uVar10 * 0x20 | uVar10 >> 0x1b) +
           ((uVar18 | uVar17) & uVar23 | uVar18 & uVar17) + uVar19 + uVar1 + 0x8f1bbcdc;
  uVar19 = uVar25 ^ uVar6 ^ uVar5 ^ uVar8;
  uVar20 = uVar10 * 0x40000000 | uVar10 >> 2;
  uVar24 = uVar19 >> 0x1f | uVar19 << 1;
  uVar21 = ((uVar10 | uVar22) & uVar17 | uVar10 & uVar22) +
           uVar27 + 0x8f1bbcdc + uVar23 + (uVar18 * 0x20 | uVar18 >> 0x1b);
  uVar10 = uVar14 ^ uVar28 ^ uVar4 ^ uVar1;
  uVar19 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar14 = uVar10 >> 0x1f | uVar10 << 1;
  uVar10 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           ((uVar18 | uVar20) & uVar22 | uVar18 & uVar20) + uVar17 + uVar24 + 0x8f1bbcdc;
  uVar6 = uVar6 ^ uVar26 ^ uVar3 ^ uVar27;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar6 = uVar6 >> 0x1f | uVar6 << 1;
  uVar18 = ((uVar21 | uVar19) & uVar20 | uVar21 & uVar19) +
           uVar14 + 0x8f1bbcdc + uVar22 + (uVar10 * 0x20 | uVar10 >> 0x1b);
  uVar21 = uVar28 ^ uVar2 ^ uVar7 ^ uVar24;
  uVar17 = uVar10 * 0x40000000 | uVar10 >> 2;
  uVar28 = uVar21 >> 0x1f | uVar21 << 1;
  uVar10 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar10 | uVar23) & uVar19 | uVar10 & uVar23) + uVar20 + uVar6 + 0x8f1bbcdc;
  uVar21 = uVar26 ^ uVar13 ^ uVar9 ^ uVar14;
  uVar22 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar25 = uVar21 >> 0x1f | uVar21 << 1;
  uVar18 = ((uVar18 | uVar17) & uVar23 | uVar18 & uVar17) +
           uVar28 + 0x8f1bbcdc + uVar19 + (uVar10 * 0x20 | uVar10 >> 0x1b);
  uVar2 = uVar2 ^ uVar11 ^ uVar8 ^ uVar6;
  uVar20 = uVar10 * 0x40000000 | uVar10 >> 2;
  uVar2 = uVar2 >> 0x1f | uVar2 << 1;
  uVar21 = (uVar18 * 0x20 | uVar18 >> 0x1b) +
           ((uVar10 | uVar22) & uVar17 | uVar10 & uVar22) + uVar23 + uVar25 + 0x8f1bbcdc;
  uVar10 = uVar13 ^ uVar5 ^ uVar1 ^ uVar28;
  uVar19 = uVar18 * 0x40000000 | uVar18 >> 2;
  uVar13 = uVar10 >> 0x1f | uVar10 << 1;
  uVar17 = ((uVar18 | uVar20) & uVar22 | uVar18 & uVar20) +
           uVar2 + 0x8f1bbcdc + uVar17 + (uVar21 * 0x20 | uVar21 >> 0x1b);
  uVar10 = uVar11 ^ uVar4 ^ uVar27 ^ uVar25;
  uVar18 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar10 = uVar10 >> 0x1f | uVar10 << 1;
  uVar23 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           ((uVar21 | uVar19) & uVar20 | uVar21 & uVar19) + uVar22 + uVar13 + 0x8f1bbcdc;
  uVar5 = uVar5 ^ uVar3 ^ uVar24 ^ uVar2;
  uVar11 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar5 = uVar5 >> 0x1f | uVar5 << 1;
  uVar21 = (uVar23 * 0x20 | uVar23 >> 0x1b) +
           (uVar19 ^ uVar18 ^ uVar17) + uVar20 + uVar10 + 0xca62c1d6;
  uVar4 = uVar4 ^ uVar7 ^ uVar14 ^ uVar13;
  uVar20 = uVar23 * 0x40000000 | uVar23 >> 2;
  uVar4 = uVar4 >> 0x1f | uVar4 << 1;
  uVar17 = (uVar21 * 0x20 | uVar21 >> 0x1b) +
           (uVar18 ^ uVar11 ^ uVar23) + uVar19 + uVar5 + 0xca62c1d6;
  uVar3 = uVar3 ^ uVar9 ^ uVar6 ^ uVar10;
  uVar23 = uVar21 * 0x40000000 | uVar21 >> 2;
  uVar3 = uVar3 >> 0x1f | uVar3 << 1;
  uVar19 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar11 ^ uVar20 ^ uVar21) + uVar18 + uVar4 + 0xca62c1d6;
  uVar7 = uVar7 ^ uVar8 ^ uVar28 ^ uVar5;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar7 = uVar7 >> 0x1f | uVar7 << 1;
  uVar11 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           (uVar20 ^ uVar23 ^ uVar17) + uVar11 + uVar3 + 0xca62c1d6;
  uVar9 = uVar9 ^ uVar1 ^ uVar25 ^ uVar4;
  uVar21 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar9 = uVar9 >> 0x1f | uVar9 << 1;
  uVar20 = (uVar11 * 0x20 | uVar11 >> 0x1b) +
           (uVar23 ^ uVar18 ^ uVar19) + uVar20 + uVar7 + 0xca62c1d6;
  uVar8 = uVar8 ^ uVar27 ^ uVar2 ^ uVar3;
  uVar17 = uVar11 * 0x40000000 | uVar11 >> 2;
  uVar8 = uVar8 >> 0x1f | uVar8 << 1;
  uVar19 = (uVar20 * 0x20 | uVar20 >> 0x1b) +
           (uVar18 ^ uVar21 ^ uVar11) + uVar23 + uVar9 + 0xca62c1d6;
  uVar1 = uVar1 ^ uVar24 ^ uVar13 ^ uVar7;
  uVar22 = uVar20 * 0x40000000 | uVar20 >> 2;
  uVar1 = uVar1 >> 0x1f | uVar1 << 1;
  uVar11 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           (uVar21 ^ uVar17 ^ uVar20) + uVar18 + uVar8 + 0xca62c1d6;
  uVar18 = uVar27 ^ uVar14 ^ uVar10 ^ uVar9;
  uVar23 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar26 = uVar18 >> 0x1f | uVar18 << 1;
  uVar19 = (uVar11 * 0x20 | uVar11 >> 0x1b) +
           (uVar17 ^ uVar22 ^ uVar19) + uVar21 + uVar1 + 0xca62c1d6;
  uVar21 = uVar24 ^ uVar6 ^ uVar5 ^ uVar8;
  uVar18 = uVar11 * 0x40000000 | uVar11 >> 2;
  uVar24 = uVar21 >> 0x1f | uVar21 << 1;
  uVar17 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           (uVar22 ^ uVar23 ^ uVar11) + uVar17 + uVar26 + 0xca62c1d6;
  uVar11 = uVar14 ^ uVar28 ^ uVar4 ^ uVar1;
  uVar21 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar11 = uVar11 >> 0x1f | uVar11 << 1;
  uVar20 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar23 ^ uVar18 ^ uVar19) + uVar22 + uVar24 + 0xca62c1d6;
  uVar6 = uVar6 ^ uVar25 ^ uVar3 ^ uVar26;
  uVar14 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar6 = uVar6 >> 0x1f | uVar6 << 1;
  uVar19 = (uVar20 * 0x20 | uVar20 >> 0x1b) +
           (uVar18 ^ uVar21 ^ uVar17) + uVar23 + uVar11 + 0xca62c1d6;
  uVar17 = uVar28 ^ uVar2 ^ uVar7 ^ uVar24;
  uVar22 = uVar20 * 0x40000000 | uVar20 >> 2;
  uVar27 = uVar17 >> 0x1f | uVar17 << 1;
  uVar17 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
           (uVar21 ^ uVar14 ^ uVar20) + uVar18 + uVar6 + 0xca62c1d6;
  uVar18 = uVar25 ^ uVar13 ^ uVar9 ^ uVar11;
  uVar23 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar20 = uVar18 >> 0x1f | uVar18 << 1;
  uVar19 = (uVar17 * 0x20 | uVar17 >> 0x1b) +
           (uVar14 ^ uVar22 ^ uVar19) + uVar21 + uVar27 + 0xca62c1d6;
  uVar2 = uVar2 ^ uVar10 ^ uVar8 ^ uVar6;
  uVar18 = uVar17 * 0x40000000 | uVar17 >> 2;
  uVar2 = uVar2 >> 0x1f | uVar2 << 1;
  uVar8 = (uVar19 * 0x20 | uVar19 >> 0x1b) +
          (uVar22 ^ uVar23 ^ uVar17) + uVar14 + uVar20 + 0xca62c1d6;
  uVar27 = uVar13 ^ uVar5 ^ uVar1 ^ uVar27;
  uVar13 = uVar19 * 0x40000000 | uVar19 >> 2;
  uVar21 = uVar27 >> 0x1f | uVar27 << 1;
  uVar14 = uVar22 + uVar2 + 0xca62c1d6 + (uVar23 ^ uVar18 ^ uVar19) + (uVar8 * 0x20 | uVar8 >> 0x1b)
  ;
  uVar20 = uVar10 ^ uVar4 ^ uVar26 ^ uVar20;
  uVar10 = (uVar14 * 0x20 | uVar14 >> 0x1b) +
