pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
           (uVar18 ^ uVar13 ^ uVar8) + uVar23 + uVar21 + 0xca62c1d6;
  uVar1 = uVar8 * 0x40000000 | uVar8 >> 2;
  uVar17 = uVar20 >> 0x1f | uVar20 << 1;
  uVar2 = uVar5 ^ uVar3 ^ uVar24 ^ uVar2;
  uVar5 = uVar18 + uVar17 + 0xca62c1d6 + (uVar13 ^ uVar1 ^ uVar14) +
          (uVar10 * 0x20 | uVar10 >> 0x1b);
  uVar8 = uVar14 * 0x40000000 | uVar14 >> 2;
  uVar21 = uVar4 ^ uVar7 ^ uVar11 ^ uVar21;
  uVar4 = uVar13 + (uVar2 << 1 | uVar2 >> 0x1f) + 0xca62c1d6 + (uVar1 ^ uVar8 ^ uVar10) +
          (uVar5 * 0x20 | uVar5 >> 0x1b);
  uVar7 = uVar10 * 0x40000000 | uVar10 >> 2;
  uVar17 = uVar3 ^ uVar9 ^ uVar6 ^ uVar17;
  uVar1 = uVar1 + (uVar21 << 1 | uVar21 >> 0x1f) + 0xca62c1d6 + (uVar8 ^ uVar7 ^ uVar5) +
          (uVar4 * 0x20 | uVar4 >> 0x1b);
  uVar2 = uVar5 * 0x40000000 | uVar5 >> 2;
  uVar12 = ctx->state[1];
  ctx->state[0] =
       uVar8 + (uVar17 << 1 | uVar17 >> 0x1f) + uVar15 + 0xca62c1d6 + (uVar7 ^ uVar2 ^ uVar4) +
       (uVar1 * 0x20 | uVar1 >> 0x1b);
  ctx->state[1] = uVar1 + uVar12;
  ctx->state[2] = uVar16 + (uVar4 >> 2 | uVar4 * 0x40000000);
  ctx->state[3] = uVar2 + ctx->state[3];
  ctx->state[4] = uVar7 + ctx->state[4];
  return;
}



void mbedtls_sha1_update(mbedtls_sha1_context *ctx,uchar *input,size_t ilen)

{
  size_t __n;
  uint uVar1;
  uint uVar2;
  uint __n_00;
  
  uVar2 = ctx->total[0] & 0x3f;
  uVar1 = ctx->total[0] + ilen;
  ctx->total[0] = uVar1;
  if (uVar1 < ilen) {
    ctx->total[1] = ctx->total[1] + 1;
  }
  uVar1 = ilen;
  if ((uVar2 != 0) && (__n_00 = 0x40 - uVar2, __n_00 <= ilen)) {
    memcpy(ctx->buffer + uVar2,input,__n_00);
    ilen = (ilen - 0x40) + uVar2;
    mbedtls_sha1_process(ctx,ctx->buffer);
    input = input + __n_00;
    uVar2 = 0;
    uVar1 = ilen;
  }
  while (0x3f < ilen) {
    mbedtls_sha1_process(ctx,input + (uVar1 - ilen));
    ilen = ilen - 0x40;
  }
  __n = (uVar1 >> 6) * -0x40 + uVar1;
  if (__n == 0) {
    return;
  }
  memcpy(ctx->buffer + uVar2,input + (uVar1 & 0xffffffc0),__n);
  return;
}



void mbedtls_sha1_update(mbedtls_sha1_context *ctx,uchar *input,size_t ilen)

{
  if (ilen != 0) {
    mbedtls_sha1_update(ctx,input,ilen);
    return;
  }
  return;
}



// WARNING: Could not reconcile some variable overlaps

void mbedtls_sha1_finish(mbedtls_sha1_context *ctx,uchar *output)

{
  uint uVar1;
  uint uVar2;
  int iVar3;
  uchar uStack24;
  undefined uStack23;
  ushort uStack22;
  uchar msglen [8];
  
  uVar1 = ctx->total[0];
  uVar2 = ctx->total[1] << 3;
  uStack24 = (uchar)(uVar2 >> 0x18);
  uStack23 = (undefined)(uVar2 >> 0x10);
  uStack22 = (ushort)(uVar2 >> 8) & 0xff | (ushort)((uVar2 | uVar1 >> 0x1d) << 8);
  msglen[0] = (uchar)((uVar1 << 3) >> 0x18);
  msglen[1] = (uchar)((uVar1 << 3) >> 0x10);
  msglen._2_2_ = (ushort)((uVar1 << 0x13) >> 0x18) | (ushort)(uVar1 << 0xb);
  if ((uVar1 & 0x3f) < 0x38) {
    iVar3 = 0x38;
  }
  else {
    iVar3 = 0x78;
  }
  mbedtls_sha1_update(ctx,sha1_padding,iVar3 - (uVar1 & 0x3f));
  mbedtls_sha1_update(ctx,&uStack24,8);
  *output = *(uchar *)((int)ctx->state + 3);
  output[1] = (uchar)*(undefined2 *)((int)ctx->state + 2);
  output[2] = (uchar)(ctx->state[0] >> 8);
  output[3] = (uchar)ctx->state[0];
  output[4] = *(uchar *)((int)ctx->state + 7);
  output[5] = (uchar)*(undefined2 *)((int)ctx->state + 6);
  output[6] = (uchar)(ctx->state[1] >> 8);
  output[7] = (uchar)ctx->state[1];
  output[8] = *(uchar *)((int)ctx->state + 0xb);
  output[9] = (uchar)*(undefined2 *)((int)ctx->state + 10);
  output[10] = (uchar)(ctx->state[2] >> 8);
  output[0xb] = (uchar)ctx->state[2];
  output[0xc] = *(uchar *)((int)ctx->state + 0xf);
  output[0xd] = (uchar)*(undefined2 *)((int)ctx->state + 0xe);
  output[0xe] = (uchar)(ctx->state[3] >> 8);
  output[0xf] = (uchar)ctx->state[3];
  output[0x10] = *(uchar *)((int)ctx->state + 0x13);
  output[0x11] = (uchar)*(undefined2 *)((int)ctx->state + 0x12);
  output[0x12] = (uchar)(ctx->state[4] >> 8);
  output[0x13] = (uchar)ctx->state[4];
  return;
}



void mbedtls_sha1(uchar *input,size_t ilen,uchar *output)

{
  undefined auStack108 [4];
  mbedtls_sha1_context ctx;
  
  mbedtls_sha1_init((mbedtls_sha1_context *)auStack108);
  mbedtls_sha1_starts((mbedtls_sha1_context *)auStack108);
  mbedtls_sha1_update((mbedtls_sha1_context *)auStack108,input,ilen);
  mbedtls_sha1_finish((mbedtls_sha1_context *)auStack108,output);
  mbedtls_sha1_free((mbedtls_sha1_context *)auStack108);
  return;
}



mbedtls_ssl_ciphersuite_t * mbedtls_ssl_ciphersuite_from_id(int ciphersuite)

{
  mbedtls_ssl_ciphersuite_t *pmVar1;
  
  pmVar1 = ciphersuite_definitions;
  while( true ) {
    if (pmVar1->id == 0) {
      return (mbedtls_ssl_ciphersuite_t *)0x0;
    }
    if (pmVar1->id == ciphersuite) break;
    pmVar1 = pmVar1 + 1;
  }
  return pmVar1;
}



int * mbedtls_ssl_list_ciphersuites(void)

{
  int *piVar1;
  int *piVar2;
  mbedtls_ssl_ciphersuite_t *pmVar3;
  int ciphersuite;
  
  if (supported_init == 0) {
    piVar1 = supported_ciphersuites;
    piVar2 = ciphersuite_preference;
    while ((ciphersuite = *piVar2, ciphersuite != 0 && (piVar1 < supported_ciphersuites + 5))) {
      pmVar3 = mbedtls_ssl_ciphersuite_from_id(ciphersuite);
      if (pmVar3 != (mbedtls_ssl_ciphersuite_t *)0x0) {
        *piVar1 = ciphersuite;
        piVar1 = piVar1 + 1;
      }
      piVar2 = piVar2 + 1;
    }
    *piVar1 = 0;
    supported_init = 1;
  }
  return supported_ciphersuites;
}



char * mbedtls_ssl_get_ciphersuite_name(int ciphersuite_id)

{
  mbedtls_ssl_ciphersuite_t *pmVar1;
  char *pcVar2;
  
  pmVar1 = mbedtls_ssl_ciphersuite_from_id(ciphersuite_id);
  if (pmVar1 == (mbedtls_ssl_ciphersuite_t *)0x0) {
    pcVar2 = "unknown";
  }
  else {
    pcVar2 = pmVar1->name;
  }
  return pcVar2;
}



mbedtls_pk_type_t mbedtls_ssl_get_ciphersuite_sig_pk_alg(mbedtls_ssl_ciphersuite_t *info)

{
  mbedtls_pk_type_t mVar1;
  uint uVar2;
  
  if (info->key_exchange < MBEDTLS_KEY_EXCHANGE_ECJPAKE) {
    uVar2 = 1 << ((uint)info->key_exchange & 0x1f);
    mVar1 = MBEDTLS_PK_RSA;
    if (((uVar2 & 0x8e) == 0) && (mVar1 = MBEDTLS_PK_ECKEY, (uVar2 & 0x600) == 0)) {
      return (mbedtls_pk_type_t)(((uVar2 & 0x10) != 0) << 2);
    }
  }
  else {
    mVar1 = MBEDTLS_PK_NONE;
  }
  return mVar1;
}



mbedtls_pk_context * mbedtls_ssl_own_key(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_key_cert *pmVar1;
  
  if (((ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) &&
      (pmVar1 = ssl->handshake->key_cert, pmVar1 != (mbedtls_ssl_key_cert *)0x0)) ||
     (pmVar1 = ssl->conf->key_cert, pmVar1 != (mbedtls_ssl_key_cert *)0x0)) {
    pmVar1 = (mbedtls_ssl_key_cert *)pmVar1->key;
  }
  return (mbedtls_pk_context *)pmVar1;
}



size_t mbedtls_ssl_hs_hdr_len(void)

{
  int in_a0;
  
  if ((*(ushort *)(in_a0 + 0x74) & 2) != 0) {
    return 0xc;
  }
  return 4;
}



// WARNING: Type propagation algorithm not settling

int mbedtls_ssl_handshake_client_step(mbedtls_ssl_context *ssl)

{
  uchar uVar1;
  mbedtls_key_exchange_type_t mVar2;
  byte bVar3;
  byte bVar4;
  byte bVar5;
  byte bVar6;
  bool bVar7;
  uchar *puVar8;
  uchar *puVar9;
  uchar uVar10;
  uint ret;
  mbedtls_ssl_session *pmVar11;
  size_t __n;
  mbedtls_x509_crt *pmVar12;
  mbedtls_pk_context *pk;
  size_t len;
  mbedtls_md_type_t md_alg;
  int line;
  int line_00;
  char *format;
  uint __n_00;
  size_t sVar13;
  uchar *buf;
  int *piVar14;
  undefined *puVar15;
  mbedtls_ssl_config *pmVar16;
  mbedtls_ssl_key_cert *pmVar17;
  uchar *buf_00;
  ushort *puVar18;
  byte *buf_01;
  mbedtls_ssl_handshake_params *pmVar19;
  uint size;
  mbedtls_ssl_ciphersuite_t *ciphersuite_info;
  uchar *puVar20;
  uint uVar21;
  byte *pbVar22;
  uchar *puVar23;
  mbedtls_ssl_transform *pmVar24;
  char **ppcVar25;
  uchar *ver;
  byte *buf_02;
  uchar *puVar26;
  size_t local_74;
  int major_ver;
  int minor_ver;
  
  if (ssl->state == 0x10) {
    return -0x7100;
  }
  if (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0) {
    return -0x7100;
  }
  mbedtls_debug_print_msg(ssl,2,"file1",0xccf,"client state: %d");
  ret = mbedtls_ssl_flush_output(ssl);
  if (ret != 0) {
    return ret;
  }
  if ((((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) &&
      (ssl->handshake->retransmit_state == '\x01')) &&
     (line_00 = mbedtls_ssl_resend(ssl), line_00 != 0)) {
    return line_00;
  }
  if ((ssl->state == 0xc) && (ssl->handshake->new_session_ticket != 0)) {
    ssl->state = 0x11;
  }
  __n_00 = ssl->state;
  switch(__n_00) {
  case 0:
    ssl->state = 1;
    break;
  case 1:
    mbedtls_debug_print_msg(ssl,2,"file1",0x2cd,"=> write client hello");
    pmVar16 = ssl->conf;
    if (pmVar16->f_rng == (mbedtls_ssl_recv_t *)0x0) {
      mbedtls_debug_print_msg(ssl,1,"file1",0x2d1,"no RNG provided");
      return -0x7400;
    }
    ssl->major_ver = (uint)pmVar16->min_major_ver;
    ssl->minor_ver = (uint)pmVar16->min_minor_ver;
    if (pmVar16->max_major_ver == 0) {
      mbedtls_debug_print_msg
                (ssl,1,"file1",0x2e0,
                                  
