pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
                 "configured max major version is invalid, consider using mbedtls_ssl_config_defaults()"
                );
      return -0x7100;
    }
    ver = ssl->out_msg;
    mbedtls_ssl_write_version
              ((uint)pmVar16->max_major_ver,(uint)pmVar16->max_minor_ver,
               *(uint *)&pmVar16->field_0x74 >> 1 & 1,ver + 4);
    mbedtls_debug_print_msg
              (ssl,3,"file1",0x2f3,"client hello, max version: [%d:%d]",(uint)ver[4],(uint)ver[5]);
    pmVar16 = ssl->conf;
    pmVar19 = ssl->handshake;
    if ((((*(ushort *)&pmVar16->field_0x74 & 2) == 0) || (pmVar19->verify_cookie == (uchar *)0x0))
       && ((ret = (*pmVar16->f_rng)(pmVar16->p_rng,pmVar19->randbytes,4), ret != 0 ||
           (ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,pmVar19->randbytes + 4,0x1c), ret != 0)))) {
      format = "ssl_generate_random";
      line_00 = 0x2f7;
    }
    else {
      memcpy(ver + 6,ssl->handshake->randbytes,0x20);
      mbedtls_debug_print_buf(ssl,3,"file1",0x2fc,"client hello, random bytes",ver + 6,0x20);
      pmVar11 = ssl->session_negotiate;
      len = pmVar11->id_len;
      if ((0x10 < len - 0x10) || (ssl->handshake->resume == 0)) {
        len = 0;
      }
      if ((pmVar11->ticket != (uchar *)0x0) && (pmVar11->ticket_len != 0)) {
        line_00 = (*ssl->conf->f_rng)(ssl->conf->p_rng,pmVar11->id,0x20);
        if (line_00 != 0) {
          return line_00;
        }
        len = 0x20;
        ssl->session_negotiate->id_len = 0x20;
      }
      ver[0x26] = (uchar)len;
      sVar13 = 0;
      while (len != sVar13) {
        ver[sVar13 + 0x27] = ssl->session_negotiate->id[sVar13];
        sVar13 = sVar13 + 1;
      }
      puVar20 = ver + 0x27 + len;
      mbedtls_debug_print_msg(ssl,3,"file1",0x331,"client hello, session id len.: %d",len);
      mbedtls_debug_print_buf(ssl,3,"file1",0x332,"client hello, session id",ver + 0x27,len);
      buf_00 = puVar20;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        buf_00 = puVar20 + 1;
        buf = ssl->handshake->verify_cookie;
        if (buf == (uchar *)0x0) {
          mbedtls_debug_print_msg(ssl,3,"file1",0x33c,"no verify cookie to send");
          *puVar20 = '\0';
        }
        else {
          mbedtls_debug_print_buf
                    (ssl,3,"file1",0x343,"client hello, cookie",buf,
                     (uint)ssl->handshake->verify_cookie_len);
          *puVar20 = ssl->handshake->verify_cookie_len;
          memcpy(buf_00,ssl->handshake->verify_cookie,(uint)ssl->handshake->verify_cookie_len);
          buf_00 = buf_00 + ssl->handshake->verify_cookie_len;
        }
      }
      piVar14 = ssl->conf->ciphersuite_list[ssl->minor_ver];
      line_00 = 0;
      puVar20 = buf_00 + 2;
      while (*piVar14 != 0) {
        ciphersuite_info = mbedtls_ssl_ciphersuite_from_id(*piVar14);
        buf = puVar20;
        if ((((ciphersuite_info != (mbedtls_ssl_ciphersuite_t *)0x0) &&
             (pmVar16 = ssl->conf,
             ciphersuite_info->min_minor_ver <= (int)(uint)pmVar16->max_minor_ver)) &&
            ((int)(uint)pmVar16->min_minor_ver <= ciphersuite_info->max_minor_ver)) &&
           (((*(ushort *)&pmVar16->field_0x74 & 2) == 0 || ((ciphersuite_info->flags & 4) == 0)))) {
          mbedtls_debug_print_msg
                    (ssl,3,"file1",0x375,"client hello, add ciphersuite: %04x",*piVar14);
          line_00 = line_00 + 1;
          buf = puVar20 + 2;
          *puVar20 = (uchar)((uint)*piVar14 >> 8);
          puVar20[1] = (uchar)*piVar14;
        }
        piVar14 = piVar14 + 1;
        puVar20 = buf;
      }
      puVar20[1] = -1;
      *puVar20 = '\0';
      *buf_00 = (uchar)(line_00 + 1U >> 7);
      buf_00[1] = (char)(line_00 + 1U) * '\x02';
      mbedtls_debug_print_msg(ssl,3,"file1",0x396,"client hello, got %d ciphersuites");
      mbedtls_debug_print_msg(ssl,3,"file1",0x3b5,"client hello, compress len.: %d",1);
      mbedtls_debug_print_msg(ssl,3,"file1",0x3b7,"client hello, compress alg.: %d",0);
      puVar20[2] = '\x01';
      puVar20[3] = '\0';
      buf_00 = puVar20 + 4;
      buf = puVar20 + 6;
      puVar23 = (uchar *)0x0;
      if (ssl->hostname != (char *)0x0) {
        puVar8 = ssl->out_msg;
        mbedtls_debug_print_msg(ssl,3,"file1",0x48,"client hello, adding server name extension: %s")
        ;
        __n = strlen(ssl->hostname);
        if ((puVar8 + 0x4000 < buf) ||
           (puVar23 = (uchar *)(__n + 9), puVar8 + 0x4000 + -(int)buf < puVar23)) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x4e,"buffer too small");
          puVar23 = (uchar *)0x0;
        }
        else {
          puVar20[8] = (uchar)(__n + 5 >> 8);
          uVar10 = (uchar)__n;
          puVar20[9] = uVar10 + '\x05';
          puVar20[10] = (uchar)(__n + 3 >> 8);
          puVar20[0xb] = uVar10 + '\x03';
          puVar20[6] = '\0';
          puVar20[7] = '\0';
          puVar20[0xc] = '\0';
          puVar20[0xd] = (uchar)(__n >> 8);
          puVar20[0xe] = uVar10;
          memcpy(puVar20 + 0xf,ssl->hostname,__n);
        }
      }
      line_00 = 0;
      if (ssl->conf->max_minor_ver == '\x03') {
        puVar8 = ssl->out_msg;
        mbedtls_debug_print_msg
                  (ssl,3,"file1",0xb2,"client hello, adding signature_algorithms extension");
        piVar14 = ssl->conf->sig_hashes;
        line_00 = 0;
        while (*(int *)(line_00 * 2 + (int)piVar14) != 0) {
          line_00 = line_00 + 2;
        }
        puVar9 = puVar23 + 2 + (int)buf_00;
        if ((puVar8 + 0x4000 < puVar9) || (puVar8 + 0x4000 + -(int)puVar9 < (uchar *)(line_00 + 6)))
        {
          mbedtls_debug_print_msg(ssl,1,"file1",0xc0,"buffer too small");
          line_00 = 0;
        }
        else {
          puVar8 = puVar9 + 6;
          line_00 = 0;
          while( true ) {
            line = *(int *)(line_00 * 2 + (int)piVar14);
            if (line == 0) break;
            uVar10 = mbedtls_ssl_hash_from_md_alg(line);
            *puVar8 = uVar10;
            puVar8[1] = '\x01';
            puVar8 = puVar8 + 2;
            line_00 = line_00 + 2;
          }
          puVar9[1] = '\r';
          puVar9[3] = (uchar)line_00 + '\x02';
          *puVar9 = '\0';
          puVar9[2] = (uchar)((uint)(line_00 + 2) >> 8);
          puVar9[4] = (uchar)((uint)line_00 >> 8);
          puVar9[5] = (uchar)line_00;
          line_00 = line_00 + 6;
        }
      }
      puVar23 = puVar23 + line_00;
      line_00 = 0;
      if ((*(ushort *)&ssl->conf->field_0x74 & 0x1c0) != 0) {
        puVar9 = ssl->out_msg;
        puVar8 = buf_00 + (int)(puVar23 + 2);
        mbedtls_debug_print_msg
                  (ssl,3,"file1",0x1b8,"client hello, adding max_fragment_length extension");
        if ((puVar9 + 0x4000 < puVar8) || (puVar9 + 0x4000 + -(int)puVar8 < &DAT_00000005)) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x1bc,"buffer too small");
          line_00 = 0;
        }
        else {
          *puVar8 = '\0';
          puVar8[1] = '\x01';
          puVar8[2] = '\0';
          puVar8[3] = '\x01';
          puVar8[4] = (byte)(*(uint *)&ssl->conf->field_0x74 >> 6) & 7;
          line_00 = 5;
        }
      }
      puVar23 = puVar23 + line_00;
      buf_02 = (byte *)0x0;
      if (ssl->conf->alpn_list != (char **)0x0) {
        puVar8 = ssl->out_msg;
        mbedtls_debug_print_msg(ssl,3,"file1",0x26c,"client hello, adding alpn extension");
        ppcVar25 = ssl->conf->alpn_list;
        while (*ppcVar25 != (char *)0x0) {
          __n = strlen(*ppcVar25);
          buf_02 = buf_02 + (__n & 0xff) + 1;
          ppcVar25 = ppcVar25 + 1;
        }
        puVar9 = buf_00 + (int)(puVar23 + 2);
        if ((puVar8 + 0x4000 < puVar9) || (puVar8 + 0x4000 + -(int)puVar9 < buf_02 + 6)) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x273,"buffer too small");
          buf_02 = (byte *)0x0;
        }
        else {
          *puVar9 = '\0';
          puVar9[1] = '\x10';
          buf_02 = puVar9 + 6;
          ppcVar25 = ssl->conf->alpn_list;
          while (*ppcVar25 != (char *)0x0) {
            __n = strlen(*ppcVar25);
            *buf_02 = (byte)__n;
            memcpy(buf_02 + 1,*ppcVar25,__n & 0xff);
            ppcVar25 = ppcVar25 + 1;
            buf_02 = buf_02 + (uint)*buf_02 + 1;
          }
          buf_02 = buf_02 + -(int)puVar9;
          puVar9[4] = (uchar)((uint)(buf_02 + -6) >> 8);
          puVar9[5] = (char)buf_02 + -6;
          puVar9[2] = (uchar)((uint)(buf_02 + -4) >> 8);
          puVar9[3] = (char)buf_02 + -4;
        }
      }
      puVar8 = (uchar *)0x0;
      if ((*(ushort *)&ssl->conf->field_0x74 & 0x200) != 0) {
        puVar26 = ssl->out_msg;
        puVar9 = buf_00 + (int)(buf_02 + (int)puVar23 + 2);
        __n = ssl->session_negotiate->ticket_len;
        mbedtls_debug_print_msg(ssl,3,"file1",0x23f,"client hello, adding session ticket extension")
        ;
        if ((puVar26 + 0x4000 < puVar9) ||
           (puVar8 = (uchar *)(__n + 4), puVar26 + 0x4000 + -(int)puVar9 < puVar8)) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x243,"buffer too small");
          puVar8 = (uchar *)0x0;
        }
        else {
          puVar9[1] = '#';
          *puVar9 = '\0';
          puVar9[2] = (uchar)(__n >> 8);
          puVar9[3] = (uchar)__n;
          if ((ssl->session_negotiate->ticket == (uchar *)0x0) || (__n == 0)) {
            puVar8 = &DAT_00000004;
          }
          else {
            mbedtls_debug_print_msg(ssl,3,"file1",0x254,"sending session ticket of length %d",__n);
            memcpy(puVar9 + 4,ssl->session_negotiate->ticket,__n);
          }
        }
      }
      puVar8 = puVar8 + (int)(buf_02 + (int)puVar23);
      mbedtls_debug_print_msg(ssl,3,"file1",0x3ff,"client hello, total extension length: %d",puVar8)
      ;
      if (puVar8 != (uchar *)0x0) {
        puVar20[4] = (uchar)((uint)puVar8 >> 8);
        puVar20[5] = (uchar)puVar8;
        buf_00 = buf + (int)puVar8;
      }
      ssl->out_msgtype = 0x16;
      *(uchar **)&ssl->out_msglen = buf_00 + -(int)ver;
      *ssl->out_msg = '\x01';
      ssl->state = ssl->state + 1;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        mbedtls_ssl_send_flight_completed(ssl);
      }
      ret = mbedtls_ssl_write_record(ssl);
      if (ret == 0) {
        format = "<= write client hello";
        line_00 = 0x419;
        goto LAB_2306920e;
      }
      format = "mbedtls_ssl_write_record";
      line_00 = 0x415;
    }
    goto LAB_230690ee;
  case 2:
    mbedtls_debug_print_msg(ssl,2,"file1",0x582,"=> parse server hello");
    buf_02 = ssl->in_msg;
    ret = mbedtls_ssl_read_record(ssl);
    if (ret == 0) {
      if (ssl->in_msgtype == 0x16) {
        if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
          if (*buf_02 == 3) {
            mbedtls_debug_print_msg(ssl,2,"file1",0x5a9,"received hello verify request");
            mbedtls_debug_print_msg(ssl,2,"file1",0x5aa,"<= parse server hello");
            len = mbedtls_ssl_hs_hdr_len();
            ver = ssl->in_msg + len;
            mbedtls_debug_print_msg(ssl,2,"file1",0x52e,"=> parse hello verify request");
            mbedtls_debug_print_buf(ssl,3,"file1",0x536,"server version",ver,2);
            mbedtls_ssl_read_version
                      ((int *)&local_74,&major_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,ver);
            if (((((int)local_74 < 3) || (major_ver < 2)) ||
                ((int)(uint)ssl->conf->max_major_ver < (int)local_74)) ||
               ((int)(uint)ssl->conf->max_minor_ver < major_ver)) {
              mbedtls_debug_print_msg(ssl,1,"file1",0x543,"bad server version");
              goto LAB_2306935a;
            }
            buf_00 = ver + 3;
            bVar3 = ver[2];
            __n_00 = (uint)bVar3;
            mbedtls_debug_print_buf(ssl,3,"file1",0x54c,"cookie",buf_00,__n_00);
            if ((int)(ssl->in_msg + (ssl->in_msglen - (int)buf_00)) < (int)__n_00) {
              mbedtls_debug_print_msg
                        (ssl,1,"file1",0x551,"cookie length does not match incoming message size");
              mbedtls_ssl_send_alert_message(ssl,'\x02','2');
              return -0x7980;
            }
            vPortFree(ssl->handshake->verify_cookie);
            pmVar19 = ssl->handshake;
            ver = (uchar *)mycalloc(1,__n_00);
            pmVar19->verify_cookie = ver;
            ver = ssl->handshake->verify_cookie;
            if (ver == (uchar *)0x0) {
              mbedtls_debug_print_msg(ssl,1,"file1",0x55c,"alloc failed (%d bytes)",__n_00);
              return -0x7f00;
            }
            memcpy(ver,buf_00,__n_00);
            ssl->handshake->verify_cookie_len = bVar3;
            ssl->state = 1;
            mbedtls_ssl_reset_checksum(ssl);
            mbedtls_ssl_recv_flight_completed(ssl);
            format = "<= parse hello verify request";
            line_00 = 0x569;
            goto LAB_2306920e;
          }
          vPortFree(ssl->handshake->verify_cookie);
          ssl->handshake->verify_cookie = (uchar *)0x0;
          ssl->handshake->verify_cookie_len = '\0';
        }
        len = mbedtls_ssl_hs_hdr_len();
        if ((ssl->in_hslen < len + 0x26) || (bVar3 = *buf_02, bVar3 != 2)) {
          line_00 = 0x5ba;
        }
        else {
          buf_02 = buf_02 + len;
          mbedtls_debug_print_buf(ssl,3,"file1",0x5cb,"server hello, version",buf_02,2);
          mbedtls_ssl_read_version
                    (&ssl->major_ver,&ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,buf_02
                    );
          pmVar16 = ssl->conf;
          if (((ssl->major_ver < (int)(uint)pmVar16->min_major_ver) ||
              (ssl->minor_ver < (int)(uint)pmVar16->min_minor_ver)) ||
             (((int)(uint)pmVar16->max_major_ver < ssl->major_ver ||
              ((int)(uint)pmVar16->max_minor_ver < ssl->minor_ver)))) {
            mbedtls_debug_print_msg
                      (ssl,1,"file1",0x5d8,
                       "server version out of bounds -  min: [%d:%d], server: [%d:%d], max: [%d:%d]"
                      );
LAB_2306935a:
            mbedtls_ssl_send_alert_message(ssl,'\x02','F');
            return -0x6e80;
          }
          mbedtls_debug_print_msg
                    (ssl,3,"file1",0x5e5,"server hello, current time: %lu",
                     (uint)buf_02[4] << 8 |
                     (uint)buf_02[2] << 0x18 | (uint)buf_02[3] << 0x10 | (uint)buf_02[5]);
          memcpy(ssl->handshake->randbytes + 0x20,buf_02 + 2,0x20);
          bVar4 = buf_02[0x22];
          size = (uint)bVar4;
          mbedtls_debug_print_buf(ssl,3,"file1",0x5ec,"server hello, random bytes",buf_02 + 2,0x20);
          if (bVar4 < 0x21) {
            __n_00 = ssl->in_hslen;
            len = mbedtls_ssl_hs_hdr_len();
            line_00 = len + size;
            if (line_00 + 0x27U < __n_00) {
              uVar21 = (uint)CONCAT11((buf_02 + size)[0x26],(buf_02 + size)[0x27]);
              if ((uVar21 - 1 <= (uint)bVar3) || (__n_00 != line_00 + uVar21 + 0x28)) {
                line_00 = 0x5fc;
                goto LAB_2306948e;
              }
            }
            else {
              uVar21 = 0;
              if (__n_00 != line_00 + 0x26U) {
                line_00 = 0x606;
                goto LAB_2306948e;
              }
            }
            __n_00 = (uint)CONCAT11((buf_02 + size)[0x23],(buf_02 + size)[0x24]);
            if (buf_02[size + 0x25] != 0) {
              mbedtls_debug_print_msg(ssl,1,"file1",0x621,"server hello, bad compression: %d");
              return -0x7080;
            }
            pmVar24 = ssl->transform_negotiate;
            ciphersuite_info = mbedtls_ssl_ciphersuite_from_id(__n_00);
            pmVar24->ciphersuite_info = ciphersuite_info;
            ciphersuite_info = ssl->transform_negotiate->ciphersuite_info;
            if (ciphersuite_info == (mbedtls_ssl_ciphersuite_t *)0x0) {
              format = "ciphersuite info for %04x not found";
              line_00 = 0x62c;
LAB_2306966a:
              mbedtls_debug_print_msg(ssl,1,"file1",line_00,format,__n_00);
              return -0x7100;
            }
            mbedtls_ssl_optimize_checksum(ssl,ciphersuite_info);
            mbedtls_debug_print_msg(ssl,3,"file1",0x632,"server hello, session id len.: %d",size);
            buf_01 = buf_02 + 0x23;
            mbedtls_debug_print_buf(ssl,3,"file1",0x633,"server hello, session id",buf_01,size);
            if ((((ssl->handshake->resume == 0) || (bVar4 == 0)) ||
                (pmVar11 = ssl->session_negotiate, __n_00 != pmVar11->ciphersuite)) ||
               (((pmVar11->compression != 0 || (size != pmVar11->id_len)) ||
                (line_00 = memcmp(pmVar11->id,buf_01,size), line_00 != 0)))) {
              ssl->state = ssl->state + 1;
              ssl->handshake->resume = 0;
              ssl->session_negotiate->ciphersuite = __n_00;
              ssl->session_negotiate->compression = 0;
              ssl->session_negotiate->id_len = size;
              memcpy(ssl->session_negotiate->id,buf_01,size);
            }
            else {
              ssl->state = 0xc;
              line_00 = mbedtls_ssl_derive_keys(ssl);
              if (line_00 != 0) {
                mbedtls_debug_print_ret(ssl,1,"file1",0x651,"mbedtls_ssl_derive_keys",line_00);
                return line_00;
              }
            }
            if (ssl->handshake->resume == 0) {
              puVar15 = &UNK_2308c4d8;
            }
            else {
              puVar15 = (undefined *)0x230873f4;
            }
            mbedtls_debug_print_msg(ssl,3,"file1",0x657,"%s session has been resumed",puVar15);
            mbedtls_debug_print_msg
                      (ssl,3,"file1",0x659,"server hello, chosen ciphersuite: %04x",__n_00);
            mbedtls_debug_print_msg
                      (ssl,3,"file1",0x65a,"server hello, compress alg.: %d",
                       (uint)buf_02[size + 0x25]);
            ciphersuite_info = mbedtls_ssl_ciphersuite_from_id(ssl->session_negotiate->ciphersuite);
            if (ciphersuite_info == (mbedtls_ssl_ciphersuite_t *)0x0) {
              line_00 = 0x664;
            }
            else {
              mbedtls_debug_print_msg
                        (ssl,3,"file1",0x668,"server hello, chosen ciphersuite: %s",
                         ciphersuite_info->name);
              piVar14 = ssl->conf->ciphersuite_list[ssl->minor_ver];
              do {
                line_00 = *piVar14;
                if (line_00 == 0) {
                  line_00 = 0x66f;
                  goto LAB_2306948e;
                }
                piVar14 = piVar14 + 1;
              } while (line_00 != ssl->session_negotiate->ciphersuite);
              ssl->session_negotiate->compression = 0;
              puVar18 = (ushort *)(buf_02 + size + 0x28);
              mbedtls_debug_print_msg
                        (ssl,2,"file1",0x687,"server hello, total extension length: %d",uVar21);
              do {
                if (uVar21 == 0) {
                  if ((ssl->secure_renegotiation == 0) &&
                     ((*(ushort *)&ssl->conf->field_0x74 & 0x30) == 0x20)) {
                    line_00 = -0x430;
                    line = 0x720;
LAB_23069934:
                    mbedtls_debug_print_msg
                              (ssl,1,"file1",line,(char *)((int)&PTR_caseD_e_2308d000 + line_00));
                    line_00 = mbedtls_ssl_send_fatal_handshake_failure(ssl);
                    if (line_00 == 0) {
                      return -0x7980;
                    }
                    return line_00;
                  }
                  format = "<= parse server hello";
                  line_00 = 0x743;
                  goto LAB_2306920e;
                }
                __n_00 = (uint)(*puVar18 >> 8) | ((uint)*puVar18 & 0xff) << 8;
                size = ((uint)puVar18[1] & 0xff) << 8 | (uint)(puVar18[1] >> 8);
                if (uVar21 < size + 4) {
                  line_00 = 0x692;
                  goto LAB_2306948e;
                }
                if (__n_00 == 0x10) {
                  mbedtls_debug_print_msg(ssl,3,"file1",0x703,"found alpn extension");
                  ppcVar25 = ssl->conf->alpn_list;
                  if (ppcVar25 == (char **)0x0) {
                    return -0x7980;
                  }
                  if (size < 4) {
                    return -0x7980;
                  }
                  if (((uint)(puVar18[2] >> 8) | ((uint)puVar18[2] & 0xff) << 8) != size - 2) {
                    return -0x7980;
                  }
                  __n_00 = (uint)*(byte *)(puVar18 + 3);
                  if (__n_00 != size - 3) {
                    return -0x7980;
                  }
                  while( true ) {
                    if (*ppcVar25 == (char *)0x0) {
                      return -0x7980;
                    }
                    __n = strlen(*ppcVar25);
                    if ((__n_00 == __n) &&
                       (line_00 = memcmp((byte *)((int)puVar18 + 7),*ppcVar25,__n_00), line_00 == 0)
                       ) break;
                    ppcVar25 = ppcVar25 + 1;
                  }
                  ssl->alpn_chosen = *ppcVar25;
                }
                else {
                  if (__n_00 < 0x11) {
                    if (__n_00 == 1) {
                      mbedtls_debug_print_msg
                                (ssl,3,"file1",0x6a6,"found max_fragment_length extension");
                      if ((*(ushort *)&ssl->conf->field_0x74 & 0x1c0) == 0) {
                        return -0x7980;
                      }
                      if (size != 1) {
                        return -0x7980;
                      }
                      if ((uint)*(byte *)(puVar18 + 2) != (*(uint *)&ssl->conf->field_0x74 >> 6 & 7)
                         ) {
                        return -0x7980;
                      }
                    }
                    else {
LAB_230698de:
                      mbedtls_debug_print_msg
                                (ssl,3,"file1",0x70d,"unknown extension found: %d (ignoring)");
                    }
                  }
                  else {
                    if (__n_00 == 0x23) {
                      mbedtls_debug_print_msg(ssl,3,"file1",0x6da,"found session_ticket extension");
                      if ((*(ushort *)&ssl->conf->field_0x74 & 0x200) == 0) {
                        return -0x7980;
                      }
                      if (size != 0) {
                        return -0x7980;
                      }
                      ssl->handshake->new_session_ticket = 1;
                    }
                    else {
                      if (__n_00 != 0xff01) goto LAB_230698de;
                      mbedtls_debug_print_msg(ssl,3,"file1",0x699,"found renegotiation extension");
                      if ((size != 1) || (*(byte *)(puVar18 + 2) != 0)) {
                        line_00 = -0x4d8;
                        line = 0x43c;
                        goto LAB_23069934;
                      }
                      ssl->secure_renegotiation = 1;
                    }
                  }
                }
                line_00 = uVar21 - size;
                uVar21 = line_00 - 4;
                puVar18 = (ushort *)((int)puVar18 + size + 4);
              } while (2 < line_00 - 5U);
              line_00 = 0x715;
            }
          }
          else {
            line_00 = 0x5f0;
          }
        }
LAB_2306948e:
