pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
        mbedtls_debug_print_msg(ssl,1,"file1",line_00,"bad server hello message");
        return -0x7980;
      }
      format = "bad server hello message";
      line_00 = 0x5a0;
LAB_2306926a:
      line = 1;
LAB_23069270:
      mbedtls_debug_print_msg(ssl,line,"file1",line_00,format);
      return -0x7700;
    }
    format = "mbedtls_ssl_read_record";
    line_00 = 0x588;
    goto LAB_230690ee;
  case 3:
    __n_00 = mbedtls_ssl_parse_certificate(ssl);
    break;
  case 4:
    ciphersuite_info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0x896,"=> parse server key exchange");
    if (ciphersuite_info->key_exchange == MBEDTLS_KEY_EXCHANGE_RSA) {
      format = "<= skip parse server key exchange";
      line_00 = 0x89b;
LAB_23069ac2:
      mbedtls_debug_print_msg(ssl,2,"file1",line_00,format);
      line_00 = ssl->state + 1;
      __n_00 = ret;
      goto LAB_23069ad4;
    }
    ret = mbedtls_ssl_read_record(ssl);
    if (ret == 0) {
      if (ssl->in_msgtype == 0x16) {
        ver = ssl->in_msg;
        if (*ver == '\f') {
          len = mbedtls_ssl_hs_hdr_len();
          mbedtls_debug_print_buf
                    (ssl,3,"file1",0x8d6,"server key exchange",ver + len,ssl->in_hslen - len);
          line_00 = 0x91b;
          goto LAB_23069b94;
        }
        if ((ciphersuite_info->key_exchange & 0xfd) == 5) {
          ssl->record_read = 1;
          ssl->state = ssl->state + 1;
          format = "<= parse server key exchange";
          line_00 = 0x9d4;
          goto LAB_2306920e;
        }
        format = "bad server key exchange message";
        line_00 = 0x8d0;
      }
      else {
        format = "bad server key exchange message";
        line_00 = 0x8bf;
      }
      goto LAB_2306926a;
    }
    format = "mbedtls_ssl_read_record";
    line_00 = 0x8b9;
    goto LAB_230690ee;
  case 5:
    ciphersuite_info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0x9fc,"=> parse certificate request");
    mVar2 = ciphersuite_info->key_exchange;
    if (((byte)(mVar2 + ~MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA) < 4) ||
       (mVar2 == MBEDTLS_KEY_EXCHANGE_ECJPAKE)) {
      format = "<= skip parse certificate request";
      line_00 = 0xa04;
      goto LAB_23069ac2;
    }
    if (ssl->record_read == 0) {
      line_00 = mbedtls_ssl_read_record(ssl);
      if (line_00 != 0) {
        line = 0xa0d;
        goto LAB_23069c12;
      }
      if (ssl->in_msgtype != 0x16) {
        format = "bad certificate request message";
        line_00 = 0xa13;
        goto LAB_2306926a;
      }
      ssl->record_read = 1;
    }
    ssl->client_auth = 0;
    ssl->state = ssl->state + 1;
    if (*ssl->in_msg == '\r') {
      ssl->client_auth = 1;
      puVar15 = (undefined *)0x230873f4;
    }
    else {
      puVar15 = &UNK_2308c4d8;
    }
    mbedtls_debug_print_msg(ssl,3,"file1",0xa21,"got %s certificate request",puVar15);
    if (ssl->client_auth != 0) {
      ver = ssl->in_msg;
      ssl->record_read = 0;
      len = mbedtls_ssl_hs_hdr_len();
      buf_01 = (byte *)(uint)ver[len];
      buf_02 = buf_01 + len;
      if ((byte *)ssl->in_hslen < buf_02 + 2) {
        line_00 = 0xa48;
LAB_23069cc2:
        mbedtls_debug_print_msg(ssl,1,"file1",line_00,"bad certificate request message");
        return -0x7a80;
      }
      if (ssl->minor_ver == 3) {
        uVar10 = ver[(int)(buf_02 + 1)];
        uVar1 = ver[(int)(buf_02 + 2)];
        pbVar22 = ver + (int)(buf_02 + 3);
        while (pbVar22 + -(int)(ver + (int)(buf_02 + 3)) < (byte *)(uint)CONCAT11(uVar10,uVar1)) {
          mbedtls_debug_print_msg
                    (ssl,3,"file1",0xa58,"Supported Signature Algorithm found: %d,%d",(uint)*pbVar22
                     ,(uint)pbVar22[1]);
          pbVar22 = pbVar22 + 2;
        }
        buf_01 = (byte *)(uint)CONCAT11(uVar10,uVar1) + (int)(buf_01 + 2);
        len = mbedtls_ssl_hs_hdr_len();
        if ((byte *)ssl->in_hslen < buf_01 + len + 2) {
          line_00 = 0xa60;
          goto LAB_23069cc2;
        }
      }
      len = mbedtls_ssl_hs_hdr_len();
      buf_01 = buf_01 + len;
      if ((byte *)ssl->in_hslen !=
          buf_01 + (uint)CONCAT11((ver + (int)buf_01)[1],(ver + (int)buf_01)[2]) + 3) {
        line_00 = 0xa6d;
        goto LAB_23069cc2;
      }
    }
    format = "<= parse certificate request";
    line_00 = 0xa72;
    goto LAB_2306920e;
  case 6:
    mbedtls_debug_print_msg(ssl,2,"file1",0xa81,"=> parse server hello done");
    if (ssl->record_read == 0) {
      line_00 = mbedtls_ssl_read_record(ssl);
      if (line_00 != 0) {
        line = 0xa87;
LAB_23069c12:
        mbedtls_debug_print_ret(ssl,1,"file1",line,"mbedtls_ssl_read_record",line_00);
        return line_00;
      }
      if (ssl->in_msgtype != 0x16) {
        format = "bad server hello done message";
        line_00 = 0xa8d;
        goto LAB_2306926a;
      }
    }
    pmVar16 = ssl->conf;
    ssl->record_read = 0;
    len = mbedtls_ssl_hs_hdr_len();
    if ((ssl->in_hslen != len) || (*ssl->in_msg != '\x0e')) {
      mbedtls_debug_print_msg(ssl,1,"file1",0xa96,"bad server hello done message");
      return -0x7b80;
    }
    ssl->state = ssl->state + 1;
    if ((*(ushort *)&pmVar16->field_0x74 & 2) != 0) {
      mbedtls_ssl_recv_flight_completed(ssl);
    }
    format = "<= parse server hello done";
    line_00 = 0xaa1;
LAB_2306920e:
    mbedtls_debug_print_msg(ssl,2,"file1",line_00,format);
    __n_00 = ret;
    break;
  case 7:
    __n_00 = mbedtls_ssl_write_certificate(ssl);
    break;
  case 8:
    ciphersuite_info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0xaac,"=> write client key exchange");
    if (ciphersuite_info->key_exchange != MBEDTLS_KEY_EXCHANGE_RSA) {
      line_00 = 0xb91;
LAB_23069b94:
      mbedtls_debug_print_msg(ssl,1,"file1",line_00,"should never happen");
      return -0x6c00;
    }
    pmVar16 = ssl->conf;
    pmVar19 = ssl->handshake;
    line_00 = ssl->minor_ver;
    ver = pmVar19->premaster;
    mbedtls_ssl_write_version
              ((uint)pmVar16->max_major_ver,(uint)pmVar16->max_minor_ver,
               *(uint *)&pmVar16->field_0x74 >> 1 & 1,ver);
    bVar7 = line_00 != 0;
    ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,pmVar19->premaster + 2,0x2e);
    line_00 = (uint)bVar7 * 2 + 4;
    if (ret == 0) {
      ssl->handshake->pmslen = 0x30;
      pmVar12 = ssl->session_negotiate->peer_cert;
      if (pmVar12 == (mbedtls_x509_crt *)0x0) {
        format = "certificate required";
        line_00 = 0x801;
        line = 2;
        goto LAB_23069270;
      }
      line = mbedtls_pk_can_do(&pmVar12->pk,MBEDTLS_PK_RSA);
      if (line == 0) {
        mbedtls_debug_print_msg(ssl,1,"file1",0x80b,"certificate key type mismatch");
        return -0x6d00;
      }
      ret = mbedtls_pk_encrypt(&ssl->session_negotiate->peer_cert->pk,ver,ssl->handshake->pmslen,
                               ssl->out_msg + line_00,(size_t *)&major_ver,0x4000 - line_00,
                               (anon_subr_int_void_ptr_uchar_ptr_size_t *)ssl->conf->f_rng,
                               ssl->conf->p_rng);
      if (ret == 0) {
        if (bVar7) {
          ssl->out_msg[4] = (uchar)((uint)major_ver >> 8);
          ssl->out_msg[5] = (uchar)major_ver;
          major_ver = major_ver + 2;
        }
        ssl->out_msglen = major_ver + 4;
        ssl->out_msgtype = 0x16;
        *ssl->out_msg = '\x10';
        ssl->state = ssl->state + 1;
        ret = mbedtls_ssl_write_record(ssl);
        if (ret == 0) {
          format = "<= write client key exchange";
          line_00 = 0xba1;
          goto LAB_2306920e;
        }
        format = "mbedtls_ssl_write_record";
        line_00 = 0xb9d;
      }
      else {
        format = "mbedtls_rsa_pkcs1_encrypt";
        line_00 = 0x815;
      }
    }
    else {
      format = "f_rng";
      line_00 = 0x7f9;
    }
    goto LAB_230690ee;
  case 9:
    ciphersuite_info = ssl->transform_negotiate->ciphersuite_info;
    local_74 = 0;
    mbedtls_debug_print_msg(ssl,2,"file1",0xbd2,"=> write certificate verify");
    ret = mbedtls_ssl_derive_keys(ssl);
    if (ret == 0) {
      mVar2 = ciphersuite_info->key_exchange;
      if (((byte)(mVar2 + ~MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA) < 4) ||
         (mVar2 == MBEDTLS_KEY_EXCHANGE_ECJPAKE)) {
        format = "<= skip write certificate verify";
        line_00 = 0xbe0;
      }
      else {
        if ((ssl->client_auth != 0) &&
           ((((pmVar19 = ssl->handshake, pmVar19 != (mbedtls_ssl_handshake_params *)0x0 &&
              (pmVar17 = pmVar19->key_cert, pmVar17 != (mbedtls_ssl_key_cert *)0x0)) ||
             (pmVar17 = ssl->conf->key_cert, pmVar17 != (mbedtls_ssl_key_cert *)0x0)) &&
            (pmVar17->cert != (mbedtls_x509_crt *)0x0)))) {
          pk = mbedtls_ssl_own_key(ssl);
          if (pk == (mbedtls_pk_context *)0x0) {
            mbedtls_debug_print_msg(ssl,1,"file1",0xbee,"got no private key for certificate");
            return -0x7600;
          }
          (*pmVar19->calc_verify)(ssl,(uchar *)&major_ver);
          if (ssl->minor_ver != 3) {
            line_00 = 0xc3d;
            goto LAB_23069b94;
          }
          md_alg = ssl->transform_negotiate->ciphersuite_info->mac;
          if (md_alg == MBEDTLS_MD_SHA384) {
            ssl->out_msg[4] = '\x05';
          }
          else {
            ssl->out_msg[4] = '\x04';
            md_alg = MBEDTLS_MD_SHA256;
          }
          pk = mbedtls_ssl_own_key(ssl);
          ver = ssl->out_msg;
          uVar10 = mbedtls_ssl_sig_from_pk(pk);
          ver[5] = uVar10;
          pk = mbedtls_ssl_own_key(ssl);
          ret = mbedtls_pk_sign(pk,md_alg,(uchar *)&major_ver,0,ssl->out_msg + 8,&local_74,
                                (anon_subr_int_void_ptr_uchar_ptr_size_t *)ssl->conf->f_rng,
                                ssl->conf->p_rng);
          if (ret == 0) {
            ssl->out_msg[6] = (uchar)(local_74 >> 8);
            ssl->out_msg[7] = (uchar)local_74;
            ssl->out_msglen = local_74 + 8;
            ssl->out_msgtype = 0x16;
            *ssl->out_msg = '\x0f';
            ssl->state = ssl->state + 1;
            ret = mbedtls_ssl_write_record(ssl);
            if (ret == 0) {
              format = "<= write certificate verify";
              line_00 = 0xc58;
              goto LAB_2306920e;
            }
            format = "mbedtls_ssl_write_record";
            line_00 = 0xc54;
          }
          else {
            format = "mbedtls_pk_sign";
            line_00 = 0xc45;
          }
          goto LAB_230690ee;
        }
        format = "<= skip write certificate verify";
        line_00 = 0xbe7;
      }
      goto LAB_23069ac2;
    }
    format = "mbedtls_ssl_derive_keys";
    line_00 = 0xbd6;
    goto LAB_230690ee;
  case 10:
    __n_00 = mbedtls_ssl_write_change_cipher_spec(ssl);
    break;
  case 0xb:
    __n_00 = mbedtls_ssl_write_finished(ssl);
    break;
  case 0xc:
    __n_00 = mbedtls_ssl_parse_change_cipher_spec(ssl);
    break;
  case 0xd:
    __n_00 = mbedtls_ssl_parse_finished(ssl);
    break;
  case 0xe:
    mbedtls_debug_print_msg(ssl,2,"file1",0xd3e,"handshake: done");
    line_00 = 0xf;
    __n_00 = ret;
LAB_23069ad4:
    ssl->state = line_00;
    break;
  case 0xf:
    mbedtls_ssl_handshake_wrapup(ssl);
    __n_00 = ret;
    break;
  default:
    format = "invalid state %d";
    line_00 = 0xd47;
    goto LAB_2306966a;
  case 0x11:
    mbedtls_debug_print_msg(ssl,2,"file1",0xc6c,"=> parse new session ticket");
    ret = mbedtls_ssl_read_record(ssl);
    if (ret == 0) {
      if (ssl->in_msgtype == 0x16) {
        ver = ssl->in_msg;
        if (*ver == '\x04') {
          __n_00 = ssl->in_hslen;
          len = mbedtls_ssl_hs_hdr_len();
          if (len + 6 <= __n_00) {
            buf_02 = ver + len;
            bVar3 = *buf_02;
            size = ((uint)*(ushort *)(buf_02 + 4) & 0xff) << 8 |
                   (uint)(*(ushort *)(buf_02 + 4) >> 8);
            bVar4 = buf_02[1];
            bVar5 = buf_02[2];
            bVar6 = buf_02[3];
            if (__n_00 != len + 6 + size) {
              line_00 = 0xc94;
              goto LAB_2306a270;
            }
            mbedtls_debug_print_msg(ssl,3,"file1",0xc98,"ticket length: %d",size);
            ssl->handshake->new_session_ticket = 0;
            ssl->state = 0xc;
            if (size == 0) {
              return 0;
            }
            buf_00 = ssl->session_negotiate->ticket;
            ver = buf_00 + ssl->session_negotiate->ticket_len;
            while (buf_00 != ver) {
              *buf_00 = '\0';
              buf_00 = buf_00 + 1;
            }
            vPortFree(ssl->session_negotiate->ticket);
            ssl->session_negotiate->ticket = (uchar *)0x0;
            ssl->session_negotiate->ticket_len = 0;
            ver = (uchar *)mycalloc(1,size);
            if (ver == (uchar *)0x0) {
              mbedtls_debug_print_msg(ssl,1,"file1",0xcad,"ticket alloc failed");
              return -0x7f00;
            }
            memcpy(ver,buf_02 + 6,size);
            ssl->session_negotiate->ticket = ver;
            ssl->session_negotiate->ticket_len = size;
            ssl->session_negotiate->ticket_lifetime =
                 (uint)bVar3 << 0x18 | (uint)bVar4 << 0x10 | (uint)bVar6 | (uint)bVar5 << 8;
            mbedtls_debug_print_msg(ssl,3,"file1",0xcbc,"ticket in use, discarding session id");
            format = "<= parse new session ticket";
            ssl->session_negotiate->id_len = 0;
            line_00 = 0xcbf;
            goto LAB_2306920e;
          }
        }
        line_00 = 0xc87;
LAB_2306a270:
        mbedtls_debug_print_msg(ssl,1,"file1",line_00,"bad new session ticket message");
        return -0x6e00;
      }
      format = "bad new session ticket message";
      line_00 = 0xc76;
      goto LAB_2306926a;
    }
    format = "mbedtls_ssl_read_record";
    line_00 = 0xc70;
LAB_230690ee:
    mbedtls_debug_print_ret(ssl,1,"file1",line_00,format,ret);
    __n_00 = ret;
  }
  return __n_00;
}



mbedtls_pk_context * mbedtls_ssl_own_key(mbedtls_ssl_context *ssl)

{
  mbedtls_ssl_key_cert *pmVar1;
  
  if (((ssl->handshake != (mbedtls_ssl_handshake_params *)0x0) &&
      (pmVar1 = ssl->handshake->key_cert, pmVar1 != (mbedtls_ssl_key_cert *)0x0)) ||
     (pmVar1 = ssl->conf->key_cert, pmVar1 != (mbedtls_ssl_key_cert *)0x0)) {
    pmVar1 = (mbedtls_ssl_key_cert *)pmVar1->key;
  }
  return (mbedtls_pk_context *)pmVar1;
}



