pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Could not reconcile some variable overlaps

int mbedtls_ssl_handshake_server_step(mbedtls_ssl_context *ssl)

{
  byte bVar1;
  mbedtls_key_exchange_type_t mVar2;
  ushort uVar3;
  char cVar4;
  mbedtls_x509_crt *pmVar5;
  ushort *buf;
  uchar *__n;
  uchar *puVar6;
  mbedtls_ssl_handshake_params *pmVar7;
  mbedtls_ssl_ciphersuite_t *info;
  uchar message;
  mbedtls_md_type_t md_alg;
  mbedtls_pk_type_t type;
  int ret;
  int iVar8;
  undefined3 extraout_var;
  undefined3 extraout_var_00;
  size_t __n_00;
  undefined3 extraout_var_01;
  mbedtls_pk_context *ctx;
  size_t sVar9;
  undefined3 extraout_var_02;
  undefined3 extraout_var_03;
  ushort *puVar10;
  uint uVar11;
  int line;
  mbedtls_ssl_config *pmVar12;
  char *format;
  anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_for_f_get_cache *paVar13;
  mbedtls_ssl_session *pmVar14;
  undefined *puVar15;
  uchar *buf_00;
  uchar *hash;
  uint sig_len;
  byte *pbVar16;
  byte *input;
  uint ilen;
  byte *buf_01;
  uint uVar17;
  byte *len;
  uint *puVar18;
  uchar *puVar19;
  size_t len_00;
  int *piVar20;
  int line_00;
  byte *pbVar21;
  uint uVar22;
  mbedtls_ssl_key_cert *pmVar23;
  uchar *puVar24;
  byte *pbVar25;
  byte *pbVar26;
  char **ppcVar27;
  mbedtls_ssl_key_cert *pmVar28;
  byte bStack236;
  byte bStack235;
  uchar ver [2];
  int major;
  int minor;
  undefined4 local_b4;
  mbedtls_ssl_session session;
  
  if ((ssl->state == 0x10) || (ssl->handshake == (mbedtls_ssl_handshake_params *)0x0)) {
    return -0x7100;
  }
  mbedtls_debug_print_msg(ssl,2,"file1",0xede,"server state: %d");
  ret = mbedtls_ssl_flush_output(ssl);
  if (ret != 0) {
    return ret;
  }
  if ((((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) &&
      (ssl->handshake->retransmit_state == '\x01')) &&
     (line_00 = mbedtls_ssl_resend(ssl), line_00 != 0)) {
    return line_00;
  }
  line_00 = ssl->state;
  switch(line_00) {
  case 0:
    ssl->state = 1;
    break;
  case 1:
    mbedtls_debug_print_msg(ssl,2,"file1",0x440,"=> parse client hello");
    line = mbedtls_ssl_fetch_input(ssl,5);
    if (line == 0) {
      input = ssl->in_hdr;
      len_00 = 5;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        len_00 = 0xd;
      }
      mbedtls_debug_print_buf(ssl,4,"file1",0x45f,"record header",input,len_00);
      mbedtls_debug_print_msg(ssl,3,"file1",0x46b,"client hello v3, message type: %d",(uint)*input);
      if (*input != 0x16) {
        ret = 0x46f;
        goto LAB_2306a59a;
      }
      mbedtls_debug_print_msg
                (ssl,3,"file1",0x474,"client hello v3, message len.: %d",
                 ((uint)*(ushort *)ssl->in_len & 0xff) << 8 | (uint)(*(ushort *)ssl->in_len >> 8));
      mbedtls_debug_print_msg
                (ssl,3,"file1",0x477,"client hello v3, protocol version: [%d:%d]",(uint)input[1],
                 (uint)input[2]);
      mbedtls_ssl_read_version((int *)ver,&major,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,input + 1)
      ;
      if ((int)_ver < 3) {
        ret = 0x481;
        goto LAB_2306a59a;
      }
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        hash = ssl->in_ctr;
        if ((*hash != '\0') || (hash[1] != '\0')) {
          ret = 0x491;
          goto LAB_2306a59a;
        }
        memcpy(ssl->out_ctr + 2,hash + 2,6);
      }
      ilen = ((uint)*(ushort *)ssl->in_len & 0xff) << 8 | (uint)(*(ushort *)ssl->in_len >> 8);
      if (0x4000 < ilen) {
        ret = 0x4b3;
        goto LAB_2306a59a;
      }
      ret = 5;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        ret = 0xd;
      }
      iVar8 = mbedtls_ssl_fetch_input(ssl,ret + ilen);
      if (iVar8 != 0) {
        format = "mbedtls_ssl_fetch_input";
        ret = 0x4b9;
        line_00 = iVar8;
        goto LAB_2306a528;
      }
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) {
        ssl->in_left = 0;
      }
      else {
        ssl->next_record_offset = ilen + 0xd;
      }
      input = ssl->in_msg;
      mbedtls_debug_print_buf(ssl,4,"file1",0x4c8,"record contents",input,ilen);
      (*ssl->handshake->update_checksum)(ssl,input,ilen);
      sig_len = 4;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        sig_len = 0xc;
      }
      if (ilen < sig_len) {
        ret = 0x4d6;
        goto LAB_2306a59a;
      }
      mbedtls_debug_print_msg
                (ssl,3,"file1",0x4da,"client hello v3, handshake type: %d",(uint)*input);
      if (*input != 1) {
        ret = 0x4de;
        goto LAB_2306a59a;
      }
      mbedtls_debug_print_msg
                (ssl,3,"file1",0x4e3,"client hello v3, handshake len.: %d",
                 (uint)input[1] << 0x10 | (uint)input[2] << 8 | (uint)input[3]);
      if (input[1] == 0) {
        ret = 4;
        uVar3 = *(ushort *)&ssl->conf->field_0x74;
        if ((uVar3 & 2) != 0) {
          ret = 0xc;
        }
        if (ilen == ((uint)(*(ushort *)(input + 2) >> 8) |
                    ((uint)*(ushort *)(input + 2) & 0xff) << 8) + ret) {
          if ((uVar3 & 2) == 0) {
LAB_2306a850:
            ret = 4;
          }
          else {
            sig_len = ((uint)*(ushort *)(ssl->in_msg + 4) & 0xff) << 8 |
                      (uint)(*(ushort *)(ssl->in_msg + 4) >> 8);
            ssl->handshake->out_msg_seq = sig_len;
            ssl->handshake->in_msg_seq = sig_len + 1;
            hash = ssl->in_msg;
            if ((((hash[6] != '\0') || (hash[7] != '\0')) || (hash[8] != '\0')) ||
               (ret = memcmp(hash + 1,hash + 9,3), ret != 0)) {
              mbedtls_debug_print_msg(ssl,1,"file1",0x515,"ClientHello fragmentation not supported")
              ;
              return -0x7080;
            }
            ret = 0xc;
            if ((*(ushort *)&ssl->conf->field_0x74 & 2) == 0) goto LAB_2306a850;
          }
          input = input + ret;
          pbVar21 = (byte *)(ilen - ret);
          if (pbVar21 < (byte *)0x26) {
            ret = 0x535;
            goto LAB_2306a59a;
          }
          mbedtls_debug_print_buf(ssl,3,"file1",0x53c,"client hello, version",input,2);
          mbedtls_ssl_read_version
                    (&ssl->major_ver,&ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,input)
          ;
          ssl->handshake->max_major_ver = ssl->major_ver;
          ret = ssl->minor_ver;
          ssl->handshake->max_minor_ver = ret;
          pmVar12 = ssl->conf;
          if ((ssl->major_ver < (int)(uint)pmVar12->min_major_ver) ||
             (ret < (int)(uint)pmVar12->min_minor_ver)) {
            mbedtls_debug_print_msg
                      (ssl,1,"file1",0x54a,
                       "client only supports ssl smaller than minimum [%d:%d] < [%d:%d]");
            mbedtls_ssl_send_alert_message(ssl,'\x02','F');
            return -0x6e80;
          }
          if ((int)(uint)pmVar12->max_major_ver < ssl->major_ver) {
            ssl->major_ver = (uint)pmVar12->max_major_ver;
            ilen = (uint)pmVar12->max_minor_ver;
LAB_2306a910:
            ssl->minor_ver = ilen;
          }
          else {
            ilen = (uint)pmVar12->max_minor_ver;
            if ((int)ilen < ret) goto LAB_2306a910;
          }
          mbedtls_debug_print_buf(ssl,3,"file1",0x55d,"client hello, random bytes",input + 2,0x20);
          memcpy(ssl->handshake->randbytes,input + 2,0x20);
          ilen = (uint)input[0x22];
          if ((0x20 < input[0x22]) || (len = (byte *)(ilen + 0x24), pbVar21 < len)) {
            ret = 0x569;
            goto LAB_2306a59a;
          }
          mbedtls_debug_print_buf(ssl,3,"file1",0x56d,"client hello, session id",input + 0x23,ilen);
          ssl->session_negotiate->id_len = ilen;
          buf_01 = (byte *)(ilen + 0x23);
          memset(ssl->session_negotiate->id,0,0x20);
          memcpy(ssl->session_negotiate->id,input + 0x23,ssl->session_negotiate->id_len);
          if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
            bVar1 = input[(int)buf_01];
            if (pbVar21 < buf_01 + (uint)bVar1 + 3) {
              ret = 0x580;
              goto LAB_2306a59a;
            }
            mbedtls_debug_print_buf
                      (ssl,3,"file1",0x585,"client hello, cookie",input + (int)len,(uint)bVar1);
            if (bVar1 != 0) {
              ret = 0x5a1;
              goto LAB_2306a59a;
            }
            mbedtls_debug_print_msg(ssl,2,"file1",0x5a5,"cookie verification skipped");
            buf_01 = len;
          }
          bVar1 = (input + (int)buf_01)[1];
          uVar3 = CONCAT11(input[(int)buf_01],bVar1);
          len = (byte *)(uint)uVar3;
          if (1 < uVar3) {
            pbVar25 = len + (int)buf_01;
            if ((pbVar25 + 3 <= pbVar21) && (ilen = (uint)len & 1, (bVar1 & 1) == 0)) {
              buf_01 = input + (int)(buf_01 + 2);
              mbedtls_debug_print_buf
                        (ssl,3,"file1",0x5bd,"client hello, ciphersuitelist",buf_01,(size_t)len);
              sig_len = (uint)input[(int)(pbVar25 + 2)];
              if (sig_len - 1 < 0x10) {
                pbVar26 = pbVar25 + 2 + sig_len;
                pbVar16 = pbVar26 + 1;
                if (pbVar16 <= pbVar21) {
                  mbedtls_debug_print_buf
                            (ssl,3,"file1",0x5cf,"client hello, compression",
                             input + (int)(pbVar25 + 3),sig_len);
                  ssl->session_negotiate->compression = 0;
                  if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
                    ssl->session_negotiate->compression = 0;
                  }
                  pbVar25 = pbVar26 + 3;
                  if (pbVar16 < pbVar21) {
                    if (pbVar21 < pbVar25) {
                      ret = 0x5f0;
                      goto LAB_2306a59a;
                    }
                    ilen = (uint)CONCAT11(input[(int)pbVar16],input[(int)(pbVar26 + 2)]);
                    if ((ilen - 1 < 3) || (pbVar21 != pbVar25 + ilen)) {
                      ret = 0x5fa;
                      goto LAB_2306a59a;
                    }
                  }
                  buf = (ushort *)(input + (int)pbVar25);
                  mbedtls_debug_print_buf
                            (ssl,3,"file1",0x602,"client hello extensions",(uchar *)buf,ilen);
                  do {
                    input = buf_01;
                    if (ilen == 0) goto LAB_2306ab72;
                    sig_len = (uint)(*buf >> 8) | ((uint)*buf & 0xff) << 8;
                    uVar17 = ((uint)buf[1] & 0xff) << 8 | (uint)(buf[1] >> 8);
                    uVar22 = uVar17 + 4;
                    if (ilen < uVar22) {
                      ret = 0x60d;
                      goto LAB_2306a59a;
                    }
                    if (sig_len == 0xd) {
                      mbedtls_debug_print_msg
                                (ssl,3,"file1",0x62c,"found signature_algorithms extension");
                      uVar3 = buf[2] >> 8;
                      if ((uVar17 == (((uint)buf[2] & 0xff) << 8 | (uint)uVar3) + 2) &&
                         ((uVar3 & 1) == 0)) {
                        piVar20 = ssl->conf->sig_hashes;
                        while (*piVar20 != 0) {
                          puVar10 = buf + 3;
                          while (puVar10 < (ushort *)((int)buf + uVar22)) {
                            ret = *piVar20;
                            md_alg = mbedtls_ssl_md_alg_from_hash(*(byte *)puVar10);
                            if (ret == CONCAT31(extraout_var,md_alg)) {
                              line = 0xe4;
                              ssl->handshake->sig_alg = (uint)*(byte *)puVar10;
                              ret = 0x298;
                              sig_len = ssl->handshake->sig_alg;
                              goto LAB_2306aeda;
                            }
                            puVar10 = puVar10 + 1;
                          }
                          piVar20 = piVar20 + 1;
                        }
                        format = "no signature_algorithm in common";
                        ret = 0xdf;
                        goto LAB_2306ae8c;
                      }
                      ret = 0xcb;
                      goto LAB_2306a59a;
                    }
                    if (sig_len < 0xe) {
                      if (sig_len == 0) {
                        mbedtls_debug_print_msg(ssl,3,"file1",0x614,"found ServerName extension");
                        if (ssl->conf->f_sni !=
                            (
                             anon_subr_int_void_ptr_mbedtls_ssl_context_ptr_uchar_ptr_size_t_for_f_sni
                             *)0x0) {
                          mbedtls_debug_print_msg(ssl,3,"file1",0x62,"parse ServerName extension");
                          sig_len = ((uint)buf[2] & 0xff) << 8 | (uint)(buf[2] >> 8);
                          if (uVar17 != sig_len + 2) {
                            ret = 0x67;
                            goto LAB_2306a59a;
                          }
                          puVar10 = buf + 3;
                          while (sig_len != 0) {
                            uVar11 = ((uint)*(ushort *)((int)puVar10 + 1) & 0xff) << 8 |
                                     (uint)(*(ushort *)((int)puVar10 + 1) >> 8);
                            if (sig_len < uVar11 + 3) {
                              ret = 0x71;
                              goto LAB_2306a59a;
                            }
                            if (*(byte *)puVar10 == 0) {
                              ret = (*ssl->conf->f_sni)(ssl->conf->p_sni,ssl,
                                                        (byte *)((int)puVar10 + 3),uVar11);
                              if (ret != 0) {
                                mbedtls_debug_print_ret(ssl,1,"file1",0x7b,"ssl_sni_wrapper",ret);
                                message = 'p';
                                goto LAB_2306adbc;
                              }
                              break;
                            }
                            sig_len = sig_len + (-3 - uVar11);
                            puVar10 = (ushort *)((int)puVar10 + uVar11 + 3);
                          }
                        }
                      }
                      else {
                        if (sig_len == 1) {
                          mbedtls_debug_print_msg
                                    (ssl,3,"file1",0x65a,"found max fragment length extension");
                          if ((uVar17 != 1) || (4 < *(byte *)(buf + 2))) {
                            ret = 0x16a;
                            goto LAB_2306a59a;
                          }
                          ssl->session_negotiate->mfl_code = *(byte *)(buf + 2);
                        }
                        else {
LAB_2306ac44:
                          ret = -0x458;
                          line = 0x696;
LAB_2306aeda:
                          mbedtls_debug_print_msg
                                    (ssl,3,"file1",line,(char *)((int)&PTR_caseD_e_2308d000 + ret),
                                     sig_len);
                        }
                      }
                    }
                    else {
                      if (sig_len == 0x23) {
                        mbedtls_debug_print_msg
                                  (ssl,3,"file1",0x682,"found session ticket extension");
                        mbedtls_ssl_session_init((mbedtls_ssl_session *)&local_b4);
                        if ((ssl->conf->f_ticket_parse !=
                             (
                              anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_uchar_ptr_size_t_for_f_ticket_parse
                              *)0x0) &&
                           (ssl->conf->f_ticket_write !=
                            (
                             anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_uchar_ptr_uchar_ptr_size_t_ptr_uint32_t_ptr_for_f_ticket_write
                             *)0x0)) {
                          ssl->handshake->new_session_ticket = 1;
                          mbedtls_debug_print_msg(ssl,3,"file1",0x1c9,"ticket length: %d",uVar17);
                          if (uVar17 != 0) {
                            ret = (*ssl->conf->f_ticket_parse)
                                            (ssl->conf->p_ticket,(mbedtls_ssl_session *)&local_b4,
                                             (uchar *)(buf + 2),uVar17);
                            if (ret == 0) {
                              session.compression = ssl->session_negotiate->id_len;
                              memcpy(&session.id_len,ssl->session_negotiate->id,session.compression)
                              ;
                              mbedtls_ssl_session_free(ssl->session_negotiate);
                              memcpy(ssl->session_negotiate,&local_b4,0x74);
                              hash = &local_b4;
                              do {
                                *hash = '\0';
                                hash = hash + 1;
                              } while (hash != &session.mfl_code);
                              mbedtls_debug_print_msg
                                        (ssl,3,"file1",0x1f5,
                                         "session successfully restored from ticket");
                              ssl->handshake->resume = 1;
                              ssl->handshake->new_session_ticket = 0;
                            }
                            else {
                              mbedtls_ssl_session_free((mbedtls_ssl_session *)&local_b4);
                              if (ret == -0x7180) {
                                format = "ticket is not authentic";
                                ret = 0x1df;
                              }
                              else {
                                if (ret != -0x6d80) {
                                  mbedtls_debug_print_ret
                                            (ssl,1,"file1",0x1e3,"mbedtls_ssl_ticket_parse",ret);
                                  goto LAB_2306ad3a;
                                }
                                format = "ticket is expired";
                                ret = 0x1e1;
                              }
LAB_2306ae8c:
                              mbedtls_debug_print_msg(ssl,3,"file1",ret,format);
                            }
                          }
                        }
                      }
                      else {
                        if (sig_len == 0xff01) {
                          mbedtls_debug_print_msg
                                    (ssl,3,"file1",0x61f,"found renegotiation extension");
                          if ((uVar17 != 1) || (*(byte *)(buf + 2) != 0)) {
                            format = "non-zero length renegotiation info";
                            ret = 0xad;
                            goto LAB_2306ae02;
                          }
                          ssl->secure_renegotiation = 1;
                        }
                        else {
                          if (sig_len != 0x10) goto LAB_2306ac44;
                          mbedtls_debug_print_msg(ssl,3,"file1",0x68c,"found alpn extension");
                          ppcVar27 = ssl->conf->alpn_list;
                          if (ppcVar27 != (char **)0x0) {
                            if (uVar17 < 4) {
                              return -0x7900;
                            }
                            if (((uint)(buf[2] >> 8) | ((uint)buf[2] & 0xff) << 8) != uVar17 - 2) {
                              return -0x7900;
                            }
                            while (*ppcVar27 != (char *)0x0) {
                              __n_00 = strlen(*ppcVar27);
                              puVar10 = buf + 3;
                              while ((ushort *)((int)buf + uVar22) != puVar10) {
                                if ((ushort *)((int)buf + uVar22) < puVar10) {
                                  return -0x7900;
                                }
                                bVar1 = *(byte *)puVar10;
                                if (bVar1 == 0) {
                                  return -0x7900;
                                }
                                if ((__n_00 == (uint)bVar1) &&
                                   (ret = memcmp((byte *)((int)puVar10 + 1),*ppcVar27,__n_00),
                                   ret == 0)) {
                                  ssl->alpn_chosen = *ppcVar27;
                                  goto LAB_2306ad3a;
                                }
                                puVar10 = (ushort *)((byte *)((int)puVar10 + 1) + (uint)bVar1);
                              }
                              ppcVar27 = ppcVar27 + 1;
                            }
                            message = 'x';
LAB_2306adbc:
                            mbedtls_ssl_send_alert_message(ssl,'\x02',message);
                            return -0x7900;
                          }
                        }
                      }
                    }
LAB_2306ad3a:
                    ret = ilen - uVar17;
                    ilen = ret - 4;
                    buf = (ushort *)((int)buf + uVar22);
                  } while (2 < ret - 5U);
                  ret = 0x69e;
                  goto LAB_2306a59a;
                }
              }
              ret = 0x5ca;
              goto LAB_2306a59a;
            }
          }
          ret = 0x5b8;
          goto LAB_2306a59a;
        }
      }
      ret = 0x4e9;
LAB_2306a59a:
      mbedtls_debug_print_msg(ssl,1,"file1",ret,"bad client hello message");
      return -0x7900;
    }
    format = "mbedtls_ssl_fetch_input";
    ret = 0x450;
    line_00 = line;
    goto LAB_2306a528;
  case 2:
    mbedtls_debug_print_msg(ssl,2,"file1",0x8b1,"=> write server hello");
    if (ssl->conf->f_rng == (mbedtls_ssl_recv_t *)0x0) {
      mbedtls_debug_print_msg(ssl,1,"file1",0x8c0,"no RNG provided");
      return -0x7400;
    }
    puVar24 = ssl->out_msg;
    mbedtls_ssl_write_version
              (ssl->major_ver,ssl->minor_ver,*(uint *)&ssl->conf->field_0x74 >> 1 & 1,puVar24 + 4);
    mbedtls_debug_print_msg
              (ssl,3,"file1",0x8d3,"server hello, chosen version: [%d:%d]",(uint)puVar24[4],
               (uint)puVar24[5]);
    hash = puVar24 + 6;
    ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,hash,4);
    if (ret != 0) {
      return ret;
    }
    ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,puVar24 + 10,0x1c);
    if (ret != 0) {
      return ret;
    }
    memcpy(ssl->handshake->randbytes + 0x20,hash,0x20);
    mbedtls_debug_print_buf(ssl,3,"file1",0x8eb,"server hello, random bytes",hash,0x20);
    if ((ssl->handshake->resume == 0) && (ssl->session_negotiate->id_len != 0)) {
      paVar13 = ssl->conf->f_get_cache;
      if ((paVar13 != (anon_subr_int_void_ptr_mbedtls_ssl_session_ptr_for_f_get_cache *)0x0) &&
         (ret = (*paVar13)(ssl->conf->p_cache,ssl->session_negotiate), ret == 0)) {
        mbedtls_debug_print_msg(ssl,3,"file1",0x8fa,"session successfully restored from cache");
        ssl->handshake->resume = 1;
      }
    }
    pmVar14 = ssl->session_negotiate;
    if (ssl->handshake->resume == 0) {
      ssl->state = ssl->state + 1;
      if (ssl->handshake->new_session_ticket == 0) {
        pmVar14->id_len = 0x20;
        len_00 = 0x20;
        ret = (*ssl->conf->f_rng)(ssl->conf->p_rng,ssl->session_negotiate->id,0x20);
        if (ret != 0) {
          return ret;
        }
      }
      else {
