pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
        pmVar14->id_len = 0;
        memset(ssl->session_negotiate->id,0,0x20);
        len_00 = 0;
      }
    }
    else {
      len_00 = pmVar14->id_len;
      ssl->state = 0xc;
      line_00 = mbedtls_ssl_derive_keys(ssl);
      if (line_00 != 0) {
        format = "mbedtls_ssl_derive_keys";
        ret = 0x923;
        goto LAB_2306a528;
      }
    }
    hash = puVar24 + 0x27;
    puVar24[0x26] = (uchar)ssl->session_negotiate->id_len;
    memcpy(hash,ssl->session_negotiate->id,ssl->session_negotiate->id_len);
    sVar9 = ssl->session_negotiate->id_len;
    mbedtls_debug_print_msg(ssl,3,"file1",0x934,"server hello, session id len.: %d",len_00);
    mbedtls_debug_print_buf(ssl,3,"file1",0x935,"server hello, session id",hash,len_00);
    hash = hash + sVar9;
    if (ssl->handshake->resume == 0) {
      puVar15 = &UNK_2308c4d8;
    }
    else {
      puVar15 = (undefined *)0x230873f4;
    }
    mbedtls_debug_print_msg(ssl,3,"file1",0x937,"%s session has been resumed",puVar15);
    puVar19 = hash + 3;
    *hash = (uchar)((uint)ssl->session_negotiate->ciphersuite >> 8);
    hash[1] = (uchar)ssl->session_negotiate->ciphersuite;
    hash[2] = (uchar)ssl->session_negotiate->compression;
    format = mbedtls_ssl_get_ciphersuite_name(ssl->session_negotiate->ciphersuite);
    mbedtls_debug_print_msg(ssl,3,"file1",0x93e,"server hello, chosen ciphersuite: %s",format);
    mbedtls_debug_print_msg
              (ssl,3,"file1",0x940,"server hello, compress alg.: 0x%02X",
               ssl->session_negotiate->compression);
    puVar6 = (uchar *)0x0;
    if (ssl->secure_renegotiation == 1) {
      mbedtls_debug_print_msg(ssl,3,"file1",0x7c3,"server hello, secure renegotiation extension");
      hash[5] = -1;
      hash[6] = '\x01';
      hash[7] = '\0';
      hash[8] = '\x01';
      hash[9] = '\0';
      puVar6 = hash + (10 - (int)(hash + 5));
    }
    ret = 0;
    if (ssl->session_negotiate->mfl_code != '\0') {
      mbedtls_debug_print_msg(ssl,3,"file1",0x7ec,"server hello, max_fragment_length extension");
      __n = puVar6 + 2 + (int)puVar19;
      *__n = '\0';
      __n[1] = '\x01';
      __n[2] = '\0';
      __n[3] = '\x01';
      __n[4] = ssl->session_negotiate->mfl_code;
      ret = 5;
    }
    puVar6 = puVar6 + ret;
    ret = 0;
    if (ssl->handshake->new_session_ticket != 0) {
      mbedtls_debug_print_msg(ssl,3,"file1",0x7ab,"server hello, adding session ticket extension");
      __n = puVar19 + (int)(puVar6 + 2);
      *__n = '\0';
      __n[1] = '#';
      __n[2] = '\0';
      __n[3] = '\0';
      ret = 4;
    }
    line_00 = 0;
    if (ssl->alpn_chosen != (char *)0x0) {
      mbedtls_debug_print_msg(ssl,3,"file1",0x84f,"server hello, adding alpn extension");
      __n = puVar19 + (int)(puVar6 + ret + 2);
      __n[1] = '\x10';
      *__n = '\0';
      __n_00 = strlen(ssl->alpn_chosen);
      line_00 = __n_00 + 7;
      __n[2] = (uchar)(__n_00 + 3 >> 8);
      cVar4 = (char)line_00;
      __n[3] = cVar4 + -4;
      __n[4] = (uchar)(__n_00 + 1 >> 8);
      __n[5] = cVar4 + -6;
      __n[6] = cVar4 + -7;
      memcpy(__n + 7,ssl->alpn_chosen,__n_00);
    }
    puVar6 = puVar6 + ret + line_00;
    mbedtls_debug_print_msg(ssl,3,"file1",0x977,"server hello, total extension length: %d",puVar6);
    if (puVar6 != (uchar *)0x0) {
      hash[3] = (uchar)((uint)puVar6 >> 8);
      hash[4] = (uchar)puVar6;
      puVar19 = hash + 5 + (int)puVar6;
    }
    ssl->out_msgtype = 0x16;
    *(uchar **)&ssl->out_msglen = puVar19 + -(int)puVar24;
    *ssl->out_msg = '\x02';
    line_00 = mbedtls_ssl_write_record(ssl);
    format = "<= write server hello";
    line = 0x98a;
    goto LAB_2306b2ac;
  case 3:
    line_00 = mbedtls_ssl_write_certificate(ssl);
    break;
  case 4:
    info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0xa7f,"=> write server key exchange");
    mVar2 = info->key_exchange;
    if (((mVar2 & 0xfb) == 1) || (mVar2 == MBEDTLS_KEY_EXCHANGE_RSA_PSK)) {
      format = "<= skip write server key exchange";
      line_00 = 0xa88;
LAB_2306b7d0:
      mbedtls_debug_print_msg(ssl,2,"file1",line_00,format);
      line_00 = ssl->state + 1;
      goto LAB_2306b7e2;
    }
    ssl->out_msglen = 4;
    ssl->out_msgtype = 0x16;
    *ssl->out_msg = '\f';
    ssl->state = ssl->state + 1;
    line_00 = mbedtls_ssl_write_record(ssl);
    if (line_00 != 0) {
      format = "mbedtls_ssl_write_record";
      ret = 0xbd4;
      goto LAB_2306a528;
    }
    format = "<= write server key exchange";
    line = 0xbd8;
    goto LAB_2306b2ac;
  case 5:
    info = ssl->transform_negotiate->ciphersuite_info;
    hash = ssl->out_msg;
    mbedtls_debug_print_msg(ssl,2,"file1",0x9b5,"=> write certificate request");
    ssl->state = ssl->state + 1;
    ilen = ssl->handshake->sni_authmode;
    if (ilen == 3) {
      ilen = *(uint *)&ssl->conf->field_0x74 >> 2 & 3;
    }
    mVar2 = info->key_exchange;
    if ((((byte)(mVar2 + ~MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA) < 4) ||
        (mVar2 == MBEDTLS_KEY_EXCHANGE_ECJPAKE)) || (ilen == 0)) {
      format = "<= skip write certificate request";
      line = 0x9c7;
      line_00 = ret;
    }
    else {
      puVar19 = ssl->out_msg;
      ret = 0;
      puVar19[5] = '\x01';
      puVar19[4] = '\x01';
      puVar6 = puVar19 + 6;
      puVar24 = puVar6;
      if (ssl->minor_ver == 3) {
        line_00 = 0;
        piVar20 = ssl->conf->sig_hashes;
        while( true ) {
          ret = line_00 + 2;
          puVar24 = puVar6 + ret;
          if (*piVar20 == 0) break;
          message = mbedtls_ssl_hash_from_md_alg(*piVar20);
          if ((CONCAT31(extraout_var_01,message) != 0) &&
             (line = mbedtls_ssl_set_calc_verify_md(ssl,CONCAT31(extraout_var_01,message)),
             line == 0)) {
            *puVar24 = message;
            puVar6[line_00 + 3] = '\x01';
            line_00 = ret;
          }
          piVar20 = piVar20 + 1;
        }
        puVar19[6] = (uchar)((uint)line_00 >> 8);
        puVar19[7] = (uchar)line_00;
      }
      puVar24 = puVar24 + 2;
      pmVar5 = ssl->handshake->sni_ca_chain;
      if (pmVar5 == (mbedtls_x509_crt *)0x0) {
        pmVar5 = ssl->conf->ca_chain;
      }
      hash = hash + 0x4000;
      puVar6 = (uchar *)0x0;
      while( true ) {
        if ((pmVar5 == (mbedtls_x509_crt *)0x0) || (pmVar5->version == 0)) goto LAB_2306b93e;
        __n = (uchar *)(pmVar5->subject_raw).len;
        if ((hash < puVar24) || ((hash + -(int)puVar24 < __n || (hash + -(int)puVar24 < __n + 2))))
        break;
        *puVar24 = (uchar)((uint)__n >> 8);
        puVar24[1] = (uchar)__n;
        buf_00 = puVar24 + 2;
        memcpy(buf_00,(pmVar5->subject_raw).p,(size_t)__n);
        puVar24 = buf_00 + (int)__n;
        puVar6 = __n + 2 + (int)puVar6;
        mbedtls_debug_print_buf(ssl,3,"file1",0xa38,"requested DN",buf_00,(size_t)__n);
        pmVar5 = pmVar5->next;
      }
      mbedtls_debug_print_msg(ssl,1,"file1",0xa2f,"skipping CAs: buffer too short");
LAB_2306b93e:
      *(uchar **)&ssl->out_msglen = puVar24 + -(int)puVar19;
      ssl->out_msgtype = 0x16;
      *ssl->out_msg = '\r';
      ssl->out_msg[ret + 6] = (uchar)((uint)puVar6 >> 8);
      ssl->out_msg[ret + 7] = (uchar)puVar6;
      line_00 = mbedtls_ssl_write_record(ssl);
      format = "<= write certificate request";
      line = 0xa46;
    }
LAB_2306b2ac:
    mbedtls_debug_print_msg(ssl,2,"file1",line,format);
    break;
  case 6:
    mbedtls_debug_print_msg(ssl,2,"file1",0xbe1,"=> write server hello done");
    ssl->out_msglen = 4;
    ssl->out_msgtype = 0x16;
    *ssl->out_msg = '\x0e';
    ssl->state = ssl->state + 1;
    if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
      mbedtls_ssl_send_flight_completed(ssl);
    }
    line_00 = mbedtls_ssl_write_record(ssl);
    if (line_00 == 0) {
      format = "<= write server hello done";
      line = 0xbf4;
      goto LAB_2306b2ac;
    }
    format = "mbedtls_ssl_write_record";
    ret = 0xbf0;
    goto LAB_2306a528;
  case 7:
    line_00 = mbedtls_ssl_parse_certificate(ssl);
    break;
  case 8:
    info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0xcd4,"=> parse client key exchange");
    line_00 = mbedtls_ssl_read_record(ssl);
    if (line_00 == 0) {
      hash = ssl->in_msg;
      ret = 4;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        ret = 0xc;
      }
      len_00 = ssl->in_hslen;
      input = hash + ret;
      if (ssl->in_msgtype == 0x16) {
        if (*hash == '\x10') {
          if (info->key_exchange != MBEDTLS_KEY_EXCHANGE_RSA) {
            ret = 0xdb5;
LAB_2306b108:
            mbedtls_debug_print_msg(ssl,1,"file1",ret,"should never happen");
            ret = -0x7000;
            goto LAB_2306baec;
          }
          ctx = mbedtls_ssl_own_key(ssl);
          sVar9 = mbedtls_pk_get_bitlen(ctx);
          ctx = mbedtls_ssl_own_key(ssl);
          ilen = sVar9 + 7 >> 3;
          pmVar7 = ssl->handshake;
          ret = mbedtls_pk_can_do(ctx,MBEDTLS_PK_RSA);
          if (ret == 0) {
            mbedtls_debug_print_msg(ssl,1,"file1",0xc34,"got no RSA private key");
            line_00 = -0x7600;
          }
          else {
            if ((ssl->minor_ver == 0) ||
               (((uint)*input == (sVar9 + 7 >> 0xb & 0xff) &&
                (pbVar21 = input + 1, input = input + 2, (uint)*pbVar21 == (ilen & 0xff))))) {
              if (hash + len_00 == input + ilen) {
                mbedtls_ssl_write_version
                          (ssl->handshake->max_major_ver,ssl->handshake->max_minor_ver,
                           *(uint *)&ssl->conf->field_0x74 >> 1 & 1,&bStack236);
                line_00 = (*ssl->conf->f_rng)(ssl->conf->p_rng,(uchar *)&major,0x30);
                if (line_00 == 0) {
                  ctx = mbedtls_ssl_own_key(ssl);
                  ilen = mbedtls_pk_decrypt(ctx,input,ilen,&local_b4,(size_t *)ver,0x30,
                                            (anon_subr_int_void_ptr_uchar_ptr_size_t *)
                                            ssl->conf->f_rng,ssl->conf->p_rng);
                  ilen = ilen | (uint)(byte)((byte)local_b4 ^ bStack236 | local_b4._1_1_ ^ bStack235
                                            ) | _ver ^ 0x30;
                  ssl->handshake->pmslen = 0x30;
                  bVar1 = (char)((byte)(ilen >> 0x18) | (byte)(-ilen >> 0x18)) >> 7;
                  ilen = 0;
                  while (ilen < ssl->handshake->pmslen) {
                    pmVar7->premaster[ilen] =
                         (&local_b4)[ilen] & ~bVar1 | *(byte *)((int)&major + ilen) & bVar1;
                    ilen = ilen + 1;
                  }
                  line_00 = mbedtls_ssl_derive_keys(ssl);
                  if (line_00 == 0) {
                    ssl->state = ssl->state + 1;
                    format = "<= parse client key exchange";
                    line = 0xdc1;
                    goto LAB_2306b2ac;
                  }
                  format = "mbedtls_ssl_derive_keys";
                  ret = 0xdbb;
                  goto LAB_2306a528;
                }
                goto LAB_2306bb5c;
              }
              ret = 0xc4a;
            }
            else {
              ret = 0xc42;
            }
            mbedtls_debug_print_msg(ssl,1,"file1",ret,"bad client key exchange message");
            line_00 = -0x7c00;
          }
LAB_2306bb5c:
          format = "ssl_parse_parse_encrypted_pms_secret";
          ret = 0xd98;
          goto LAB_2306a528;
        }
        ret = 0xce7;
      }
      else {
        ret = 0xce1;
      }
      mbedtls_debug_print_msg(ssl,1,"file1",ret,"bad client key exchange message");
      ret = -0x8000;
LAB_2306baec:
      return ret + 0x400;
    }
    format = "mbedtls_ssl_read_record";
    ret = 0xcd8;
    goto LAB_2306a528;
  case 9:
    info = ssl->transform_negotiate->ciphersuite_info;
    mbedtls_debug_print_msg(ssl,2,"file1",0xdee,"=> parse certificate verify");
    mVar2 = info->key_exchange;
    if ((((byte)(mVar2 + ~MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA) < 4) ||
        (mVar2 == MBEDTLS_KEY_EXCHANGE_ECJPAKE)) ||
       (ssl->session_negotiate->peer_cert == (mbedtls_x509_crt *)0x0)) {
      format = "<= skip parse certificate verify";
      line_00 = 0xdf7;
      goto LAB_2306b7d0;
    }
    do {
      line_00 = mbedtls_ssl_read_record_layer(ssl);
      if (line_00 != 0) {
        format = "mbedtls_ssl_read_record_layer";
        ret = 0xe01;
        goto LAB_2306a528;
      }
      line_00 = mbedtls_ssl_handle_message_type(ssl);
    } while (line_00 == -0x6680);
    if (line_00 == 0) {
      ssl->state = ssl->state + 1;
      if ((ssl->in_msgtype != 0x16) || (*ssl->in_msg != '\x0f')) {
        format = "bad certificate verify message";
        ret = 0xe15;
        goto LAB_2306bd9e;
      }
      ret = 4;
      if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
        ret = 0xc;
      }
      if (ssl->minor_ver != 3) {
        ret = 0xe6c;
        goto LAB_2306b108;
      }
      if (ssl->in_hslen < ret + 2U) {
        format = "bad certificate verify message";
        ret = 0xe39;
LAB_2306bd9e:
        mbedtls_debug_print_msg(ssl,1,"file1",ret,format);
        return -0x7d80;
      }
      md_alg = mbedtls_ssl_md_alg_from_hash(ssl->in_msg[ret]);
      if ((CONCAT31(extraout_var_02,md_alg) == 0) ||
         (line_00 = mbedtls_ssl_set_calc_verify_md(ssl,(uint)ssl->in_msg[ret]), line_00 != 0)) {
        format = "peer not adhering to requested sig_alg for verify message";
        ret = 0xe45;
        goto LAB_2306bd9e;
      }
      hash = &local_b4;
      if (CONCAT31(extraout_var_02,md_alg) == 4) {
        hash = session.id;
      }
      type = mbedtls_ssl_pk_alg_from_sig(ssl->in_msg[ret + 1]);
      if (CONCAT31(extraout_var_03,type) == 0) {
        format = "peer not adhering to requested sig_alg for verify message";
        ret = 0xe5a;
        goto LAB_2306bd9e;
      }
      line_00 = mbedtls_pk_can_do(&ssl->session_negotiate->peer_cert->pk,type);
      if (line_00 == 0) {
        format = "sig_alg doesn\'t match cert key";
        ret = 0xe63;
        goto LAB_2306bd9e;
      }
      ilen = ret + 4;
      if (ssl->in_hslen < ilen) {
        format = "bad certificate verify message";
        ret = 0xe72;
        goto LAB_2306bd9e;
      }
      sig_len = (uint)CONCAT11(ssl->in_msg[ret + 2U],ssl->in_msg[ret + 3]);
      if (ssl->in_hslen != ilen + sig_len) {
        format = "bad certificate verify message";
        ret = 0xe7b;
        goto LAB_2306bd9e;
      }
      (*ssl->handshake->calc_verify)(ssl,&local_b4);
      line_00 = mbedtls_pk_verify(&ssl->session_negotiate->peer_cert->pk,md_alg,hash,0,
                                  ssl->in_msg + ilen,sig_len);
      if (line_00 == 0) {
        mbedtls_ssl_update_handshake_status(ssl);
        format = "<= parse certificate verify";
        line = 0xe8c;
        goto LAB_2306b2ac;
      }
      format = "mbedtls_pk_verify";
      ret = 0xe86;
    }
    else {
      format = "mbedtls_ssl_handle_message_type";
      ret = 0xe0b;
    }
    goto LAB_2306a528;
  case 10:
    line_00 = mbedtls_ssl_parse_change_cipher_spec(ssl);
    break;
  case 0xb:
    line_00 = mbedtls_ssl_parse_finished(ssl);
    break;
  case 0xc:
    if (ssl->handshake->new_session_ticket == 0) {
      ret = mbedtls_ssl_write_change_cipher_spec(ssl);
      return ret;
    }
    mbedtls_debug_print_msg(ssl,2,"file1",0xe9e,"=> write new session ticket");
    ssl->out_msgtype = 0x16;
    *ssl->out_msg = '\x04';
    ret = (*ssl->conf->f_ticket_write)
                    (ssl->conf->p_ticket,ssl->session_negotiate,ssl->out_msg + 10,
                     ssl->out_msg + 0x4000,(size_t *)&major,(uint32_t *)&local_b4);
    if (ret != 0) {
      mbedtls_debug_print_ret(ssl,1,"file1",0xeb4,"mbedtls_ssl_ticket_write",ret);
      major = 0;
    }
    ssl->out_msg[4] = (uchar)(local_b4 >> 0x18);
    ssl->out_msg[5] = (uchar)(local_b4 >> 0x10);
    ssl->out_msg[6] = (uchar)(local_b4 >> 8);
    ssl->out_msg[7] = (uchar)local_b4;
    ssl->out_msg[8] = (uchar)((uint)major >> 8);
    ssl->out_msg[9] = (uchar)major;
    ssl->out_msglen = major + 10;
    ssl->handshake->new_session_ticket = 0;
    line_00 = mbedtls_ssl_write_record(ssl);
    if (line_00 == 0) {
      format = "<= write new session ticket";
      line = 0xece;
      goto LAB_2306b2ac;
    }
    format = "mbedtls_ssl_write_record";
    ret = 0xeca;
LAB_2306a528:
    mbedtls_debug_print_ret(ssl,1,"file1",ret,format,line_00);
    break;
  case 0xd:
    line_00 = mbedtls_ssl_write_finished(ssl);
    break;
  case 0xe:
    mbedtls_debug_print_msg(ssl,2,"file1",0xf47,"handshake: done");
    line_00 = 0xf;
LAB_2306b7e2:
    ssl->state = line_00;
    line_00 = ret;
    break;
  case 0xf:
    mbedtls_ssl_handshake_wrapup(ssl);
    line_00 = ret;
    break;
  default:
    mbedtls_debug_print_msg(ssl,1,"file1",0xf50,"invalid state %d",line_00);
    return -0x7100;
  case 0x12:
    line_00 = -0x6a80;
  }
  return line_00;
LAB_2306ab72:
  if ((*input == 0) && (input[1] == 0xff)) {
    mbedtls_debug_print_msg(ssl,3,"file1",0x6c4,"received TLS_EMPTY_RENEGOTIATION_INFO ");
    ssl->secure_renegotiation = 1;
    goto LAB_2306aba0;
  }
  input = input + 2;
  if (len <= input + -(int)buf_01) {
    if ((ssl->secure_renegotiation != 1) && ((*(ushort *)&ssl->conf->field_0x74 & 0x30) == 0x20)) {
      format = "legacy renegotiation, breaking off handshake";
      ret = 0x6db;
LAB_2306ae02:
      mbedtls_debug_print_msg(ssl,1,"file1",ret,format);
      ret = mbedtls_ssl_send_fatal_handshake_failure(ssl);
      if (ret == 0) {
        return -0x7900;
      }
      return ret;
    }
LAB_2306aba0:
    puVar18 = (uint *)ssl->conf->ciphersuite_list[ssl->minor_ver];
    ret = 0;
    do {
      input = buf_01;
      if (*puVar18 == 0) {
        if (ret == 0) {
          mbedtls_debug_print_msg(ssl,1,"file1",0x728,"got no ciphersuites in common");
          mbedtls_ssl_send_fatal_handshake_failure(ssl);
          return -0x7380;
        }
        mbedtls_debug_print_msg
                  (ssl,1,"file1",0x722,"got ciphersuites in common, but none of them usable");
        mbedtls_ssl_send_fatal_handshake_failure(ssl);
        return -0x6980;
      }
      do {
        ilen = *puVar18;
        if (((uint)*input == ((int)ilen >> 8 & 0xffU)) && ((uint)input[1] == (ilen & 0xff))) {
          info = mbedtls_ssl_ciphersuite_from_id(ilen);
          if (info == (mbedtls_ssl_ciphersuite_t *)0x0) {
            ret = 0x2cc;
            goto LAB_2306b108;
          }
          mbedtls_debug_print_msg(ssl,3,"file1",0x2d0,"trying ciphersuite: %s",info->name);
          ret = line_00;
          if ((ssl->minor_ver < info->min_minor_ver) || (info->max_minor_ver < ssl->minor_ver)) {
            format = "ciphersuite mismatch: version";
            line = 0x2d5;
          }
          else {
            if (((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) && ((info->flags & 4) != 0))
            goto LAB_2306b15a;
            type = mbedtls_ssl_get_ciphersuite_sig_pk_alg(info);
            pmVar28 = ssl->handshake->sni_key_cert;
            if (pmVar28 == (mbedtls_ssl_key_cert *)0x0) {
              pmVar28 = ssl->conf->key_cert;
            }
            if (CONCAT31(extraout_var_00,type) == 0) {
have_ciphersuite:
              mbedtls_debug_print_msg(ssl,2,"file1",0x72e,"selected ciphersuite: %s",info->name);
              ssl->session_negotiate->ciphersuite = *puVar18;
              ssl->transform_negotiate->ciphersuite_info = info;
              ssl->state = ssl->state + 1;
              if ((*(ushort *)&ssl->conf->field_0x74 & 2) != 0) {
                mbedtls_ssl_recv_flight_completed(ssl);
              }
              format = "<= parse client hello";
              line = 0x73a;
              line_00 = iVar8;
              goto LAB_2306b2ac;
            }
            mbedtls_debug_print_msg(ssl,3,"file1",0x26f,"ciphersuite requires certificate");
            pmVar23 = (mbedtls_ssl_key_cert *)0x0;
            if (pmVar28 == (mbedtls_ssl_key_cert *)0x0) {
              mbedtls_debug_print_msg(ssl,3,"file1",0x273,"server has no certificate");
            }
            else {
              do {
                mbedtls_debug_print_crt
                          (ssl,3,"file1",0x27a,"candidate certificate chain, certificate",
                           pmVar28->cert);
                line = mbedtls_pk_can_do(pmVar28->key,type);
                if (line == 0) {
                  format = "certificate mismatch: key type";
                  line = 0x27e;
                }
                else {
                  line = mbedtls_ssl_check_cert_usage(pmVar28->cert,info,1,(uint32_t *)&local_b4);
                  if (line == 0) {
                    if ((2 < ssl->minor_ver) || (pmVar28->cert->sig_md == MBEDTLS_MD_SHA1))
                    goto LAB_2306b22e;
                    if (pmVar23 == (mbedtls_ssl_key_cert *)0x0) {
                      pmVar23 = pmVar28;
                    }
                    format = "certificate not preferred: sha-2 with pre-TLS 1.2 client";
                    line = 0x2a7;
                  }
                  else {
                    format = "certificate mismatch: (extended) key usage extension";
                    line = 0x28e;
                  }
                }
                mbedtls_debug_print_msg(ssl,3,"file1",line,format);
                pmVar28 = pmVar28->next;
              } while (pmVar28 != (mbedtls_ssl_key_cert *)0x0);
              pmVar28 = pmVar23;
              if (pmVar23 != (mbedtls_ssl_key_cert *)0x0) {
LAB_2306b22e:
                ssl->handshake->key_cert = pmVar28;
                mbedtls_debug_print_crt
                          (ssl,3,"file1",0x2b8,"selected certificate chain, certificate",
                           ssl->handshake->key_cert->cert);
                goto have_ciphersuite;
              }
            }
            format = "ciphersuite mismatch: no suitable certificate";
            line = 0x316;
          }
          mbedtls_debug_print_msg(ssl,3,"file1",line,format);
        }
LAB_2306b15a:
        input = input + 2;
      } while (input + -(int)buf_01 < len);
      puVar18 = puVar18 + 1;
    } while( true );
  }
  goto LAB_2306ab72;
}



int mbedtls_x509_get_serial(uchar **p,uchar *end,mbedtls_x509_buf *serial)

{
  int iVar1;
  byte *pbVar2;
  uchar *puVar3;
  
  pbVar2 = *p;
  if ((int)(end + -(int)pbVar2) < 1) {
    return -0x22e0;
  }
  if ((*pbVar2 & 0x7f) == 2) {
    *p = pbVar2 + 1;
    serial->tag = (uint)*pbVar2;
    iVar1 = mbedtls_asn1_get_len(p,end,&serial->len);
    if (iVar1 == 0) {
      puVar3 = *p;
      serial->p = puVar3;
      *p = puVar3 + serial->len;
    }
    else {
      iVar1 = iVar1 + -0x2280;
    }
    return iVar1;
  }
  return -0x22e2;
}



int mbedtls_x509_get_alg(uchar **p,uchar *end,mbedtls_x509_buf *alg,mbedtls_x509_buf *params)

{
  int iVar1;
  
  iVar1 = mbedtls_asn1_get_alg(p,end,(mbedtls_asn1_buf *)alg,(mbedtls_asn1_buf *)params);
  if (iVar1 != 0) {
    iVar1 = iVar1 + -0x2300;
  }
  return iVar1;
}



