pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
int mbedtls_x509_get_name(uchar **p,uchar *end,mbedtls_x509_name *cur)

{
  mbedtls_x509_name *pmVar1;
  int iVar2;
  mbedtls_asn1_named_data *pmVar3;
  uchar *puVar4;
  byte *pbVar5;
  uchar *end_00;
  size_t sStack56;
  size_t set_len;
  size_t len;
  
LAB_2306c13a:
  iVar2 = mbedtls_asn1_get_tag(p,end,&sStack56,0x31);
  if (iVar2 != 0) {
    return iVar2 + -0x2380;
  }
  end_00 = *p + sStack56;
  pmVar1 = cur;
  do {
    iVar2 = mbedtls_asn1_get_tag(p,end_00,&set_len,0x30);
    if (iVar2 == 0) {
      if ((int)(end_00 + -(int)*p) < 1) {
        return -0x23e0;
      }
      (pmVar1->oid).tag = (uint)**p;
      iVar2 = mbedtls_asn1_get_tag(p,end_00,&(pmVar1->oid).len,6);
      if (iVar2 != 0) goto LAB_2306c186;
      puVar4 = *p;
      (pmVar1->oid).p = puVar4;
      pbVar5 = puVar4 + (pmVar1->oid).len;
      *p = pbVar5;
      if ((int)(end_00 + -(int)pbVar5) < 1) {
        return -0x23e0;
      }
      if ((0x1e < *pbVar5) || ((0x50581008U >> ((uint)*pbVar5 & 0x1f) & 1) == 0)) {
        return -0x23e2;
      }
      *p = pbVar5 + 1;
      (pmVar1->val).tag = (uint)*pbVar5;
      iVar2 = mbedtls_asn1_get_len(p,end_00,&(pmVar1->val).len);
      if (iVar2 != 0) goto LAB_2306c186;
      puVar4 = *p;
      (pmVar1->val).p = puVar4;
      *p = puVar4 + (pmVar1->val).len;
      pmVar1->next = (mbedtls_asn1_named_data *)0x0;
    }
    else {
LAB_2306c186:
      if (iVar2 + -0x2380 != 0) {
        return iVar2 + -0x2380;
      }
    }
    if (*p == end_00) break;
    pmVar1->next_merged = '\x01';
    pmVar3 = (mbedtls_asn1_named_data *)mycalloc(1,0x20);
    pmVar1->next = pmVar3;
    pmVar1 = (mbedtls_x509_name *)pmVar3;
    if (pmVar3 == (mbedtls_asn1_named_data *)0x0) {
      return -0x2880;
    }
  } while( true );
  if (end == end_00) {
    return 0;
  }
  cur = (mbedtls_x509_name *)mycalloc(1,0x20);
  *(mbedtls_x509_name **)&pmVar1->next = cur;
  if (cur == (mbedtls_x509_name *)0x0) {
    return -0x2880;
  }
  goto LAB_2306c13a;
}



// WARNING: Variable defined which should be unmapped: len

int mbedtls_x509_get_sig(uchar **p,uchar *end,mbedtls_x509_buf *sig)

{
  byte bVar1;
  int iVar2;
  uchar *puVar3;
  size_t sStack20;
  size_t len;
  
  if (0 < (int)(end + -(int)*p)) {
    bVar1 = **p;
    iVar2 = mbedtls_asn1_get_bitstring_null(p,end,&sStack20);
    if (iVar2 == 0) {
      sig->tag = (uint)bVar1;
      sig->len = sStack20;
      puVar3 = *p;
      sig->p = puVar3;
      *p = puVar3 + sStack20;
    }
    else {
      iVar2 = iVar2 + -0x2480;
    }
    return iVar2;
  }
  return -0x24e0;
}



int mbedtls_x509_get_sig_alg
              (mbedtls_x509_buf *sig_oid,mbedtls_x509_buf *sig_params,mbedtls_md_type_t *md_alg,
              mbedtls_pk_type_t *pk_alg,void **sig_opts)

{
  int iVar1;
  
  if (*sig_opts == (void *)0x0) {
    iVar1 = mbedtls_oid_get_sig_alg((mbedtls_asn1_buf *)sig_oid,md_alg,pk_alg);
    if (iVar1 == 0) {
      if (((sig_params->tag != 5) && (sig_params->tag != 0)) || (sig_params->len != 0)) {
        iVar1 = -0x2300;
      }
    }
    else {
      iVar1 = iVar1 + -0x2600;
    }
    return iVar1;
  }
  return -0x2800;
}



int mbedtls_x509_get_ext(uchar **p,uchar *end,mbedtls_x509_buf *ext,int tag)

{
  int iVar1;
  uchar *end_00;
  size_t sStack20;
  size_t len;
  
  if (*p == end) {
    return 0;
  }
  ext->tag = (uint)**p;
  iVar1 = mbedtls_asn1_get_tag(p,end,&ext->len,tag | 0xa0);
  if (iVar1 == 0) {
    end_00 = *p;
    ext->p = end_00;
    end_00 = end_00 + ext->len;
    iVar1 = mbedtls_asn1_get_tag(p,end_00,&sStack20,0x30);
    if (iVar1 == 0) {
      iVar1 = 0;
      if (end_00 != *p + sStack20) {
        iVar1 = -0x2566;
      }
    }
    else {
      iVar1 = iVar1 + -0x2500;
    }
  }
  return iVar1;
}



int mbedtls_x509_dn_gets(char *buf,size_t size,mbedtls_x509_name *dn)

{
  size_t __maxlen;
  uint __maxlen_00;
  uint uVar1;
  int iVar2;
  char *__format;
  byte bVar3;
  uchar uVar4;
  uint uVar5;
  mbedtls_x509_name *oid;
  char *pcStack308;
  char *short_name;
  char s [256];
  
  pcStack308 = (char *)0x0;
  memset(&short_name,0,0x100);
  uVar4 = '\0';
  __maxlen = size;
  oid = dn;
  do {
    if (oid == (mbedtls_x509_name *)0x0) {
      return size - __maxlen;
    }
    if ((oid->oid).p != (uchar *)0x0) {
      if (oid != dn) {
        __format = " + ";
        if (uVar4 == '\0') {
          __format = ", ";
        }
        uVar1 = snprintf(buf,__maxlen,__format);
        if ((int)uVar1 < 0) {
          return -0x2980;
        }
        if (__maxlen <= uVar1) {
          return -0x2980;
        }
        __maxlen = __maxlen - uVar1;
        buf = buf + uVar1;
      }
      iVar2 = mbedtls_oid_get_attr_short_name((mbedtls_asn1_buf *)oid,&pcStack308);
      if (iVar2 == 0) {
        uVar1 = snprintf(buf,__maxlen,"%s=",pcStack308);
      }
      else {
        uVar1 = snprintf(buf,__maxlen,"??=");
      }
      if (((int)uVar1 < 0) || (__maxlen <= uVar1)) {
        return -0x2980;
      }
      __maxlen_00 = __maxlen - uVar1;
      uVar5 = 0;
      while ((uVar5 < (oid->val).len && (uVar5 != 0xff))) {
        bVar3 = (oid->val).p[uVar5];
        if ((bVar3 < 0x20) || ((bVar3 == 0x7f || ((byte)(bVar3 + 0x7f) < 0x1f)))) {
          bVar3 = 0x3f;
        }
        *(byte *)((int)&short_name + uVar5) = bVar3;
        uVar5 = uVar5 + 1;
      }
      *(undefined *)((int)&short_name + uVar5) = 0;
      uVar5 = snprintf(buf + uVar1,__maxlen_00,"%s",&short_name);
      if ((int)uVar5 < 0) {
        return -0x2980;
      }
      if (__maxlen_00 <= uVar5) {
        return -0x2980;
      }
      __maxlen = __maxlen_00 - uVar5;
      buf = buf + uVar1 + uVar5;
      uVar4 = oid->next_merged;
    }
    oid = (mbedtls_x509_name *)oid->next;
  } while( true );
}



int mbedtls_x509_serial_gets(char *buf,size_t size,mbedtls_x509_buf *serial)

{
  size_t __maxlen;
  uint uVar1;
  undefined1 *puVar2;
  uint uVar3;
  uint uVar4;
  
