pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  uVar4 = serial->len;
  if (0x20 < uVar4) {
    uVar4 = 0x1c;
  }
  uVar3 = 0;
  __maxlen = size;
  do {
    if (uVar3 == uVar4) {
      if (serial->len != uVar3) {
        uVar4 = snprintf(buf,__maxlen,"....");
        if (((int)uVar4 < 0) || (__maxlen <= uVar4)) {
          return -0x2980;
        }
        __maxlen = __maxlen - uVar4;
      }
      return size - __maxlen;
    }
    if (((uVar3 != 0) || (uVar4 == 1)) || (*serial->p != '\0')) {
      puVar2 = (undefined1 *)0x23087a70;
      if (uVar4 - 1 <= uVar3) {
        puVar2 = &DAT_23088e60;
      }
      uVar1 = snprintf(buf,__maxlen,"%02X%s",(uint)serial->p[uVar3],puVar2);
      if ((int)uVar1 < 0) {
        return -0x2980;
      }
      if (__maxlen <= uVar1) {
        return -0x2980;
      }
      __maxlen = __maxlen - uVar1;
      buf = buf + uVar1;
    }
    uVar3 = uVar3 + 1;
  } while( true );
}



int mbedtls_x509_sig_alg_gets
              (char *buf,size_t size,mbedtls_x509_buf *sig_oid,mbedtls_pk_type_t pk_alg,
              mbedtls_md_type_t md_alg,void *sig_opts)

{
  int iVar1;
  uint uVar2;
  char *pcStack20;
  char *desc;
  
  pcStack20 = (char *)0x0;
  iVar1 = mbedtls_oid_get_sig_alg_desc((mbedtls_asn1_buf *)sig_oid,&pcStack20);
  if (iVar1 == 0) {
    uVar2 = snprintf(buf,size,"%s",pcStack20);
  }
  else {
    uVar2 = snprintf(buf,size,"???");
  }
  if (((int)uVar2 < 0) || (size <= uVar2)) {
    uVar2 = 0xffffd680;
  }
  return uVar2;
}



int mbedtls_x509_key_size_helper(char *buf,size_t buf_size,char *name)

{
  uint uVar1;
  int iVar2;
  
  uVar1 = snprintf(buf,buf_size,"%s key size",name);
  if (((int)uVar1 < 0) || (buf_size <= uVar1)) {
    iVar2 = -0x2980;
  }
  else {
    iVar2 = 0;
  }
  return iVar2;
}



int mbedtls_x509_time_is_past(mbedtls_x509_time *to)

{
  return 0;
}



undefined4 mbedtls_x509_time_is_future(void)

{
  return 0;
}



int mbedtls_base64_decode(uchar *dst,size_t dlen,size_t *olen,uchar *src,size_t slen)

{
  byte bVar1;
  byte bVar2;
  int iVar3;
  byte *pbVar4;
  uint uVar5;
  uchar *puVar6;
  uint uVar7;
  size_t sVar8;
  uint uVar9;
  int iVar10;
  
  uVar5 = 0;
  uVar7 = 0;
  sVar8 = 0;
  while (sVar8 < slen) {
    iVar3 = 0;
    uVar9 = sVar8;
    while( true ) {
      bVar1 = src[uVar9];
      sVar8 = slen;
      if (bVar1 != 0x20) break;
      uVar9 = uVar9 + 1;
      iVar3 = iVar3 + 1;
      if (slen == uVar9) goto LAB_2306c656;
    }
    if (slen == uVar9) break;
    bVar2 = bVar1;
    if ((1 < slen - uVar9) && (bVar1 == 0xd)) {
      bVar2 = (src + uVar9)[1];
    }
    if (bVar2 != 10) {
      if (iVar3 != 0) {
        return -0x2c;
      }
      if (bVar1 == 0x3d) {
        uVar5 = uVar5 + 1;
        if (2 < uVar5) {
          return -0x2c;
        }
      }
      else {
        if ((char)bVar1 < '\0') {
          return -0x2c;
        }
      }
      if (
          "\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f>\x7f\x7f\x7f?456789:;<=\x7f\x7f\x7f@\x7f\x7f\x7f"
          [bVar1] == 0x7f) {
        return -0x2c;
      }
      if ((
           "\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f>\x7f\x7f\x7f?456789:;<=\x7f\x7f\x7f@\x7f\x7f\x7f"
           [bVar1] < 0x40) && (uVar5 != 0)) {
        return -0x2c;
      }
      uVar7 = uVar7 + 1;
    }
    sVar8 = uVar9 + 1;
  }
LAB_2306c656:
  if (uVar7 == 0) {
    *olen = 0;
  }
  else {
    uVar5 = ((uVar7 >> 3) * 6 - uVar5) + ((uVar7 & 7) * 6 + 7 >> 3);
    if ((dst == (uchar *)0x0) || (dlen < uVar5)) {
      *olen = uVar5;
      return -0x2a;
    }
    pbVar4 = src + sVar8;
    uVar5 = 0;
    iVar10 = 3;
    iVar3 = 0;
    puVar6 = dst;
    while (pbVar4 != src) {
      uVar7 = (uint)*src - 10;
      if ((0x16 < (uVar7 & 0xff)) || ((0x400009U >> (uVar7 & 0x1f) & 1) == 0)) {
        uVar7 = uVar5 << 6;
        iVar3 = iVar3 + 1;
        iVar10 = iVar10 - (uint)(
                                 "\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f>\x7f\x7f\x7f?456789:;<=\x7f\x7f\x7f@\x7f\x7f\x7f"
                                 [(uint)*src] == 0x40);
        uVar5 = (uint)
                      "\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f\x7f>\x7f\x7f\x7f?456789:;<=\x7f\x7f\x7f@\x7f\x7f\x7f"
                      [(uint)*src] & 0x3f | uVar7;
        if ((iVar3 == 4) && (iVar3 = 0, iVar10 != 0)) {
          *puVar6 = (uchar)(uVar7 >> 0x10);
          if (iVar10 == 1) {
            puVar6 = puVar6 + 1;
          }
          else {
            puVar6[1] = (uchar)(uVar7 >> 8);
            if (iVar10 == 2) {
              puVar6 = puVar6 + 2;
            }
            else {
              puVar6[2] = (uchar)uVar5;
              puVar6 = puVar6 + 3;
            }
          }
        }
      }
      src = src + 1;
    }
    *(uchar **)olen = puVar6 + -(int)dst;
  }
  return 0;
}



double modf(double __x,double *__iptr)

{
  double *in_a1;
  double **in_a2;
  uint uVar1;
  uint uVar2;
  double in_fa0;
  DFtype DVar3;
  
  uVar1 = (int)in_a1 >> 0x14 & 0x7ff;
  uVar2 = uVar1 - 0x3ff;
  if ((int)uVar2 < 0x14) {
    if ((int)uVar2 < 0) {
      *in_a2 = (double *)0x0;
      in_a2[1] = (double *)((uint)in_a1 & 0x80000000);
      return in_fa0;
    }
    uVar1 = 0xfffff >> (uVar2 & 0x1f);
    if ((uVar1 & (uint)in_a1 | (uint)__iptr) != 0) {
      in_a1 = (double *)(~uVar1 & (uint)in_a1);
      __iptr = (double *)0x0;
LAB_2306c840:
      *in_a2 = __iptr;
      in_a2[1] = in_a1;
      DVar3 = __subdf3();
      return (double)DVar3;
    }
  }
  else {
    if (((int)uVar2 < 0x34) &&
       (uVar1 = 0xffffffff >> (uVar1 - 0x413 & 0x1f), (uVar1 & (uint)__iptr) != 0)) {
      __iptr = (double *)(~uVar1 & (uint)__iptr);
      goto LAB_2306c840;
    }
  }
  in_a2[1] = in_a1;
  *in_a2 = __iptr;
  return in_fa0;
}



