pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
DItype __lshrdi3(shift_count_type b)

{
  DItype in_fa0;
  
  return in_fa0;
}



int __clzsi2(USItype x)

{
  int iVar1;
  
  if (x < 0x10000) {
    iVar1 = (uint)(0xff < x) << 3;
  }
  else {
    iVar1 = 0x10;
    if (0xffffff < x) {
      iVar1 = 0x18;
    }
  }
  return (0x20 - iVar1) - (uint)""[x >> iVar1];
}



SFtype __floatundisf(void)

{
  USItype in_a0;
  SFtype SVar1;
  uint in_a1;
  
  if ((0x1fffff < in_a1) && ((in_a0 & 0x7ff) != 0)) {
    in_a0 = in_a0 & 0xfffff800 | 0x800;
  }
  __floatunsidf(in_a1);
  __muldf3();
  __floatunsidf(in_a0);
  __adddf3();
  SVar1 = __truncdfsf2();
  return SVar1;
}



// WARNING: Type propagation algorithm not settling

DItype __divdi3(void)

{
  DItype in_fa0;
  
  return in_fa0;
}



// WARNING: Type propagation algorithm not settling

DItype __moddi3(void)

{
  DItype in_fa0;
  
  return in_fa0;
}



// WARNING: Type propagation algorithm not settling

UDItype __udivdi3(void)

{
  UDItype in_fa0;
  
  return in_fa0;
}



// WARNING: Type propagation algorithm not settling

UDItype __umoddi3(void)

{
  UDItype in_fa0;
  
  return in_fa0;
}


/*
Unable to decompile '__adddf3'
Cause: Exception while decompiling 2306daa4: Decompiler process died

*/

/*
Unable to decompile '__divdf3'
Cause: 
Low-level Error: Assignment to constant at r0x2306ec28
*/


__gcc_CMPtype __eqdf2(void)

{
  uint in_a0;
  uint in_a1;
  uint in_a2;
  uint in_a3;
  uint uVar1;
  uint uVar2;
  uint uVar3;
  
  uVar1 = in_a1 >> 0x14 & 0x7ff;
  uVar2 = in_a1 & 0xfffff;
  uVar3 = in_a3 >> 0x14 & 0x7ff;
  if (uVar1 == 0x7ff) {
    if ((uVar2 | in_a0) != 0) {
      return 1;
    }
    if (uVar3 != 0x7ff) {
      return 1;
    }
  }
  else {
    if (uVar3 != 0x7ff) goto LAB_2306eef8;
  }
  if ((in_a3 & 0xfffff | in_a2) != 0) {
    return 1;
  }
LAB_2306eef8:
  if (((uVar1 == uVar3) && (uVar2 == (in_a3 & 0xfffff))) && (in_a2 == in_a0)) {
    if (in_a1 >> 0x1f == in_a3 >> 0x1f) {
      return 0;
    }
    if (uVar1 == 0) {
      return (uint)((uVar2 | in_a2) != 0);
    }
  }
  return 1;
}



__gcc_CMPtype __gedf2(void)

{
  bool bVar1;
  uint in_a0;
  uint in_a1;
  int iVar2;
  uint in_a2;
  uint in_a3;
  int iVar3;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  
  uVar6 = in_a1 >> 0x14 & 0x7ff;
  uVar7 = in_a1 & 0xfffff;
  uVar5 = in_a3 & 0xfffff;
  iVar2 = -((int)in_a1 >> 0x1f);
  uVar4 = in_a3 >> 0x14 & 0x7ff;
  iVar3 = -((int)in_a3 >> 0x1f);
  if (uVar6 == 0x7ff) {
    if ((uVar7 | in_a0) != 0) {
      return -2;
    }
    if (uVar4 == 0x7ff) {
LAB_2306efbc:
      if ((uVar5 | in_a2) != 0) {
        return -2;
      }
      goto LAB_2306efc4;
    }
LAB_2306f048:
    if (uVar4 == 0) {
      bVar1 = false;
LAB_2306efd4:
      if ((uVar5 | in_a2) == 0) {
        if (bVar1) {
          return 0;
        }
        goto LAB_2306efe8;
      }
      goto LAB_2306efdc;
    }
  }
  else {
    if (uVar4 == 0x7ff) goto LAB_2306efbc;
LAB_2306efc4:
    if (uVar6 != 0) goto LAB_2306f048;
    bVar1 = (uVar7 | in_a0) == 0;
    if (uVar4 == 0) goto LAB_2306efd4;
LAB_2306efdc:
    if (bVar1) {
      if (iVar3 != 0) {
        return iVar3;
      }
      return -1;
    }
  }
  if ((iVar2 == iVar3) && (uVar6 <= uVar4)) {
    if (uVar4 <= uVar6) {
      if (uVar5 < uVar7) goto LAB_2306efe8;
      if (uVar7 == uVar5) {
        if (in_a2 < in_a0) goto LAB_2306efe8;
        if (in_a2 <= in_a0) {
          return 0;
        }
      }
      else {
        if (uVar5 <= uVar7) {
          return 0;
        }
      }
    }
    if (iVar2 == 0) {
      return -1;
    }
    return iVar2;
  }
LAB_2306efe8:
  if (iVar2 != 0) {
    return -1;
  }
  return 1;
}



__gcc_CMPtype __ledf2(void)

{
  bool bVar1;
  uint in_a0;
  uint in_a1;
  int iVar2;
  uint in_a2;
  uint in_a3;
  int iVar3;
  uint uVar4;
  uint uVar5;
  uint uVar6;
  uint uVar7;
  
  uVar6 = in_a1 >> 0x14 & 0x7ff;
  uVar7 = in_a1 & 0xfffff;
  uVar5 = in_a3 & 0xfffff;
  iVar2 = -((int)in_a1 >> 0x1f);
  uVar4 = in_a3 >> 0x14 & 0x7ff;
  iVar3 = -((int)in_a3 >> 0x1f);
  if (uVar6 == 0x7ff) {
    if ((uVar7 | in_a0) != 0) {
      return 2;
    }
    if (uVar4 == 0x7ff) {
LAB_2306f0a8:
      if ((uVar5 | in_a2) != 0) {
        return 2;
      }
      goto LAB_2306f0b0;
    }
LAB_2306f134:
    if (uVar4 == 0) {
      bVar1 = false;
LAB_2306f0c0:
      if ((uVar5 | in_a2) == 0) {
        if (bVar1) {
          return 0;
        }
        goto LAB_2306f0d4;
      }
      goto LAB_2306f0c8;
    }
  }
  else {
    if (uVar4 == 0x7ff) goto LAB_2306f0a8;
LAB_2306f0b0:
    if (uVar6 != 0) goto LAB_2306f134;
    bVar1 = (uVar7 | in_a0) == 0;
    if (uVar4 == 0) goto LAB_2306f0c0;
LAB_2306f0c8:
    if (bVar1) {
      if (iVar3 != 0) {
        return iVar3;
      }
      return -1;
    }
  }
  if ((iVar2 == iVar3) && (uVar6 <= uVar4)) {
    if (uVar4 <= uVar6) {
      if (uVar5 < uVar7) goto LAB_2306f0d4;
      if (uVar7 == uVar5) {
        if (in_a2 < in_a0) goto LAB_2306f0d4;
        if (in_a2 <= in_a0) {
          return 0;
        }
      }
      else {
        if (uVar5 <= uVar7) {
          return 0;
        }
      }
    }
    if (iVar2 == 0) {
      return -1;
    }
    return iVar2;
  }
LAB_2306f0d4:
  if (iVar2 != 0) {
    return -1;
  }
  return 1;
}


/*
Unable to decompile '__muldf3'
Cause: 
Low-level Error: Assignment to constant at r0x2306f3e8
*/

/*
Unable to decompile '__subdf3'
Cause: Exception while decompiling 2306f8dc: Decompiler process died

*/


SItype __fixdfsi(void)

{
  uint in_a0;
  uint in_a1;
  uint uVar1;
  uint uVar2;
  
  uVar1 = in_a1 >> 0x14 & 0x7ff;
  if (uVar1 < 0x3ff) {
    if ((uVar1 != 0) || (uVar2 = in_a1 & 0xfffff | in_a0, uVar2 != 0)) {
      uVar2 = 0;
    }
  }
  else {
    if (uVar1 < 0x41e) {
      uVar2 = in_a1 & 0xfffff | 0x100000;
      if ((int)(0x433 - uVar1) < 0x20) {
        uVar2 = uVar2 << (uVar1 - 0x413 & 0x1f) | in_a0 >> (0x433 - uVar1 & 0x1f);
      }
      else {
        uVar2 = uVar2 >> (0x413 - uVar1 & 0x1f);
      }
      if (-((int)in_a1 >> 0x1f) != 0) {
        uVar2 = -uVar2;
      }
    }
    else {
      uVar2 = -((int)in_a1 >> 0x1f) + 0x7fffffff;
    }
  }
  return uVar2;
}



USItype __fixunsdfsi(void)

{
  uint in_a0;
  USItype UVar1;
  uint in_a1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  
  uVar3 = in_a1 >> 0x14 & 0x7ff;
  if (uVar3 < 0x3ff) {
    if ((uVar3 == 0) && ((in_a1 & 0xfffff | in_a0) == 0)) {
      return 0;
    }
    UVar1 = 0;
  }
  else {
    if ((int)in_a1 < 0) {
      UVar1 = 0;
    }
    else {
      if (uVar3 < 0x41f) {
        uVar5 = in_a1 & 0xfffff | 0x100000;
        uVar2 = 0x433 - uVar3;
        if ((int)uVar2 < 0x20) {
          uVar4 = in_a0 << (uVar3 - 0x413 & 0x1f);
          UVar1 = uVar5 << (uVar3 - 0x413 & 0x1f) | in_a0 >> (uVar2 & 0x1f);
        }
        else {
          uVar4 = 0;
          if (uVar2 != 0x20) {
            uVar4 = uVar5 << (uVar3 - 0x3f3 & 0x1f);
          }
          uVar4 = uVar4 | in_a0;
          UVar1 = uVar5 >> (0x413 - uVar3 & 0x1f);
        }
        if (uVar4 == 0) {
          return UVar1;
        }
      }
      else {
        UVar1 = 0xffffffff;
      }
    }
  }
  return UVar1;
}



DFtype __floatsidf(SItype i)

{
  DFtype in_fa0;
  
  if (i != 0) {
    __clzsi2((i >> 0x1f ^ i) - (i >> 0x1f));
  }
  return in_fa0;
}



DFtype __floatunsidf(USItype i)

{
  DFtype in_fa0;
  
  if (i != 0) {
    __clzsi2(i);
  }
  return in_fa0;
}


