pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
/*
Unable to decompile '__extendsfdf2'
Cause: Exception while decompiling 23070708: Decompiler process died

*/


SFtype __truncdfsf2(void)

{
  uint uVar1;
  SFtype in_a0;
  uint in_a1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  uint uVar5;
  int iVar6;
  int in_frm;
  
  uVar1 = in_a1 >> 0x14 & 0x7ff;
  uVar3 = (uint)in_a0 >> 0x1d | (in_a1 & 0xfffff) << 3;
  uVar5 = (int)in_a0 << 3;
  if ((uVar1 + 1 & 0x7fe) == 0) {
    uVar3 = uVar3 | uVar5;
    if (uVar1 == 0) {
      uVar1 = (uint)(uVar3 != 0);
LAB_23070968:
      if (uVar1 == 0) {
        return in_a0;
      }
LAB_2307096c:
      if (((((uVar1 * 2 & 7) != 0) && (in_frm != 2)) && (in_frm != 3)) && (in_frm == 0)) {
        in_a0 = 0.00000000;
      }
    }
    else {
      if (uVar3 == 0) {
        return in_a0;
      }
      uVar1 = 0;
    }
  }
  else {
    iVar6 = uVar1 - 0x380;
    if (0xfe < iVar6) {
      if (in_frm == 0) {
        return in_a0;
      }
      if (in_frm == 3) {
        if (-1 < (int)in_a1) {
          return in_a0;
        }
      }
      else {
        if ((in_frm == 2) && ((int)in_a1 < 0)) {
          return in_a0;
        }
      }
      goto LAB_23070878;
    }
    if (iVar6 < 1) {
      if (-0x18 < iVar6) {
        uVar3 = uVar3 | 0x800000;
        uVar2 = 0x1e - iVar6;
        if ((int)uVar2 < 0x20) {
          uVar1 = uVar5 >> (uVar2 & 0x1f) |
                  (uint)(uVar5 << (uVar1 - 0x37e & 0x1f) != 0) | uVar3 << (uVar1 - 0x37e & 0x1f);
        }
        else {
          in_a0 = 0.00000000;
          uVar4 = 0;
          if (uVar2 != 0x20) {
            uVar4 = uVar3 << (uVar1 - 0x35e & 0x1f);
          }
          uVar1 = uVar3 >> (-iVar6 - 2U & 0x1f) | (uint)((uVar4 | uVar5) != 0);
        }
        goto LAB_23070968;
      }
      uVar1 = 1;
      goto LAB_2307096c;
    }
    in_a0 = (SFtype)(uint)(((uint)in_a0 & 0x3ffffff) != 0);
    uVar1 = (uint)in_a0 | uVar5 >> 0x1d;
  }
  if ((uVar1 & 7) == 0) {
    return in_a0;
  }
LAB_23070878:
  if (((in_frm != 2) && (in_frm != 3)) && (in_frm == 0)) {
    in_a0 = 0.00000000;
  }
  return in_a0;
}



int atoi(char *__nptr)

{
  long lVar1;
  
  lVar1 = strtol(__nptr,(char **)0x0,10);
  return lVar1;
}



void _atoi_r(void)

{
  _strtol_r(0,10);
  return;
}



undefined * __errno(void)

{
  return _impure_ptr;
}



void * memchr(void *__s,int __c,size_t __n)

{
  byte bVar1;
  uint uVar2;
  uint uVar3;
  uint *puVar4;
  uint uVar5;
  
  uVar5 = __c & 0xff;
  if (((uint)__s & 3) != 0) {
    if (__n == 0) {
      return (void *)0x0;
    }
    bVar1 = *(byte *)__s;
    __n = __n - 1;
    while( true ) {
      if ((uint)bVar1 == uVar5) {
        return (uint *)__s;
      }
      __s = (void *)((int)__s + 1);
      if (((uint)__s & 3) == 0) break;
      __n = __n - 1;
      if (__n == 0xffffffff) {
        return (void *)0x0;
      }
      bVar1 = *(byte *)__s;
    }
  }
  if (3 < __n) {
    uVar2 = (__c & 0xffU) << 8 | __c & 0xffU;
    do {
      uVar3 = (uVar2 << 0x10 | uVar2) ^ *(uint *)__s;
      if ((uVar3 + 0xfefefeff & ~uVar3 & 0x80808080) != 0) goto LAB_23070b64;
      __n = __n - 4;
      __s = (uint *)__s + 1;
    } while (3 < __n);
  }
  if (__n != 0) {
LAB_23070b64:
    if ((uint)*(byte *)__s == uVar5) {
      return (uint *)__s;
    }
    puVar4 = (uint *)((int)__s + __n);
    while (__s = (void *)((int)__s + 1), puVar4 != (uint *)__s) {
      if ((uint)*(byte *)__s == uVar5) {
        return (uint *)__s;
      }
    }
  }
  return (void *)0x0;
}



int memcmp(void *__s1,void *__s2,size_t __n)

{
  int *piVar1;
  uint uVar2;
  uint uVar3;
  
  if (3 < __n) {
    if ((((uint)__s1 | (uint)__s2) & 3) != 0) goto LAB_23070c30;
    do {
      if (*(int *)__s1 != *(int *)__s2) goto LAB_23070c30;
      __n = __n - 4;
      __s1 = (int *)__s1 + 1;
      __s2 = (int *)__s2 + 1;
    } while (3 < __n);
  }
  if (__n == 0) {
    return 0;
  }
LAB_23070c30:
  uVar3 = (uint)*(byte *)__s1;
  uVar2 = (uint)*(byte *)__s2;
  if (uVar3 == uVar2) {
    piVar1 = (int *)((int)__s1 + __n);
    do {
      __s1 = (void *)((int)__s1 + 1);
      __s2 = (void *)((int)__s2 + 1);
      if ((int *)__s1 == piVar1) {
        return 0;
      }
      uVar3 = (uint)*(byte *)__s1;
      uVar2 = (uint)*(byte *)__s2;
    } while (uVar3 == uVar2);
  }
  return uVar3 - uVar2;
}



void * memcpy(void *__dest,void *__src,size_t __n)

{
  undefined uVar1;
  undefined4 uVar2;
  undefined4 uVar3;
  undefined4 *puVar4;
  undefined4 *puVar5;
  undefined4 uVar6;
  undefined4 *puVar7;
  uint uVar8;
  undefined4 *puVar9;
  undefined4 *puVar10;
  int iVar11;
  undefined4 uVar12;
  undefined4 *puVar13;
  undefined4 uVar14;
  undefined4 uVar15;
  undefined4 uVar16;
  undefined4 uVar17;
  
  puVar13 = (undefined4 *)((int)__dest + __n);
  if (((((uint)__src ^ (uint)__dest) & 3) == 0) && (3 < __n)) {
    uVar8 = (uint)__dest & 3;
    puVar5 = (undefined4 *)__dest;
    while (puVar4 = (undefined4 *)__src, puVar7 = puVar5, uVar8 != 0) {
      puVar7 = (undefined4 *)((int)puVar5 + 1);
      *(undefined *)puVar5 = *(undefined *)__src;
      puVar4 = (undefined4 *)((int)__src + 1);
      if (((uint)puVar7 & 3) == 0) break;
      uVar8 = (uint)(undefined4 *)((int)puVar5 + 2) & 3;
      *(undefined *)((int)puVar5 + 1) = *(undefined *)puVar4;
      __src = (void *)((int)__src + 2);
      puVar5 = (undefined4 *)((int)puVar5 + 2);
    }
    puVar5 = (undefined4 *)((uint)puVar13 & 0xfffffffc);
    __src = puVar4;
    while (puVar7 < puVar5 + -8) {
      uVar2 = ((undefined4 *)__src)[1];
      uVar17 = ((undefined4 *)__src)[2];
      uVar16 = ((undefined4 *)__src)[3];
      uVar15 = ((undefined4 *)__src)[4];
      uVar14 = ((undefined4 *)__src)[5];
      uVar3 = ((undefined4 *)__src)[6];
      uVar12 = ((undefined4 *)__src)[7];
      *puVar7 = *(undefined4 *)__src;
      uVar6 = ((undefined4 *)__src)[8];
      puVar7[1] = uVar2;
      puVar7[2] = uVar17;
      puVar7[3] = uVar16;
      puVar7[4] = uVar15;
      puVar7[5] = uVar14;
      puVar7[6] = uVar3;
      puVar7[7] = uVar12;
      puVar7[8] = uVar6;
      __src = (undefined4 *)__src + 9;
      puVar7 = puVar7 + 9;
    }
    puVar4 = (undefined4 *)__src;
    puVar9 = puVar7;
    if (puVar7 < puVar5) {
      do {
        puVar10 = puVar9 + 1;
        *puVar9 = *puVar4;
        puVar4 = puVar4 + 1;
        puVar9 = puVar10;
      } while (puVar10 < puVar5);
      iVar11 = ((int)puVar5 + (-1 - (int)puVar7) & 0xfffffffcU) + 4;
      puVar7 = (undefined4 *)((int)puVar7 + iVar11);
      __src = (void *)((int)__src + iVar11);
    }
    if (puVar7 < puVar13) {
LAB_23070cf4:
      do {
        uVar1 = *(undefined *)__src;
        puVar5 = (undefined4 *)((int)puVar7 + 1);
        __src = (void *)((int)__src + 1);
        *(undefined *)puVar7 = uVar1;
        puVar7 = puVar5;
      } while (puVar5 < puVar13);
      return __dest;
    }
  }
  else {
    puVar7 = (undefined4 *)__dest;
    if (__dest < puVar13) goto LAB_23070cf4;
  }
  return __dest;
}



void * memmove(void *__dest,void *__src,size_t __n)

{
  int iVar1;
  undefined *puVar2;
  undefined4 *puVar3;
  undefined *puVar4;
  undefined4 *puVar5;
  undefined4 *puVar6;
  uint uVar7;
  
  if ((__src < __dest) && (puVar4 = (undefined *)((int)__src + __n), __dest < puVar4)) {
    puVar2 = (undefined *)((int)__dest + __n);
    if (__n == 0) {
      return __dest;
    }
    do {
      puVar4 = puVar4 + -1;
      puVar2 = puVar2 + -1;
      *puVar2 = *puVar4;
    } while ((undefined *)__src != puVar4);
    return __dest;
  }
  uVar7 = __n;
  puVar5 = (undefined4 *)__dest;
  if (0xf < __n) {
    if ((((uint)__src | (uint)__dest) & 3) != 0) {
      iVar1 = __n - 1;
      goto LAB_23070dd8;
    }
    iVar1 = (__n - 0x10 & 0xfffffff0) + 0x10;
    puVar3 = (undefined4 *)__src;
    puVar6 = (undefined4 *)__dest;
    do {
      puVar5 = puVar6 + 4;
      *puVar6 = *puVar3;
      puVar6[1] = puVar3[1];
      puVar6[2] = puVar3[2];
      puVar6[3] = puVar3[3];
      puVar3 = puVar3 + 4;
      puVar6 = puVar5;
    } while ((undefined4 *)((int)__dest + iVar1) != puVar5);
    __src = (void *)((int)__src + iVar1);
    uVar7 = __n & 0xf;
    puVar3 = (undefined4 *)__src;
    if ((__n & 0xc) != 0) {
      do {
        puVar3 = puVar3 + 1;
        *puVar6 = *puVar3;
        puVar3 = puVar3;
        puVar6 = puVar6 + 1;
      } while (3 < (int)__src + (uVar7 - (int)puVar3));
      iVar1 = (uVar7 - 4 & 0xfffffffc) + 4;
      __src = (void *)((int)__src + iVar1);
      uVar7 = __n & 3;
      puVar5 = (undefined4 *)((int)puVar5 + iVar1);
    }
  }
  iVar1 = uVar7 - 1;
  if (uVar7 == 0) {
    return __dest;
  }
LAB_23070dd8:
  puVar3 = puVar5;
  do {
    puVar6 = (undefined4 *)((int)puVar3 + 1);
    *(undefined *)puVar3 = *(undefined *)__src;
    __src = (undefined4 *)((int)__src + 1);
    puVar3 = puVar6;
  } while (puVar6 != (undefined4 *)((int)puVar5 + iVar1 + 1));
  return __dest;
}



void * memset(void *__s,int __c,size_t __n)

{
  uint uVar1;
  uint extraout_a1;
  uint *puVar2;
  uint *puVar3;
  void *pvVar4;
  uint uVar5;
  
  uVar1 = 0xf;
  if (0xf < __n) {
    uVar5 = (uint)__s & 0xf;
    puVar3 = (uint *)__s;
    if (uVar5 != 0) {
      pvVar4 = __s;
      __s = (void *)(*(code *)(uVar5 * 4 + 0x23070f0c))();
      puVar3 = (uint *)((int)pvVar4 - (uVar5 - 0x10));
      __n = __n + (uVar5 - 0x10);
      __c = extraout_a1;
      if (__n <= uVar1) goto LAB_23070efc;
    }
    if (__c != 0) {
      uVar5 = __c & 0xffU | (__c & 0xffU) << 8;
      __c = uVar5 | uVar5 << 0x10;
    }
    uVar5 = __n & 0xfffffff0;
    __n = __n & 0xf;
    puVar2 = (uint *)(uVar5 + (int)puVar3);
    do {
      *puVar3 = __c;
      puVar3[1] = __c;
      puVar3[2] = __c;
      puVar3[3] = __c;
      puVar3 = puVar3 + 4;
    } while (puVar3 < puVar2);
    if (__n == 0) {
      return __s;
    }
  }
LAB_23070efc:
                    // WARNING: Could not recover jumptable at 0x23070f0c. Too many branches
                    // WARNING: Treating indirect jump as call
  pvVar4 = (void *)(*(code *)(&UNK_23070f10 + (uVar1 - __n) * 4))();
  return pvVar4;
}



char * strchr(char *__s,int __c)

{
  uint uVar1;
  uint uVar2;
  uint uVar3;
  uint uVar4;
  
  uVar3 = __c & 0xff;
  if (uVar3 == 0) {
    if (((uint)__s & 3) != 0) {
      if (*__s == '\0') {
        return __s;
      }
      while (__s = (char *)((int)__s + 1), ((uint)__s & 3) != 0) {
        if (*__s == '\0') {
          return (char *)(uint *)__s;
        }
      }
    }
    uVar3 = *(uint *)__s + 0xfefefeff & ~*(uint *)__s;
    while ((uVar3 & 0x80808080) == 0) {
      __s = (char *)((uint *)__s + 1);
      uVar3 = *(uint *)__s + 0xfefefeff & ~*(uint *)__s;
    }
    if (*__s != '\0') {
      do {
        __s = (char *)((int)__s + 1);
      } while (*__s != '\0');
      return __s;
    }
    return (char *)(uint *)__s;
  }
  if (((uint)__s & 3) != 0) {
    if (*__s == 0) {
      return (char *)0x0;
    }
    if (uVar3 == (uint)(byte)*__s) {
      return __s;
    }
    while (__s = (char *)((int)__s + 1), ((uint)__s & 3) != 0) {
      if (*__s == 0) {
        return (char *)0x0;
      }
      if ((uint)(byte)*__s == uVar3) {
        return (char *)(uint *)__s;
      }
    }
  }
  uVar1 = __c & 0xffU | (__c & 0xffU) << 8;
  uVar4 = *(uint *)__s;
  uVar1 = uVar1 << 0x10 | uVar1;
  uVar2 = uVar1 ^ uVar4;
  uVar2 = ~uVar4 & uVar4 + 0xfefefeff | ~uVar2 & uVar2 + 0xfefefeff;
  while ((uVar2 & 0x80808080) == 0) {
    __s = (char *)((uint *)__s + 1);
    uVar4 = *(uint *)__s;
    uVar2 = uVar4 ^ uVar1;
    uVar2 = uVar4 + 0xfefefeff & ~uVar4 | uVar2 + 0xfefefeff & ~uVar2;
  }
  if (*__s != 0) {
    if (uVar3 == (uint)(byte)*__s) {
      return (char *)(uint *)__s;
    }
    while( true ) {
      __s = (char *)((int)__s + 1);
      if (*__s == 0) break;
      if ((uint)(byte)*__s == uVar3) {
        return __s;
      }
    }
  }
  return (char *)0x0;
}



int strcmp(char *__s1,char *__s2)

{
  byte bVar1;
  byte bVar2;
  uint uVar3;
  uint uVar4;
  
  if ((((uint)__s1 | (uint)__s2) & 3) == 0) {
    do {
      uVar3 = *(uint *)__s1;
      uVar4 = *(uint *)__s2;
      if (((uVar3 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar3 | 0x7f7f7f7f) != 0xffffffff) {
LAB_23071234:
        if (uVar3 == uVar4) {
          return 0;
        }
        goto LAB_2307120c;
      }
      if (uVar3 != uVar4) break;
      uVar3 = ((uint *)__s1)[1];
      uVar4 = ((uint *)__s2)[1];
      if (((uVar3 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar3 | 0x7f7f7f7f) != 0xffffffff) {
        __s1 = (char *)((uint *)__s1 + 1);
        __s2 = (char *)((uint *)__s2 + 1);
        goto LAB_23071234;
      }
      if (uVar3 != uVar4) break;
      uVar3 = ((uint *)__s1)[2];
      uVar4 = ((uint *)__s2)[2];
      if (((uVar3 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar3 | 0x7f7f7f7f) != 0xffffffff) {
        __s1 = (char *)((uint *)__s1 + 2);
        __s2 = (char *)((uint *)__s2 + 2);
        if (uVar3 == uVar4) {
          return 0;
        }
        goto LAB_2307120c;
      }
      if (uVar3 != uVar4) break;
      uVar3 = ((uint *)__s1)[3];
      uVar4 = ((uint *)__s2)[3];
      if (((uVar3 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar3 | 0x7f7f7f7f) != 0xffffffff) {
        __s1 = (char *)((uint *)__s1 + 3);
        __s2 = (char *)((uint *)__s2 + 3);
        if (uVar3 == uVar4) {
          return 0;
        }
        goto LAB_2307120c;
      }
      if (uVar3 != uVar4) break;
      uVar3 = ((uint *)__s1)[4];
      uVar4 = ((uint *)__s2)[4];
      if (((uVar3 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar3 | 0x7f7f7f7f) != 0xffffffff) {
        __s1 = (char *)((uint *)__s1 + 4);
        __s2 = (char *)((uint *)__s2 + 4);
        if (uVar3 == uVar4) {
          return 0;
        }
        goto LAB_2307120c;
      }
      __s1 = (char *)((uint *)__s1 + 5);
      __s2 = (char *)((uint *)__s2 + 5);
    } while (uVar3 == uVar4);
    if (uVar3 << 0x10 == uVar4 << 0x10) {
      uVar3 = uVar3 >> 0x10;
      uVar4 = uVar4 >> 0x10;
      if ((uVar3 - uVar4 & 0xff) == 0) {
        return uVar3 - uVar4;
      }
    }
    else {
      uVar3 = uVar3 & 0xffff;
      uVar4 = uVar4 & 0xffff;
      if ((uVar3 - uVar4 & 0xff) == 0) {
        return uVar3 - uVar4;
      }
    }
    return (uVar3 & 0xff) - (uVar4 & 0xff);
  }
LAB_2307120c:
  do {
    bVar1 = *__s1;
    bVar2 = *__s2;
    __s1 = (char *)((int)__s1 + 1);
    __s2 = (char *)((int)__s2 + 1);
    if ((uint)bVar1 != (uint)bVar2) break;
  } while (bVar1 != 0);
  return (uint)bVar1 - (uint)bVar2;
}



char * strcpy(char *__dest,char *__src)

{
  char cVar1;
  char cVar2;
  char cVar3;
  uint *puVar4;
  uint uVar5;
  uint uVar6;
  char *pcVar7;
  
  pcVar7 = __dest;
  if ((((uint)__dest | (uint)__src) & 3) != 0) {
    do {
      cVar1 = *__src;
      __src = __src + 1;
      *pcVar7 = cVar1;
      pcVar7 = pcVar7 + 1;
    } while (cVar1 != '\0');
    return __dest;
  }
  uVar5 = *(uint *)__src;
  uVar6 = (uVar5 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar5;
  puVar4 = (uint *)__dest;
  while ((uVar6 | 0x7f7f7f7f) == 0xffffffff) {
    __src = (char *)((uint *)__src + 1);
    *puVar4 = uVar5;
    uVar5 = *(uint *)__src;
    uVar6 = (uVar5 & 0x7f7f7f7f) + 0x7f7f7f7f | uVar5;
    puVar4 = puVar4 + 1;
  }
  cVar1 = *__src;
  cVar2 = *(char *)((int)__src + 1);
  cVar3 = *(char *)((int)__src + 2);
  *(char *)puVar4 = cVar1;
  if (((cVar1 != '\0') && (*(char *)((int)puVar4 + 1) = cVar2, cVar2 != '\0')) &&
     (*(char *)((int)puVar4 + 2) = cVar3, cVar3 != '\0')) {
    *(char *)((int)puVar4 + 3) = '\0';
    return __dest;
  }
  return __dest;
}



size_t strlen(char *__s)

{
  char cVar1;
  uint *puVar2;
  uint *puVar3;
  uint uVar4;
  
  uVar4 = (uint)__s & 3;
  puVar3 = (uint *)__s;
  while (uVar4 != 0) {
    cVar1 = *(char *)puVar3;
    puVar3 = (uint *)((int)puVar3 + 1);
    uVar4 = (uint)puVar3 & 3;
    if (cVar1 == '\0') {
      return (int)puVar3 + (-1 - (int)__s);
    }
  }
  do {
    puVar2 = puVar3;
    puVar3 = puVar2 + 1;
  } while (((*puVar2 & 0x7f7f7f7f) + 0x7f7f7f7f | *puVar2 | 0x7f7f7f7f) == 0xffffffff);
  puVar3 = (uint *)((int)(puVar2 + 1) - (int)__s);
  if (*(char *)puVar2 != '\0') {
    if (*(char *)((int)puVar2 + 1) != '\0') {
      return (int)puVar3 + ((uint)(*(char *)((int)puVar2 + 2) != '\0') - 2);
    }
    return (size_t)((int)puVar3 + -3);
  }
  return (size_t)(puVar3 + -1);
}



int strncmp(char *__s1,char *__s2,size_t __n)

{
  int iVar1;
  uint *puVar2;
  uint uVar3;
  uint uVar4;
  
  if (__n == 0) {
    return 0;
  }
  if (((((uint)__s1 | (uint)__s2) & 3) == 0) && (3 < __n)) {
    uVar4 = *(uint *)__s1;
    if (uVar4 != *(uint *)__s2) {
LAB_23071494:
      uVar3 = (uint)(byte)*__s1;
      uVar4 = (uint)(byte)*__s2;
      iVar1 = __n - 1;
      if (uVar4 == uVar3) goto LAB_23071458;
      goto LAB_23071484;
    }
    __n = __n - 4;
    if (__n == 0) {
      return 0;
    }
    uVar4 = uVar4 + 0xfefefeff & ~uVar4;
    while( true ) {
      if ((uVar4 & 0x80808080) != 0) {
        return 0;
      }
      __s1 = (char *)((uint *)__s1 + 1);
      __s2 = (char *)((uint *)__s2 + 1);
      if (__n < 4) break;
      uVar3 = *(uint *)__s1;
      uVar4 = uVar3 + 0xfefefeff & ~uVar3;
      if (uVar3 != *(uint *)__s2) goto LAB_23071494;
      __n = __n - 4;
      if (__n == 0) {
        return 0;
      }
    }
  }
  uVar3 = (uint)(byte)*__s1;
  uVar4 = (uint)(byte)*__s2;
  iVar1 = __n - 1;
  if (uVar4 == uVar3) {
    if (iVar1 == 0) {
      return 0;
    }
LAB_23071458:
    if (uVar3 != 0) {
      puVar2 = (uint *)((int)__s1 + iVar1);
      do {
        __s1 = (char *)((int)__s1 + 1);
        __s2 = (char *)((int)__s2 + 1);
        uVar3 = (uint)(byte)*__s1;
        uVar4 = (uint)(byte)*__s2;
        if (uVar3 != uVar4) goto LAB_23071484;
      } while ((puVar2 != (uint *)__s1) && (*__s1 != 0));
    }
    return 0;
  }
LAB_23071484:
  return uVar3 - uVar4;
}



char * strncpy(char *__dest,char *__src,size_t __n)

{
  char cVar1;
  uint uVar2;
  uint *puVar3;
  uint *puVar4;
  char *pcVar5;
  char *pcVar6;
  char *pcVar7;
  int iVar8;
  
