pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
  puVar3 = (uint *)__dest;
  if (((((uint)__src | (uint)__dest) & 3) == 0) && (puVar4 = (uint *)__dest, 3 < __n)) {
    do {
      uVar2 = *(uint *)__src;
      if ((uVar2 + 0xfefefeff & ~uVar2 & 0x80808080) != 0) goto LAB_230714c4;
      puVar3 = puVar4 + 1;
      __n = __n - 4;
      *puVar4 = uVar2;
      __src = (char *)((uint *)__src + 1);
      puVar4 = puVar3;
    } while (3 < __n);
  }
  puVar4 = puVar3;
  if (__n != 0) {
LAB_230714c4:
    cVar1 = *__src;
    *(char *)puVar4 = cVar1;
    pcVar5 = (char *)((int)puVar4 + 1);
    iVar8 = __n - 1;
    if (cVar1 != '\0') {
      pcVar6 = pcVar5;
      do {
        __src = (char *)((int)__src + 1);
        iVar8 = (__n - 1) - (int)pcVar6;
        if (pcVar6 == (char *)((int)puVar4 + __n)) {
          return __dest;
        }
        cVar1 = *__src;
        pcVar5 = pcVar6 + 1;
        *pcVar6 = cVar1;
        pcVar6 = pcVar5;
        iVar8 = (int)puVar4 + iVar8;
      } while (cVar1 != '\0');
    }
    pcVar6 = pcVar5;
    if (iVar8 == 0) {
      return __dest;
    }
    do {
      pcVar7 = pcVar6 + 1;
      *pcVar6 = '\0';
      pcVar6 = pcVar7;
    } while (pcVar7 != pcVar5 + iVar8);
  }
  return __dest;
}



size_t strnlen(char *__string,size_t __maxlen)

{
  char *pcVar1;
  
  if (__maxlen != 0) {
    if (*__string == '\0') {
      __maxlen = 0;
    }
    else {
      pcVar1 = __string;
      while (pcVar1 = pcVar1 + 1, pcVar1 != __string + __maxlen) {
        if (*pcVar1 == '\0') {
          return (size_t)(pcVar1 + -(int)__string);
        }
      }
    }
  }
  return __maxlen;
}



char * strrchr(char *__s,int __c)

{
  char *pcVar1;
  char *pcVar2;
  
  if (__c != 0) {
    pcVar2 = (char *)0x0;
    while (pcVar1 = strchr(__s,__c), pcVar1 != (char *)0x0) {
      __s = pcVar1 + 1;
      pcVar2 = pcVar1;
    }
    return pcVar2;
  }
  pcVar2 = strchr(__s,0);
  return pcVar2;
}



byte * two_way_long_needle(int param_1,int param_2,byte *param_3,byte *param_4)

{
  byte bVar1;
  byte bVar2;
  int iVar3;
  size_t sVar4;
  byte *pbVar5;
  byte *pbVar6;
  byte *__n;
  byte *pbVar7;
  byte *pbVar8;
  byte **ppbVar9;
  byte *pbVar10;
  byte *pbVar11;
  byte *pbVar12;
  byte *pbVar13;
  byte *pbVar14;
  byte *local_440 [256];
  byte *apbStack64 [3];
  
  pbVar13 = (byte *)0x1;
  pbVar6 = (byte *)0x1;
  __n = (byte *)0x0;
  pbVar11 = (byte *)0xffffffff;
  do {
    pbVar14 = pbVar6 + (int)pbVar11;
    pbVar10 = pbVar6 + (int)__n;
    pbVar12 = __n;
    while( true ) {
      __n = pbVar10;
      if (param_4 <= __n) {
        pbVar6 = (byte *)0x1;
        __n = (byte *)0x1;
        pbVar14 = (byte *)0xffffffff;
        pbVar12 = (byte *)0x0;
        goto LAB_230716b8;
      }
      if (param_3[(int)pbVar14] <= param_3[(int)__n]) break;
      pbVar6 = (byte *)0x1;
      pbVar13 = __n + -(int)pbVar11;
      pbVar14 = pbVar11 + 1;
      pbVar10 = __n + 1;
      pbVar12 = __n;
    }
    if (param_3[(int)__n] == param_3[(int)pbVar14]) {
      if (pbVar6 == pbVar13) {
        pbVar6 = (byte *)0x1;
      }
      else {
        pbVar6 = pbVar6 + 1;
        __n = pbVar12;
      }
    }
    else {
      pbVar13 = (byte *)0x1;
      pbVar6 = (byte *)0x1;
      __n = pbVar12 + 1;
      pbVar11 = pbVar12;
    }
  } while( true );
LAB_230716b8:
  pbVar5 = __n + (int)pbVar14;
  pbVar7 = __n + (int)pbVar12;
  pbVar10 = pbVar12;
  while (pbVar12 = pbVar7, pbVar12 < param_4) {
    if (param_3[(int)pbVar12] <= param_3[(int)pbVar5]) goto LAB_2307188c;
    __n = (byte *)0x1;
    pbVar6 = pbVar12 + -(int)pbVar14;
    pbVar5 = pbVar14 + 1;
    pbVar7 = pbVar12 + 1;
    pbVar10 = pbVar12;
  }
  __n = pbVar11 + 1;
  if (pbVar11 + 1 <= pbVar14 + 1) {
    pbVar13 = pbVar6;
    __n = pbVar14 + 1;
  }
  ppbVar9 = local_440;
  do {
    *ppbVar9 = param_4;
    ppbVar9 = ppbVar9 + 1;
  } while (apbStack64 != ppbVar9);
  pbVar11 = param_4 + -1;
  pbVar6 = param_3;
  if (param_4 != (byte *)0x0) {
    do {
      bVar1 = *pbVar6;
      iVar3 = -(int)pbVar6;
      pbVar6 = pbVar6 + 1;
      local_440[bVar1] = param_3 + (int)(pbVar11 + iVar3);
    } while (pbVar6 != param_3 + (int)param_4);
  }
  iVar3 = memcmp(param_3,param_3 + (int)pbVar13,(size_t)__n);
  if (iVar3 != 0) {
    pbVar13 = param_4 + -(int)__n;
    if (param_4 + -(int)__n < __n) {
      pbVar13 = __n;
    }
    pbVar6 = __n + -1;
    pbVar12 = (byte *)0x0;
LAB_2307194c:
    pbVar14 = pbVar12 + param_1;
    pbVar10 = local_440[pbVar11[(int)pbVar14]];
    if (pbVar10 == (byte *)0x0) goto LAB_230719b0;
    do {
      pbVar12 = pbVar10 + (int)pbVar12;
      while( true ) {
        if (pbVar12 <= (byte *)(param_2 - (int)param_4)) goto LAB_2307194c;
        sVar4 = strnlen((char *)(param_1 + param_2),(uint)param_4 | 0x800);
        param_2 = param_2 + sVar4;
        if ((byte *)(param_2 - (int)param_4) < pbVar12) {
          return (byte *)0;
        }
        pbVar14 = pbVar12 + param_1;
        pbVar10 = local_440[pbVar11[(int)pbVar14]];
        if (pbVar10 != (byte *)0x0) break;
LAB_230719b0:
        if (__n < pbVar11) {
          pbVar10 = __n;
          if (__n[(int)pbVar14] == param_3[(int)__n]) {
            do {
              pbVar10 = pbVar10 + 1;
              if (pbVar11 <= pbVar10) goto LAB_230719f0;
            } while (param_3[(int)pbVar10] == pbVar10[(int)(pbVar12 + param_1)]);
          }
          pbVar12 = pbVar10 + (int)(pbVar12 + (1 - (int)__n));
        }
        else {
LAB_230719f0:
          if (pbVar6 == (byte *)0xffffffff) {
            return pbVar14;
          }
          if (pbVar6[(int)pbVar14] == param_3[(int)pbVar6]) {
            pbVar5 = param_3 + (int)(__n + -2);
            pbVar10 = __n + -2 + (int)(pbVar12 + param_1);
            do {
              if (pbVar5 == param_3 + -1) {
                return pbVar14;
              }
              bVar1 = *pbVar5;
              bVar2 = *pbVar10;
              pbVar5 = pbVar5 + -1;
              pbVar10 = pbVar10 + -1;
            } while (bVar1 == bVar2);
          }
          pbVar12 = pbVar13 + (int)(pbVar12 + 1);
        }
      }
    } while( true );
  }
  pbVar6 = __n + -1;
  pbVar12 = (byte *)0x0;
  pbVar14 = (byte *)0x0;
  do {
    pbVar5 = pbVar14 + param_1;
    pbVar10 = local_440[pbVar11[(int)pbVar5]];
    if (pbVar10 == (byte *)0x0) {
      pbVar10 = pbVar12;
      if (pbVar12 < __n) {
        pbVar10 = __n;
      }
      if (pbVar10 < pbVar11) {
        pbVar7 = pbVar10 + (int)(pbVar14 + param_1);
        pbVar8 = param_3 + (int)pbVar10;
        do {
          if (*pbVar7 != *pbVar8) {
            pbVar14 = pbVar14 + (1 - (int)__n);
            goto LAB_230717c4;
          }
          pbVar10 = pbVar10 + 1;
          pbVar7 = param_3 + (int)pbVar10;
          pbVar8 = pbVar10 + (int)(pbVar14 + param_1);
        } while (pbVar10 < pbVar11);
      }
      if ((pbVar12 < __n) &&
         (pbVar10 = pbVar6, pbVar6[(int)(pbVar14 + param_1)] == param_3[(int)pbVar6])) {
        do {
          pbVar7 = pbVar10;
          pbVar10 = pbVar7 + -1;
          if (pbVar12 == pbVar7) break;
        } while (param_3[(int)pbVar10] == pbVar10[(int)(pbVar14 + param_1)]);
        if (pbVar7 < pbVar12 + 1) {
          return pbVar5;
        }
      }
      else {
        if (__n < pbVar12 + 1) {
          return pbVar5;
        }
      }
      pbVar14 = pbVar13 + (int)pbVar14;
      pbVar12 = param_4 + -(int)pbVar13;
    }
    else {
      if ((pbVar12 != (byte *)0x0) && (pbVar10 < pbVar13)) {
        pbVar10 = param_4 + -(int)pbVar13;
      }
LAB_230717c4:
      pbVar14 = pbVar10 + (int)pbVar14;
      pbVar12 = (byte *)0x0;
    }
    if ((byte *)(param_2 - (int)param_4) < pbVar14) {
      sVar4 = strnlen((char *)(param_1 + param_2),(uint)param_4 | 0x800);
      param_2 = param_2 + sVar4;
      if ((byte *)(param_2 - (int)param_4) < pbVar14) {
        return (byte *)0;
      }
    }
  } while( true );
LAB_2307188c:
  if (param_3[(int)pbVar12] == param_3[(int)pbVar5]) {
    if (__n == pbVar6) {
      __n = (byte *)0x1;
    }
    else {
      __n = __n + 1;
      pbVar12 = pbVar10;
    }
  }
  else {
    pbVar6 = (byte *)0x1;
    __n = (byte *)0x1;
    pbVar14 = pbVar10;
    pbVar12 = pbVar10 + 1;
  }
  goto LAB_230716b8;
}



char * strstr(char *__haystack,char *__needle)

{
  byte bVar1;
  byte bVar2;
  char cVar3;
  size_t __n;
  size_t sVar4;
  int iVar5;
  uint __c;
  char *pcVar6;
  uint uVar7;
  byte *pbVar8;
  uint uVar9;
  char *pcVar10;
  byte abStack96 [68];
  
  __c = (uint)(byte)*__needle;
  if (*__needle != 0) {
    uVar7 = (uint)(byte)__needle[1];
    if (__needle[1] == 0) {
      __haystack = strchr(__haystack,__c);
    }
    else {
      bVar1 = __needle[2];
      if (bVar1 == 0) {
        uVar9 = (uint)(byte)*__haystack;
        if (*__haystack != 0) {
          bVar1 = __haystack[1];
          pcVar10 = __haystack + 1;
          while (pcVar6 = pcVar10, uVar9 = (uint)bVar1 | uVar9 << 0x10, bVar1 != 0) {
            bVar1 = pcVar6[1];
            pcVar10 = pcVar6 + 1;
            if ((__c << 0x10 | uVar7) == uVar9) {
              return pcVar6 + -1;
            }
          }
        }
      }
      else {
        if (__needle[3] == 0) {
          if (*__haystack != 0) {
            uVar9 = (uint)(byte)*__haystack << 8;
            bVar2 = __haystack[1];
            pcVar10 = __haystack + 1;
            while (pcVar6 = pcVar10, uVar9 = (bVar2 | uVar9) << 8, bVar2 != 0) {
              bVar2 = pcVar6[1];
              pcVar10 = pcVar6 + 1;
              if ((__c << 0x18 | uVar7 << 0x10 | (uint)bVar1 << 8) == uVar9) {
                return pcVar6 + -2;
              }
            }
          }
        }
        else {
          if (__needle[4] == '\0') {
            bVar2 = *__haystack;
            __c = __c << 0x18 | uVar7 << 0x10 | (uint)(byte)__needle[3] | (uint)bVar1 << 8;
            if (bVar2 != 0) {
              uVar7 = 0;
              do {
                pcVar10 = __haystack;
                uVar7 = (uint)bVar2 | uVar7 << 8;
                bVar2 = pcVar10[1];
                if (bVar2 == 0) {
                  if (__c != uVar7) goto LAB_23071c58;
                  break;
                }
                __haystack = pcVar10 + 1;
              } while (__c != uVar7);
              return pcVar10 + -3;
            }
          }
          else {
            __n = strlen(__needle);
            sVar4 = strnlen(__haystack,__n | 0x200);
            if (__n <= sVar4) {
              if (0xfe < __n) {
                pcVar10 = (char *)two_way_long_needle(__haystack,sVar4,__needle,__n);
                return pcVar10;
              }
              pcVar10 = __haystack + (sVar4 - __n);
              memset(abStack96,__n + 1,0x40);
              if (__n != 0) {
                pbVar8 = (byte *)__needle;
                do {
                  bVar1 = *pbVar8;
                  cVar3 = (char)pbVar8;
                  pbVar8 = pbVar8 + 1;
                  abStack96[(uint)bVar1 & 0x3f] = ((char)__needle + (char)__n) - cVar3;
                } while ((byte *)(__needle + __n) != pbVar8);
              }
              while( true ) {
                __haystack = __haystack + -1 + abStack96[(uint)(byte)(__haystack + -1)[__n] & 0x3f];
                while (__haystack <= pcVar10) {
                  bVar1 = abStack96[(uint)(byte)__haystack[__n] & 0x3f];
                  iVar5 = memcmp(__haystack,__needle,__n);
                  if (iVar5 == 0) {
                    return __haystack;
                  }
                  __haystack = __haystack + bVar1;
                }
                if (pcVar10[__n] == '\0') break;
                sVar4 = strnlen(pcVar10 + __n,0x800);
                pcVar10 = pcVar10 + sVar4;
                if (pcVar10 < __haystack) {
                  return (char *)0x0;
                }
              }
            }
          }
        }
      }
LAB_23071c58:
      __haystack = (char *)0x0;
    }
  }
  return __haystack;
}



