pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
uint _strtol_l_isra_0(undefined4 *param_1,byte *param_2,byte **param_3,uint param_4)

{
  byte bVar1;
  bool bVar2;
  uint uVar3;
  byte *pbVar4;
  uint uVar5;
  byte *pbVar6;
  uint uVar7;
  uint uVar8;
  int iVar9;
  uint uVar10;
  
  pbVar6 = param_2;
  do {
    pbVar4 = pbVar6;
    pbVar6 = pbVar4 + 1;
    bVar1 = *pbVar4;
    uVar7 = (uint)bVar1;
  } while ((_ctype_[uVar7 + 1] & 8) != 0);
  if (bVar1 == 0x2d) {
    uVar7 = (uint)*pbVar6;
    bVar2 = true;
    pbVar6 = pbVar4 + 2;
LAB_23071d58:
    if (param_4 != 0) goto LAB_23071d5c;
LAB_23071de0:
    if (uVar7 != 0x30) {
      uVar10 = 10;
      param_4 = 10;
      goto LAB_23071d68;
    }
    if ((*pbVar6 & 0xdf) != 0x58) {
      uVar10 = 8;
      param_4 = 8;
      goto LAB_23071d68;
    }
  }
  else {
    if (bVar1 != 0x2b) {
      bVar2 = false;
      goto LAB_23071d58;
    }
    uVar7 = (uint)*pbVar6;
    bVar2 = false;
    pbVar6 = pbVar4 + 2;
    if (param_4 == 0) goto LAB_23071de0;
LAB_23071d5c:
    uVar10 = param_4;
    if (param_4 != 0x10) goto LAB_23071d68;
    if ((uVar7 != 0x30) || ((*pbVar6 & 0xdf) != 0x58)) {
      uVar10 = 0x10;
      goto LAB_23071d68;
    }
  }
  uVar7 = (uint)pbVar6[1];
  uVar10 = 0x10;
  pbVar6 = pbVar6 + 2;
  param_4 = 0x10;
LAB_23071d68:
  uVar3 = 0x80000000;
  if (!bVar2) {
    uVar3 = 0x7fffffff;
  }
  iVar9 = 0;
  uVar5 = 0;
  do {
    uVar8 = uVar7 - 0x30;
    if (9 < uVar8) {
      if (uVar7 - 0x41 < 0x1a) {
        uVar8 = uVar7 - 0x37;
      }
      else {
        if (0x19 < uVar7 - 0x61) break;
        uVar8 = uVar7 - 0x57;
      }
    }
    if ((int)param_4 <= (int)uVar8) break;
    if (((iVar9 != -1) && (iVar9 = -1, uVar5 <= uVar3 / uVar10)) &&
       ((uVar3 / uVar10 != uVar5 || ((int)uVar8 <= (int)(uVar3 % uVar10))))) {
      iVar9 = 1;
      uVar5 = uVar8 + uVar10 * uVar5;
    }
    uVar7 = (uint)*pbVar6;
    pbVar6 = pbVar6 + 1;
  } while( true );
  if (iVar9 == -1) {
    *param_1 = 0x22;
    if (param_3 == (byte **)0x0) {
      return uVar3;
    }
  }
  else {
    uVar3 = uVar5;
    if (bVar2) {
      uVar3 = -uVar5;
    }
    if (param_3 == (byte **)0x0) {
      return uVar3;
    }
    if (iVar9 == 0) goto LAB_23071e1c;
  }
  param_2 = pbVar6 + -1;
LAB_23071e1c:
  *param_3 = param_2;
  return uVar3;
}



uint _strtol_r(undefined4 *param_1,byte *param_2,byte **param_3,uint param_4)

{
  byte bVar1;
  bool bVar2;
  uint uVar3;
  byte *pbVar4;
  uint uVar5;
  byte *pbVar6;
  uint uVar7;
  uint uVar8;
  int iVar9;
  uint uVar10;
  
  pbVar6 = param_2;
  do {
    pbVar4 = pbVar6;
    pbVar6 = pbVar4 + 1;
    bVar1 = *pbVar4;
    uVar7 = (uint)bVar1;
  } while ((_ctype_[uVar7 + 1] & 8) != 0);
  if (bVar1 == 0x2d) {
    uVar7 = (uint)*pbVar6;
    bVar2 = true;
    pbVar6 = pbVar4 + 2;
LAB_23071d58:
    if (param_4 != 0) goto LAB_23071d5c;
LAB_23071de0:
    if (uVar7 != 0x30) {
      uVar10 = 10;
      param_4 = 10;
      goto LAB_23071d68;
    }
    if ((*pbVar6 & 0xdf) != 0x58) {
      uVar10 = 8;
      param_4 = 8;
      goto LAB_23071d68;
    }
  }
  else {
    if (bVar1 != 0x2b) {
      bVar2 = false;
      goto LAB_23071d58;
    }
    uVar7 = (uint)*pbVar6;
    bVar2 = false;
    pbVar6 = pbVar4 + 2;
    if (param_4 == 0) goto LAB_23071de0;
LAB_23071d5c:
    uVar10 = param_4;
    if (param_4 != 0x10) goto LAB_23071d68;
    if ((uVar7 != 0x30) || ((*pbVar6 & 0xdf) != 0x58)) {
      uVar10 = 0x10;
      goto LAB_23071d68;
    }
  }
  uVar7 = (uint)pbVar6[1];
  uVar10 = 0x10;
  pbVar6 = pbVar6 + 2;
  param_4 = 0x10;
LAB_23071d68:
  uVar3 = 0x80000000;
  if (!bVar2) {
    uVar3 = 0x7fffffff;
  }
  iVar9 = 0;
  uVar5 = 0;
  do {
    uVar8 = uVar7 - 0x30;
    if (9 < uVar8) {
      if (uVar7 - 0x41 < 0x1a) {
        uVar8 = uVar7 - 0x37;
      }
      else {
        if (0x19 < uVar7 - 0x61) break;
        uVar8 = uVar7 - 0x57;
      }
    }
    if ((int)param_4 <= (int)uVar8) break;
    if (((iVar9 != -1) && (iVar9 = -1, uVar5 <= uVar3 / uVar10)) &&
       ((uVar3 / uVar10 != uVar5 || ((int)uVar8 <= (int)(uVar3 % uVar10))))) {
      iVar9 = 1;
      uVar5 = uVar8 + uVar10 * uVar5;
    }
    uVar7 = (uint)*pbVar6;
    pbVar6 = pbVar6 + 1;
  } while( true );
  if (iVar9 == -1) {
    *param_1 = 0x22;
    if (param_3 == (byte **)0x0) {
      return uVar3;
    }
  }
  else {
    uVar3 = uVar5;
    if (bVar2) {
      uVar3 = -uVar5;
    }
    if (param_3 == (byte **)0x0) {
      return uVar3;
    }
    if (iVar9 == 0) goto LAB_23071e1c;
  }
  param_2 = pbVar6 + -1;
LAB_23071e1c:
  *param_3 = param_2;
  return uVar3;
}



long strtol_l(char *__nptr,char **__endptr,int __base,__locale_t __loc)

{
  long lVar1;
  
  lVar1 = _strtol_l_isra_0(_impure_ptr,__nptr,__endptr,__base);
  return lVar1;
}



long strtol(char *__nptr,char **__endptr,int __base)

{
  long lVar1;
  
  lVar1 = _strtol_l_isra_0(_impure_ptr,__nptr,__endptr,__base);
  return lVar1;
}



int stat(char *__file,stat *__buf)

{
  int iVar1;
  
  iVar1 = _stat_r(_impure_ptr,__file,__buf);
  return iVar1;
}



void _stat_r(int *param_1,undefined4 param_2,undefined4 param_3)

{
  int iVar1;
  
  errno = 0;
  iVar1 = _stat(param_2,param_3);
  if ((iVar1 == -1) && (errno != 0)) {
    *param_1 = errno;
    return;
  }
  return;
}



int _stat(int param_1,undefined4 param_2)

{
  int *piVar1;
  undefined auStack144 [132];
  
  ecall();
  if (param_1 < 0) {
    piVar1 = (int *)__errno(auStack144,0,0,0,0,0x40e);
    *piVar1 = -param_1;
    param_1 = -1;
  }
  _conv_stat(param_2,auStack144);
  return param_1;
}



void _conv_stat(undefined2 *param_1,undefined4 *param_2)

{
  undefined4 uVar1;
  undefined4 uVar2;
  undefined4 uVar3;
  undefined4 uVar4;
  undefined4 uVar5;
  undefined4 uVar6;
  undefined4 uVar7;
  undefined4 uVar8;
  undefined4 uVar9;
  undefined4 uVar10;
  undefined4 uVar11;
  undefined4 uVar12;
  undefined4 uVar13;
  undefined4 uVar14;
  undefined4 uVar15;
  
  uVar3 = param_2[5];
  uVar1 = param_2[6];
  uVar15 = param_2[7];
  uVar14 = param_2[8];
  uVar13 = param_2[0xc];
  uVar12 = param_2[0x10];
  uVar2 = param_2[0xe];
  uVar10 = param_2[0x12];
  uVar11 = param_2[0x13];
  uVar6 = param_2[0x16];
  uVar4 = param_2[4];
  uVar5 = param_2[2];
  uVar7 = param_2[0x17];
  uVar8 = param_2[0x1a];
  uVar9 = param_2[0x1b];
  *param_1 = (short)*param_2;
  param_1[1] = (short)uVar5;
  *(undefined4 *)(param_1 + 2) = uVar4;
  param_1[4] = (short)uVar3;
  param_1[5] = (short)uVar1;
  param_1[6] = (short)uVar15;
  param_1[7] = (short)uVar14;
  *(undefined4 *)(param_1 + 8) = uVar13;
  *(undefined4 *)(param_1 + 0x24) = uVar12;
  *(undefined4 *)(param_1 + 0x22) = uVar2;
  *(undefined4 *)(param_1 + 0xc) = uVar10;
  *(undefined4 *)(param_1 + 0xe) = uVar11;
  *(undefined4 *)(param_1 + 0x14) = uVar6;
  *(undefined4 *)(param_1 + 0x16) = uVar7;
  *(undefined4 *)(param_1 + 0x1c) = uVar8;
  *(undefined4 *)(param_1 + 0x1e) = uVar9;
  return;
}



