pine64/bl602-re/blobs/bl602_demo_wifi.ghidra.c
// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int XIP_SFlash_Write_With_Lock(SPI_Flash_Cfg_Type *pFlashCfg,uint32_t addr,uint8_t *src,int len)

{
  int iVar1;
  
                    // WARNING: Could not recover jumptable at 0x4200c9be. Too many branches
                    // WARNING: Treating indirect jump as call
  iVar1 = (*_DAT_21010aac)();
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

int XIP_SFlash_Erase_With_Lock(SPI_Flash_Cfg_Type *pFlashCfg,uint32_t addr,int len)

{
  int iVar1;
  
                    // WARNING: Could not recover jumptable at 0x4200c9c8. Too many branches
                    // WARNING: Treating indirect jump as call
  iVar1 = (*_DAT_21010ab0)();
  return iVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void XIP_SFlash_Opt_Enter(uint8_t *aesEnable)

{
                    // WARNING: Could not recover jumptable at 0x4200c9d2. Too many branches
                    // WARNING: Treating indirect jump as call
  (*_DAT_21010ab4)();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void XIP_SFlash_Opt_Exit(uint8_t aesEnable)

{
                    // WARNING: Could not recover jumptable at 0x4200c9dc. Too many branches
                    // WARNING: Treating indirect jump as call
  (*_DAT_21010ab8)();
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

uint32_t BFLB_Soft_CRC32(void *dataIn,uint32_t len)

{
  uint32_t uVar1;
  
                    // WARNING: Could not recover jumptable at 0x4200c9e6. Too many branches
                    // WARNING: Treating indirect jump as call
  uVar1 = (*_DAT_21010abc)();
  return uVar1;
}



// WARNING: Control flow encountered bad instruction data

BL_Err_Type ADC_Trim_TSEN(uint16_t *tsen_offset)

{
  Efuse_TSEN_Refcode_Corner_Type trim;
  
                    // WARNING: Bad instruction - Truncating control flow here
  halt_baddata();
}



// WARNING: Control flow encountered bad instruction data

BL_Err_Type ADC_Gain_Trim(void)

{
  uint uVar1;
  uint8_t a;
  undefined3 extraout_var;
  Efuse_ADC_Gain_Coeff_Type EStack36;
  Efuse_ADC_Gain_Coeff_Type trim;
  
  EF_Ctrl_Read_ADC_Gain_Trim(&EStack36);
  if ((int)EStack36 << 0x12 < 0) {
    uVar1 = (uint)EStack36 >> 0xc;
    a = EF_Ctrl_Get_Trim_Parity((uint)EStack36 & 0xfff,'\f');
    _a = (SFtype)CONCAT31(extraout_var,a);
    if ((SFtype)(uVar1 & 1) == _a) {
      adcGainCoeffCal.adcGainCoeffEnable = ENABLE;
      adcGainCoeffCal.adcgainCoeffVal = SUB42(EStack36,0) & 0xfff;
      if (((uint)EStack36 & 0x800) == 0) {
        __extendsfdf2(_a);
        __muldf3();
        __subdf3();
      }
      else {
        __extendsfdf2(_a);
        __muldf3();
        __adddf3();
      }
      __truncdfsf2();
                    // WARNING: Bad instruction - Truncating control flow here
      halt_baddata();
    }
  }
  return ERROR;
}



uint8_t EF_Ctrl_Get_Trim_Parity(uint32_t val,uint8_t len)

{
  undefined3 in_register_0000202d;
  uint uVar1;
  byte bVar2;
  
  uVar1 = 0;
  bVar2 = 0;
  while ((uVar1 & 0xff) < CONCAT31(in_register_0000202d,len)) {
    if ((1 << (uVar1 & 0x1f) & val) != 0) {
      bVar2 = bVar2 + 1;
    }
    uVar1 = uVar1 + 1;
  }
  return (uint8_t)(bVar2 & 1);
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void EF_Ctrl_Read_RC32M_Trim(Efuse_Ana_RC32M_Trim_Type *trim)

{
  uint uVar1;
  uint uVar2;
  
  EF_Ctrl_Sw_AHB_Clk_0();
  EF_Ctrl_Load_Efuse_R0();
  uVar1 = _DAT_4000700c;
  uVar2 = _DAT_4000700c >> 10;
  *(char *)trim = (char)uVar2;
  *(uint *)trim = (uint)*trim & 0xfffffcff | uVar2 & 0x100 | uVar1 >> 10 & 0x200;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void EF_Ctrl_Read_RC32K_Trim(Efuse_Ana_RC32K_Trim_Type *trim)

{
  EF_Ctrl_Sw_AHB_Clk_0();
  EF_Ctrl_Load_Efuse_R0();
  *(uint *)trim =
       (uint)*trim & 0xfffff000 | _DAT_4000700c >> 0x14 & 0x3ff | _DAT_4000700c >> 0x14 & 0x400 |
       (_DAT_4000700c >> 0x1f) << 0xb;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void EF_Ctrl_Read_TSEN_Trim(Efuse_TSEN_Refcode_Corner_Type *trim)

{
  uint uVar1;
  Efuse_TSEN_Refcode_Corner_Type EVar2;
  uint uVar3;
  uint uVar4;
  
  EF_Ctrl_Sw_AHB_Clk_0();
  EF_Ctrl_Load_Efuse_R0();
  uVar3 = (_DAT_40007078 & 1) << 0xd;
  EVar2 = *trim;
  *(uint *)trim = (uint)EVar2 & 0xffffdfff | uVar3;
  uVar4 = _DAT_4000707c & 0xfff;
  uVar1 = _DAT_4000707c & 0x1000;
  *(uint *)trim = (uint)EVar2 & 0xffffc000 | uVar3 | uVar4 | uVar1;
  *(uint *)trim =
       (uint)EVar2 & 0xffff8000 | uVar3 | uVar4 | uVar1 | (_DAT_40007070 >> 0x1e & 1) << 0xe;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

void EF_Ctrl_Read_ADC_Gain_Trim(Efuse_ADC_Gain_Coeff_Type *trim)

{
  EF_Ctrl_Sw_AHB_Clk_0();
  EF_Ctrl_Load_Efuse_R0();
  *(uint *)trim =
       (uint)*trim & 0xffffc000 | (_DAT_40007078 << 0x13) >> 0x14 |
       (_DAT_40007078 >> 0xd & 1) << 0xc | (_DAT_40007078 >> 0xe & 1) << 0xd;
  return;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type AON_Power_On_MBG(void)

{
  BL_Err_Type BVar1;
  
                    // WARNING: Could not recover jumptable at 0x4200cd8e. Too many branches
                    // WARNING: Treating indirect jump as call
  BVar1 = (*_DAT_21010810)();
  return BVar1;
}



// WARNING: Globals starting with '_' overlap smaller symbols at the same address

BL_Err_Type AON_Power_Off_MBG(void)

{
  BL_Err_Type BVar1;
  
                    // WARNING: Could not recover jumptable at 0x4200cd98. Too many branches
                    // WARNING: Treating indirect jump as call
  BVar1 = (*_DAT_21010814)();
  return BVar1;
}



